[
  {
    "id": "cardio_acm_001",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 66-year-old woman with systolic left ventricular dysfunction comes to the emergency department due to dizziness, palpitations, and shortness of breath. The symptoms started 2 days ago and have become progressively worse. Her cardiologist prescribed an extra dose of oral furosemide yesterday, but her symptoms did not improve. Six weeks ago, she was admitted for acute decompensated heart failure that was thought to be precipitated by atrial fibrillation. The patient underwent electrical cardioversion and was diuresed with marked symptomatic improvement. She has a history of atrial fibrillation, hypertension, type 2 diabetes mellitus, coronary artery disease, ischemic cardiomyopathy with a 30% ejection fraction, and osteoarthritis. She underwent coronary artery bypass grafting 5 years ago. Her current medications include low-dose aspirin, metoprolol, lisinopril, rosuvastatin, long-acting insulin, rivaroxaban, furosemide, and ibuprofen as needed. The patient has been adherent to her medical regimen. She does not use tobacco or alcohol. Temperature is 36.7 C (98 F), blood pressure is 126/82 mm Hg, pulse is 132/min and irregular, and respirations is 19/min Physical examination reveals bibasilar crackles on auscultation. There are irregularly irregular heart sounds with no audible murmurs. There is 1+ symmetric peripheral edema. ECG shows atrial fibrillation with rapid ventricular response. Serum creatinine level is 0.8 mg/dL After initial treatment, electrical cardioversion is planned. Which of the following is the most appropriate medication for long-term management of this patient?",
    "choice_a": "Amiodarone",
    "choice_b": "Flecainide",
    "choice_c": "Ranolazine",
    "choice_d": "Valsartan",
    "choice_e": "Verapamil",
    "correct_answer": "A",
    "explanation": "Preferred antiarrhythmic therapy in patients with atrial fibrillation\nNo CAD or structural heart disease: Flecainide, Propafenone\nLeft ventricular hypertrophy: Dronedarone, Amiodarone\nCAD without heart failure: Sotalol, Dronedarone\nHeart failure: Amiodarone, Dofetilide\nRecurrent AF symptoms refractory to medication: Radiofrequency ablation\nAF = atrial fibrillation; CAD = coronary artery disease.\n\nThis patient's dizziness, palpitations, shortness of breath, and lower extremity edema are due to an exacerbation of systolic heart failure likely triggered by uncontrolled atrial fibrillation (AF) with rapid ventricular response. Patients with AF can be managed with anticoagulation (eg, rivaroxaban) and rate control with atrioventricular nodal blocking agents (eg, beta blockers), or rhythm control with antiarrhythmic agents. Each strategy has similar rates of thromboembolism and long-term survival. Due to somewhat limited efficacy and the risk of side effects of antiarrhythmic drugs, most patients with AF are managed with a conservative rate-control strategy. However, rhythm control is preferred in the following clinical settings:\n\n• Inability to maintain adequate heart rate control with rate-control agents\n• Persistence of symptomatic episodes (eg, heart failure exacerbation) on rate-control agents\n\nThis patient with poorly controlled heart rate and persistent symptoms would likely benefit from a rhythm control strategy aimed at maintenance of sinus rhythm. Amiodarone or dofetilide are the preferred antiarrhythmic agents in patients with AF and left ventricular (LV) systolic dysfunction with ejection fraction <35%. Monitoring for evidence of pulmonary, thyroid, and hepatic toxicity is needed in patients taking chronic amiodarone.\n\n(Choice B) Flecainide is a class IC antiarrhythmic agent recommended for rhythm control in patients without cardiovascular comorbidities. However, it is contraindicated in patients with structural or coronary heart disease due to increased risk of arrhythmias and death in these patients.\n(Choice C) In addition to antianginal properties, ranolazine has antiarrhythmic effects similar to the class IB antiarrhythmic agents. However, ranolazine has not demonstrated efficacy in the rhythm control of AF.\n\n(Choice D) Angiotensin II receptor blockers (eg, valsartan) are indicated in patients with LV systolic dysfunction. However, they should not be combined with ACE inhibitors (eg, lisinopril) due to increased risk of side effects (eg, hyperkalemia). In addition, these drugs do not have rate-control or antiarrhythmic properties useful in the management of AF\n\n(Choice E) Nondihydropyridine calcium channel blockers (eg, verapamil, diltiazem) are often used for rate control in patients with AF; however, these drugs are not effective for long-term maintenance of sinus rhythm after cardioversion. In addition, they have a negative inotropic effect and should be avoided in patients with LV systolic dysfunction.\n\nEducational objective:\nRhythm control of atrial fibrillation is appropriate in patients who fail a rate-control strategy. Amiodarone and dofetilide are the preferred antiarrhythmic agents to maintain sinus rhythm in patients with atrial fibrillation and left ventricular systolic dysfunction.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_002",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items.\n\nA 27-year-old woman is brought to the emergency department due to a 4-hour history of chest pain that is localized to the middle of the chest and the upper sternal area. She describes it as \"intense.\" The patient has never before experienced a similar pain. She also describes some nausea and a mild occipital headache. She has had no vomiting, abdominal pain, or shortness of breath. A friend who accompanies her to the emergency department says that they attended a party and the patient smoked crack cocaine shortly prior to her episode of chest pain. She did not consume alcohol. The patient has a history of intravenous drug use. She was treated with antibiotics for upper extremity cellulitis 6 months ago. There is no family history of premature coronary artery disease. The patient does not take any medications and has no known drug allergies. On initial evaluation, temperature is 37.8 C (100 F), blood pressure is 204/102 mm Hg on the right arm and 210/104 mm Hg on the left arm, pulse is 102/min and regular, and respirations are 18/min. Oxygen saturation is 99% on room air. The patient appears thin, anxious, and agitated. Heart sounds are normal and no murmurs are heard. Lungs are clear to auscultation bilaterally. The abdomen is soft and nontender. Lower extremity pulses are full and symmetric. There is no peripheral edema. ECG shows sinus tachycardia but is otherwise unremarkable. Portable chest x-ray reveals clear lung fields. Finger-stick blood glucose level is 98 mg/dL.\n\nItem 1 of 2\n\nWhich of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Aspirin and clopidogrel",
    "choice_b": "Intravenous lorazepam",
    "choice_c": "Intravenous metoprolol",
    "choice_d": "Intravenous phentolamine",
    "choice_e": "Low-molecular-weight heparin",
    "correct_answer": "B",
    "explanation": "Cardiovascular effects of cocaine intoxication\nPhysiologic effects: • Hypertension & tachycardia, • Coronary vasoconstriction, ↑ Platelet activity & thrombus formation\nClinical manifestations: • Myocardial ischemia or infarction, • Aortic dissection, • Neurologic ischemia or stroke\nTreatment: • Benzodiazepines & nitroglycerin, Beta blockers contraindicated, CCBs for persistent chest pain, Phentolamine for persistent hypertension, PCI for myocardial infarction\nCCBs = calcium channel blockers, PCI = percutaneous coronary intervention.\n\nAlthough cocaine-related chest pain (CRCP) can occur due to noncardiac causes (eg, pneumothorax, hemorrhagic alveolitis or \"crack lung\"), clinicians should have a high index of suspicion for cardiovascular pathology. Most acute cardiovascular adverse effects of cocaine result from inhibition of the presynaptic reuptake of norepinephrine in the central nervous system, which leads to overstimulation of adrenergic receptors (eg, alpha-1, beta-1) and resulting tachycardia, increased myocardial contractility, arterial (including coronary) vasoconstriction, and hypertension. Because these effects lead to an increase in myocardial oxygen demand and a decrease in supply, myocardial ischemia and acute coronary syndrome (ACS) are common. Cocaine also activates platelets and supports thrombus formation, which further increases the risk of myocardial infarction and can lead to stroke. Cocaine-induced hypertension can also cause aortic dissection.\n\nIn patients with CRCP that is likely of cardiovascular etiology, benzodiazepines (eg, lorazepam, diazepam) are the preferred initial medication treatment. These drugs reduce sympathetic outflow to alleviate tachycardia and hypertension and improve myocardial ischemia. In addition, benzodiazepines calm cocaine-induced psychomotor agitation, which helps to decrease myocardial oxygen demand and provide further relief of myocardial ischemia. Nitroglycerin (sublingual or infusion) is also useful in alleviating hypertension (and myocardial ischemia) in these patients.\n\n(Choice A) Unless there is a contraindication (eg, high suspicion for aortic dissection), aspirin should be given early in the management of patients with CRCP. Clopidogrel should be given only when a diagnosis of ACS has been established (eg, ischemic ECG changes, elevated cardiac biomarkers).\n\n(Choice C) Although some studies suggest that beta blockers (eg, metoprolol) are safe in the setting of cocaine intoxication, these studies are poorly reliable due to design flaws and retrospective data collection. Due to the potential for poor outcomes resulting from unopposed alpha-1 receptor-mediated vasoconstriction, these drugs should be considered contraindicated in acute cocaine ingestion.\n\n(Choice D) Phentolamine is an alpha receptor antagonist that can be used in patients with CRCP whose hypertension fails to respond to benzodiazepines and nitroglycerin.\n\n(Choice E) Low-molecular-weight heparin should not be given empirically in patients with CRCP; it is indicated when a diagnosis of ACS is made.\n\nEducational objective:\nBenzodiazepines (eg, lorazepam) should be given early to patients with cocaine-related chest pain to decrease sympathetic outflow and psychomotor agitation and alleviate hypertension and myocardial ischemia. Beta blockers are contraindicated in acute cocaine ingestion due to the risk of excessive alpha-1 receptor-mediated vasoconstriction.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_003",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items.\n\nA 27-year-old woman is brought to the emergency department due to a 4-hour history of chest pain that is localized to the middle of the chest and the upper sternal area. She describes it as \"intense.\" The patient has never before experienced a similar pain. She also describes some nausea and a mild occipital headache. She has had no vomiting, abdominal pain, or shortness of breath. A friend who accompanies her to the emergency department says that they attended a party and the patient smoked crack cocaine shortly prior to her episode of chest pain. She did not consume alcohol. The patient has a history of intravenous drug use. She was treated with antibiotics for upper extremity cellulitis 6 months ago. There is no family history of premature coronary artery disease. The patient does not take any medications and has no known drug allergies. On initial evaluation, temperature is 37.8 C (100 F), blood pressure is 204/102 mm Hg on the right arm and 210/104 mm Hg on the left arm, pulse is 102/min and regular, and respirations are 18/min. Oxygen saturation is 99% on room air. The patient appears thin, anxious, and agitated. Heart sounds are normal and no murmurs are heard. Lungs are clear to auscultation bilaterally. The abdomen is soft and nontender. Lower extremity pulses are full and symmetric. There is no peripheral edema. ECG shows sinus tachycardia but is otherwise unremarkable. Portable chest x-ray reveals clear lung fields. Finger-stick blood glucose level is 98 mg/dL.\n\nItem 2 of 2\n\nAfter 2 hours in the emergency department, the patient has weakness in her right arm. Her chest pain is somewhat better, but she still has pain at the middle and upper part of the sternum. She has been treated with lorazepam, morphine, and nitroglycerin infusion. Blood pressure is 133/80 mm Hg and heart rate is 88/min and regular. Neurologic examination shows mild muscle weakness affecting the right upper and lower extremities. Speech is normal. Repeat ECG shows normal sinus rhythm with no significant abnormalities. Laboratory results are as follows:\nLeukocytes: 11,000/mm³\nHemoglobin: 12.2 g/dL\nPlatelets: 220,000/mm³\nSodium: 134 mEq/L\nPotassium: 4.1 mEq/L\nCreatinine: 0.8 mg/dL\nTroponin: undetectable\nImmediate noncontrast CT scan of the head reveals no evidence of bleeding. Which of the following is the best next step in management of this patient?",
    "choice_a": "Carotid artery ultrasound",
    "choice_b": "CT angiography of the chest",
    "choice_c": "Intravenous alteplase",
    "choice_d": "Intravenous phentolamine",
    "choice_e": "Low-molecular-weight heparin",
    "correct_answer": "B",
    "explanation": "Acute aortic dissection\nClinical features: History of HTN, Marfan syndrome, cocaine use; Severe, sharp, tearing chest or back pain; ±>20 mm Hg variation in SBP between arms; Stroke (carotid artery)\nComplications due to extension (involved structure): Acute aortic regurgitation (aortic root/valve); Horner syndrome (carotid sympathetic plexus); Myocardial ischemia/infarction (coronary artery ostia); Pericardial effusion/tamponade (pericardium); Hemothorax (pleural cavity); Renal injury (renal arteries); Abdominal pain (mesenteric arteries); Lower extremity paraplegia (spinal arteries)\nHTN = hypertension; SBP = systolic blood pressure. *Strongest overall risk factor\n\nThis patient with recent cocaine ingestion has persistent chest pain despite adequately controlled heart rate and blood pressure and no evidence of ischemia on ECG. The chest pain in combination with new neurologic findings of right-sided weakness is highly suspicious for acute dissection of the ascending aorta. Severe hypertension due to cocaine ingestion is one of the most common causes of acute aortic dissection in young patients. In dissections involving the ascending aorta (type A dissections), patients typically have sharp anterior chest pain (back pain is more common in type B dissections). Focal neurologic deficits can occur; this patient's right-sided weakness is suggestive of carotid artery involvement (eg, obstruction by intimal flap, extension of dissection into carotids) leading to cerebral ischemia.\n\nAcute dissection of the ascending aorta is a surgical emergency rapid diagnosis and treatment are critical to reduce morbidity and mortality. The diagnosis is confirmed by noninvasive imaging, including CT angiography, magnetic resonance angiography, or transesophageal echocardiography.\n\n(Choice A) Carotid artery ultrasound is typically used to evaluate for atherosclerotic carotid artery stenosis. Significant atherosclerotic disease is extremely unlikely in this young woman.\n\n(Choice C) Fibrinolysis with intravenous alteplase is indicated within 4.5 hours of symptom onset of thrombotic ischemic stroke. Although acute cocaine ingestion increases the risk for stroke due to arterial vasospasm and activation of clot formation, thrombotic stroke does not explain the persistence of chest pain. This patient's focal weakness is more likely explained by acute aortic dissection, for which fibrinolysis is contraindicated.\n\n(Choice D) Phentolamine (alpha receptor antagonist) is not indicated as this patient's blood pressure is under control.\n\n(Choice E) Anticoagulation (eg, low-molecular-weight heparin) is indicated for the treatment of acute coronary syndrome. However, this patient's normal ECG and normal troponin levels make acute coronary syndrome unlikely. Anticoagulation is contraindicated in the setting of acute aortic dissection.\n\nEducational objective:\nThe presence of persistent chest pain and neurologic symptoms in a patient with recent cocaine use should raise suspicion for acute dissection of the ascending aorta. Rapid diagnosis is essential and can be made by CT angiography of the chest.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_004",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 12-year-old boy is brought to the clinic by his mother for a preparticipation sports physical. The patient will be starting 6th grade in a few weeks and would like to join his school's cross-country team. He ran several short races last year and had no chest pain, shortness of breath, or dizziness. Last year, he did well in school and received mostly As and Bs. The patient has a good relationship with his parents and has many friends. He wears eyeglasses for myopia. He has no allergies or other medical conditions. His grandfather died of a \"brain bleed\" at age 75. The patient's height and weight are at the 98th and 50th percentiles, respectively. Temperature is 37 C (98.6 F), blood pressure is 110/72 mm Hg, pulse is 80/min and respirations are 20/min. Cranial nerves II-XII are intact. Cardiac examination reveals a regular rate and rhythm. The lungs are clear to auscultation bilaterally. Achilles and patellar deep tendon reflexes are 2+ bilaterally. The patient's arm span to height ratio is increased. Physical examination is otherwise unremarkable. Which of the following is the best next step in management?",
    "choice_a": "Echocardiogram",
    "choice_b": "Karyotype analysis",
    "choice_c": "MRI/MRA of the brain",
    "choice_d": "No further evaluation is indicated",
    "choice_e": "Serum growth hormone level",
    "correct_answer": "A",
    "explanation": "Marfanoid habitus\n• Ectopia lentis\n• ↑ Arm-to-height ratio\n• Kyphosis and/or scoliosis\n• Breastbone dips inward or protrudes outward\n• Joint hypermobility\n• Upper-to-lower body segment ratio\n• Taller & slender build\n• Arachnodactyly\n• Flat feet\n\nThe most crucial component of a preparticipation sports physical is identification of any risk factors for sudden cardiac death during intense exercise. Evaluation should include close attention to any physical stigmata of undiagnosed Marfan syndrome (MFS). MFS is an autosomal dominant disorder caused by mutations in the FBN1 gene encoding the protein fibrillin-1. This patient has characteristic findings, including tall stature, increased arm span to height ratio, and myopia. Diagnosis is based on the presence of multiple clinical features.\n\nThe main cause of morbidity and mortality in patients with MFS is aortic root disease, manifesting as aneurysmal dilation, aortic regurgitation, and/or dissection. Patients with suspected MFS require an echocardiogram prior to sports participation. If aortic root disease and/or a family history of aortic dissection or sudden death is present, patients are counseled to avoid strenuous physical activity, with intense/contact sports (eg, track, basketball, football) generally restricted.\n\n(Choice B) Klinefelter syndrome (47,XXY) can present with tall stature and is diagnosed by karyotype. However, gynecomastia and small or cryptorchid testes, not seen in this patient, are typically present in Klinefelter syndrome.\n\n(Choice C) MRI/MRA of the brain can identify berry aneurysms, which occur more commonly in Ehlers-Danlos syndrome, in contrast to aortic aneurysms in MFS. Joint hypermobility and skin hyperextensibility are characteristic of Ehlers-Danlos syndrome.\n\n(Choice D) A patient with a Marfanoid habitus should be restricted from sports participation until the aortic root has been evaluated.\n\n(Choice E) Serum growth hormone level is elevated in gigantism. Patients are typically tall but also have excessive weight gain and coarse facial features with frontal bossing, which are not seen in this patient.\n\nEducational objective:\nMarfan syndrome should be suspected in patients with tall stature, myopia, and increased arm span to height ratio. Because these patients are at higher risk for sudden cardiac death due to aortic root disease, screening echocardiography is required prior to sports participation.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_005",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 23-year-old man is evaluated for a murmur discovered at a health fair. His past medical history is insignificant, and he feels well with no cardiac symptoms. The patient plays soccer and jogs regularly. His immediate family is healthy. Blood pressure is 122/70 mm Hg and pulse is 72/min. A 2/6 midsystolic murmur is heard at the left sternal border. The femoral pulses are full, and there is no brachial-femoral pulse delay. Echocardiography shows bicuspid aortic valve with a mildly increased gradient and no dilation of the aortic root. Which of the following is the best next step in management of this patient?",
    "choice_a": "Angiography to rule out coronary artery anomaly",
    "choice_b": "Aortic valve replacement",
    "choice_c": "Balloon valvuloplasty",
    "choice_d": "Doppler ultrasound for renal artery stenosis",
    "choice_e": "First-degree relative screening with echocardiography",
    "correct_answer": "E",
    "explanation": "Bicuspid aortic valve\nEtiology: • Affects 1% of population, • Predominant in male patients, • Present in 30% of patients with Turner syndrome, • Autosomal dominant with incomplete penetrance or sporadic\nDiagnosis: • Screening echocardiogram for patient & first-degree relatives\nComplications: • Infective endocarditis, • Severe regurgitation or stenosis, • Aortic root or ascending aortic dilation, • Dissection\nManagement: • Follow-up echocardiogram every 1-2 years, • Balloon valvuloplasty or surgery (valve & ascending aorta replacement)\n\nBicuspid aortic valve (AV) is one of the most common (about 1% of the population) types of congenital heart disease. It can occur sporadically or as an autosomal dominant inherited disorder with incomplete penetrance. Patients with uncomplicated bicuspid valves typically have an ejection murmur and a sound or click best heard at the lower left sternal border.\n\nChest x-ray is usually unremarkable but can occasionally reveal AV calcification, aortic enlargement (due to aneurysm), or rib notching (due to coarctation). Transthoracic echocardiogram is recommended for diagnosing bicuspid AV and for follow-up. First-degree relatives also should be screened for bicuspid AV to avoid complications including severe regurgitation, stenosis, ascending aorta or aortic root dilation, and dissection. Patients are at increased risk for endocarditis due to abnormal valve anatomy and function; however, routine antibiotic prophylaxis is not recommended.\n\n(Choice A) Bicuspid AV can be associated with other congenital cardiovascular anomalies including coarctation of the aorta, sinus of Valsalva or ascending aortic aneurysm, supravalvular or subvalvular stenosis, and ventricular septal defects. Coronary artery anomalies, including anomalous origin of the arteries, are also seen in some patients. However, routine screening for coronary anomalies is not recommended in patients with bicuspid AV.\n\n(Choice B) AV replacement is indicated in patients with severe aortic stenosis or regurgitation associated with symptoms of left ventricular dysfunction.\n\n(Choice C) Balloon valvuloplasty is indicated in symptomatic and asymptomatic (if they plan to become pregnant or participate in competitive sports) young adults when the following criteria are met:\n• Aortic stenosis\n• No significant AV calcification or aortic regurgitation\n• Peak gradient >50 mm Hg\n\n(Choice D) Screening for renal artery stenosis using Doppler ultrasound is helpful in patients with resistant hypertension refractory to antihypertensive therapy. There is no such indication in this patient.\n\nEducational objective:\nBicuspid aortic valve is an autosomal dominant trait with incomplete penetrance, although it can also occur sporadically. Current guidelines recommend echocardiography screening of first-degree relatives.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_006",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 72-year-old man with diet-controlled diabetes mellitus comes to the emergency department with chest pain for the last 4 hours. He has never had similar pain before. The pain is accompanied by nausea and epigastric discomfort. Electrocardiogram shows normal sinus rhythm and ST-segment elevation in leads II, III, and aVF. Sublingual nitroglycerine and intravenous morphine are administered and the on-call interventional cardiologist is informed. Several minutes later, the patient complains of lightheadedness, nausea, and weakness. His blood pressure is 75/45 mm Hg, pulse is 60/min, and respirations are 15/min. The patient is diaphoretic and his extremities are cold. The lungs are clear on auscultation and no murmurs are appreciated on cardiac auscultation. Which of the following is the best next step in management of this patient?",
    "choice_a": "Decrease vagal tone",
    "choice_b": "Increase afterload",
    "choice_c": "Infuse inotropic agent",
    "choice_d": "Optimize preload",
    "choice_e": "Thrombolytic therapy",
    "correct_answer": "D",
    "explanation": "Management of ST-segment elevation myocardial infarction (STEMI)\n• Oxygen for arterial saturation <90%\n• Nitrates: Caution with hypotension, right ventricular infarction, or severe aortic stenosis\n• Antiplatelet therapy: Aspirin + P2Y12 receptor blocker\n• Anticoagulation: Unfractionated heparin, low-molecular weight heparin, or bivalirudin\n• Beta blockers: Contraindicated in overt heart failure, High risk for cardiogenic shock, Bradycardia\n• Prompt reperfusion with PCI: Ideal first medical contact to PCI ≤90 minutes\n• Statin therapy as soon as possible\nPCI = percutaneous coronary intervention.\n\nThis patient has developed cardiogenic shock in the setting of acute inferior ST-elevation myocardial infarction (STEMI) after administration of nitroglycerine and morphine. This is most likely due to right ventricular MI (RVMI). RVMI is seen in 30%-50% of patients with acute inferior MI. Patients typically present with hypotension or shock, jugular vein distension, and clear lung fields.\n\nPatients with RVMI are treated similar to other patients with acute MI with appropriate dual antiplatelet therapy, statins, and anticoagulant therapy, as well as emergency revascularization with thrombolytics or primary percutaneous intervention. Drugs that slow heart rate (beta blockers) or decrease contractility (calcium channel blockers) should be used with caution. Nitrates, diuretics, and opioids should be avoided as they decrease right ventricular preload, which in turn impairs cardiac output and can cause profound hypotension.\n\nPatients with hypotension and normal or low jugular venous pressure should be treated with a bolus of intravenous fluids (isotonic saline). This generally improves right ventricular preload and facilitates left ventricular filling.\n\n(Choice A) Transient bradycardia or atrioventricular block due to enhanced vagal tone can occur in the setting of acute inferior MI. However, this patient has adequate heart rate, and interventions to decrease in vagal tone (eg, administration of atropine) are not indicated.\n\n(Choice B) Decreasing afterload with intra-aortic balloon pump is useful in patients with cardiogenic shock due to left ventricular dysfunction. An increase in afterload would worsen the RV dysfunction and hypotension.\n\n(Choice C) Inotropic agents are used in patients with RVMI and persistent hypotension despite aggressive fluid resuscitation. Dopamine is the initial drug of choice in such settings. Dobutamine can decrease peripheral vascular resistance at higher doses and worsen hypotension.\n\n(Choice E) Emergency reperfusion with thrombolytics or primary percutaneous coronary intervention is indicated in all patients with acute STEMI, including those with RVMI. However, this patient should be given a fluid bolus initially to improve RV preload and hypotension while plans for early reperfusion are implemented.\n\nEducational objective:\nNitrates, diuretics, and opioids can reduce right ventricular (RV) preload and cause hypotension in patients with acute RV myocardial infarction. Such patients with evidence of low cardiac output and hypotension should be treated initially with a bolus of intravenous fluids to improve RV preload.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_007",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 36-year-old man comes to the emergency department due to loss of consciousness. He was standing in a crowded subway station when he felt lightheaded, had a pounding sensation in his chest, and passed out. On awakening, he felt short of breath for a little while and then was \"completely fine.\" He has had no similar episodes, nor chest pain, confusion, tongue biting, or urinary incontinence. The night before, he was at a party with friends and consumed alcohol. Later he was nauseated and had 3 episodes of vomiting and one episode of diarrhea. In the emergency department, blood pressure is 124/68 mm Hg and pulse is 80/min There is a small laceration above his right eyebrow. Cardiac examination shows normal heart sounds with regular rhythm. The lungs are clear to auscultation. Neurologic examination shows no abnormalities. ECG is shown in this exhibit.\n\nItem 1 of 2\n\nWhich of the following is the most likely cause of this patient's syncope?",
    "choice_a": "Acute coronary syndrome",
    "choice_b": "Bradyarrhythmia",
    "choice_c": "Orthostatic hypotension",
    "choice_d": "Tachyarrhythmia",
    "choice_e": "Vasovagal syncope",
    "correct_answer": "D",
    "explanation": "Wolff-Parkinson-White pattern\n• Shortened PR\n• Delta wave\n• Wide QRS\n\nThis patient's ECG shows a Wolff-Parkinson-White (WPW) pattern, a type of cardiac preexcitation caused by an accessory pathway. Normal electrical impulses pass from the atria to the ventricles via the atrioventricular (AV) node/His-Purkinje system; however, in patients with WPW there is an extra conduction pathway (accessory pathway) that directly connects the atria to the ventricles and bypasses the AV junction. The accessory pathway conducts faster than the AV node and excites the ventricles prematurely, manifesting on resting ECG as a short PR interval with a characteristic delta wave and widened QRS complex (>0.12 sec).\n\nAlthough patients with a WPW pattern on ECG can be asymptomatic, some develop tachyarrhythmias; the combination of WPW findings on ECG and symptomatic tachyarrhythmia constitutes WPW syndrome. Paroxysmal supraventricular tachycardia is the most common arrhythmia; it is usually a regular, narrow complex tachycardia. If patients with WPW develop atrial fibrillation, they can conduct down the accessory pathway from the atria to the ventricles at a very fast rate, commonly resulting in syncope. This patient's ingestion of alcohol, a known precipitant of atrial fibrillation, likely placed him at risk for such a scenario.\n\n(Choice A) Acute coronary syndrome can sometimes present with nausea, vomiting, palpitations, or syncope, rather than chest pain. However, it is unlikely in this young patient with no significant risk factors for coronary artery disease and ECG showing no ST segment elevation/depression to suggest myocardial ischemia.\n\n(Choice B) Bradyarrhythmias generally arise from sinoatrial node dysfunction or AV nodal conduction block, and typically present with syncope or presyncope. However, this patient's WPW pattern on ECG and palpitations before passing out make a tachyarrhythmia more likely.\n\n(Choice C) Orthostatic hypotension is defined as a decrease in systolic blood pressure ≥20 mm Hg with change in position from supine to standing, it can be due to an inadequate autonomic response or volume depletion. Although this patient may be hypovolemic from vomiting and diarrhea, his presentation is more consistent with WPW syndrome given the palpitations and classic ECG findings.\n\n(Choice E) Vasovagal (neurocardiogenic) syncope can have many triggering factors (eg, stress, pain) and is caused by decreased sympathetic drive (causing vasodilation) combined with increased parasympathetic response (causing bradycardia). The ECG findings in this patient make cardiogenic syncope due to WPW more likely.\n\nEducational objective:\nThe classic Wolff-Parkinson-White pattern on ECG consists of short PR interval, delta wave, and wide QRS complex. Some patients can become symptomatic with tachyarrhythmias, and syncope can result.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_008",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 36-year-old man comes to the emergency department due to loss of consciousness. He was standing in a crowded subway station when he felt lightheaded, had a pounding sensation in his chest, and passed out. On awakening, he felt short of breath for a little while and then was \"completely fine.\" He has had no similar episodes, nor chest pain, confusion, tongue biting, or urinary incontinence. The night before, he was at a party with friends and consumed alcohol. Later he was nauseated and had 3 episodes of vomiting and one episode of diarrhea. In the emergency department, blood pressure is 124/68 mm Hg and pulse is 80/min There is a small laceration above his right eyebrow. Cardiac examination shows normal heart sounds with regular rhythm. The lungs are clear to auscultation. Neurologic examination shows no abnormalities. ECG is shown in this exhibit.\n\nItem 2 of 2\n\nThe patient is hospitalized for observation. His serum electrolytes are within normal limits. Echocardiogram shows normal left ventricular size and function and no significant valvular abnormalities. During the hospital stay, he has another episode of lightheadedness when the telemetry revealed brief supraventricular tachycardia that resolved spontaneously. Which of the following is the most appropriate next step in management?",
    "choice_a": "Catheter ablation",
    "choice_b": "Coronary angiography",
    "choice_c": "Loop event recording",
    "choice_d": "Nuclear stress testing",
    "choice_e": "Tilt-table testing",
    "correct_answer": "A",
    "explanation": "The overall incidence of sudden cardiac death in patients with Wolff-Parkinson-White (WPW) pattern on ECG is low (<1%), but the risk is significantly increased in patients with episodes of tachyarrhythmia. Tachyarrhythmia due to atrial fibrillation is especially dangerous because impulses can conduct from the atria to the ventricles at a very fast rate, potentially causing rhythmic degeneration to ventricular fibrillation. This patient with WPW pattern on ECG, recent syncope event, and documented supraventricular tachycardia with associated symptoms meets criteria for WPW syndrome, and definitive therapy is indicated.\n\nCatheter ablation is the recommended therapy in patients with WPW syndrome. It has a nearly 90% efficacy rate and <5% risk of complications, replacing surgical ablation as the preferred treatment for accessory pathways. The need for catheter ablation in asymptomatic patients with WPW pattern on ECG is controversial, ablation is sometimes favored in young patients, but observation is often favored in older patients who have demonstrated a relatively longer symptom-free period.\n\n(Choice B) Coronary angiography is an invasive procedure indicated for management of acute coronary syndrome. This patient does not have findings to suggest acute coronary syndrome and would be better managed with catheter ablation therapy.\n\n(Choice C) A loop event recorder allows ambulatory ECG monitoring when patients have symptoms (eg, palpitations, lightheadedness) that are suspected to be the result of paroxysmal arrhythmia. However, additional diagnostic cardiac monitoring is not needed in this patient as the resting ECG findings combined with documentation of symptomatic supraventricular tachycardia on telemetry are diagnostic of WPW syndrome.\n\n(Choice D) Nuclear stress testing can be used for diagnosis of coronary artery disease but has no role in managing patients with WPW syndrome.\n\n(Choice E) Tilt-table testing can be used in the evaluation of recurrent syncope (particularly vasovagal syncope) and is reserved for patients who have been ruled out for heart disease (structural or conductive). This patient has conductive evidence of WPW and would not benefit from a tilt-table test.\n\nEducational objective:\nPatients with Wolff-Parkinson-White syndrome are at risk of sudden cardiac death because the accessory pathway can lead to atrial fibrillation that can degenerate into ventricular fibrillation. Catheter ablation to obliterate the accessory pathway is the preferred treatment.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_009",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 47-year-old man is brought to the emergency department after being injured by a lightning strike. He was playing tennis when a thunderstorm suddenly developed. He was struck by cloud-to-ground lightning and thrown several feet by the force of the bolt. Bystanders initiated chest compressions. Emergency medical services arrived within 5 minutes and found the patient in cardiac arrest. On examination, his pupils are dilated and unresponsive to light. The electrical rhythm appears to be asystole. Which of the following is the most appropriate next step in management?",
    "choice_a": "Attempt defibrillation",
    "choice_b": "Continue chest compressions",
    "choice_c": "Give patient amiodarone",
    "choice_d": "Give patient atropine",
    "choice_e": "Stop resuscitation",
    "correct_answer": "B",
    "explanation": "Lightning injuries are uncommon but can involve a number of organ systems, potentially leading to severe multisystem dysfunction and death. Characteristic features include thermal burns (superficial, partial, or full thickness), cardiac arrhythmias (eg, asystole, ventricular fibrillation), rhabdomyolysis with renal failure, and neurological dysfunction (loss of consciousness, temporary weakness/paralysis, autonomic dysfunction, respiratory depression).\n\nExcellent cardiopulmonary resuscitation (CPR) remains the most important component of basic and advanced cardiac life support (ACLS) for patients with asystole following lightning strike; every effort should be made not to interrupt CPR cycles. Chest compressions should be continued while administering vasopressors (epinephrine or vasopressin) and identifying and treating reversible causes of cardiac arrest. Lightning injury can cause temporary autonomic dysfunction with fixed and dilated pupils, this finding should not preclude extended resuscitation efforts. Most victims of lightning injury are relatively young, have few clinical comorbidities, and may recover even following a prolonged period of asystole if they receive appropriate CPR (Choice E).\n\n(Choice A) Early defibrillation is indicated in patients with ventricular fibrillation (VF) and/or pulseless ventricular tachycardia (VT). It is ineffective in patients with asystole or pulseless electrical activity (PEA) and is contraindicated.\n\n(Choice C) Amiodarone has no role in the management of patients with asystole. It is occasionally used to treat stable patients with regular, wide complex tachycardia, and may be used for patients with pulseless VT or VF that is unresponsive to initial defibrillation.\n\n(Choice D) Atropine is considered first-line therapy for patients with symptomatic bradycardia. However, atropine is no longer recommended for the treatment of asystole or PEA.\n\nEducational objective:\nLightning injury can cause cardiac arrest with asystole or ventricular fibrillation. It should be treated with prompt uninterrupted cardiopulmonary resuscitation and use of vasopressors (epinephrine or vasopressin). Atropine is not recommended for the treatment of asystole or pulseless electrical activity.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_010",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 53-year-old man comes to the physician for hypertension follow-up. His blood pressure was 145/95 mm Hg at his last visit 2 weeks ago. He has no present complaints. His past medical history is significant for type 2 diabetes mellitus. The patient has a 50-pack-year smoking history and has consumed 1-2 cans of beer daily for the past 25 years. His body mass index is 33 kg/m². Blood pressure is 150/95 mm Hg and pulse is 80/min. The physical examination is otherwise within normal limits. The physician tells the patient that he should initiate lifestyle changes to control his blood pressure and decrease his risk of future cardiovascular events. Which of the following nonpharmacological measures would be the most effective in decreasing this patient's blood pressure?",
    "choice_a": "10% Weight reduction",
    "choice_b": "Cessation of alcohol intake",
    "choice_c": "Decreased sodium intake to 2 g daily",
    "choice_d": "Moderate exercise",
    "choice_e": "Smoking cessation",
    "correct_answer": "A",
    "explanation": "Modification: Recommended plan | Approximate systolic BP (mm Hg)\nWeight loss: Reduction of BMI to <25 kg/m² | 5-20 per 10-kg loss\nDASH diet: Diet high in fruits & vegetables & low in saturated & total fats | 8-14\nExercise: 30 minutes/day for 5-6 days/week | 4-9\nDietary sodium: <3 g/day | 2-8\nLimit alcohol intake: ≤2 drinks/day in men, ≤1 drink/day in women | 2-4\nDASH = Dietary Approaches to Stop Hypertension\n\nWeight loss is the most effective nonpharmacologic measure to decrease blood pressure in overweight individuals. Weight loss with other nonpharmacologic measures can prevent or delay the onset of hypertension and reduce the overall risk of cardiovascular events in such patients. In some patients with established hypertension, lifestyle changes alone may control their blood pressure. These changes can also allow for fewer drugs and lower doses of antihypertensive medication when needed.\n\n(Choice B) Daily alcohol consumption (≥3 drinks per day in men, ≥2 in women) can raise blood pressure and is a common cause of refractory hypertension that remains uncontrolled despite multiple medications. However, moderate alcohol intake (as in this patient) does not significantly affect blood pressure.\n\n(Choice C) Sodium restriction is recommended for most patients with hypertension, but its effect on blood pressure is inconsistent in some individuals. Sodium restriction is more effective in older (especially postmenopausal women), African American, and overweight individuals. The DASH diet (low in sodium and saturated fat and high in potassium, calcium, and dietary fiber) combined with sodium restriction can lower blood pressure more than sodium restriction alone.\n\n(Choice D) Moderate-intensity exercise can lower blood pressure in both hypertensive and normotensive individuals and will facilitate weight loss. However, weight loss has a greater impact on blood pressure than exercise alone.\n\n(Choice E) Smoking cessation is an important component of lifestyle modification that reduces the risk of future cardiovascular events. Although smoking cessation may directly lower blood pressure, its impact is not as significant as that for weight reduction.\n\nEducational objective:\nWeight loss is the most effective nonpharmacological measure to decrease blood pressure in overweight individuals. Other effective measures include the DASH diet, sodium restriction, moderation of alcohol intake, regular moderate exercise, and smoking cessation.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_011",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 72-year-old man comes to a rural health clinic due to intermittent leg pain. The patient reports a dull discomfort in his left lower calf with activity, causing him to stop and rest on the way to his mailbox, which is approximately 150 m (492 ft) from his house. The pain improves with rest and does not occur at night when he is lying in bed. Medical history is significant for hypertension and gout. Current medications include lisinopril and allopurinol. The patient has a 40-pack-year smoking history, but quit 5 years ago. Family history is significant for a stroke in his father and breast cancer in his mother. Blood pressure is 130/78 mm Hg and pulse is 75/min. The patient's left foot is shiny and devoid of hair, but there are no lower extremity ulcerations. Strength and sensory examination of the left lower extremity is normal. The ankle-brachial index is 0.76 on the left and 1.05 on the right (normal: 1.0-1.4). Laboratory results are as follows:\nCreatinine: 1.0 mg/dL\nGlucose: 101 mg/dL\nTotal cholesterol: 155 mg/dL\nLow-density lipoprotein: 93 mg/dL\nHigh-density lipoprotein: 58 mg/dL\nTriglycerides: 120 mg/dL\nAlanine aminotransferase (SGPT): 25 U/L\n\nItem 1 of 2\n\nIn addition to aspirin, which of the following medications is the most appropriate to add to this patient's pharmacologic regimen?",
    "choice_a": "Amlodipine",
    "choice_b": "Cilostazol",
    "choice_c": "Clopidogrel",
    "choice_d": "Rosuvastatin",
    "choice_e": "Warfarin",
    "correct_answer": "D",
    "explanation": "Indications for statin therapy in the prevention of ASCVD\nSecondary prevention: Established ASCVD (Acute coronary syndrome, Stable angina, Arterial revascularization (eg, CABG), Stroke, TIA, PAD) → Age ≤75: High-intensity statin, Age >75: Moderate-intensity statin\nPrimary prevention: LDL ≥190 mg/dL → High-intensity statin; Age ≥40 with diabetes mellitus → 10-year ASCVD risk ≥20%: High-intensity statin, 10-year ASCVD risk <20%: Moderate-intensity statin; Estimated 10-year ASCVD risk >7.5%-10% → Moderate- to high-intensity statin*\n*High-intensity statins include atorvastatin 40-80 mg & rosuvastatin 20-40 mg; moderate-intensity statins include atorvastatin 10-20 mg, rosuvastatin 5-10 mg, simvastatin 20-40 mg, pravastatin 40-80 mg & lovastatin 40 mg.\nASCVD = atherosclerotic cardiovascular disease; CABG = coronary artery bypass grafting; PAD = peripheral artery disease; TIA = transient ischemic attack.\n\nThis patient's reduced ankle-brachial index and symptoms of calf pain with walking are consistent with claudication due to peripheral artery disease (PAD). PAD is the result of atherosclerotic narrowing that most commonly occurs toward the proximal end of large peripheral arteries (eg, iliac, popliteal). Typical cardiovascular risk factors (eg, advancing age, diabetes mellitus, smoking, hypertension) increase the risk of developing PAD. Depending on the severity of disease, patients can have pain with exertion (claudication), rest pain, tissue ulceration, or gangrene.\n\nPAD is a representation of atherosclerotic cardiovascular disease (ASCVD) and denotes an increased risk of future cardiovascular events (eg, myocardial infarction, stroke). The initiation of aspirin has demonstrated decreased incidence of stroke in patients with PAD and is recommended at the time of diagnosis. In addition, patients age ≤75 should be initiated on high-intensity statin therapy (eg, atorvastatin 40-80 mg daily, rosuvastatin 20-40 mg daily) regardless of baseline cholesterol levels: this lowers the risk of cardiovascular events and may in some cases improve claudication symptoms.\n\n(Choice A) Although amlodipine blocks dihydropyridine calcium channels in peripheral arteries, resulting in peripheral artery dilation, the drug is not helpful for PAD likely because arteries with atherosclerotic disease are unable to undergo significant dilation. Control of hypertension is recommended in patients with PAD, but this patient's blood pressure is already under control on lisinopril alone.\n\n(Choice B) Cilostazol is a phosphodiesterase-3 inhibitor that provides symptomatic improvement in some patients with claudication due to PAD however, initiation of the drug is not recommended until lifestyle modifications (eg, smoking cessation, exercise) have failed.\n\n(Choice C) Some evidence suggests that clopidogrel may be superior to aspirin in reducing the risk of cardiovascular events in patients with PAD; however, aspirin is considered first-line therapy due to a lower bleeding risk. Dual antiplatelet therapy is not recommended due to increased bleeding risk and lack of additional benefit.\n\n(Choice E) Warfarin is not recommended in patients with PAD as it does not provide benefit over aspirin and increases the risk of bleeding complications.\n\nEducational objective:\nPeripheral artery disease (PAD) results from atherosclerotic narrowing of peripheral arteries and represents established atherosclerotic cardiovascular disease. Patients with PAD should be initiated on antiplatelet and high-intensity statin therapy for secondary prevention of cardiovascular events.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_012",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 72-year-old man comes to a rural health clinic due to intermittent leg pain. The patient reports a dull discomfort in his left lower calf with activity, causing him to stop and rest on the way to his mailbox, which is approximately 150 m (492 ft) from his house. The pain improves with rest and does not occur at night when he is lying in bed. Medical history is significant for hypertension and gout. Current medications include lisinopril and allopurinol. The patient has a 40-pack-year smoking history, but quit 5 years ago. Family history is significant for a stroke in his father and breast cancer in his mother. Blood pressure is 130/78 mm Hg and pulse is 75/min. The patient's left foot is shiny and devoid of hair, but there are no lower extremity ulcerations. Strength and sensory examination of the left lower extremity is normal. The ankle-brachial index is 0.76 on the left and 1.05 on the right (normal: 1.0-1.4). Laboratory results are as follows:\nCreatinine: 1.0 mg/dL\nGlucose: 101 mg/dL\nTotal cholesterol: 155 mg/dL\nLow-density lipoprotein: 93 mg/dL\nHigh-density lipoprotein: 58 mg/dL\nTriglycerides: 120 mg/dL\nAlanine aminotransferase (SGPT): 25 U/L\n\nItem 2 of 2\n\nFollowing medication adjustment, the patient is sent for CT angiography that shows 90% stenosis of the left superficial femoral artery and 80% stenosis of the left popliteal artery. Which of the following is the best additional recommendation for this patient?",
    "choice_a": "Intermittent pneumatic compression",
    "choice_b": "Low-fat diet",
    "choice_c": "Percutaneous stent placement",
    "choice_d": "Supervised exercise program",
    "choice_e": "Surgical bypass grafting",
    "correct_answer": "D",
    "explanation": "Treatment of symptomatic peripheral artery disease\nStep 1A: Risk factor management (Smoking cessation, Blood pressure & diabetes control, Antiplatelet & statin therapy)\nStep 1B: Supervised exercise therapy\nStep 2: Cilostazol (preferred over pentoxifylline)\nStep 3: Revascularization for persistent symptoms (Angioplasty ± stent placement, Autogenous or synthetic bypass graft)\n\nIn addition to cardiovascular risk factor management (eg, smoking cessation), a supervised exercise program is the best initial management for claudication due to peripheral artery disease (PAD). Patients should participate in 30-45 minutes of supervised walking ≥3 times a week for >3 months. Once the walking time required to develop claudication is determined, the sessions are gradually increased until the patient can walk for a longer period without developing symptoms. Patients may experience moderate increases in symptom-free walking distance.\n\nFor patients with persistent symptoms despite smoking cessation, antiplatelet and statin therapy, and supervised exercise therapy, the addition of twice-daily cilostazol may lead to improvement in symptoms.\n\n(Choice A) Daily intermittent pneumatic compression therapy may improve symptoms in some patients with severe PAD or critical limb ischemia, but it should not be attempted until exercise therapy has failed.\n\n(Choice B) A healthy diet low in fat is important in all patients with cardiovascular disease but is unlikely to result in significant improvement in claudication symptoms.\n\n(Choices C and E) Revascularization via percutaneous stent placement or surgical bypass grafting is generally reserved for patients with critical limb ischemia or for those who continue to have claudication symptoms despite cardiovascular risk factor management, exercise, and pharmacologic therapy.\n\nEducational objective:\nA supervised exercise program should be recommended for patients with intermittent claudication due to peripheral arterial disease. Cilostazol can be added for patients with persistent symptoms despite cardiovascular risk factor management and exercise therapy, followed by revascularization if necessary.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_013",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 55-year-old woman comes to the office for a preventive visit. She has no concerns at this time. The patient experienced a myocardial infarction 2 years ago. Current medications are metoprolol and aspirin. The patient does not smoke or use alcohol. Blood pressure is 125/80 mm Hg and pulse is 65/min. Physical examination is unremarkable. Fasting blood glucose level is 100 mg/dL Laboratory results are as follows:\nTotal cholesterol: 240 mg/dL\nHDL cholesterol: 40 mg/dL\nLDL cholesterol: 140 mg/dL\nTriglycerides: 400 mg/dL\nThe initiation of which of the following medications is most appropriate in this patient?",
    "choice_a": "Atorvastatin",
    "choice_b": "Cholestyramine",
    "choice_c": "Estradiol",
    "choice_d": "Gemfibrozil",
    "choice_e": "Niacin",
    "correct_answer": "A",
    "explanation": "Indications for statin therapy in the prevention of ASCVD\nSecondary prevention: Established ASCVD (Acute coronary syndrome, Stable angina, Arterial revascularization (eg, CABG), Stroke, TIA, PAD) → Age ≤75: High-intensity statin, Age >75: Moderate-intensity statin\nPrimary prevention: LDL ≥190 mg/dL → High-intensity statin; Age ≥40 with diabetes mellitus → 10-year ASCVD risk ≥20%: High-intensity statin, 10-year ASCVD risk <20%: Moderate-intensity statin; Estimated 10-year ASCVD risk >7.5%-10% → Moderate- to high-intensity statin*\n*High-intensity statins include atorvastatin 40-80 mg & rosuvastatin 20-40 mg; moderate-intensity statins include atorvastatin 10-20 mg, rosuvastatin 5-10 mg, simvastatin 20-40 mg, pravastatin 40-80 mg & lovastatin 40 mg.\nASCVD = atherosclerotic cardiovascular disease; CABG = coronary artery bypass grafting; PAD = peripheral artery disease; TIA = transient ischemic attack.\n\nThis patient has established atherosclerotic cardiovascular disease (ASCVD) based on her previous myocardial infarction. Patients with known ASCVD are at high risk for future cardiovascular events and death. Several randomized trials for secondary prevention of ASCVD have shown significant risk reduction in cardiovascular events and overall cardiovascular disease mortality in patients treated with statins.\n\nCurrent guidelines recommend high-intensity statin therapy (eg, atorvastatin 40-80 mg, rosuvastatin 20-40 mg daily) for secondary prevention in all patients age ≤75 with known ASCVD (moderate-intensity statin therapy is recommended for those age >75), regardless of baseline LDL level.\n\nStatin therapy is also recommended for primary prevention of ASCVD in patients with serum LDL ≥190 mg/dL, age ≥40 with diabetes mellitus, or with an estimated 10-year risk of ASCVD >7.5%-10% (guidelines vary on the exact cutoff) using the Pooled Cohort Equations risk calculator.\n\n(Choice B) Bile acid sequestrants (eg, cholestyramine, colestipol, colesevelam) are effective in reducing LDL levels, but there is limited evidence of improvement in cardiovascular outcomes.\n\n(Choice C) Estrogen replacement therapy (eg, estradiol) has favorable effects on lipid levels (ie, reduced LDL, increased HDL) but does not lead to a lower risk of cardiovascular events. Estrogen replacement may actually increase cardiovascular risk in older, postmenopausal women (eg, age >60).\n\n(Choice D) Fibrates (eg, gemfibrozil) are the most effective pharmacologic therapy available for reducing triglyceride levels and are recommended in patients with severe hypertriglyceridemia (ie, >1000 mg/dL) to reduce the risk of pancreatitis. However, due to superior evidence of overall cardiovascular benefit, statins are the recommended first-line therapy for both secondary and primary prevention of ASCVD in patients with mild hypertriglyceridemia (ie, 150-500 mg/dL).\n\n(Choice E) Niacin (ie, nicotinic acid) is effective in increasing HDL levels and has modest effects in reducing LDL levels. However, despite the favorable effects on lipid profile, niacin has not shown improvement in cardiovascular outcomes in patients with known ASCVD.\n\nEducational objective:\nStatin therapy is recommended for all patients with established atherosclerotic cardiovascular disease, regardless of baseline LDL level. Therapy with nonstatin lipid-lowering medications has not been shown to improve cardiovascular outcomes and is not usually recommended.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_014",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 3 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 70-year-old woman is brought to the emergency department by her son for evaluation of shortness of breath. She has had a sensation of choking since last night. According to her son, for the past several weeks she has had a dry cough at night and has been taking over-the-counter cough drops. The patient has had no chest pain, palpitations, back pain, abdominal symptoms, or lightheadedness. She has a history of hypertension, hyperlipidemia, and type 2 diabetes mellitus. She has been refusing statin therapy, as she heard statins cause multiple side effects. The patient has also refused flu vaccinations over the last several years. Her only hospital admission occurred 6 years ago when she underwent a spinal fusion for lower back pain. She does not use tobacco, alcohol, or illicit drugs. Family history is not significant. Temperature is 36.1 C (97 F), blood pressure is 171/102 mm Hg, pulse is 92/min, and respirations are 34/min Pulse oximetry is 85% on room air. BMI is 29 kg/m² Bilateral crackles are heard on lung examination. There are no heart murmurs. ECG shows normal sinus rhythm, increased voltage in the precordial leads, and T-wave inversion in leads V5 and V6. Chest x-ray is shown in the exhibit. Oxygen is administered via 100% nonrebreather facemask.\n\nItem 1 of 3\n\nWhich of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Intravenous broad-spectrum antibiotics",
    "choice_b": "Intravenous furosemide",
    "choice_c": "Intravenous methylprednisolone",
    "choice_d": "Intravenous metoprolol",
    "choice_e": "Intravenous thrombolytics",
    "correct_answer": "B",
    "explanation": "Acute decompensated heart failure (ADHF) results from a critical elevation in intracardiac filling pressures that most commonly occurs due to left ventricular (LV) systolic and/or diastolic dysfunction (eg, coronary ischemia, hypertensive cardiomyopathy). Other causes include valvular disease and marked elevations in preload (eg, excessive volume resuscitation) or afterload (eg, severe hypertension).\n\nThis patient with chronic hypertension, possible medication nonadherence (eg, refusing statins and vaccinations), ECG evidence of LV hypertrophy (ie, increased voltage in the precordial leads), and several weeks of cough likely has chronic LV dysfunction due to hypertension. She has experienced gradually increasing LV filling pressures that reached a critical point, resulting in ADHF and pulmonary edema (bilateral crackles, vascular congestion on chest x-ray, tachypnea, hypoxia). Jugular venous distension is usually present but lower extremity edema may be absent, especially in patients without chronic heart failure.\n\nEarly therapeutic goals include hemodynamic stabilization, improved oxygenation (ie, with supplemental oxygen or positive pressure ventilation), and optimization of volume status. Intravenous diuretics (eg, furosemide) are an important part of initial therapy as they reduce intravascular volume, lower intracardiac filling pressures, and improve pulmonary edema.\n\n(Choice A) This patient is without fever, purulent sputum production, or focal consolidation on chest x-ray to suggest respiratory failure due to pulmonary infection; intravenous antibiotics are not indicated.\n\n(Choice C) Glucocorticoids (eg, methylprednisolone) are indicated for an exacerbation of chronic obstructive pulmonary disease; however, this patient's bilateral crackles on lung examination, evidence of pulmonary edema on chest x-ray, and lack of tobacco use make ADHF more likely.\n\n(Choice D) Beta blockers (eg, metoprolol) are important in the management of chronic heart failure due to LV systolic dysfunction. They are also used in certain patients with tachyarrhythmias or ST-elevation myocardial infarction. However, they are usually contraindicated in ADHF due to the negative inotropy and chronotropy causing a potential worsening of pulmonary edema.\n\n(Choice E) Intravenous thrombolytic (eg, alteplase) therapy is indicated in patients with hypotension (ie, systolic blood pressure <90 mm Hg) or shock due to acute pulmonary embolism. This patient is not hypotensive and the several weeks of cough, marked pulmonary edema on chest x-ray, and absence of chest pain make ADHF more likely.\n\nEducational objective:\nAcute decompensated heart failure results from a critical elevation in intracardiac filling pressures, often due to left ventricular dysfunction, and leads to pulmonary edema. Intravenous diuretics (eg, furosemide) lower intracardiac filling pressures and improve pulmonary edema, and are an important part of initial therapy.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_015",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 3 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 70-year-old woman is brought to the emergency department by her son for evaluation of shortness of breath. She has had a sensation of choking since last night. According to her son, for the past several weeks she has had a dry cough at night and has been taking over-the-counter cough drops. The patient has had no chest pain, palpitations, back pain, abdominal symptoms, or lightheadedness. She has a history of hypertension, hyperlipidemia, and type 2 diabetes mellitus. She has been refusing statin therapy, as she heard statins cause multiple side effects. The patient has also refused flu vaccinations over the last several years. Her only hospital admission occurred 6 years ago when she underwent a spinal fusion for lower back pain. She does not use tobacco, alcohol, or illicit drugs. Family history is not significant. Temperature is 36.1 C (97 F), blood pressure is 171/102 mm Hg, pulse is 92/min, and respirations are 34/min Pulse oximetry is 85% on room air. BMI is 29 kg/m² Bilateral crackles are heard on lung examination. There are no heart murmurs. ECG shows normal sinus rhythm, increased voltage in the precordial leads, and T-wave inversion in leads V5 and V6. Chest x-ray is shown in the exhibit. Oxygen is administered via 100% nonrebreather facemask.\n\nItem 2 of 3\n\nThe patient is placed on noninvasive positive pressure ventilation but still appears somewhat uncomfortable. Laboratory results are as follows:\nHemoglobin: 11.4 g/dL\nPlatelets: 180,000/mm³\nLeukocytes: 10,000/mm³\nSodium: 131 mEq/L\nPotassium: 3.8 mEq/L\nCreatinine: 1.4 mg/dL\nThe first troponin I level is negative. Repeat blood pressure is 176/105 mm Hg, pulse is 82/min, and respirations are 24/min. Oxygen saturation is 94%. What is the best next step in management of this patient?",
    "choice_a": "Intravenous digoxin",
    "choice_b": "Intravenous metoprolol",
    "choice_c": "Intravenous milrinone",
    "choice_d": "Intravenous nitroglycerin",
    "choice_e": "Intravenous unfractionated heparin",
    "correct_answer": "D",
    "explanation": "The addition of an intravenous vasodilator is recommended in patients with acute decompensated heart failure (ADHF) who have an inadequate response to initial diuretic therapy Nitroglycerin is most commonly used; as primarily a venous dilator, it leads to a rapid decrease in cardiac preload, resulting in reduced intracardiac filling pressures and improvement in pulmonary edema. Nitroprusside is less commonly used due to the risk of adverse effects (eg, cyanide toxicity, severe hypotension); it decreases intracardiac filling pressures through balanced vasodilation and reductions in both cardiac preload and afterload.\n\nBecause intravenous vasodilator therapy often results in rapid improvement of acutely symptomatic pulmonary edema, it is indicated right away (prior to or instead of intravenous diuretics) in patients with \"flash\" pulmonary edema due to severe hypertension (>180/120 mm Hg) (ie, hypertensive emergency).\n\n(Choice A) Digoxin is a positive inotropic agent used in some patients with chronic heart failure due to left ventricular (LV) systolic dysfunction. However, it has no role in the management of ADHF.\n\n(Choice B) Pulmonary edema due to atrial fibrillation with rapid ventricular response is one ADHF scenario where metoprolol may actually provide benefit (by increasing markedly low ventricular filling times); however, in this patient with normal heart rate and sinus rhythm on ECG, metoprolol is likely to worsen pulmonary edema.\n\n(Choice C) Milrinone is a selective phosphodiesterase-3 inhibitor that causes positive inotropy as well as reductions in preload and afterload. It can be useful for ADHF due to LV systolic dysfunction; however, it is associated with increased risk of hypotension and atrial or ventricular arrhythmia, and is typically reserved for severe ADHF that is refractory to other management.\n\n(Choice E) Intravenous unfractionated heparin is indicated for acute myocardial infarction, which can lead to ADHF. However, there is currently no evidence of acute myocardial infarction in this patient with no chest pain, no ST elevation on ECG, and a negative initial serum troponin.\n\nEducational objective:\nIntravenous vasodilators (eg, nitroglycerin) reduce intracardiac filling pressures and are recommended in patients with acute decompensated heart failure who have an inadequate response to initial diuretic therapy. In addition, they are indicated as initial therapy (prior to or instead of intravenous diuretics) in patients with \"flash\" pulmonary edema due to severe hypertension.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_016",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 3 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 70-year-old woman is brought to the emergency department by her son for evaluation of shortness of breath. She has had a sensation of choking since last night. According to her son, for the past several weeks she has had a dry cough at night and has been taking over-the-counter cough drops. The patient has had no chest pain, palpitations, back pain, abdominal symptoms, or lightheadedness. She has a history of hypertension, hyperlipidemia, and type 2 diabetes mellitus. She has been refusing statin therapy, as she heard statins cause multiple side effects. The patient has also refused flu vaccinations over the last several years. Her only hospital admission occurred 6 years ago when she underwent a spinal fusion for lower back pain. She does not use tobacco, alcohol, or illicit drugs. Family history is not significant. Temperature is 36.1 C (97 F), blood pressure is 171/102 mm Hg, pulse is 92/min, and respirations are 34/min Pulse oximetry is 85% on room air. BMI is 29 kg/m² Bilateral crackles are heard on lung examination. There are no heart murmurs. ECG shows normal sinus rhythm, increased voltage in the precordial leads, and T-wave inversion in leads V5 and V6. Chest x-ray is shown in the exhibit. Oxygen is administered via 100% nonrebreather facemask.\n\nItem 3 of 3\n\nThe patient is responding well to treatment. The second troponin I level is negative. Which of these tests is the most appropriate next step in management of this patient?",
    "choice_a": "Coronary angiography",
    "choice_b": "D-dimer testing",
    "choice_c": "Noncontrast CT scan of the chest",
    "choice_d": "Pulmonary function testing",
    "choice_e": "Transthoracic echocardiogram",
    "correct_answer": "E",
    "explanation": "Transthoracic echocardiogram should be performed in patients with acute decompensated heart failure (ADHF) of uncertain etiology. In this patient it will allow for confirmation of suspected left ventricular dysfunction (ie, hypertensive cardiomyopathy) and provide an assessment for valvular abnormalities (eg, mitral regurgitation) that may contribute to ADHF.\n\n(Choice A) There is no biochemical or significant ECG evidence that myocardial ischemia contributed to this patient's presentation of ADHF However, if echocardiogram demonstrates left ventricular systolic (rather than only diastolic) dysfunction, stress testing or coronary angiography should be performed to rule out ischemic cardiomyopathy.\n\n(Choices B, C, and D) Negative D-dimer testing can rule out acute pulmonary embolism in patients with a low pretest probability of disease. Pulmonary function testing and noncontrast CT scan of the chest can allow for evaluation for other causes of respiratory failure (eg, chronic obstructive pulmonary disease, interstitial lung disease). However, these tests are not indicated in this patient with a clear presentation of ADHF that responded to typical therapy.\n\nEducational objective:\nTransthoracic echocardiogram should be performed in patients with acute decompensated heart failure of uncertain etiology to evaluate for left ventricular and valvular dysfunction. If significant left ventricular systolic dysfunction is present, evaluation for ischemic cardiomyopathy with stress testing or coronary angiography is indicated.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_017",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 70-year-old man is brought to the emergency department by his wife after passing out earlier this morning. He was sitting in a chair watching TV when he lost consciousness for approximately 3 minutes before spontaneously recovering. He did not fall off the chair, and his wife did not observe any convulsive limb movements. There was no soiling of his clothes by urine or stool. She says, \"Doc, it never happened to him before He was completely unresponsive and looked pale. I got really scared.\" In the emergency department the patient has no headache, nausea, chest discomfort, or shortness of breath. He has no recollection of what happened and did not feel anything out of the ordinary beforehand. Medical history includes hypertension, hyperlipidemia, type 2 diabetes mellitus, and coronary artery disease. He had an anterolateral myocardial infarction 2 years ago and underwent coronary stent placement. Since then, the patient has had no episodes of angina. His lifestyle is sedentary and he spends little time outdoors. He becomes short of breath when climbing a flight of stairs. On initial evaluation the patient appears comfortable and asks if he can go home. Temperature is 36.7 C (98 F), blood pressure is 130/86 mm Hg sitting and 125/85 mm Hg standing, pulse is 78/min, and respirations are 16/min. Pulse oximetry shows 98% on room air. Neurologic examination is nonfocal. ECG shows normal sinus rhythm with anterolateral Q waves, unchanged from prior ECG. Blood cell counts, serum chemistry studies, and chest x-ray are within normal limits. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Admit to telemetry unit for echocardiogram and observation",
    "choice_b": "Discharge home with 24-hour Holter monitor and arrange outpatient follow-up",
    "choice_c": "Order CT scan of the head without contrast",
    "choice_d": "Proceed with immediate coronary angiography",
    "choice_e": "Provide reassurance and discharge home with syncope education",
    "correct_answer": "A",
    "explanation": "Cardiogenic syncope\nEtiology: Clues to diagnosis\nAortic stenosis or HCM: Exertional syncope, Systolic murmur on examination\nVentricular tachycardia: No preceding symptoms, Cardiomyopathy or previous MI\nSick sinus syndrome: Preceding fatigue or dizziness, Sinus pauses on ECG\nAdvanced AV block: Bifascicular block or ↑ PR interval on ECG, Dropped QRS complexes on ECG\nTorsades de pointes: No preceding symptoms, Medications that prolong QT interval, Hypokalemia or hypomagnesemia\nAV= atrioventricular; HCM = hypertrophic cardiomyopathy: MI= myocardial infarction\n\nThis patient has most likely experienced cardiogenic syncope due to ventricular tachycardia (VT); scarring from previous myocardial infarction (evidenced by Q waves on ECG) increases the risk of ventricular arrhythmia. Syncope due to VT usually has no warning symptoms (other than palpitations in some patients). The arrhythmia spontaneously terminates within a few minutes, resulting in restoration of cardiac output and rapid patient recovery with no residual symptoms.\n\nThe recognition of cardiogenic syncope is crucial because these patients are often at high risk of sudden cardiac death. Absence of autonomic prodromal symptoms (eg, nausea, pallor, diaphoresis, feeling of warmth), which are usually present prior to a benign syncope event, suggests cardiogenic syncope. The presence of underlying structural heart disease (eg, ischemic scarring, cardiomyopathy with low ejection fraction) specifically suggests cardiogenic syncope due to VT.\n\nThis patient should be admitted to the hospital to undergo telemetry monitoring (to attempt to detect arrhythmia) and echocardiography (to evaluate left ventricular function and identify wall motion abnormality). Treatment with some combination of pharmacologic therapy (eg, amiodarone), catheter ablation, or placement of an implantable cardiac defibrillator is likely indicated.\n\n(Choice B) This patient is at risk of experiencing recurrent VT that could result in sudden cardiac death; therefore, discharge home with a Holter monitor is not appropriate and inpatient monitoring and workup are indicated.\n\n(Choice C) Although CT scan of the head is appropriate for patients with suspected stroke or seizure, it is not indicated in the workup of syncope. This patient has no focal neurologic deficits and experienced no abnormal movements or incontinence during the episode, making stroke or seizure highly unlikely.\n\n(Choice D) This patient may require coronary angiography if echocardiogram shows a new wall motion defect or markedly reduced left ventricular ejection fraction; however, coronary angiography is not indicated prior to other workup.\n\n(Choice E) Reassurance and discharge home with syncope education are appropriate for patients who have experienced neurocardiogenic (vasovagal) syncope, which is commonly triggered by prolonged standing or emotional stress and is usually accompanied by autonomic prodrome. This patient's absence of prodrome and history of ischemic heart disease make cardiogenic syncope more likely.\n\nEducational objective:\nCardiogenic syncope due to ventricular tachycardia is suggested by the abrupt onset of syncope without prodrome and the presence of underlying structural heart disease These patients are at risk of sudden cardiac death and require definitive evaluation and management",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_018",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 62-year-old woman comes to the physician due to chest and epigastric discomfort over the last 6 months. She feels dull chest pressure while walking uphill at a fast pace. The patient says, \"It is unusual. I feel this pressure only once in a while, even when doing the same thing. Sometimes it is worse when I walk fast after a heavy meal.\" She has a history of nonulcer dyspepsia and acid reflux disease and occasionally takes over-the-counter omeprazole. She has no shortness of breath, palpitations, lightheadedness, lower extremity swelling, or syncope. The patient is physically active and has a very hectic social lifestyle. Medical history includes \"borderline\" hypertension and anxiety disorder. She stopped taking antihypertensive medications 5 years ago. She is a lifetime nonsmoker. The patient does not use alcohol or illicit drugs. Her mother suffered a stroke at age 70 and her father died of prostate cancer. Blood pressure is 145/90 mm Hg and pulse is 80/min and regular. BMI is 29 kg/m² No heart murmurs are heard on cardiac auscultation. There are no carotid bruits. The lungs are clear and the rest of the physical examination is unremarkable. Resting ECG shows normal sinus rhythm, normal voltage, and T-wave flattening in leads V5 and V6. Laboratory studies show fasting blood glucose of 102 mg/dL and LDL cholesterol of 110 mg/dL Which of the following is most appropriate management for this patient's chest pain?",
    "choice_a": "Initiate antihypertensive therapy with no diagnostic testing",
    "choice_b": "Obtain a dobutamine echocardiogram",
    "choice_c": "Obtain an exercise ECG",
    "choice_d": "Obtain exercise myocardial perfusion imaging",
    "choice_e": "Proceed with coronary angiography",
    "correct_answer": "C",
    "explanation": "Diagnostic evaluation of suspected stable CAD\nSymptoms & risk factors suggest stable CAD\n→ Able to exercise → Exercise ECG stress testing*\n→ Unable to exercise → Pharmacologic stress testing\nExercise ECG stress testing results:\n→ Positive → CAD present → Medical management ± CA with revascularization (high-risk patients)\n→ Negative → No significant CAD** → Risk factor reduction\n*Exercise imaging if significant baseline ECG abnormalities (eg, baseline ST depression).\n**Perform coronary angiography if high suspicion of false-negative result.\nCA coronary angiography, CAD = coronary artery disease.\n\nMyocardial ischemia due to coronary artery disease (CAD) is a common and highly important cause of chest pain in adults; however, the diagnosis is sometimes challenging. There is a high probability of chest pain being anginal if it is typical in location and quality (eg, substernal pressure or discomfort), provoked by exercise or stress, and relieved by rest or nitroglycerin. This probability decreases as fewer of these criteria are met. Patient age, sex, and ECG findings as well as the presence of CAD risk factors (eg, diabetes mellitus, smoking, hypertension) also influence the probability of clinically significant CAD.\n\nThis patient's chest pain is typical in location and quality but is only sometimes related to exercise; it is most consistent with atypical or nonanginal chest pain. Women are less likely to have CAD than men when presenting with similar symptoms at the same age, however, women are more likely to present with atypical anginal symptoms. Overall, this patient's presentation raises reasonable suspicion for stable CAD, and stress testing is the most appropriate initial diagnostic evaluation. Exercise ECG is preferred in patients who are able to walk and do not have significant abnormalities on resting ECG (eg, left bundle branch block, ST depression).\n\n(Choice A) Initiation of antihypertensive therapy with no diagnostic testing would be appropriate in a hypertensive patient with a very low suspicion for CAD (eg, woman age 35 with nonanginal chest pain and no other CAD risk factors), but is not appropriate in this 62-year-old woman with a reasonable suspicion of clinically significant CAD.\n\n(Choices B and D) Dobutamine echocardiogram and myocardial perfusion imaging are alternate forms of cardiac stress testing. These modalities may have better diagnostic accuracy than ECG stress testing however, they cost more and are typically reserved as second-line options or for patients unable to undergo exercise ECG stress testing.\n\n(Choice E) Coronary angiography is rarely pursued in the evaluation of stable CAD until stress testing has been performed. In patients with positive stress testing with evidence of high-risk features (eg, severe ischemia), coronary angiography is indicated to evaluate for amenability to revascularization (eg, stent placement, coronary artery bypass grafting).\n\nEducational objective:\nIn patients with chest pain, the probability of clinically significant coronary artery disease (CAD) is based on chest pain characteristics, as well as patient age, sex, ECG findings, and CAD risk factors. Stress testing is the initial evaluation of choice in patients in whom there is reasonable suspicion of clinically significant, stable CAD.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_019",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 55-year-old man comes to the emergency department due to sudden onset of retrosternal chest pain. The pain began 10 hours ago and has been mostly constant, although he describes it as \"being bad and then getting a little better.\" The patient has had no lightheadedness, syncope, or shortness of breath. ECG shows normal sinus rhythm with 2-mm ST-segment elevation in leads V2 to V5. He is taken emergently for cardiac catheterization and undergoes percutaneous coronary intervention with stent placement to the left anterior descending artery. After the procedure, the ST-segment changes improve and he has complete resolution of the chest pain. On the third night, just prior to discharge, he calls for the nurse due to the sudden onset of sharp, retrosternal chest pain. The patient first noticed the pain while turning around in bed; it worsens with deep breathing. Temperature is 37.8 C (100 F), blood pressure is 134/80 mm Hg, heart rate is 108/min, and respirations are 22/min Pulse examination reveals regular heart sounds and clear lung fields. There is a scratchy sound heard during ventricular systole along the left sternal border. Abdominal palpation reveals no localized tenderness. ECG shows sinus tachycardia with Q waves and T-wave inversion in leads V2 to V5.\n\nItem 1 of 2\n\nWhich of the following is the most likely cause of this patient's recurrent symptoms?",
    "choice_a": "Acute myocardial infarction",
    "choice_b": "Acute pericarditis",
    "choice_c": "Dressler syndrome",
    "choice_d": "Left ventricular aneurysm",
    "choice_e": "Recurrent myocardial ischemia",
    "correct_answer": "B",
    "explanation": "Acute pericarditis\nEtiology: • Viral or idiopathic, • Autoimmune disease (eg, SLE), • Uremia (acute or chronic renal failure), • Post myocardial infarction (Early: peri-infarction pericarditis; Late: Dressler syndrome)\nClinical features & diagnosis: • Pleuritic chest pain (↓ when sitting up) ± fever; • Pericardial friction rub (highly specific); • ECG: diffuse ST-segment elevation & PR-segment depression; • Echocardiography: pericardial effusion\nTreatment: NSAIDs & colchicine for viral or idiopathic etiology; Variable for other etiologies\nNSAIDs = nonsteroidal anti-inflammatory drugs: SLE = systemic lupus erythematosus.\n\nThis patient's chest pain is most likely due to peri-infarction pericarditis (PIP), which can occur due to localized inflammation typically <4 days following acute myocardial infarction (MI). Delayed coronary reperfusion following ST-elevation MI (eg, >3 hours from symptom onset) increases the risk of developing PIP.\n\nPatients with PIP typically have pleuritic chest pain that worsens with deep inspiration and improves with sitting up. The pain is usually located retrosternally and often radiates posteriorly to the bilateral trapezius ridges (lower portion of the scapulae). Low-grade fever may be present. Cardiac auscultation should reveal a pericardial friction rub that is classically triphasic (heard in atrial systole, ventricular systole, and early ventricular diastole). ECG characteristically shows diffuse PR depression and ST elevation, but these findings are not always present and may be masked by ECG changes from recent MI.\n\n(Choices A and E) Recurrent myocardial ischemia or infarction is often difficult to distinguish from PIP. However, pleuritic chest pain (worse with position and breathing) and pericardial friction rub, along with the absence of any new ECG changes, are consistent with acute pericarditis.\n\n(Choice C) Dressler syndrome (post cardiac injury syndrome) is an immune-mediated pericarditis that can occur several weeks following MI. The symptomatic presentation is similar to PIP, but it would be highly unusual for Dressler syndrome to occur within 2-3 days following MI.\n\n(Choice D) Ventricular aneurysm occurs as a late complication, typically weeks to months, after acute MI. It is characterized by ECG findings of persistent ST-segment elevation, along with deep Q waves in the same leads. The usual presentation is progressive left ventricular enlargement causing heart failure, refractory angina, ventricular arrhythmias, or systemic arterial embolization due to mural thrombus.\n\nEducational objective:\nPatients with peri-infarction pericarditis typically have pleuritic chest pain and a pericardial friction rub <4 days following an acute myocardial infarction. The characteristic ECG changes of diffuse PR depression and ST elevation may also be present, but can be masked by ECG changes of recent myocardial infarction.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_020",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "The following vignette applies to the next 2 items. The items in the set must be answered in sequential order. Once you click Proceed to Next Item, you will not be able to add or change an answer.\n\nA 55-year-old man comes to the emergency department due to sudden onset of retrosternal chest pain. The pain began 10 hours ago and has been mostly constant, although he describes it as \"being bad and then getting a little better.\" The patient has had no lightheadedness, syncope, or shortness of breath. ECG shows normal sinus rhythm with 2-mm ST-segment elevation in leads V2 to V5. He is taken emergently for cardiac catheterization and undergoes percutaneous coronary intervention with stent placement to the left anterior descending artery. After the procedure, the ST-segment changes improve and he has complete resolution of the chest pain. On the third night, just prior to discharge, he calls for the nurse due to the sudden onset of sharp, retrosternal chest pain. The patient first noticed the pain while turning around in bed; it worsens with deep breathing. Temperature is 37.8 C (100 F), blood pressure is 134/80 mm Hg, heart rate is 108/min, and respirations are 22/min Pulse examination reveals regular heart sounds and clear lung fields. There is a scratchy sound heard during ventricular systole along the left sternal border. Abdominal palpation reveals no localized tenderness. ECG shows sinus tachycardia with Q waves and T-wave inversion in leads V2 to V5.\n\nItem 2 of 2\n\nWhich of the following is the most appropriate next step in management of this patient?",
    "choice_a": "High-dose aspirin",
    "choice_b": "Immediate cardiothoracic surgical referral",
    "choice_c": "Naproxen plus colchicine",
    "choice_d": "Oral glucocorticoids",
    "choice_e": "Urgent cardiac catheterization",
    "correct_answer": "A",
    "explanation": "Mechanical complications of acute myocardial infarction\nComplication: Time course | Involved coronary artery | Clinical findings | Echocardiogram findings\nRight ventricular failure: Acute | RCA | Hypotension, Clear lungs, Kussmaul sign | Hypokinetic RV\nPapillary muscle rupture: Acute or within 3-5 days | RCA | Severe pulmonary edema, New holosystolic murmur | Severe mitral regurgitation with flail leaflet\nInterventricular septum rupture: Acute or within 3-5 days | LAD (apical septal) or RCA (basal septal) | Chest pain, New holosystolic murmur, Biventricular failure, Shock | Left-to-right ventricular shunt, ↑ O2 level from RA to RV\nFree wall rupture: Within 5 days* to 2 weeks | LAD | Chest pain, Shock, Distant heart sounds | Pericardial effusion with tamponade\nLeft ventricular aneurysm: Up to several months | LAD | Subacute heart failure, Stable angina | Thin & dyskinetic myocardial wall\n*50% occur within 5 days. LAD = left anterior descending; RA = right atrium; RCA = right coronary artery; RV = right ventricle.\n\nPeri-infarction pericarditis (PIP) is usually self-limited and some patients do not require pharmacologic treatment. However, for those with significant discomfort, high-dose aspirin (eg, 650 mg 3 times a day) is the treatment of choice for symptomatic relief. High-dose aspirin is believed to provide analgesia and anti-inflammatory effect while having a relatively small effect on myocardial healing and scar formation compared to other anti-inflammatory drugs (eg, other nonsteroidal anti-inflammatory drugs [NSAIDs], glucocorticoids). In patients with persistent symptoms despite high-dose aspirin, colchicine or narcotic analgesics (eg, oxycodone) can be used either individually or in combination for additional pain relief.\n\n(Choice B) Immediate cardiothoracic surgical referral should be obtained in patients with a suspected early mechanical complication of myocardial infarction. This patient has no hypotension, evidence of pulmonary edema, or cardiac murmur to suggest such a complication.\n\n(Choices C and D) Naproxen in combination with colchicine is the treatment of choice for most patients with idiopathic or viral acute pericarditis. However, it is recommended that NSAIDs other than aspirin be avoided for treatment of PIP as they may impair myocardial healing and increase the risk of ventricular septal or free wall rupture. For the same reason, glucocorticoids (eg, prednisone) should be avoided as well.\n\n(Choice E) Urgent cardiac catheterization is indicated in patients with recurrent myocardial ischemia or infarction. However, this patient's pleuritic chest pain that worsens with movement is not consistent with chest pain due to recurrent myocardial ischemia or infarction.\n\nEducational objective:\nWhen pharmacologic therapy is needed, high-dose aspirin is the treatment of choice for symptomatic management of peri-infarction pericarditis. Other anti-inflammatory agents (eg, other nonsteroidal anti-inflammatory drugs, glucocorticoids) should be avoided as they may impair myocardial healing and increase the risk of ventricular septal or free wall rupture.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  },
  {
    "id": "cardio_acm_021",
    "system": "Cardiovascular System",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 55-year-old man with type 2 diabetes mellitus and hypertension comes to the physician with exertional chest pain over the last 3 months that has worsened recently. He reports chest pain, occasionally accompanied by diaphoresis, after walking one block. His medications include low-dose aspirin, metoprolol, rosuvastatin, insulin detemir, and nitroglycerin as needed. Cardiac catheterization shows proximal left anterior descending artery stenosis of 90%, right coronary artery stenosis of 85%, and left circumflex artery stenosis of 75%. His left ventricular ejection fraction is 45%. His hemoglobin A1C is 7.8% and LDL cholesterol is 110 mg/dL What is the most appropriate management for this patient?",
    "choice_a": "Coronary artery bypass grafting surgery",
    "choice_b": "Improvement of glycemic control, ranolazine, and follow-up in 6 months",
    "choice_c": "Niacin, amlodipine, and follow-up in 6 months",
    "choice_d": "Percutaneous coronary intervention using bare metal stents",
    "choice_e": "Percutaneous coronary intervention using drug-eluting stents",
    "correct_answer": "A",
    "explanation": "This patient has crescendo angina pectoris, severe multivessel coronary artery disease (CAD) with involvement the proximal left anterior descending artery (LAD), and left ventricular systolic dysfunction. The goals of treatment in patients with CAD are to improve symptoms, reduce cardiovascular morbidity, and improve overall survival. This is achieved using a comprehensive approach, with aggressive lifestyle modifications, optimal medical therapy, and coronary revascularization in appropriately selected patients.\n\nCoronary revascularization is indicated primarily for 2 groups of patients with stable angina:\n• Patients with refractory angina despite maximal medical therapy\n• Patients in whom revascularization will improve long-term survival. This includes those with left main coronary stenosis and those with multivessel CAD (especially involving the proximal LAD) along with left ventricular systolic dysfunction.\n\nClinical trials have shown that for patients with diabetes and multivessel CAD, coronary artery bypass graft (CABG) surgery is superior to percutaneous coronary intervention (PCI) with drug-eluting stents because of a lower rate of all-cause mortality and myocardial infarction with CABG. CABG in this population is also associated with lower rates of repeat revascularization than PCI.\n\n(Choice B) All patients with CAD, with or without coronary revascularization, should be treated with aggressive risk factor modification. This includes lifestyle and dietary changes to improve glycemic control, smoking cessation, and appropriate medical therapy with low-dose aspirin and adequate treatment for hypertension and hyperlipidemia. Ranolazine, an antianginal agent, is effective in reducing the frequency or severity of anginal symptoms in patients with refractory symptoms on conventional medical therapy with nitrates, beta blockers, and/or calcium channel blockers. It has not been shown to improve long-term survival in patients with CAD. It is also not recommended in patients with multivessel CAD that is amenable to percutaneous or surgical revascularization.\n\n(Choice C) Amlodipine is an effective antihypertensive agent in patients with CAD. Niacin is also occasionally used in patients with dyslipidemia with low HDL levels. However, there is no evidence that these agents improve long-term clinical outcomes in those with CAD.\n\n(Choices D and E) PCI with bare metal or drug-eluting stents is an excellent revascularization option for patients with refractory angina due to severe single- or two-vessel CAD not involving the proximal LAD. However, CABG is superior to PCI in patients with multivessel CAD (especially involving the proximal LAD) and left ventricular dysfunction, with lower rates of repeat revascularization and improved clinical outcomes.\n\nEducational objective:\nIn patients with diabetes and multivessel coronary artery disease, coronary artery bypass graft (CABG) surgery is preferred over percutaneous coronary intervention due to a lower rate of all-cause mortality and myocardial infarction with CABG.",
    "source": "Advanced - Cardiovascular Block 1- @USMLEWorldStep3.pdf"
  }
]