[
  {
    "id": "biostatistics_acm_001",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A study examines the role of different tumor markers or their combinations in diagnosing pancreatic cancer in patients with a solid lesion in the pancreatic head.\r\nThe following table is reported:\r\n\"Tumor marker\",\"Sensitivity (%)\",\"Specificity (%)\",\"Positive likelihood ratio\",\"Negative likelihood ratio\"\r\n\"Marker 1\",\"75.36\",\"58.71\",\"1.83\",\"0.42\"\r\n\"Marker 2\",\"58.64\",\"73.38\",\"2.20\",\"0.56\"\r\n\"Marker 3\",\"47.12\",\"91.67\",\"5.66\",\"0.58\"\r\n\"Parallel combination\",\"98.41\",\"54.19\",\"2.15\",\"0.03\"\r\n\"Serial combination\",\"36.71\",\"97.76\",\"16.39\",\"0.65\"\r\nBased on the study results, a patient with a solid lesion in the pancreatic head is most likely to be free of pancreatic cancer if which of the following tests or combinations is negative?",
    "choice_a": "Marker 1",
    "choice_b": "Marker 2",
    "choice_c": "Marker 3",
    "choice_d": "Parallel combination",
    "choice_e": "Serial combination",
    "correct_answer": "D",
    "explanation": "The negative predictive value of a test is the probability of not having a disease given a negative result on that test. In this case, it is the probability of a patient with a solid pancreatic head lesion not having pancreatic cancer given a negative marker or combination of markers (parallel combination means all markers are drawn simultaneously, whereas serial combination means they are drawn in a specific order). Calculating the predictive value of a test requires knowing the disease prevalence, which is not given in this question. However, other measures can help evaluate the utility of the diagnostic tests presented.\r\nThe likelihood ratio (LR) is an expression of sensitivity and specificity that can be used to assess the value of a diagnostic test indepedently of prevalence. The positive likelihood ratio (LR+) represents the value of a positive test result. It is the probability of a patient with the disease testing positive divided by the probability of a patient without the disease testing positive. The negative LR (LR-) represents the value of a negative test result. It is the probability of a patient with the disease testing negative divided by the probability of a patient without the disease testing negative. LR values can vary between 0 and infinity. In general, the smaller the LR, the less likely the disease presence (eg, $LR=5$ increases probability of disease by ~30% whereas $LR=2$ increases probability of disease by only ~15%); a $LR<1$ argues against the disease (eg, $LR=0.1$ decreases probability of disease by ~45%). In this case, the parallel combination has the lowest LR- ($LR-=0.03$); therefore, negative test results on the parallel combination gives the strongest evidence against the presence of pancreatic cancer. The LR can be used to calculate post-test probability (post-test odds = pre-test odds * LR).\r\nThe parallel combination test also has the highest sensitivity at 98.41%, meaning that patients with pancreatic cancer would have >98% probability of having a positive result on that test. Of all the tests and combinations listed, the parallel combination is the most likely to detect cases of pancreatic cancer and the least likely to give false negative results. Therefore, a negative result on this test is most helpful in ruling out pancreatic cancer in a patient with pancreatic head lesion. The very elevated sensitivity came at the cost of specificity, which was the lowest among the values reported.\r\nEducational objective:\r\nThe negative likelihood ratio (LR-) represents the value of a negative test result. The smaller the LR, the less likely it is that the disease is actually present. A negative result on a highly sensitive test helps to rule out a disease.\r\n\"Likelihood ratio\",\"Interpretation\"\r\n\">10\",\"Strong evidence to rule in the disease\"\r\n\"5-10\",\"Moderate evidence to rule in the disease\"\r\n\"2-5\",\"Weak evidence to rule in the disease\"\r\n\"0.5-2\",\"No evidence to rule in or rule out the disease\"\r\n\"0.2-0.5\",\"Weak evidence to rule out the disease\"\r\n\"0.1-0.2\",\"Moderate evidence to rule out the disease\"\r\n\"<0.1\",\"Strong evidence to rule out the disease\"",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_002",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A study examined the role of a humanized monoclonal antibody (mAb) that binds soluble forms of amyloid in treating Alzheimer disease. Patients were randomly assigned to a mAb injection or placebo group for 14 months. The outcomes included changes in cognitive performance assessed by different scores at week 72 compared to baseline. Higher scores indicate worse impairment. The following numbers were reported for patients with mild and moderate Alzheimer disease.\r\nCognitive performance scores in patients with mild to moderate Alzheimer disease *\r\n\"Variable\",\"Mean change from baseline to week 72 Placebo mAb\",\"Mild Alzheimer disease Mean difference (95% CI)\",\"P value+\",\"Mean change from baseline to week 72 Placebo mAb\",\"Moderate Alzheimer disease Mean difference (95% CI)\",\"P value+\",\"Q statistic test for heterogeneity P value+\"\r\n\"Score 1\",\"5.2 3.7\",\"-1.5 (-2.9-0.8)\",\"0.19\",\"10.3 11.1\",\"-0.8 (-2.8-1.4)\",\"0.45\",\"0.67\"\r\n\"Score 2\",\"4.6 6.2\",\"-1.6 (-3.6-1.2)\",\"0.42\",\"11.6 13.5\",\"-1.9 (-3.4-1.1)\",\"0.37\",\"0.86\"\r\n\"Score 3\",\"2.7 2.1\",\"-0.6 (-0.7-0.3)\",\"0.18\",\"2.9 3.6\",\"-0.7 (-0.9-0.2)\",\"0.49\",\"0.94\"\r\nCl = confidence interval; mAb = monoclonal antibody\r\n* In the placebo group, 351 patients had mild Alzheimer disease and 198 had moderate Alzheimer disease; in the mAb group, 329 patients had mild Alzheimer disease and 193 had moderate Alzheimer disease. Intention-to-treat analysis.\r\n+ The P value results from the comparison between the mAb group and the placebo group.\r\n+ The P value results from the comparison between patients with mild and moderate Alzheimer disease.\r\nWhich of the following is the most accurate interpretation of these study results?",
    "choice_a": "mAb therapy effectively slowed the process of mild and moderate Alzheimer disease",
    "choice_b": "mAb therapy was more effective in patients with mild Alzheimer disease",
    "choice_c": "mAb therapy was more effective in patients with moderate Alzheimer disease",
    "choice_d": "Patients with mild Alzheimer disease had a sharper decline in all cognitive performance scores",
    "choice_e": "There was no differential response to mAb therapy depending on Alzheimer disease severity",
    "correct_answer": "E",
    "explanation": "This trial compared cognitive performance scores with and without monoclonal antibody (mAb) therapy among patients in 2 disease categories (mild and moderate Alzheimer). These 2 categories were evaluated separately but presented in the same analysis, so a test for heterogeneity helps to exclude differences between them. Heterogeneity testing is particularly important when conducting a meta-analysis of several trials as it can provide insight about the combinability of multiple studies. A commonly used heterogeneity test is the Q statistic, which results in a corresponding P value (last column on the right in the table). In general, the null hypothesis ($H_0$) denotes that there is no difference between the groups studied. A small significant P value (<0.05) suggests that there is a difference and that $H_0$ should be rejected. However, large nonsignificant P value ($>0.05$) suggests that there is no difference between the groups studied so $H_0$ cannot be rejected. For the Q statistic in this example, $H_0$ represents no difference (no heterogeneity) in response to mAb therapy between patients with mild and moderate Alzheimer disease. The large P values obtained (0.67, 0.86, and 0.94) mean that $H_0$ cannot be rejected. In other words, there was no differential response to mAb therapy depending on disease severity. Another commonly used heterogeneity test is the I2 index (derived from the Q statistic). An I2 index = 0 represents no heterogeneity. I2 <25% is traditionally considered to represent low heterogeneity (<25% of the variability seen is due to true heterogeneity); the cutoffs for moderate and high heterogeneity are $I^2=50\\%$ and $I^2=75\\%$ respectively.\r\n(Choice A) The P values listed under \"Mild Alzheimer disease\" and \"Moderate Alzheimer disease\" relate to the differences in scores for patients treated with mAb versus those treated with placebo within each group. None of the P values are significant, so it is difficult to comment on the statistical significance of these score differences or on the effectiveness of mAb in slowing disease progression.\r\n(Choices B and C) Even though in most cases, the P values are smaller in the mild Alzheimer disease group than in the moderate Alzheimer disease group, this does not necessarily mean that the antibodies were more effective in the mild Alzheimer disease group, particularly because none of the P values are significant.\r\n(Choice D) Patients with mild Alzheimer disease did not have a sharper decline than patients with moderate Alzheimer disease for scores 2 (-1.6 in mild versus -1.9 in moderate Alzheimer disease) and 3 (-0.6 in mild versus -0.7 in moderate Alzheimer disease); only score 1 declined more (-1.5 in mild versus -0.8 in moderate Alzheimer disease). Furthermore, the confidence intervals all cross 0, so the results are not statistically significant.\r\nEducational objective:\r\nTests for heterogeneity are useful when performing a meta analysis or comparing different trials. Common tests for heterogeneity include the Q statistic (no heterogeneity if $P>0.05$) and the I2 index (25%, 50%, and 75% are traditionally considered cutoffs for low, moderate, and high heterogeneity, respectively).",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_003",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A study was designed to identify the variables associated with rebleeding in patients admitted to the hospital with upper gastrointestinal hemorrhage. A total of 2,488 patients were analyzed retrospectively by reviewing patient charts. A logistic regression analysis was conducted to evaluate potential predictors for rebleeding. The following variables were found to be associated with the outcome.\r\nVariables associated with rebleeding\r\n\"Variable\",\"Odds ratio\",\"95% confidence interval\"\r\n\"Sex (female)\",\"0.293\",\"0.112-0.832\"\r\n\"Helicobacter pylori infection\",\"0.371\",\"0.271-0.910\"\r\n\"Hematochezia\",\"2.467\",\"1.037-6.712\"\r\n\"Number of comorbidities\",\"2.500\",\"2.145-2.812\"\r\n\"Endoscopic therapy with epinephrine injection only\",\"6.846\",\"1.761-25.246\"\r\n\"Endoscopic therapy with thermal coagulation only\",\"6.706\",\"1.373-33.497\"\r\n\"Combination endoscopic therapy (epinephrine injection + thermal coagulation)\",\"2.453\",\"1.071-5.641\"\r\nNo missing data points regarding the type of endoscopic therapy received, comorbidities, or H pylori status were reported in the study. Which of the following is the best interpretation of the study results?",
    "choice_a": "Endoscopic therapy with epinephrine injection increases the odds of controling rebleeding",
    "choice_b": "The average number of comorbidities in the group of patients who rebleed is 2.5",
    "choice_c": "The odds of hematochezia are significantly higher among female patients",
    "choice_d": "The odds of rebleeding are significantly higher among patients who are H pylori-negative",
    "choice_e": "The odds ratio for rebleeding among patients who undergo combination endoscopic therapy represents strong evidence of causation",
    "correct_answer": "D",
    "explanation": "The odds ratio (OR) is a measure of association between an exposure and an outcome (eg, disease). It represents the odds that an outcome will occur in the presence of an exposure divided by the odds that the outcome will occur in the absence of that exposure.\r\nAn OR should be evaluated as follows:\r\n• $OR<1$ means that the exposure is associated with lower odds of the outcome\r\n• $OR=1$ means that the exposure is not associated with the outcome\r\n• $OR>1$ means that the exposure is associated with higher odds of the outcome\r\nIn this study, with regard to Helicobacter pylori infection, the OR of 0.371 represents the odds of rebleeding among patients who are H pylori-positive (ie, presence of H pylori infection) divided by the odds of rebleeding among patients who are H pylori-negative (ie, absence of H pylori infection). In this case, an $OR<1$ means that H pylori infection is associated with lower odds of rebleeding. The inverse of the OR (1/OR; $1/0.371=\\sim2.695$) represents the odds of rebleeding among patients who are H pylori-negative divided by the odds of rebleeding among patients who are H pylori-positive. Because $1/OR=2.695>1$ the odds of rebleeding are significantly higher among patients who are H pylori-negative than among patients who are H pylori-positive.\r\n(Choices A and E) Endoscopic therapy with epinephrine, thermal coagulation, or a combination of both was associated with higher odds of rebleeding (with combination therapy being associated with lower odds of rebleeding than either epinephrine or thermal coagulation alone), not with higher odds of controling bleeding. Regardless, statistical association does not imply causation, and the differences in odds of rebleeding may be related to the underlying pathology rather than the endoscopic intervention itself (eg, higher-risk lesions may benefit from different endoscopic therapies and be associated with different odds of rebleeding).\r\n(Choice B) The OR of 2.5 does not reflect the average number of comorbidities, rather, it means that a higher number of comorbidities is associated with higher odds of rebleeding.\r\n(Choice C) No information is provided regarding the distribution of hematochezia based on sex.\r\nEducational objective:\r\nAn odds ratio >1 means that the exposure is associated with higher odds of the outcome; an odds ratio <1 means that the exposure is associated with lower odds of the outcome.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_004",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "An 84-year-old man comes to the physician with persistent dyspnea despite being treated with optimal medical therapy for congestive heart failure with low left ventricular ejection fraction. A recently published randomized clinical trial compared an angiotensin-neprilysin inhibitor (ANi) to an angiotensin-converting enzyme inhibitor (ACEI) in patients who have heart failure with a reduced ejection fraction. The following results were reported:\r\n,\"ANi (N=5012)\",\"ACEi (N=5130)\",\"P-value\"\r\n,,\"n (%)\",\r\n\">1 hospitalization for congestive heart failure exacerbation within 90 days of trial initiation\",\"626 (12.5)\",\"826 (16.1)\",\"0.002\"\r\n\"Symptomatic hypotension (systolic blood pressure <90 mm Hg)\",\"205 (4.1)\",\"67 (1.3)\",\"<0.001\"\r\n\"Elevated creatinine (>2.5 mg/dL)\",\"145 (2.9)\",\"210 (4.1)\",\"0.006\"\r\n\"Elevated serum potassium (>5.5 mmol/L)\",\"842 (16.8)\",\"882 (17.2)\",\"0.21\"\r\n\"Cough\",\"506 (10.1)\",\"703 (13.7)\",\"<0.001\"\r\nWhich of the following would be of most concern when switching from an ACEi to an ANi?",
    "choice_a": "Dangerous hyperkalemia",
    "choice_b": "Increased hospitalizations for heart failure",
    "choice_c": "Uncomfortable cough",
    "choice_d": "Unsafe drop in blood pressure",
    "choice_e": "Worsening renal function",
    "correct_answer": "D",
    "explanation": "Neprilysin is an endopeptidase that degrades natriuretic peptide (B-type natriuretic peptide is elevated in heart failure) and other proteins. Patients randomized to the angiotensin-neprilysin inhibitor (ANi) group had a higher percentage of symptomatic hypotension than those randomized to the angiotensin-converting enzyme inhibitor (ACEI) group (4.1% versus 1.3%), and this difference was statistically significant (P-value <0.001).\r\n(Choice A) There was no statistically significant difference in hyperkalemia between the ANi and the ACEi groups ($P-value=0.21$).\r\n(Choice B) More patients within the ACEi group had >1 hospitalization for a heart failure exacerbation within 90 days of trial initiation.\r\n(Choices C and E) The prevalence of cough and renal failure was higher among patients randomized to ACEi both P-values were statistically significant.\r\nEducational objective:\r\nDifferences that are statistically significant have a P-value <0.05.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_005",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A randomized study assigned patients with sickle cell anemia and silent stroke to either monthly transfusion therapy (transfusion group of 110 patients) or usual care (observation group of 105 patients). An excerpt of the study results is provided below:\r\n\"Adverse event\",\"N\",\"Total adverse events\",\"Incidence rate ratio (95% confidence interval)\",\"P-value\"\r\n\"Acute chest syndrome\",,,,\"0.14 (0.05-0.31)\",\"<0.001\"\r\n\"Observation group\",\"105\",\"43\",,\r\n\"Transfusion group\",\"110\",\"7\",,\r\n\"Avascular hip necrosis (symptomatic)\",,,,\"0.27 (0.04-0.81)\",\"0.03\"\r\n\"Observation group\",\"105\",\"7\",,\r\n\"Transfusion group\",\"110\",\"2\",,\r\n\"Headache\",,,,\"0.69 (0.32-1.21)\",\"0.51\"\r\n\"Observation group\",\"105\",\"89\",,\r\n\"Transfusion group\",\"110\",\"79\",,\r\n\"Iron overload (ferritin > 1500 ng/mL)\",,,,\"16.41 (6.21-849.21)\",\"<0.001\"\r\n\"Observation group\",\"35\",\"38\",,\r\n\"Transfusion group\",\"91\",\"1370\",,\r\n\"Vasoocclusive crisis\",,,,\"0.42 (0.18-0.79)\",\"0.004\"\r\n\"Observation group\",\"105\",\"301\",,\r\n\"Transfusion group\",\"110\",\"143\",,\r\nWhich of the following adverse event estimates is most subject to selection bias?",
    "choice_a": "Acute chest syndrome",
    "choice_b": "Avascular hip necrosis",
    "choice_c": "Headache",
    "choice_d": "Iron overload",
    "choice_e": "Vasoocclusive pain",
    "correct_answer": "D",
    "explanation": "Common types of systematic errors in statistical studies\r\nSelection biases (Inappropriate selection or poor retention of study subjects):\r\n• Ascertainment (sampling) bias: Study population differs from target population due to nonrandom selection methods\r\n• Nonresponse bias: High nonresponse rate to surveys/questionnaires can cause errors if nonresponders differ in some way from responders\r\n• Berkson bias: Disease studied using only hospital-based patients may lead to results not applicable to target population\r\n• Prevalence (Neyman) bias: Exposures that happen long before disease assessment can cause study to miss diseased patients that die early or recover\r\n• Attrition bias: Significant loss of study participants may cause bias if those lost to follow-up differ significantly from remaining subjects\r\nObservational biases (Inaccurate measurement or classification of disease, exposure, or other variable):\r\n• Recall bias: Common in retrospective studies, subjects with negative outcomes are more likely to report certain exposures than control subjects\r\n• Observer bias: Observers misclassify data due to individual differences in interpretation or preconceived expectations regarding study\r\n• Reporting bias: Subjects over- or under-report exposure history due to perceived social stigmatization\r\n• Surveillance (detection) bias: Risk factor itself causes increased monitoring in exposed group relative to unexposed group which increases probability of identifying a disease\r\nSelection bias occurs when the sample is unrepresentative of the target population. This may lead to a different measure of association (eg, rate ratio, odds ratio) in the sample than in the target population. In this example, for 4 out of 5 adverse events studied (acute chest syndrome, avascular hip necrosis, headache, vasooclusive crisis), data are provided for all 105 participants in the observation group and 110 participants in the transfusion group. However, only 35 out of 105 participants (=33%) in the observation group had their ferritin level measured, so the results may be unrepresentative of the entire group. This makes it difficult to determine whether the calculated incidence rate ratio is reflective of the true difference between the observation and transfusion groups. One possible explanation for the low proportion compared to the transfusion group (91/110=83%) is that participants who received transfusions were more likely to have iron levels measured.\r\n(Choices A, B, C, and E) The entire sample (patients in both observation [N=105] and transfusion groups [N=110]) was analyzed for the other adverse effects (acute chest syndrome, avascular necrosis, headache, and vasoocclusive crisis), this minimized the risk of selection bias.\r\nEducational objective:\r\nSelection bias occurs when the sample is unrepresentative of the target population and may lead to incorrect measures of association.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_006",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A randomized, parallel-group, controlled clinical trial evaluates the effectiveness of an anti-inflammatory intervention as treatment for neuropathic pain following spinal cord injury. Participants with varying levels and severities of spinal cord injury are randomly assigned to either a 24-week, anti-inflammatory diet treatment group or a control group. Primary outcomes consist of changes in pain scores and markers of inflammation at 6 months. Preliminary analyses reveal a significant reduction in pain scores in the treatment group from baseline to 6 months (p=0.03). There was a significant reduction in pain scores among nonobese subjects (p=0.01) and a nonsignificant increase in pain scores among obese subjects (p=0.06). Which of the following is the best explanation for these differences in findings between obese and nonobese subjects?",
    "choice_a": "Confounding bias",
    "choice_b": "Effect modification",
    "choice_c": "Hawthorne effect",
    "choice_d": "Randomization failure",
    "choice_e": "Selection bias",
    "correct_answer": "B",
    "explanation": "Effect modification (interaction bias) occurs when an extraneous variable (effect modifier) changes the direction or strength of the effect that the independent variable (exposure or treatment) has on the dependent variable (outcome). For instance, aspirin use is associated with Reye syndrome in children but not adults; therefore, age (effect modifier) modifies the effect of aspirin (exposure) on Reye syndrome development (outcome). Stratification based on the modifier (eg, analyzing the data by age group) can help detect effect modification as it typically shows different effects in each stratum (eg, children, adults); separate measures of effect should be reported for each stratum. In this case, the treatment group (ie, 24-week anti-inflammatory diet) had a significant reduction in pain scores from baseline to 6 months compared to the control group ($p<0.03$). However, the effect was significant only among nonobese (nonsignificant among obese subjects), and went in opposite directions depending on weight status (reduced pain among nonobese versus increased pain among obese). Therefore, weight status is an effect modifier that changes the effect of the intervention diet on pain scores. A stratified analysis by weight group (nonobese and obese) helps to estimate the real effect.\r\n(Choices A and D) Effect modification is sometimes confused with confounding bias, which occurs when an extraneous variable (ie, confounder) associated with both the exposure and the outcome obscures the association between the exposure and the outcome. With confounding (unlike with effect modification), no change in the strength or direction of the effect is typically seen with stratification. Randomization usually helps remove confounder effects. If successful randomization has occurred, characteristics such as obesity, age, and sex should be similarly distributed between the treatment and the control groups, and confounding should be minimized. Because obesity was found to be an effect modifier and not a confounder, neither confounding bias nor randomization failure explain the differences seen between obese and nonobese groups.\r\n(Choice C) The Hawthorne (observer) effect is the tendency of study subjects to change their behavior as a result of their awareness of being studied. However, it is commonly seen in studies concerning behavioral outcomes or outcomes that can be influenced by behavioral changes.\r\n(Choice E) Selection bias can occur with inappropriate (random or nonrandom) selection methods or through selective attrition of the study participants. Randomization in a clinical trial reduces selection bias.\r\nEducational objective:\r\nEffect modification occurs when the magnitude or direction of the effect of the independent variable on the dependent variable (outcome) varies depending on the level of a third variable (effect modifier). Separate (stratified) analyses should be conducted for each level of the effect modifier.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_007",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A study evaluated the accuracy of using midstream urine (MSU) culture to identify the causative pathogen in patients with uncomplicated cystitis. Women ages 18-49 with symptoms of cystitis provided MSU specimens for culture. The investigators also collected urine by means of a urethral catheter for culture, which served as the gold standard for confirming the causative pathogen. Bacterial growth was determined in colony forming units per mL. Correlation coefficients (r) were calculated for several organisms by comparing the logarithm of bacterial growth in urethral catheter specimens to that of bacterial growth in MSU specimens. The following plots were reported:\r\n[Image: Scatter plots for Escherichia coli (r=0.927), Group B Streptococci (r=0.427), Enterococci (r=0.341), Other Gram Negative Rods (r=0.810), Klebsiella pneumoniae (r=0.983), Staphylococcus saprophyticus (r=0.999)]\r\nWhich of the following organisms identified by MSU most likely has the lowest positive predictive value in revealing the causative pathogen for cystitis?",
    "choice_a": "Enterococci",
    "choice_b": "Escherichia coli",
    "choice_c": "Group B streptococci",
    "choice_d": "Klebsiella pneumoniae",
    "choice_e": "Staphylococcus saprophyticus",
    "correct_answer": "A",
    "explanation": "The plots represent the correlation between bacterial counts in urethral catheter samples and midstream urine (MSU) samples. The units used for the x-axis and y-axis are in the base-10 logarithmic scale ($log_{10}$); therefore, the $log_{10}$ quantities 1-5 represent $10^1-10^5$ colony forming units (CFU) per mL. The number of squares on each plot reflects the number of specimens in which organism growth was detected. For example, the Escherichia coli plot has the largest number of squares, reflecting this organism's predominance among the samples tested. The coordinates of the squares reflect the different growth patterns in the urethral catheter and MSU samples. For example, enterococci and group B streptococci mostly grew in the MSU specimens but not in the urethral catheter specimens (gold standard to diagnose cystitis), suggesting that these organisms are rarely associated with cystitis. The correlation coefficients for these organisms were also small (eg, 0.341 for enterococci).\r\nCorrelation coefficient (r) values range from -1 to +1. The operational signs indicate a positive or negative direction of association between 2 variables; the null value is 0 and denotes no association. The closer the r value is to its margins [-1, +1] the stronger the association. In this scenario, the lowest r value (0.341) was for enterococci. This means that a positive result for enterococcal growth based on MSU culture is only weakly associated with a positive result based on urethral culture (gold standard). Therefore, the positive result for enterococci on MSU has a low predictive value for cystitis.\r\n(Choices B, C, D, and E) All of these have higher (more predictive) positive r values than enterococci.\r\nDetermining the positive predictive value by counting the points on the graphs is suboptimal because no specific cutoff for bacterial growth (CFU/mL) is provided to define cystitis and because each point could represent $\\ge1$ specimen.\r\nEducational objective:\r\nCorrelation coefficient (r) values indicate a positive or negative direction of association between 2 variables. The closer the r value is to its margins [-1, +1], the stronger the association.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_008",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "Hypothesis: Statin therapy has been associated with an increased risk of new-onset diabetes mellitus. Is intensive-dose statin therapy associated with a higher risk of incident diabetes compared to moderate-dose statin therapy?\r\nTitle: Risk of new-onset diabetes mellitus with intensive-dose versus moderate-dose statin therapy\r\nMethods:\r\nDesign: Pooled meta-analysis of 5 randomized controlled trials\r\nPatients: 32752 participants without diabetes at baseline, followed for >1 year\r\nIntervention: Intensive-dose or moderate-dose statin therapy\r\nOutcome measures: New-onset diabetes, major cardiovascular events\r\nResults:\r\nThe following data were reported for the intensive as compared to the moderate therapy groups\r\n,\"Incident diabetes\",\"Major cardiovascular events\"\r\n\"Intensive statin therapy group\",\"18.9 cases per 1000 patient-years\",\"44.5 events per 1000 patient-years\"\r\n\"Moderate statin therapy group\",\"16.9 cases per 1000 patient-years\",\"51.6 events per 1000 patient-years\"\r\nThe differences were statistically significant. Out of the 32752 participants: 16408 received intensive-dose statin therapy and 16344 received moderate-dose statin therapy. Major cardiovascular events occurred in 3134 patients in the intensive therapy group and 3550 in the moderate therapy group.\r\nA 59-year-old man comes to the office for follow-up. He has a history of hypertension for which he takes 2 antihypertensive agents. The patient has no other cardiovascular problems and does not smoke. On examination, his blood pressure is 145/90 mm Hg and BMI is $25.4 kg/m^2$. The remainder of the examination is unremarkable. Laboratory studies show elevated fasting lipid levels, including LDL cholesterol. His 10-year risk of cardiovascular events is calculated as 10%, and a discussion regarding moderate or intensive statin therapy is initiated. The patient has read that statins may cause diabetes and asks if there is an even more increased risk with intensive compared to moderate statin therapy.\r\nBased on the abstract results with regard to incident diabetes, what is the approximate number needed to harm over 1 year for intensive compared to moderate statin therapy?",
    "choice_a": "2",
    "choice_b": "7",
    "choice_c": "50",
    "choice_d": "140",
    "choice_e": "500",
    "correct_answer": "E",
    "explanation": "If exposure is associated with increased risk of disease, the number needed to harm (NNH) can indicate how many patients need to be exposed before a harmful event occurs in 1 patient. NNH is the inverse of the absolute risk increase (ARI), which is the difference in incidence rate between the exposed and non-exposed groups. ARI is sometimes referred to as attributable risk.\r\nIn this meta-analysis, intensive statin therapy corresponds to the exposed group and moderate statin therapy corresponds to the non-exposed group. The incidence of diabetes was increased in the exposed group (risk of 18.9 cases per 1000 exposed patient-years) compared to the non-exposed group (risk of 16.9 cases per 1000 non-exposed patient-years).\r\n$ARI=(18.9/1000-16.9/1000)=2/1000=0.002$ per person per year\r\nTherefore, $NNH=1/ARI=1/0.002=500$\r\nThis means that 500 patients would need to receive intensive statin therapy for a year before 1 patient develops diabetes (would not have occurred on moderate statin therapy). If exposure is beneficial (decreased risk of disease), the number needed to treat (NNT) determines the number of patients who need to be exposed (eg, treated with an intervention) to prevent 1 bad outcome. NNT is the inverse of the absolute risk reduction (ARR). For instance, intensive statin therapy was associated with a decreased risk of major cardiovascular events (44.5 versus 51.6 per 1000 patient-years), so $ARR=(51.6/1000-44.5/1000)=7.1/1000=0.0071$ Therefore, $NNT=1/0.0071 \\approx 140$ (Choice D).\r\nData are not always presented in the standard 2x2 format, so care should be taken when applying memorized formulae. In addition, using the values listed under the table (1449 out of 16408 and 1300 out of 16344) will lead to the incorrect answer as these values refer to the overall number of cases over the course of the entire trial (which lasted >1 year), whereas the question asks for NNH over 1 year.\r\n(Choices A and B) In this case, 2/1000 and 7/1000 (not 2 and 7) represent the ARI and ARR, respectively.\r\nEducational objective:\r\nThe number needed to harm (NNH) is a measure that indicates how many patients need to be exposed to a particular risk factor over a specific period before a harmful event occurs in 1 patient. NNH is the inverse of the absolute risk increase (or attributable risk), which is the difference in incidence rate between exposed and non-exposed patients.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_009",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "Hypothesis: Statin therapy has been associated with an increased risk of new-onset diabetes mellitus. Is intensive-dose statin therapy associated with a higher risk of incident diabetes compared to moderate-dose statin therapy?\r\nTitle: Risk of new-onset diabetes mellitus with intensive-dose versus moderate-dose statin therapy\r\nMethods:\r\nDesign: Pooled meta-analysis of 5 randomized controlled trials\r\nPatients: 32752 participants without diabetes at baseline, followed for >1 year\r\nIntervention: Intensive-dose or moderate-dose statin therapy\r\nOutcome measures: New-onset diabetes, major cardiovascular events\r\nResults:\r\nThe following data were reported for the intensive as compared to the moderate therapy groups\r\n,\"Incident diabetes\",\"Major cardiovascular events\"\r\n\"Intensive statin therapy group\",\"18.9 cases per 1000 patient-years\",\"44.5 events per 1000 patient-years\"\r\n\"Moderate statin therapy group\",\"16.9 cases per 1000 patient-years\",\"51.6 events per 1000 patient-years\"\r\nThe differences were statistically significant. Out of the 32752 participants: 16408 received intensive-dose statin therapy and 16344 received moderate-dose statin therapy. Major cardiovascular events occurred in 3134 patients in the intensive therapy group and 3550 in the moderate therapy group.\r\nBased on the abstract, what was the pooled odds ratio of major cardiovascular events among participants on intensive compared to moderate statin therapy?",
    "choice_a": "0.33",
    "choice_b": "0.76",
    "choice_c": "0.85",
    "choice_d": "1.12",
    "choice_e": "1.30",
    "correct_answer": "C",
    "explanation": "The odds ratio (OR) is a measure of association between an exposure and an outcome. In this case, it represents the odds that an outcome (eg, major cardiovascular event) will occur in the presence of a particular exposure (eg, intensive statin therapy) compared to the odds of that outcome in a control group. An $OR>1$ means that the exposure is associated with higher odds of the outcome and an $OR<1$ means that the exposure is associated with lower odds of the outcome. This meta-analysis provides a pooled OR based on the results of the 5 trials.\r\nAccording to the abstract, and using the standard format for a 2x2 contingency table, $3134 (=a)$ out of $16408 (=a+b)$ subjects experienced major cardiovascular events in the intensive statin therapy group compared to $3550 (=c)$ out of $16344 (=c+d)$ in the moderate statin therapy group.\r\n\"Group\",\"Experienced major cardiovascular event\",\"Did not experience major cardiovascular event\",\"Total\"\r\n\"Intensive statin therapy\",\"a = 3134\",\"b = 16408 - 3134 = 13274\",\"a + b = 16408\"\r\n\"Moderate statin therapy\",\"c = 3550\",\"d = 16344 - 3550 = 12794\",\"c + d = 16344\"\r\n\"Total\",\"a + c = 6684\",\"b + d = 26068\",\"32752\"\r\nThe odds ratio (OR), pooled from all 5 studies, is given by: $OR = ad/bc = (3134 \\times 12794) / (13274 \\times 3550) = 0.85$, indicating a lower odds of major cardiovascular events with intensive compared to moderate statin therapy.\r\n(Choice E) The value 1.30 is obtained by multiplying the numbers in the table shown in the abstract: $(18.9 \\times 51.6) / (16.9 \\times 44.5)$. This table is not in the correct format.\r\nEducational objective:\r\nThe odds ratio (OR) is a measure of association between an exposure and an outcome. It can be calculated based on a 2 x 2 contingency table, using the formula $OR = ad/bc$.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_010",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 69-year-old man with chronic kidney disease comes to the office to discuss options for dialysis. The patient wishes to choose the dialysis modality that will allow him to live the longest. The following Kaplan-Meier survival curve is obtained from a prospective study on the survival of 1800 patients who began dialysis with either hemodialysis (HD) or peritoneal dialysis (PD) and were followed for 5 years. The event of interest was death while on dialysis.\r\nKaplan Meier survival plot\r\n[Image: Kaplan-Meier curve showing PD (green) above HD (yellow). P = 0.45]\r\n\"Time (years since start of dialysis)\",\"0\",\"1\",\"2\",\"3\",\"4\",\"5\"\r\n\"Number of patients 'at risk'\",,,,,\r\n\"PD\",\"342\",\"280\",\"233\",\"128\",\"67\",\r\n\"HD\",\"1306\",\"976\",\"762\",\"454\",\"241\",\r\nBased on the findings of this study, which dialysis option offers improved survival?",
    "choice_a": "HD, as median survival was greater than for PD",
    "choice_b": "HD, as survival was greater at end of study than for PD",
    "choice_c": "HD or PD, as survival was not significantly different",
    "choice_d": "PD, as median survival was greater than for HD",
    "choice_e": "PD, as survival was greater at end of study than for HD",
    "correct_answer": "C",
    "explanation": "When subjects in a clinical trial or observational study are followed over time, they can experience only one of several possible events:\r\n• Death or other primary event of interest (eg, hospitalization, development of cancer)\r\n• Completion of the study\r\n• Loss to follow-up\r\nDifferent subjects experience these events at different points in time; therefore, comparing event rates at the end of the study is not appropriate, especially when comparing survival rates in groups using different drugs or with different disease states. More helpful information is obtained if the rate at which these events occur during the entire study period can be compared. This comparison is commonly done by survival analysis, often represented graphically by a Kaplan-Meier survival curve. The Kaplan-Meier survival curve depicts the probability of survival at various time points during the study. This probability is calculated based on the proportion of subjects who are alive (or \"at risk\" for an event of interest) at a given time. The x-axis denotes time, and the y-axis denotes cumulative event-free survival starting from 1.0 (ie, 100% of patients are alive without having experienced any event) at the beginning of the study. As the study progresses, events occur and the proportion of subjects who are still alive or \"at risk\" for an event of interest decreases, demonstrated as vertical downward dips in the curve. Depending on the number of study groups, $\\ge2$ curves can be displayed simultaneously and compared. Survival of different groups can be compared by the log-rank test, which reports a p-value. In most studies, a p-value <0.05 is considered significant. A simplified explanation is that there is a <5% probability that the event-free survivals are different due to chance. The p-value reported in this study ($p=0.45$) was not statistically significant as it was >0.05, therefore, survival on HD or PD was found to be not significantly different.\r\n(Choices A, B, D, and E) Median survival (follow-up time when 50% of subjects are alive) is determined by drawing a horizontal line at 0.5 on the y-axis and looking at the corresponding time point on the x-axis. In this study, median survival on HD was ~3.0 years and median survival on PD was ~3.6 years. Similarly, survival at arbitrary time points (eg, end of study) can be determined by the curves. Although survival on PD appeared to be more than on HD at all these time points, the p-value was not significant, therefore, patients on PD were not significantly more likely to live longer than those on HD.\r\nEducational objective:\r\nThe Kaplan-Meier survival curve is a commonly used graphical representation of the probabilities that subjects survive in a study without an event. The event-free survival rates of $\\ge2$ study groups can be compared; they are statistically different only if the p-value is <0.05.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_011",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A 35-year-old man comes to the emergency department due to 2 days of fever and dysuria. He has a history of paraplegia as the result of a gunshot wound 5 years ago that required surgical intervention. He takes narcotics for chronic pain that has developed since the surgery. The patient is bedbound and practices intermittent urinary self-catheterization. He has had multiple admissions for recurrent urinary tract infections; urine cultures have grown multidrug-resistant organisms requiring intravenous antibiotic therapy in the past. He most recently completed a course of antibiotics a week ago. The patient says, \"It feels like my urinary tract infection is coming back-I was just done with antibiotics and was hoping I would get a break!\" He reports that every 5 years of life in his current state of health are equivalent to 1 year of life in full health. Which of the following measures is best described by this value?",
    "choice_a": "Disability-adjusted life years",
    "choice_b": "Quality-adjusted life years",
    "choice_c": "Standard disability weight",
    "choice_d": "Years lived with disability",
    "choice_e": "Years of life lost",
    "correct_answer": "B",
    "explanation": "For this patient, 5 years in his current state are equivalent to 1 year of full health; therefore, his time-trade-off ($TTO$) = 1/5 = 0.20. TTOs are used to calculate quality-adjusted life years (QALYs). QALYs, along with disability-adjusted life years (DALYs), are burden of disease measures evaluating the impact of specific diagnoses/treatments on individual patients or the economic impact of health interventions on populations.\r\nFor individual QALY calculations, full health has a weight of 1, whereas a disability has a TTO between 0 and 1, depending on the individual. For a patient with a disability who estimates that 5 \"limited years\" (with the disability) are equivalent to 1 \"healthy year,\" each \"limited year\" contributes a $TTO=1/5=0.20$ years to QALYs. A patient who had full health until age 30 ($weight=1$), then developed a disability with a $TTO=0.20$, will have the following QALYs at age 35 (ie, given $35-30=5$ years with the disability):\r\n$QALYs=(30 \\times 1)+(5 \\times 0.20)=30+1=31$\r\nQALYs should be maximized through interventions that increase TTO.\r\nDALYs represent a loss to be minimized. They reflect the difference between the current situation and an ideal situation (living in perfect health up to the standard life expectancy age) and are commonly used in global burden of disease comparisons (Choice A).\r\n$DALYs=YLL+YLD$\r\nWhere:\r\n• $YLL=$ years of life lost due to premature mortality (Choice E). For individuals, YLL is based on standard tables of life expectancy based on age.\r\n• $YLD=$ years lived with disability, with a standard disability weight (DW) for the disability (which, unlike TTO, is based on averages of populations rather than on individual preferences) (Choices C and D).\r\nEducational objective:\r\nQuality-adjusted life years (QALYs) and disability-adjusted life years (DALYs) measure burden of disease for individuals or populations. Time-trade-off is commonly used for QALY calculations; years of life lost and years lived with disability are used for DALY calculations.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_012",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A new, randomized, placebo-controlled trial studied the association between treatment with 250,000 IU cholecalciferol for 4 months following hip fracture surgery and incidence of falls. Results showed that at month 4 after surgery, 7 (6.3%) patients in the treatment group reported $\\ge1$ falls compared to 23 (21.2%) in the placebo group ($p<0.01$); there was a relative risk reduction of 70.3%. Treatment with 250,000 IU cholecalciferol for 4 months costs $100 per patient. Based on this information, how much would it cost to treat enough patients after hip surgery with 250,000 IU cholecalciferol to prevent $\\ge1$ falls during the first 4 months of therapy?",
    "choice_a": "$142",
    "choice_b": "$300",
    "choice_c": "$671",
    "choice_d": "$1430",
    "choice_e": "$6300",
    "correct_answer": "C",
    "explanation": "Common measures of therapeutic efficacy\r\n\"Term\",\"Definition\",\"Calculation\"\r\n\"Absolute risk reduction (ARR)\",\"Percentage indicating the actual difference in event rate between control & treatment groups\",\"ARR = control rate - treatment rate\"\r\n\"Relative risk reduction (RRR)\",\"Percentage indicating relative reduction in the treatment event rate compared to the control group\",\"RRR = ARR / control rate\"\r\n\"Relative risk (RR)\",\"Ratio of the probability of an event occurring in the treatment group compared to the control group\",\"RR = treatment rate / control rate\"\r\n\"Number needed to treat (NNT)\",\"Number of individuals that need to be treated to prevent a negative outcome in 1 patient\",\"NNT = 1 / ARR\"\r\nThe number needed to treat (NNT) represents the number of patients who need to be treated (eg, with 250,000 IU cholecalciferol) to prevent 1 bad outcome (eg, $\\ge1$ falls), assuming the treatment is beneficial. NNT is the inverse of the absolute risk reduction (ARR), or 1/ARR.\r\nARR is calculated by subtracting the experimental event rate (EER) from the control event rate (CER):\r\n$ARR = CER - EER$\r\nIn this case, CER is the proportion of patients who reported $\\ge1$ falls in the placebo (control) group (ie, 21.2%), and EER is the proportion of patients who reported $\\ge1$ falls in the 250,000 IU cholecalciferol treatment (experimental) group (ie, 6.3%). Therefore, ARR can be calculated as follows:\r\n$ARR = (21.2/100) - (6.3/100) = (14.9/100) = 0.149$\r\nUsing this information, NNT is estimated by calculating the inverse of ARR:\r\n$NNT = (1 / ARR) = (1 / 0.149) = 6.71$\r\nTherefore, 6.71 patients with the condition would have to be treated to prevent 1 bad outcome. The cost would be:\r\n$6.71 patients \\times $100/patient = $671$\r\n(Choice A) NNT is the inverse of ARR, not the inverse of the relative risk reduction ($1/0.703 = 1.42$).\r\nEducational objective:\r\nThe number needed to treat (NNT) is the number of patients who need to be treated to prevent an adverse event. It is a useful measure for evaluating the efficacy of a given therapy. NNT is calculated as the inverse of the absolute risk reduction (ARR); in other words, $NNT = 1 / ARR$.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_013",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A study evaluated predictors of adverse outcomes in geriatric patients admitted to the hospital with a hip fracture requiring surgery. The study compared an old multidimensional score (Model 1) with a new classification system (Model 2). The following results were reported:\r\n[Image: ROC curves for Mortality (Model 1 AUC: 0.782, Model 2 AUC: 0.632, P=0.02), Discharge to rehabilitation facility (Model 1 AUC: 0.821, Model 2 AUC: 0.582, P=0.01), and Postoperative myocardial infarction or stroke (Model 1 AUC: 0.718, Model 2 AUC: 0.567, P=0.03)]\r\nWhich of the following is the best statement about the study results?",
    "choice_a": "Model 1 is less sensitive than Model 2 in predicting discharge to rehabilitation facility",
    "choice_b": "Model 1 outperforms Model 2 for mortality, discharge to rehabilitation facility, and postoperative myocardial infarction or stroke",
    "choice_c": "Model 1 outperforms Model 2 for mortality only",
    "choice_d": "Model 1 predicts postoperative myocardial infarction or stroke more accurately than mortality",
    "choice_e": "Model 2 should not be used in clinical practice",
    "correct_answer": "B",
    "explanation": "A receiver-operating characteristic (ROC) curve for a given diagnostic test plots sensitivity on the y-axis and (1 - specificity), or equivalently (100% - specificity), on the x-axis. It can help determine the best cutoff point to use depending on the optimal desired parameters for sensitivity and specificity. For example, for the multidimensional score models described in the scenario, the ROC curves can help determine which score to use as cutoff for a high score (eg, with higher risk of mortality, discharge to rehabilitation facility, or postoperative myocardial infarction or stroke) or a low score, if desired.\r\nIn addition, the area under the curve (AUC) of a ROC curve is a reflection of diagnostic accuracy. A larger AUC means better discrimination and higher diagnostic accuracy. In general, an ideal test would have an AUC of 1.0 (100% sensitivity and specificity) and a nondiscriminating test would have an AUC of 0.5 (similar to a coin toss). Model 1 has a higher AUC than Model 2 in terms of predicting mortality, discharge to rehabilitation facility, and postoperative myocardial infarction or stroke; AUC differences are also statistically significant (P <0.05) in all 3 cases. Therefore, Model 1 outperforms Model 2 in all 3 areas.\r\n(Choice A) The sensitivity and specificity of the models depend on the cutoff points used.\r\n(Choice C) Model 1 outperforms Model 2 in predicting mortality, discharge to rehabilitation facility, and postoperative myocardial infarction or stroke.\r\n(Choice D) The AUC of Model 1 is higher for mortality than for postoperative myocardial infarction or stroke, so Model 1 predicts mortality more accurately than postoperative myocardial infarction or stroke.\r\n(Choice E) There may be instances where the Model 2 classification system is useful in clinical practice (eg, if its components are easier to obtain than those of Model 1).\r\nEducational objective:\r\nThe area under the curve (AUC) of a receiver-operating characteristic (ROC) curve is a reflection of diagnostic accuracy. A larger AUC means better discrimination and higher diagnostic accuracy.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  },
  {
    "id": "biostatistics_acm_014",
    "system": "Biostatistics & Epidemiology",
    "subject": "Advanced Clinical Medicine",
    "stem": "A randomized controlled study of chronically sleep-deprived (<6.5 hr per night), morbidly obese subjects examined whether sleep extension is associated with weight loss and metabolic and endocrinal improvements. The intervention consisted of education regarding sleep hygiene and a gradual change to subjects' bedtimes to earlier in the evening. Participants underwent general screening at visit 1 with collection of baseline parameters; then, 2 months later, at visit 2, subjects were randomized into either an intervention group or a comparison group. Researchers evaluated several parameters, including sleep duration, sleepiness, and sleep quality. The following results were reported:\r\n,\"Visit 1 (screening)\",\"Visit 2 (randomization into intervention vs comparison groups)\",\"Comparison group (N=50)\",\"Visit 3 (5 weeks after randomization) Intervention group (N=66)\"\r\n\"Sleep duration (min/night)\",\"357.46±51.2\",\"388.16±48.6*\",\"353.7±49.7\",\"362.0±53.2\"\r\n\"Daytime sleepiness (ESS)1\",\"8.96±4.6\",\"8.36±4.5*\",\"9.0±4.6\",\"8.6±4.7\"\r\n\"Subjective sleep quality (PSQI)2\",\"9.16±3.2\",\"8.26±3.0*\",\"8.9±3.2\",\"8.5±3.3\"\r\nNote: Data is reported as mean ± standard deviation.\r\n* p<0.05\r\n1 ESS (Epworth Sleepiness Scale [daytime sleepiness]) $\\ge10$ = sleepy\r\n2 PSQI (Pittsburgh Sleep Quality Index [subjective sleep quality]) $\\ge5$ = abnormal.\r\nThere were statistically significant differences in all 3 parameters between visit 1 and visit 2. Which of the following is the best explanation for the difference between findings at the screening and randomization visits?",
    "choice_a": "Allocation bias",
    "choice_b": "Confounding bias",
    "choice_c": "Hawthorne effect",
    "choice_d": "Placebo effect",
    "choice_e": "Selection bias",
    "correct_answer": "C",
    "explanation": "The Hawthorne effect is related to subjects' participation in research, the subsequent awareness of being observed, and the possible impact on behavior. This type of bias is commonly seen in studies that concern behavioral outcomes. In this case, subjects reported substantial improvements in sleep in the 2-month period between the screening and randomization phases, when they were candidates for participation but not yet subject to the actual intervention being implemented. It is likely that their awareness of their potential for participation (prior to any intervention) had a significant effect on the outcome under study, a characteristic of the Hawthorne effect.\r\nAlterations in behavior due to participation (or potential for participation) awareness may significantly impact how subjects report on the outcomes under study. In most instances, an overestimation of the effect of the intervention will be reported, which is a threat to the internal validity of the study. To minimize the Hawthorne effect, subjects can be kept unaware they are being studied; however, at times this is not reasonably possible.\r\n(Choice A) Allocation bias can result from the way subjects are assigned to the treatment and control groups. It may occur when subjects are nonrandomly assigned to the treatment groups of a clinical trial. Allocation bias is different from selection bias.\r\n(Choice B) A confounder is an extraneous variable that is independently associated with both the dependent variable and the independent variable. Confounding bias occurs when the study design or analysis does not control for the potential effect these confounders may have.\r\n(Choice D) The placebo effect is a perceived outcome resulting from a participant's personal expectations rather than from the treatment itself. In this case, the design did not include a placebo treatment group prior to randomization.\r\n(Choice E) Selection bias can occur with inappropriate selection methods or through differential attrition rates. This would not be a likely source here as subjects were candidates for participation.\r\nEducational objective:\r\nThe Hawthorne effect, which describes the impact on behavior from awareness of being observed, may result in an overestimation of an outcome not only among participants, but also among candidates for participation. Such overestimation of the effect of the intervention poses a threat to the internal validity of any study.",
    "source": "Advanced - Biostatistics- @USMLEWorldStep3.pdf"
  }
]