[
{
"id": "cardio_001",
"system": "Cardiovascular System",
"stem": "An 82-year-old woman is brought to the clinic by her caregiver for a new leg wound. The patient has had chronic lower-extremity swelling for many years. Over the past 2 weeks, she developed a small, shallow opening on her right anterior lower leg that has slowly expanded. She has no fever, chills, warmth, or purulent drainage. The patient says that her legs often feel tired and heavy, especially when sitting for extended periods, but they improve with walking.\n\nHer past medical history includes hypertension, degenerative joint disease, and obesity.\n\nVital sign signs normal. Cardiovascular examination shows normal rate and rhythm and no murmurs. Estimated jugular venous pressure is normal. The patient's lungs are clear. Lower extremities have symmetric edema bilaterally; the wound is shown in the image below. The feet are warm with palpable dorsalis pedis pulses bilaterally.\n\nIn addition to wound dressing recommendations, what is the best next step in management of this patient?",
"choice_a": "Ankle brachial index",
"choice_b": "Compression garments and aspirin",
"choice_c": "Furosemide",
"choice_d": "Oral antibiotic therapy",
"choice_e": "Zinc sulfate",
"correct_answer": "B",
"explanation": "This patient has lower-extremity ulceration from chronic venous insufficiency (CVI). Symptoms of CVI are variable, but characteristic findings include aching or heavy pain in the legs, visible varicosities, chronic edema, and brawny discoloration of the lower legs. Risk factors include smoking, prior thromboembolic disease, older age, family history, and obesity. Prior ulceration is a strong predictor of future recurrence. First-line treatment for CVI should include lower-extremity elevation (at least 20-30 minutes 3 or 4 times a day), leg exercise, weight loss, and continuous compressive therapy. Prescription graduated compression stockings increase healing, with improvement rates up to 97% in compliant patients. This is thought to be due to improved venous hemodynamics, optimized fibrinolysis, and reduction of inflammation. Contraindications include moderate-to-severe peripheral arterial disease or active cellulitis. Aspirin therapy also has been shown to accelerate the ulcer healing process and is recommended.\n\n(Choice A) Ankle brachial indices are an effective screening assessment for patients with symptomatic peripheral arterial disease (PAD). Features suggesting PAD include nonpalpable pulses, claudication, or rest pain. This patient's improvement with walking is not consistent with PAD.\n\n(Choice C) Furosemide and other diuretics have no role in the treatment of lower-extremity edema due to CVI. A thorough physical examination should be performed to exclude other potential etiologies such as heart failure, for which this treatment would be indicated.\n\n(Choice D) This patient's skin changes are most consistent with chronic venous stasis dermatitis with ulceration rather than an acute cellulitis or wound infection. As a result, treatment with either oral or topical antibiotics is not warranted. Findings suggesting superimposed cellulitis include a sudden increase in pain or erythema, fever, leukocytosis, or significant warmth on palpation.\n\n(Choice E) Supplementation with oral zinc sulfate has been proposed for the treatment of arterial and venous lower-extremity ulcers, but trials to date have found no significant beneficial effect.\n\nEducational objective:\nManagement of chronic venous insufficiency (with or without ulceration) consists of lower-extremity elevation, leg exercise, weight loss, and continuous compressive therapy. Aspirin accelerates ulcer healing. Topical antibiotics, zinc sulfate, and hyperbaric oxygen therapy are not effective.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_002",
"system": "Cardiovascular System",
"stem": "A 56-year-old woman who is post-operative day #1 after a laparoscopic cholecystectomy complains of chest discomfort. The patient reports that in the early hours of the morning, she was awakened from sleep with nausea, one episode of vomiting, and persistent burning in her chest. Her only medical history includes hypertension, which has been well-controlled with medication. Her other current medications include ondansetron, acetaminophen, and hydrocodone.\n\nHer temperature is 37.9 C (100.2,F), blood pressure is 92/60 mm Hg, heart rate is 90/min, and respirations are 18/min. Her BMI is 31 kg/m². She is in moderate distress and appears anxious. There is no murmur on cardiac examination and bilateral fine crackles are heard at the lung bases. Her abdomen is distended and non-tender with an incision that is clean and intact. Bowel sounds are diminished. There is no rebound tenderness or rigidity. There is no peripheral edema. A 12 lead EKG is performed and displayed below:\n\nWhich of the following would be the most appropriate next step in managing this patient?",
"choice_a": "Coronary angiography",
"choice_b": "CT scan of the chest with contrast",
"choice_c": "Intravenous metoprolol",
"choice_d": "Pantoprazole and morphine",
"choice_e": "Transthoracic echocardiogram",
"correct_answer": "A",
"explanation": "This patient is having a perioperative ST elevation myocardial infarction (STEMI). The electrocardiogram is diagnostic and shows up to 5 mm of convex ST elevation in the anterior precordial and lateral limb leads along with characteristic reciprocal changes of ST depression in the inferior leads, suggestive of an occlusive thrombus in the left anterior descending artery (LAD). Current guidelines recommend that patients with STEMI undergo emergent reperfusion (preferably by angioplasty and stent, if available) without any delays in treatment. While being prepared for transport to the cardiac cath lab, patients should receive aspirin 325 mg (as 4 aspirin 81 mg chewed), unfractionated heparin, and a beta blocker (in the absence of contraindications). At cardiac cath, this patient did have an LAD thrombus which was removed and stented. A post-procedure EKG shows near resolution of the EKG changes.\n\n(Choice B) The postoperative chest pain and diagnostic 12 lead EKG are highly suggestive of a cardiac etiology rather than a pulmonary embolism in this patient.\n\n(Choice C) Although beta blockers are generally indicated in acute coronary syndromes, this patient has an abnormally low blood pressure in the setting of a known history of hypertension, and should not acutely receive an intravenous beta blocker that could further lower her blood pressure.\n\n(Choice D) Although morphine is a reasonable option for pain control while awaiting reperfusion, there is no role for pantoprazole in this patient.\n\n(Choice E) Transthoracic echocardiogram could be useful to evaluate for acute valvular lesions, CHF, or sometimes a questionable diagnosis of acute coronary syndrome (i.e., non-diagnostic EKG). However, this patient has a diagnostic EKG for acute coronary syndrome and no murmur on exam to suggest valvular disease.\n\nEducational objective:\nPatients with STEMI should undergo prompt and emergent evaluation with cardiac catheterization (preferably with angioplasty and stent) and receive concurrent medical therapy with aspirin, heparin, and a beta blocker (if no contraindications exist).",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_003",
"system": "Cardiovascular System",
"stem": "A 69-year-old man with a history of coronary artery disease comes to the office with chest pain on moderate exertion. Over the last year, he has experienced pressure-like chest pain when walking at a fast pace or climbing stairs. He thinks this affects his quality of life as he has to stop to rest and take sublingual nitroglycerin each time. The patient has no shortness of breath, lightheadedness, syncope, or lower extremity swelling. He underwent coronary artery bypass surgery 8 years ago and has had 2 percutaneous coronary interventions over the last 2 years. Current medications include metoprolol succinate, amlodipine, lisinopril, extended-release isosorbide mononitrate, aspirin, clopidogrel, high-intensity rosuvastatin, and sublingual nitroglycerin as needed. He stopped smoking 10 years ago and does not drink alcohol. Blood pressure is 105/65 mm Hg and pulse is 55/min. The lungs are clear on auscultation. ECG shows normal sinus rhythm with T-wave inversion in leads III and aVF and a QTc interval of 410 msec. His last serum creatinine was 0.8 mg/dL and LDL cholesterol level was 68 mg/dL. Echocardiogram shows apical hypokinesis with left ventricular ejection fraction of 55%. Myocardial perfusion imaging reveals moderate ischemia of the inferior wall. Coronary angiography shows no intervenable lesions. Which of the following is the best next step in management of this patient's symptoms?",
"choice_a": "Add diltiazem",
"choice_b": "Add ranolazine",
"choice_c": "Add valsartan",
"choice_d": "Discontinue metoprolol and start diltiazem",
"choice_e": "Increase isosorbide mononitrate to twice daily",
"correct_answer": "B",
"explanation": "This patient continues to have activity-limiting chronic stable angina despite optimal medical therapy and coronary revascularization. When initial treatment is unsuccessful in relieving anginal symptoms, the addition of ranolazine may be used as a substitute for or in combination with beta blockers and other antianginal therapies. Ranolazine is a late sodium channel blocker that causes decreased influx of calcium into cardiomyocytes, resulting in lower ventricular wall tension and reduced myocardial oxygen consumption. This drug has the advantage of decreasing the frequency and severity of anginal symptoms and improving overall exercise capacity without significantly affecting heart rate or blood pressure. However, ranolazine has not been shown to improve other cardiovascular outcomes, including mortality and incidence of myocardial infarction.\n\n(Choice A) This patient is already taking a calcium channel blocker (amlodipine), and the addition of another agent from a similar class (eg, diltiazem, verapamil, felodipine) is not indicated.\n\n(Choice C) Although ACE inhibitors and angiotensin-receptor blockers reduce myocardial oxygen consumption by decreasing afterload, their overall effect on improving anginal pain is small. Furthermore, the addition of an angiotensin receptor blocker (eg, valsartan) to an ACE inhibitor (eg, lisinopril) is not typically recommended due to limited additional benefit and risk of side effects (eg, hyperkalemia, hypotension).\n\n(Choice D) Beta blockers are the preferred first-line therapy for patients with stable angina because beta blockers, unlike calcium channel blockers, improve long-term survival in patients with prior myocardial infarction or left ventricular systolic dysfunction. Discontinuing metoprolol and starting diltiazem is not indicated in the absence of beta blocker intolerance.\n\n(Choice E) Long-acting nitrates (eg, isosorbide mononitrate) are effective in improving chronic stable angina symptoms; however, long-term use is limited by the development of nitrate tolerance. Extended-release isosorbide mononitrate is typically dosed once daily; increasing to twice daily is unlikely to provide significant benefit.\n\nEducational objective:\nRanolazine decreases myocardial oxygen consumption and provides effective treatment for chronic stable angina without significantly affecting heart rate or blood pressure. It may be used as a substitute for or in combination with beta blockers and other antianginal therapies when initial treatment is unsuccessful in relieving chronic stable angina.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_004",
"system": "Cardiovascular System",
"stem": "A 78-year-old woman comes to the physician following discharge from the hospital. One week ago, she had gone to the emergency department for palpitations, which she had experienced several times before, and she was diagnosed with atrial fibrillation with rapid ventricular response. The arrhythmia resolved spontaneously overnight, and the patient was discharged the following day. She has no chest pain or shortness of breath and has never had syncope. Past medical history includes hypertension and hyperlipidemia. The patient's medications include aspirin, diltiazem, atorvastatin, and ramipril. She exercises most days of the week on a stationary bicycle for 20-30 minutes without any difficulty. The patient volunteers at a senior center and helps care for her husband with Alzheimer's dementia. Blood pressure is 135/75 mm Hg. pulse is 75 and regular, and BMI is 25 kg/m². Cardiac auscultation shows no murmurs. Her lungs are clear. Distal pulses are normal and symmetric. There is no edema. Electrocardiogram (ECG) shows normal sinus rhythm with no significant repolarization abnormalities. Transthoracic echocardiogram shows a mildly dilated left atrium, left ventricular ejection fraction of 55%. and mild mitral and tricuspid regurgitation. Laboratory studies show a TSH of 2.9 μU/mL. Which of the following is the most appropriate next step in management?",
"choice_a": "Amiodarone",
"choice_b": "Anticoagulation",
"choice_c": "Beta blocker",
"choice_d": "Exercise stress test",
"choice_e": "Transesophageal echocardiogram",
"correct_answer": "B",
"explanation": "This patient presented with paroxysmal atrial fibrillation (AF) that has spontaneously converted to sinus rhythm. Systemic thromboembolism is a major cause of long-term morbidity in patients with AF. Treatment with warfarin or target-specific oral anticoagulants has been shown to significantly reduce the risk of embolization in patients at moderate to high risk for thromboembolic events. Recent guidelines have recommended the use of a modified CHA2DS2-VASc score for stroke risk assessment in patients with nonvalvular AF. This patient has a CHA2DS2-VASc score of 4 (female gender, age >75, and hypertension) and should be managed with anticoagulation to reduce the long-term risk of systemic embolization.\n\n(Choice A) Amiodarone is occasionally used for maintenance of sinus rhythm in patients with recurrent, symptomatic AF (rhythm-control strategy). This patient has spontaneously converted to sinus rhythm, and current evidence suggests no significant difference in the risk of systemic thromboembolism between the rate- and rhythm-control strategies.\n\n(Choice C) Beta blockers and/or calcium channel blockers are used for heart rate control in patients with persistent AF. This patient has converted to sinus rhythm and would not benefit from additional beta blocker therapy.\n\n(Choice D) An exercise stress test is used primarily to evaluate for coronary artery disease (CAD) in patients with suspicious symptoms. It is occasionally used to assess rate control in AF patients with exertional symptoms. But this patient is now asymptomatic and stress testing is not indicated.\n\n(Choice E) Transesophageal echocardiography is performed to evaluate for intracardiac thrombus (left atrium or left atrial appendage thrombus) in patients with AF who have not been adequately anticoagulated prior to cardioversion. It has no role in patients with paroxysmal AF who are in sinus rhythm.\n\nEducational objective:\nWarfarin or target-specific oral anticoagulants have been shown to significantly reduce the risk of embolization in patients with atrial fibrillation and moderate to high risk for thromboembolic events. The CHA2DS2-VASc score is recommended for assessment of stroke risk in patients with nonvalvular atrial fibrillation.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_005",
"system": "Cardiovascular System",
"stem": "A 69-year-old woman comes to the physician with right calf pain when walking. The pain has been present for several months but is now starting to limit her daily walks and shopping. It is described as a deep ache or cramp. The pain initially occurred after the patient walked 6 blocks, but now occurs after 2 blocks. It dissipates rapidly with rest. She has no chest pain or leg edema. The patient has a history of hypertension, hyperlipidemia, diet-controlled type 2 diabetes mellitus, and cigarette use. She has reduced her smoking to about 10 cigarettes a day. Her medications include simvastatin, ramipril, aspirin, calcium, and vitamin D.\n\nThe patient's blood pressure is 128/77 mm Hg and pulse is 72/min. Cardiac, lung, and abdominal examinations are unremarkable. Her femoral pulses are 2+ and symmetrical. Popliteal and dorsalis pedis pulses on the right feel diminished relative to the left. Her ankle-brachial index is 0.7 on the right and 0.9 on the left. Electrocardiogram shows normal sinus rhythm and non-specific ST-segment and T-wave changes. After smoking cessation, aggressive risk factor modification, and a supervised incremental walking program, which of the following would be the best next step in management if life-style-limiting claudication persists?",
"choice_a": "Cilostazol",
"choice_b": "Pentoxifylline",
"choice_c": "Revascularization therapy",
"choice_d": "Verapamil",
"choice_e": "Warfarin",
"correct_answer": "A",
"explanation": "This patient has claudication suggestive of peripheral artery disease (PAD). Modifying risk factors (especially smoking cessation) and adding graded exercise therapy can improve symptoms and decrease the progression of disease. In addition to these lifestyle changes, medical therapy is a reasonable option in most patients. Antiplatelet therapy is the preferred initial therapy for PAD, and aspirin is the preferred drug due to cost and efficacy. Clopidogrel is typically used in patients who cannot tolerate aspirin. Patients who are still symptomatic on antiplatelet therapy require second-line agents such as cilostazol, a phosphodiesterase inhibitor and vasodilator that inhibits platelet aggregation and significantly increases maximal and pain-free walking distances. Cilostazol is normally used in patients who do not meet criteria for revascularization, such as this patient whose ankle-brachial index (ABI) is >0.5. Cilostazol is contraindicated in patients with heart failure due to increased mortality in these patients.\n\n(Choice B) Pentoxifylline is indicated as a second-line treatment for PAD symptom relief, but controlled trials regarding efficacy are inconsistent and show limited benefit in improving walking capacity.\n\n(Choice C) Current guidelines recommend revascularization therapy (either surgical or percutaneous) for patients who fail all exercise and medical therapy, for those with significant disabling claudication preventing daily activities, and those with limb-threatening ischemia (ABI usually ~0.5). This patient should receive further medical therapy before considering revascularization as she does not meet the above criteria.\n\n(Choice D) Verapamil is an arterial vasodilator that modestly increases walking distance but has no effect on ABI, peripheral leg temperature or blood pressure, or PAD progression.\n\nEducational objective:\nRisk factor modification and graded exercise are effective in improving exercise capacity in patients with claudication and peripheral arterial disease (PAD). If lifestyle-limiting claudication persists, medical therapy with antiplatelet agents (aspirin or clopidogrel) is recommended to improve pain-free walking distance and prevent PAD progression. Patients who fail antiplatelet therapy and do not meet criteria for revascularization can be prescribed cilostazol to improve pain-free walking distances.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_006",
"system": "Cardiovascular System",
"stem": "A 64-year-old man comes to the office for a routine follow-up. He has no current concerns. Last year, he underwent a transthoracic echocardiogram for a cardiac murmur and was diagnosed with mild calcific aortic stenosis. The mean gradient across the valve was 18 mm Hg (normal <5 mm Hg), and the estimated valve area was 1.6 cm (normal 3-4 cm). The patient does not use tobacco, alcohol, or illicit drugs. He jogs and bikes 3 times a week. Blood pressure is 136/78 mm Hg, and pulse is 77/min and regular. BMI is 29 kg/m². A 3/6 systolic ejection-type murmur is heard at the upper sternal border radiating to the carotids. S4 is heard at the apex at end-expiration. Lungs are clear to auscultation. The remainder of the examination is unremarkable. ECG shows normal sinus rhythm with voltage criteria for left ventricular hypertrophy and nonspecific ST segment changes. Laboratory results are as follows:\n\nComplete blood count\nHemoglobin 14.0 g/dL\nHematocrit 42%\n\nFasting lipid panel\nLow-density lipoprotein 90 mg/dL\n\nWhat is the best next step in management of this patient?",
"choice_a": "Addition of beta blocker",
"choice_b": "Education about antibiotic prophylaxis",
"choice_c": "No intervention and clinical follow-up in a year",
"choice_d": "Transthoracic echocardiogram",
"choice_e": "Treadmill exercise testing",
"correct_answer": "C",
"explanation": "This patient with aortic stenosis (AS) has asymptomatic and mild (ie, transvalvular velocity 2-2.9 m/s, mean transvalvular gradient <20 mm Hg) valvular disease, Progression of AS is quite variable; however, the aortic valve area declines at an average rate of 0.1 cm/year in most patients. Most patients with mild to moderate AS remain asymptomatic for several years and should have routine clinical evaluation (eg, annually) to assess for new symptoms or signs of worsening AS. Patients with asymptomatic, mild AS should undergo serial echocardiogram every 3-5 years. Those with moderate AS should undergo echocardiogram every 1-2 years, and those with severe AS should have an echocardiogram every 6-12 months. Echocardiogram should be performed earlier than the standard interval if patients develop any new signs or symptoms of worsening AS (eg, chest pain, dyspnea, lower extremity edema, lightheadedness, syncope).\n\n(Choice A) Pharmacologic therapy has no role in the management of patients with asymptomatic, mild AS. Beta blockers can be used in patients with mild to moderate AS and concurrent hypertension, coronary artery disease, or heart failure.\n\n(Choice B) Antibiotic prophylaxis for endocarditis is indicated only for patients with the highest-risk cardiac conditions. It is not indicated in most patients with valvular heart disease, including those with bicuspid aortic valve and AS.\n\n(Choice D) Unless symptoms consistent with worsening AS develop, echocardiogram is not indicated for another 2-4 years in this patient with mild AS.\n\n(Choice E) There is no role for routine exercise stress testing in patients with asymptomatic, mild AS. It is occasionally performed in patients with asymptomatic, severe AS to confirm absence of symptoms.\n\nEducational objective:\nSerial echocardiogram is recommended every 3-5 years in patients with mild aortic stenosis (AS), every 1- 2 years in those with moderate AS, and every 6-12 months in those with asymptomatic, severe AS. Pharmacologic therapy has no role in the management of patients with mild AS in the absence of concurrent hypertension, coronary artery disease, or heart failure.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_007",
"system": "Cardiovascular System",
"stem": "A 40-year-old man comes to the physician for an insurance physical. He has no current complaints. His medical problems include borderline hypertension and seasonal allergies. He takes fexofenadine. He does not smoke and drinks 1-2 alcoholic beverages per weekend. His family history is remarkable for an uncle who died suddenly in his 30s while playing basketball. His older brother had two unexplained syncopes.\n\nHis blood pressure is 120/70 mm Hg, pulse is 88/min, and respirations are 12/min. The patient's pulse oximetry showed 98% on room air. His BMI is 23 kg/m². There is a 3/6 systolic murmur heard at the mid and upper sternum bilaterally. Carotid upstrokes are delayed. The intensity of the murmur decreases when the patient assumes a standing position from a sitting position. Which of the following is the most likely diagnosis?",
"choice_a": "Ebstein's anomaly",
"choice_b": "Hypertrophic cardiomyopathy",
"choice_c": "Mitral valve prolapse",
"choice_d": "Valvular aortic stenosis",
"choice_e": "Ventricular septal defect",
"correct_answer": "D",
"explanation": "This patient's physical examination is consistent with aortic stenosis. Systolic ejection murmurs at the right upper sternal border imply turbulence in the left ventricular (LV) outflow tract due to aortic stenosis (AS), hypertrophic cardiomyopathy (HCM), or supravalvular AS. Maneuvers that decrease LV cavity size (i.e., Valsalva, standing) cause the hypertrophied septum in HCM to obstruct further and make the murmur louder. Fixed obstructions, as seen in AS, get slightly quieter as the decreased venous return results in less flow across the fixed obstruction. Delayed pulses (\"parvus et tardus\") are characteristic of aortic stenosis, while patients with HCM have a \"bifid\" pulse (two systolic impulses collapsed in between due to ejection obstruction ejection during systole). Aortic stenosis is due to either \"senile\" (bicuspid valve) or fibrocalcific aortic stenosis, which results from calcification of a normal aortic valve (presents around age 70). Bicuspid aortic valves are a congenital anomaly which undergo accelerated fibrocalcification and cause symptoms around age 40. Rarer causes of aortic stenosis include endocarditis, connective tissue diseases, and prior radiation.\n\n(Choice A) Ebstein's anomaly is due to abnormalities of the tricuspid leaflet structure and location. The murmur is usually due to tricuspid regurgitation (holosystolic at the left lower sternal border) that does not change with standing.\n\n(Choice B) Hypertrophic cardiomyopathy is a genetic disorder with significant hypertrophy of the LV septum or the entire left heart with outflow obstruction (about 30% of patients). Maneuvers that decrease LV volume (i.e., Valsalva, standing) will increase the gradient and the murmur; while maneuvers that increase LV volume or increase afterload will decrease the murmur (i.e., squatting, handgrip, leg lift).\n\n(Choice C) The murmur produced by mitral valve prolapse is preceded by a click and heard best at the apex. Maneuvers that decrease LV filling (i.e., Valsalva, standing) make the murmur louder. Maneuvers that increase LV filling (i.e., squatting, leg raise) will improve the closure of the mitral leaflets, delay the click, and soften the murmur.\n\n(Choice E) Ventricular septal defects produce a holosystolic, harsh murmur with a thrill along the left stemal border. The murmur does not typically change with standing.\n\nEducational objective:\nManeuvers that decrease left ventricular cavity size (i.e., Valsalva, standing) cause the hypertrophied septum in hypertrophic cardiomyopathy to obstruct further and make the murmur louder. Fixed obstructions, such as aortic stenosis, get slightly quieter as the decreased venous return results in less flow across the fixed obstruction.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_008",
"system": "Cardiovascular System",
"stem": "A 72-year-old man with a history of heart failure and reduced ejection fraction comes to the office for follow- up. The patient reports no change in his chronic dyspnea on exertion but says he has had a persistent, nonproductive cough for the past 4 weeks. The cough occurs during the day and night, and he has not been able to get restful sleep. The patient has had no fever, chills, night sweats, or loss of appetite. In the past year, he has had several hospitalizations due to decompensated heart failure, and 6 months ago he was treated with coronary stenting for an episode of non-ST elevation myocardial infarction. A recent echocardiogram revealed a left ventricular ejection fraction of 30%. The patient's other medical problems include hypertension, hyperlipidemia, and osteoarthritis. He takes aspirin, ticagrelor, atorvastatin, furosemide, carvedilol, sacubitril-valsartan, and spironolactone. He smoked a half pack of cigarettes daily for 10 years, but quit at age 40. The patient does not use alcohol or illicit drugs. Temperature is 36.6 C (98 F), blood pressure is 106/60 mm Hg, pulse is 72/min and regular, and respirations are 16/min. Pulse oximetry shows 96% on ambient air. Weight is 75 kg (165.3 lb), unchanged from previous visits. Physical examination reveals normal nasal and oropharyngeal mucous membranes, poor dentition, normal jugular venous pressure, clear lungs, and a grade 2/6 systolic murmur at the left sternal border. The abdomen is soft and nontender with no hepatosplenomegaly. Trace bilateral lower extremity pitting edema is present. Chest x-ray reveals no parenchymal opacities. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Discontinue sacubitril",
"choice_b": "Increase furosemide",
"choice_c": "Obtain CT scan of the chest",
"choice_d": "Perform pulmonary function testing",
"choice_e": "Prescribe a trial of proton pump inhibitor",
"correct_answer": "A",
"explanation": "Neprilysin is an enzyme that degrades endogenous vasoactive peptides, including atrial natriuretic peptide (ANP), brain natriuretic peptide (BNP), bradykinin, and angiotensin II. Sacubitril inhibits neprilysin, resulting in elevated circulating levels of these vasoactive peptides. The elevated ANP and BNP levels promote diuresis and cause venous and arteriolar dilation, providing beneficial hemodynamic effects in patients with heart failure. However, these effects come at the expense of elevated angiotensin II levels, leading to vasoconstriction and fluid retention, and elevated bradykinin levels, sometimes leading to cough. To counteract the elevated angiotensin II levels, sacubitril is paired with an angiotensin II receptor blocker for clinical use. Compared to an ACE inhibitor (enalapril), sacubitril-valsartan reduces heart failure hospitalization and improves cardiovascular and all-cause mortality in patients with symptomatic heart failure with reduced ejection fraction. A nonproductive cough, similar to that seen in patients taking ACE inhibitors, occurs in approximately 10% of patients taking sacubitril-valsartan, and is sometimes use-limiting. Other adverse effects include hypotension, hyperkalemia, dizziness, renal failure, and (rarely) angioedema.\n\n(Choice B) This patient has stable weight, normal pulmonary examination and chest x-ray, and only trace pedal edema. It is unlikely that fluid overload is responsible for his cough, and increasing the dose of furosemide is not indicated.\n\n(Choices C and D) CT scan of the chest and pulmonary function testing allow evaluation for chronic obstructive pulmonary disease (COPD) and interstitial lung disease (ILD), both of which can cause chronic cough. However, the absence of sputum production and pulmonary crackles makes COPD and ILD, respectively, less likely.\n\n(Choice E) Cough due to gastroesophageal reflux disease (GERD) often responds to a trial of a proton pump inhibitor. However, in the absence of other signs or symptoms suggestive of GERD (eg, heartburn, regurgitation), discontinuing sacubitril, a known cause of cough, is initially preferred.\n\nEducational objective:\nSacubitril inhibits neprilysin, resulting in elevated levels of atrial natriuretic peptide, brain natriuretic peptide, bradykinin, and angiotensin II. Sacubitril-valsartan improves cardiovascular mortality but causes a nonproductive cough, similar to that seen with ACE inhibitors, in approximately 10% of patients.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_009",
"system": "Cardiovascular System",
"stem": "A 62-year-old man comes to the physician for evaluation of chest and upper abdominal discomfort for the past 6 months. He has noted the discomfort during his daily walks and sometimes at rest, especially after heavy meals. His other medical problems include hypertension, type 2 diabetes mellitus, and gastroesophageal reflux disease. His medications include metformin, aspirin, hydrochlorothiazide, and lisinopril.\n\nThe patient's blood pressure is 142/82 mm Hg and pulse is 74/min. BMI is 33 kg/m². His physical examination is remarkable for chronic venous stasis and 1+ swelling of both lower extremities. The patient is referred for an exercise radionuclide stress test. After 5 minutes on the Bruce protocol, he is able to reach 85% of maximum age-predicted heart rate. His blood pressure at baseline is 148/88 mm Hg and is 142/86 mm Hg at peak exercise. He complains of discomfort in both arms and his chest during the end of exercise, which resolves 5 minutes later during the recovery period. ECG monitoring shows 2-mm horizontal ST-segment depression in leads II, aVF, and V4-V6 at peak stress with normalization at recovery. However, myocardial perfusion images show no evidence of ischemia, and ejection fraction is calculated at 65%. Which of the following is the most appropriate next step in management?",
"choice_a": "Add clopidogrel and nitroglycerin as needed",
"choice_b": "Evaluate for noncardiac cause of chest pain",
"choice_c": "Prescribe proton pump inhibitor",
"choice_d": "Reassure and follow up in 3-6 months",
"choice_e": "Refer for cardiac catheterization",
"correct_answer": "E",
"explanation": "Exercise ECG stress testing provides both diagnostic and prognostic information in patients with suspected coronary artery disease. Positive stress test findings, noted in the table, are often associated with poor outcomes if not treated. This patient was found to have ST depression in multiple leads during peak stress but no evidence of ischemia on radionuclide myocardial perfusion imaging. This is suggestive of the presence of balanced ischemia. Balanced ischemia is present when coronary flow is equally or nearly equally impaired. As a result, the pattern of perfusion on the radionuclide myocardial image appears mostly homogenous, creating a false negative. Therefore, the next step in management is to proceed with coronary angiography to look for significant multivessel obstructive coronary artery disease.\n\nEducational objective:\nThe presence of high-risk features on exercise stress testing and normal radionuclide myocardial perfusion imaging should raise suspicion for the presence of balanced ischemia. Such patients should be further evaluated with coronary angiography for the presence of multivessel coronary artery disease.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_010",
"system": "Cardiovascular System",
"stem": "A 32-year-old man comes to the clinic after experiencing heart palpitations. He is concerned as his uncle died suddenly at age 35.\n\nDuring physical examination, the physician asks the patient to sit up, lean forward, and hold his breath in full expiration while placing the diaphragm of the stethoscope at the left sternal border and applying firm pressure. Which of the following findings is best auscultated with this maneuver?",
"choice_a": "Aortic regurgitation murmur",
"choice_b": "Mid-systolic click of mitral valve prolapse",
"choice_c": "Mitral stenosis murmur",
"choice_d": "Pulmonary stenosis murmur",
"choice_e": "Third heart sound",
"correct_answer": "A",
"explanation": "The maneuver in the question is best suited for auscultating an aortic regurgitation murmur. Aortic regurgitation leads to an early decrescendo diastolic murmur that begins immediately after A2 (aortic component of second heart sound) and ends prior to the start of S1. The murmur is usually high pitched, blowing in quality, and best heard along the left sternal border at the 3rd and 4th intercostal space. Breath sounds can completely obscure the murmur in some patients. As a result, it is often best to instruct patients to sit up and lean forward while holding their breath in full expiration. Auscultation should be performed using the diaphragm of the stethoscope while applying firm pressure.\n\n(Choice B) Mitral valve prolapse (MVP) is associated with a single/multiple mid-systolic click and mid-to- late systolic murmur of mitral regurgitation. Standing or Valsalva causes an earlier systolic click and longer murmur (due to decreased left ventricular volume/size); squatting or leg elevation causes a delayed systolic click and shorter murmur (due to increased left ventricular volume/size). The maneuver performed on this patient does not affect mitral valve prolapse.\n\n(Choice C) Mitral stenosis is associated with an opening snap (OS) of the mitral valve and a low-pitched rumbling murmur heard throughout diastole. This is best heard when the patient is in the left lateral decubitus position with the stethoscope bell at the cardiac apex.\n\n(Choice D) Pulmonic stenosis causes an ejection systolic click with an associated systolic ejection murmur that is best heard over the left second intercostal space with radiation to the left side of the neck. The closure of the pulmonary valve is delayed due to the stenosis, causing splitting of S2. Pulmonic stenosis intensity increases with inspiration and decreases with abrupt standing.\n\n(Choice E) A third heart sound (S3) is best heard when the patient is in the left lateral decubitus position with the stethoscope bell at the cardiac apex.\n\nEducational objective:\nAortic regurgitation murmurs are best heard when the patient is sitting up, leaning forward, and holding their breath in full expiration while the diaphragm of the stethoscope is placed along the left sternal border at the 3rd or 4th intercostal space.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_011",
"system": "Cardiovascular System",
"stem": "A 43-year-old woman is being evaluated for a heart murmur. She is physically active and takes a yoga class three times a week without difficulty. She exercises on a treadmill twice per week. She denies any chest pain or pressure, palpitations, and shortness of breath. She had arthroscopic knee surgery two years ago after sustaining a knee injury while running. Otherwise, her past medical history is unremarkable.\n\nHer blood pressure is 122/78 mm Hg and pulse is 67/min. Her BMI is 25 kg/m² There is a blowing 3/6 holosystolic murmur heard best at the apex. Lungs are clear on auscultation. Her physical examination is otherwise unremarkable. EKG shows normal sinus rhythm with non-specific ST segment and T wave changes. Echocardiogram shows normal left ventricular size and function, an ejection fraction of 65%, and posterior mitral leaflet prolapse with severe eccentric mitral regurgitation. Left atrial size is moderately increased. Pulmonary artery systolic pressure is estimated at 25 mm Hg. Which of the following is the best recommendation for this patient?",
"choice_a": "Antibiotic prophylaxis prior to dental work",
"choice_b": "Anticoagulation with warfarin",
"choice_c": "Cardiac catheterization",
"choice_d": "Mitral valve replacement",
"choice_e": "Repeat echocardiogram in 6 months",
"correct_answer": "E",
"explanation": "This patient has mitral valve prolapse with significant mitral regurgitation (MR), as evidenced by the echocardiogram (ECHO). Patients with chronic severe mitral regurgitation require intervention (mitral valve repair preferred over replacement) if they develop symptoms (i.e., shortness of breath), echocardiographic evidence of cardiac dysfunction (e.g., an ejection fraction < 60% or an end systolic dimension > 40 mm), pulmonary hypertension (i.e., PAP > 50 mm Hg), or new onset atrial fibrillation (Choice D). Asymptomatic patients require serial monitoring, with the frequency depending on the severity of MR as seen on ECHO. This patient with severe mitral regurgitation and no cardiac dysfunction should be evaluated with serial clinical and echocardiographic follow-up every 6-12 months.\n\n(Choice A) Current guidelines recommend antibiotic prophylaxis in patients with valvular heart disease repaired with prosthetic valve or prosthetic material (i.e., a mitral or tricuspid ring), history of prior endocarditis, congenital heart disease (e.g., unrepaired cyanotic, within 6 months of repaired congenital heart disease, or repaired congenital heart disease with residual defects), or cardiac transplant with an abnormal valve and regurgitation.\n\n(Choice B) Anticoagulation is not indicated in the absence of documented atrial fibrillation (common in mitral valve disease).\n\n(Choice C) This patient is very physically active without any cardiovascular symptoms, and therefore has no indication for coronary angiography.\n\nEducational objective:\nPatients with chronic mitral regurgitation (MR) require mitral valve repair if they become symptomatic, show echocardiographic (ECHO) evidence of cardiac dysfunction, develop pulmonary hypertension, or new- onset atrial fibrillation. Asymptomatic patients need serial monitoring with clinical exam and ECHO depending on the severity of the MR.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_012",
"system": "Cardiovascular System",
"stem": "A 54-year-old man comes to the physician with fatigue and decreased exercise tolerance over the last 6 months. He denies cough, chest pain, syncope, or weight loss. He had aortic valve replacement with a mechanical valve due to bicuspid aortic valve stenosis 7 years ago. Coronary angiography prior to surgery showed no evidence of coronary artery disease. His medications include warfarin and antacids for occasional heartburn.\n\nHis blood pressure is 122/70 mm Hg and pulse is 89/min and regular. Jugular venous pressure is estimated at 9 cm H2O. A faint early diastolic murmur is heard at the left sternal border. Lungs are clear on auscultation. The liver span is 9 cm, and the tip of the spleen is not palpable. There is no edema of the lower extremities.\n\nLaboratory results are as follows:\n\nHemoglobin: 9.2 g/dL\nMean corpuscular volume: 89 fL\nPlatelets: 140,000/ μL\nInternational normalized ratio: 2.7\nLactate dehydrogenase, serum: 1,600 U/L\nErythrocyte sedimentation rate: 35 mm/h\n\nWhich of the following is the most likely diagnosis?",
"choice_a": "Colonic angiodysplasia",
"choice_b": "Hemolytic anemia",
"choice_c": "Large-vessel vasculitis",
"choice_d": "Lymphoma",
"choice_e": "Staphylococcus aureus endocarditis",
"correct_answer": "B",
"explanation": "This patient's early diastolic murmur is likely due to aortic regurgitation, which could be from structural failure of a mechanical valve or infective endocarditis. He also has anemia with elevated LDH, suggesting a hemolytic process. Hemolytic anemia is due to destruction of erythrocytes by malfunctioning valve and is more common with prosthetic mechanical valves than bioprosthetic valves. Patients often present with fatigue, jaundice, dark urine, and a new or changing heart murmur. Anemia, indirect hyperbilirubinemia, and elevated serum lactate dehydrogenase are present. Peripheral smear shows schistocytes. Anemia is often mild and is treated with oral iron or periodic blood transfusions. In certain cases of paravalvular leak, the valve may need to be replaced.\n\n(Choice A) Colonic angiodysplasia is a common cause of lower GI bleed and is sometimes found in patients with aortic stenosis. In most patients, bleeding improves after valve replacement. This patient's normal MCV and markedly elevated LDH make iron deficiency anemia from GI bleeding unlikely.\n\n(Choice C) This patient has no symptoms of large-vessel vasculitis (eg, giant cell or Takayasu) such as fever, weight loss, headache, or jaw/arm claudication.\n\n(Choice D) Patients with lymphoma usually present with lymphadenopathy, hepatosplenomegaly, B symptoms (fever, weight loss, night sweats), and possibly a rapidly growing mass. Although lymphoma can cause elevated LDH, this patient does not have these other symptoms.\n\n(Choice E) While infective endocarditis can result in valve failure, this patient has no fever, leukocytosis, or signs of embolic phenomena.\n\nEducational objective:\nHemolytic anemia is a complication of prosthetic heart valves. Treatment involves oral iron or blood transfusion. Patients with paravalvular leak or valve failure may need valve replacement.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_013",
"system": "Cardiovascular System",
"stem": "A 23-year-old man comes to the physician for evaluation of a murmur. He has no complaints and describes his exercise tolerance as 'excellent.' He has no other medical conditions and takes no medications. He does not use tobacco, alcohol, or illicit drugs. His paternal uncle died from an unknown cause at a young age. Physical examination reveals a IV/VI holosystolic murmur which is best heard at the fourth intercostal space along the left sternal border. It is accompanied by a palpable thrill. Carotid pulses are 2+ bilaterally without delay. Otherwise, his physical examination is unremarkable. Which of the following is the most likely diagnosis?",
"choice_a": "Atrial septal defect",
"choice_b": "Bicuspid aortic valve",
"choice_c": "Ebstein's anomaly",
"choice_d": "Supravalvular aortic stenosis",
"choice_e": "Ventricular septal defect",
"correct_answer": "E",
"explanation": "This asymptomatic patient's murmur is most likely due to the presence of a ventricular septal defect (VSD). A VSD causes a loud holosystolic murmur with maximal intensity over the third or fourth left intercostal space along the left sternal border, accompanied by a systolic thrill. This patient likely has a small VSD and is relatively asymptomatic. Observation would be the ideal management in this patient since the VSD closes spontaneously in up to 10% of adults. However, patients who progress will develop symptoms of volume overload, left ventricular dilatation, and have an increased chance of endocarditis. Surgery is indicated for patients who develop any of these complications and/or significant Eisenmenger syndrome.\n\n(Choice A) The low velocity flow across an atrial septal defect does not result in a murmur. A large defect causes a mid-systolic pulmonic ejection murmur due to increased flow across the pulmonic valve. This is best heard in the left second intercostal space and is usually not associated with a palpable thrill.\n\n(Choice B) The presence of a bicuspid aortic valve typically causes a prominent ejection click followed by a mid-systolic murmur heard best over the right second intercostal space. In severe aortic stenosis, carotid pulses are delayed and diminished in amplitude (parvus et tardus).\n\n(Choice C) Ebstein anomaly is characterized by apical displacement of the tricuspid valve leaflets, decreased volume of the right ventricle, and atrialization of the right ventricle. It is associated with tricuspid regurgitation, which results in a holosystolic murmur best heard over left second or third intercostal space or at the subxiphoid area. A thrill is not usually palpable.\n\n(Choice D) Supravalvular aortic stenosis causes a loud ejection systolic murmur which is best heard over right first intercostal space. A thrill is palpable in the suprasternal notch or the right first intercostal space.\n\nEducational objective:\nVentricular septal defects cause a loud holosystolic murmur which is best heard over the third or fourth intercostal space along the left sternal border. It can be distinguished from other systolic murmurs by its characteristic location and presence of a palpable thrill.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_014",
"system": "Cardiovascular System",
"stem": "A 29-year-old woman comes to the physician accompanied by her husband for an initial consultation. She has no current symptoms. She is physically active and walks for 45 minutes on a treadmill 3-4 days a week. She has a past history of \"heart failure,\" which was diagnosed 1 week after the birth of her first child 2 years ago. She was found to have a reduced LV ejection fraction of 25%, but further evaluation did not reveal any specific cause of her cardiomyopathy. She has been taking daily furosemide, potassium supplements, carvedilol, and quinapril since that time. Her last echocardiogram 2 months ago showed an improved LV ejection fraction of 40%, mild left atrial enlargement, and mild mitral regurgitation. The couple is contemplating another pregnancy and was referred by the obstetrician for a second opinion. Which of the following is the most appropriate recommendation?",
"choice_a": "Advise avoiding pregnancy",
"choice_b": "Continue current medications throughout pregnancy",
"choice_c": "Discontinue carvedilol and quinapril",
"choice_d": "Discontinue quinapril and continue carvedilol",
"choice_e": "Discontinue quinapril and start digoxin",
"correct_answer": "A",
"explanation": "This patient's history is consistent with peripartum cardiomyopathy (PPCM), an uncommon cause of heart failure. The etiology is unknown but may be multifactorial (e.g., immune-mediated, myocarditis, etc.). Risk factors for PPCM include age > 30, multiparity, African descent, pregnancy with multiple fetuses, maternal cocaine use, and beta-agonist (e.g., terbutaline) use > 4 weeks. Patients typically present with heart failure symptoms (usually dyspnea) and are diagnosed based on clinical criteria and an echocardiogram. Peripartum cardiomyopathy treatment is similar to usual heart failure therapy, but ACE inhibitors and ARBS are teratogenic and should not be taken during pregnancy (Choice B). Diuretics relieve pulmonary congestion, but loop diuretics are preferred over thiazide diuretics due to increased risk of fetal bleeding diathesis. Beta-1 selective blockers are generally preferred due to decreased risk of uterine relaxation and peripheral vasodilation. Digoxin is only considered in symptomatic patients who fail first-line therapies. One major predictor of persistent LV dysfunction is LV ejection fraction (EF) < 30% at the time of diagnosis. Patients who recover LV function to normal have a lower risk of complications during subsequent pregnancies, but their risk is still elevated when compared to the general population. Patients with persistent LV dysfunction have a substantially higher risk of complications such as significant decline in LVEF, recurrent heart failure, and death and should avoid subsequent pregnancies. This patient is stable but still has a depressed LVEF. She should avoid pregnancy and continue her present medications (Choices C, D, and E).\n\nEducational objective:\nPatients with a history of peripartum cardiomyopathy and persistent LV dysfunction have a high risk of further decline in LV function, recurrent heart failure, and death with subsequent pregnancies. Such patients should be advised to avoid future pregnancy.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_015",
"system": "Cardiovascular System",
"stem": "A 25-year-old woman comes to the physician with complaints of fatigue and worsening shortness of breath. She first noticed her symptoms 8 months ago. She awoke 2 days ago with palpitations and severe coughing and noticed some bright-colored blood in her sputum. She emigrated from the Philippines 2 years ago and works as a nurse at a local hospital. She has no history of smoking, illicit drug use, or unprotected sexual intercourse. She has no past medical history of childhood illnesses.\n\nHer blood pressure is 106/62 mm Hg, and pulse is 82/min and regular. Neck veins are pulsatile with a prominent c-v wave. Lungs fields are clear with minimal rales heard at both lung bases. Heart sounds are regular with a loud first heart sound. A low-pitched mid-diastolic rumble and a snapping sound after the second heart sound are present at the cardiac apex. There is also a loud holosystolic murmur heard over the precordium that increases with inspiration. Which of the following is the most likely diagnosis?",
"choice_a": "Aortic regurgitation",
"choice_b": "Constrictive pericarditis",
"choice_c": "Ebstein's anomaly",
"choice_d": "Mitral stenosis",
"choice_e": "Ventricular septal defect",
"correct_answer": "D",
"explanation": "The diagnosis of mitral stenosis is suspected based on clinical presentation and typical demographics and is confirmed with classic findings on physical examination. This patient's episode of paroxysmal nocturnal dyspnea and hemoptysis was most likely precipitated by paroxysmal atrial fibrillation. Classic physical examination findings in patients with mitral stenosis include a loud first heart sound, opening snap after S2 (best heard at the apex), and a low-pitched mid-diastolic rumble best heard at the cardiac apex using the bell of the stethoscope with the patient lying on the left side in held expiration. Patients with pulmonary hypertension and tricuspid regurgitation have pulsatile neck veins and a prominent c-v wave on jugular venous pulsation. Tricuspid regurgitation causes a holosystolic murmur best heard along the left sternal border that increases in intensity with inspiration.\n\n(Choice A) An early diastolic murmur, best heard at the left sternal border, is characteristic for aortic regurgitation. Opening snap is not present.\n\n(Choice B) Patients with constrictive pericarditis have elevated JVP with prominent \"y\" descent, Kussmaul's sign (lack of decline in JVP with inspiration), and an audible pericardial knock. There are no associated murmurs.\n\n(Choice C) Ebstein's anomaly is a congenital malformation characterized by abnormalities of the tricuspid valve and right ventricle. Auscultation reveals a tricuspid regurgitation murmur similar to that heard in this patient; however, mid-diastolic rumble at the cardiac apex is not common in adults. Also, first and second heart sounds are widely split due to right bundle branch block. Opening snap is not present.\n\n(Choice E) Ventricular septal defect causes a loud holosystolic murmur, along with a palpable thrill, and is best appreciated over the third or fourth left intercostal space along the left sternal border.\n\nEducational objective:\nPhysical examination findings in patients with mitral stenosis include a loud first heart sound, opening snap after S2 (best heard at the apex), and a low-pitched diastolic rumble best heard at the cardiac apex. Patients with tricuspid regurgitation from long-standing pulmonary hypertension also have a holosystolic murmur that increases in intensity with inspiration.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_016",
"system": "Cardiovascular System",
"stem": "A 79-year-old woman is referred for perioperative evaluation prior to cataract surgery. Medical history is significant for hypertension, heart failure, mild intermittent asthma, gout, and nonvalvular atrial fibrillation for which she takes warfarin. Medications also include lisinopril, furosemide, carvedilol, and amlodipine. The patient has no history of stroke. Two weeks ago, the INR was 2.5.\n\nBlood pressure is 130/82 mm Hg and pulse is 84/min and irregular. Jugular venous pressure is normal and the lungs are clear to auscultation. The patient has a grade 2/6 systolic ejection murmur at the right upper sternal border without radiation. Pedal edema is not present.\n\nWhat is the best way to manage this patient's anticoagulation?",
"choice_a": "Continue warfarin with no change in dosing or target INR",
"choice_b": "Discontinue warfarin 5 days prior to procedure and perform perioperative bridging with heparin",
"choice_c": "Hold warfarin until the INR normalizes, then restart warfarin postprocedure with no bridging",
"choice_d": "Permanently discontinue warfarin",
"choice_e": "Reduce warfarin dose and adjust target INR to 1.5 preoperatively",
"correct_answer": "A",
"explanation": "Management of perioperative anticoagulation with warfarin requires consideration of the surgical risk of bleeding weighed against the perioperative thrombotic risk if anticoagulation is stopped: \n\n• Low-bleeding-risk surgeries or procedures (eg, cataract surgery, central venous catheter removal) do not typically require adjustment or interruption in the warfarin regimen, regardless of thrombotic risk. \n• High-bleeding-risk surgeries (eg, joint replacement) require a temporary interruption in anticoagulation. For patients at very high thrombotic risk (eg, CHA2DS2 Vasc score 26), the interruption in anticoagulation should be accompanied by perioperative bridging (eg, low-molecular-weight heparin, unfractionated heparin) (Choice B). \n\nThis patient with atrial fibrillation and a CHA2DS2-Vasc score of 5 is at high perioperative thrombotic risk but is undergoing a low-bleeding-risk surgery (cataract); therefore, continuation of warfarin is appropriate. Temporary interruption of warfarin without perioperative bridging would have been appropriate if he had been undergoing a high-bleeding-risk surgery (Choice C). \n\n(Choices D and E) Neither permanent discontinuation of warfarin nor temporary reduction in the target INR is a viable strategy for managing perioperative bleeding and thrombotic risk in this patient requiring warfarin for atrial fibrillation.\n\nEducational objective:\nManagement of perioperative anticoagulation with warfarin involves balancing the bleeding risk of surgery with the thrombotic risk of stopping anticoagulation. Low-bleeding-risk surgeries or procedures (eg, cataract surgery) typically require no adjustment or interruption in the warfarin regimen. High-bleeding-risk surgeries (eg, joint replacement) require a temporary interruption in anticoagulation; the interruption should be accompanied by bridging (eg, low-molecular-weight heparin, unfractionated heparin) in patients at very high thrombotic risk.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_017",
"system": "Cardiovascular System",
"stem": "A 62-year-old man comes to the office to follow up hypertension. He has a long history of hypertension treated with amlodipine and obstructive sleep apnea requiring continuous positive airway pressure at night. The patient does not use tobacco, alcohol, or illicit drugs and has no medication allergies. Blood pressure is 134/90 mm Hg and pulse is 78/min. BMI is 33 kg/m². Physical examination is unremarkable. Laboratory results are as follows:\n\nSerum chemistry\nCreatinine: 0.8 mg/dL\nGlucose: 102 mg/dL\n\nFasting lipid panel\nHDL: 40 mg/dl\nLDL: 190 mg/dL\nTSH: 3.8 μU/mL\n\nLiver function tests are normal. The patient is counseled on indications for lipid-lowering therapy with statin drugs. He is at greatest risk for which of the following adverse effects if he starts high-intensity atorvastatin therapy?",
"choice_a": "Acute liver failure",
"choice_b": "Hemorrhagic stroke",
"choice_c": "New-onset diabetes mellitus",
"choice_d": "New-onset hypothyroidism",
"choice_e": "Rhabdomyolysis",
"correct_answer": "C",
"explanation": "Hydroxymethylglutaryl-coenzyme A reductase inhibitors (statins) lower LDL and VLDL cholesterol and triglycerides and have been shown to prevent cardiovascular events, with most studies indicating a relative risk reduction of approximately 20%-30%. They are indicated for patients with established atherosclerotic disease and those age 40-75 with diabetes mellitus. Patients with LDL cholesterol ≥190 mg/dL (as in this patient) are at very high risk for coronary events and also should be treated with statins, as should those who have a calculated 10-year risk for atherosclerotic cardiovascular disease 27.5%. Recent studies have shown that high-intensity statin therapy may increase the risk of new-onset diabetes or worsen glycemic control in established diabetes. The risk is dose dependent and is greater in older patients and women. However, this excess risk of developing diabetes is markedly outweighed by the reduction in risk for cardiovascular events; therefore, the benefits of statin therapy outweigh the adverse effects on blood glucose. New-onset or worsening diabetes does not warrant discontinuation of statin therapy.\n\n(Choice A) Hepatic dysfunction due to statin use is uncommon (0.5%-3%) and usually resolves without sequelae if the medication is withheld. Acute liver failure and cirrhosis are extremely rare.\n\n(Choice B) Statins are associated with an increased risk for hemorrhagic stroke; however, the excess risk is very small (-0.05%-0.1% over 5 years).\n\n(Choice D) Patients with hypothyroidism may be more susceptible to statin-induced myopathy, and many experts advise checking a serum TSH level prior to initiation of therapy. However, statins do not cause hypothyroidism.\n\n(Choice E) Statins have a 2%-10% risk of inducing myalgia (the most common side effect) but only a 0.1% risk for rhabdomyolysis. Muscle symptoms are most likely in patients with pre-existing liver or renal disease or hypothyroidism. Patients with statin myopathy should discontinue the medication until symptoms improve and then be considered for a statin less likely to cause muscle toxicity (eg, pravastatin, rosuvastatin).\n\nEducational objective:\nStatins are associated with an increased risk of diabetes and worsening glycemic control in patients with established diabetes mellitus. However, this excess risk is significantly less than the reduction in risk for cardiovascular events. The benefits of statin therapy outweigh the adverse effects on blood glucose, and new-onset or worsening diabetes does not warrant discontinuation of statin therapy.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_018",
"system": "Cardiovascular System",
"stem": "A 64-year-old man comes to the physician with a 2-week history of lightheadedness. He describes episodes of feeling woozy and a sense of heaviness in his head with squatting as he worked in his garden. He also describes occasional headaches that have recently become worse. He has no palpitations and has not lost consciousness. He has known nonischemic cardiomyopathy with a biventricular automatic implantable cardioverter defibrillator placed 2 years ago and a lead revision 1 month ago. Three weeks ago, an echocardiogram showed a left ventricular ejection fraction of 30%. His supine blood pressure is 122/75 mm Hg, standing blood pressure is 125/78 mm Hg, and pulse is 60/min. Examination shows a plethoric face. The neck and upper chest veins are distended. No enlarged lymph nodes are palpated. A 2/6 holosystolic murmur radiating to the axilla is heard at the apex. Lungs are clear to auscultation. The liver span is 10 cm. There is trace bilateral edema of the lower extremities. Symmetrical pulses are palpated on the upper and lower extremities bilaterally. Electrocardiogram shows atrioventricular sequential pacing. Which of the following is the most likely diagnosis?",
"choice_a": "Effusive-constrictive pericarditis",
"choice_b": "Pancoast tumor",
"choice_c": "Subclavian steal syndrome",
"choice_d": "Superior vena cava syndrome",
"choice_e": "Ventricular arrhythmia",
"correct_answer": "D",
"explanation": "This patient's clinical presentation (presyncope during squatting and worsening headaches) after recent automatic implantable cardioverter defibrillator (AICD) lead revision suggests superior vena cava (SVC) syndrome. SVC syndrome is most commonly due to tumor compression. However, transvenous AICD implantation can induce thrombosis and occlusion around the leads, resulting in SVC syndrome. Although the body tries to offset the high venous pressure by creating venous collaterals, central venous pressure usually remains high and causes symptoms. Risk factors for SVC include the number of ICD leads, endothelial damage during insertion, thrombophilic state, and infections. Symptoms may develop any time after AICD implantation but usually occur 1-15 months after the procedure. Typical manifestations include dyspnea, head fullness, facial/arm swelling, or chest wall edema that may worsen with bending or lying down. Patients may also develop episodic syncope or presyncope. Bilateral upper-extremity venography is the gold standard for diagnosing SVC syndrome. However, contrast-enhanced chest computed tomography is usually done first to show the extent of the venous blockage, visualize collaterals, and possibly identify the causative factor. Therapy usually involves long- term anticoagulation. Patients with more extensive clot or severe symptoms may require thrombolysis, stent implantation, bypass surgery, or extraction of the leads and re-implantation.\n\n(Choice A) Constrictive pericarditis usually presents with worsening peripheral edema or anasarca and extreme fatigability, especially in response to exertion. Physical examination shows an elevated jugular venous pressure, pulsus paradoxus, Kussmaul's sign, and pericardial knock.\n\n(Choice B) Pancoast tumor usually invades the brachial plexus, parietal pleura, surrounding fascia, ribs. and vertebral bodies. Patients typically present with shoulder pain, Horner's syndrome, and hand muscle weakness/atrophy.\n\n(Choice C) Subclavian steal syndrome is usually due to atherosclerotic narrowing of the proximal subclavian artery, which results in flow reversal in the ipsilateral vertebral artery. This occurs most often on the left side, and many patients are asymptomatic. A significant percentage has symptoms of arterial insufficiency in the affected upper extremity (eg, exercise-induced fatigue, pain, numbness, coolness, fatigue). Some patients have symptoms relative to vertebral-basilar artery insufficiency (eg, dizziness, vertigo, disequilibrium, drop attacks).\n\n(Choice E) Ventricular arrhythmias would not explain this patient's dilated neck and upper chest veins.\n\nEducational objective:\nSuperior vena cava (SVC) syndrome is most commonly due to tumor compression. However, implantation of a transvenous automatic implantable cardioverter defibrillator can induce thrombosis and occlusion around the leads, resulting in SVC syndrome. Bilateral upper-extremity venography is the gold standard for diagnosing SVC syndrome. However, contrast-enhanced chest computed tomography is usually the initial test of choice.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_019",
"system": "Cardiovascular System",
"stem": "A 62-year-old man complains of right-sided leg and thigh pain while walking. The pain improves with rest and is described as a heaviness or cramping sensation. His sexual performance has decreased over the past year. The patient's other medical problems include chronic kidney disease, type 2 diabetes mellitus, hypertension, hyperlipidemia, and gastroesophageal reflux disease. He has a 38-pack-year smoking history. The patient's blood pressure is 144/72 mm Hg, pulse is 67/min, and body mass index is 29 kg/m² A bruit is heard over the right carotid artery. Peripheral pulses are palpable bilaterally. There is a small ulcer at the tip of the right big toe. No extremity edema is present. The ankle-brachial index is 1.45 on the right and 1.40 on the left (normal 1.0-1.3). The serum creatinine is 2.2 mg/dL and HbA1c is 7.5%. Which of the following is the most likely cause of this patient's leg pain?",
"choice_a": "Diabetic neuropathy",
"choice_b": "Peripheral arterial disease",
"choice_c": "Spinal stenosis",
"choice_d": "Statin-induced myopathy",
"choice_e": "Venous claudication",
"correct_answer": "B",
"explanation": "This patient has several risk factors, along with clinical symptoms and signs (intermittent claudication, erectile dysfunction, lower-extremity ulceration) suggestive of occlusive peripheral arterial disease (PAD). Measurement of ankle-brachial index (ABI) is recommended in such patients to confirm the diagnosis of PAD. An ABI of 1.0-1.3 is considered normal; in symptomatic patients, an ABI of ≤0.90 is considered diagnostic of occlusive PAD with 90% sensitivity and 95% specificity. Some patients with PAD and arterial calcification have non-compressible vessels, which can lead to falsely elevated ABI (>1.3). This is usually seen in the setting of diabetes mellitus and/or chronic renal failure. In such patients, further vascular studies, with measurement of toe-brachial index, pulse volume recordings, or arterial duplex ultrasound should be obtained to confirm the diagnosis of PAD. The presence of high ABI >1.3 (similar to low ABI) is associated with an increased risk of all-cause and cardiovascular mortality.\n\n(Choice A) Diabetic neuropathy usually presents with bilateral sensory polyneuropathy involving the distal lower extremities, with decreased sensation to light touch, pain, and temperature, and loss of vibration sense and proprioception. Patients with florid neuropathy also complain of pain, paresthesias, or dysesthesias of their feet. The quality and exertional pattern of this patient's symptoms are not consistent with diabetic neuropathy.\n\n(Choice C) Lumbar spinal stenosis typically presents with \"neurogenic claudication,\" with bilateral or asymmetric lower-extremity pain, weakness, or sensory loss that is exacerbated with walking or prolonged standing in erect postures. It is relieved with sitting or assuming a stooped and flexed posture.\n\n(Choice D) Statin-induced myopathy generally develops within weeks to months after starting statins and can present with muscle weakness, myalgias, and myositis (with elevated creatine kinase). The symptoms are usually more diffuse (and not localized as in this patient) and affect both upper and lower extremities.\n\n(Choice E) \"Venous claudication\" is occasionally used to describe the lower-extremity discomfort in patients with chronic venous disease. These patients usually have associated findings of venous disease with leg swelling and varicosities, and the symptoms are worse with the limbs in a prolonged dependent position.\n\nEducational objective:\nA falsely elevated ankle-brachial index (ABI) >1.3 can be present due to calcified and non-compressible arteries in patients with advanced peripheral arterial disease in the setting of diabetes and/or chronic renal failure. High ABI (similar to low ABI) is associated with an increased risk of all-cause and cardiovascular mortality.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_020",
"system": "Cardiovascular System",
"stem": "A 69-year-old man comes to the office with a 4-week history of fatigue. He feels \"drained\" by the end of the day. He has no chest pain, shortness of breath, or body aches but does have decreased exercise tolerance. He reports good appetite and no recent weight changes. His medications include amlodipine for hypertension and rosuvastatin for hyperlipidemia. His temperature is 36.8 C (98.3 F) and blood pressure is 144/90 mm Hg. Body mass index is 22 kg/m². Initial laboratory studies show hemoglobin of 14.2 g/dL, serum potassium of 4.6 mEq/L and serum creatinine of 0.8 mg/dL Fasting glucose level is 98 mg/dL. Electrocardiogram is shown here. Which of the following is the best next step in management of this patient?",
"choice_a": "Ankle brachial index",
"choice_b": "Discontinue rosuvastatin",
"choice_c": "Thyroid function tests",
"choice_d": "Treadmill stress testing",
"choice_e": "Urine microalbumin",
"correct_answer": "C",
"explanation": "This patient's presentation is consistent with atrial fibrillation (AF). Electrocardiogram shows an irregularly irregular rhythm with varying R-R intervals and no clearly discernible P waves. Patients may be asymptomatic but typically present with chest pain, dyspnea, palpitations, weakness, decreased exercise tolerance, dizziness, or presyncope. AF is the most common supraventricular arrhythmia and can occur due to a variety of cardiac and/or systemic disorders. Patients with hyperthyroidism have an increased risk of developing AF, and the risk is also increased in those with subclinical hyperthyroidism (low serum thyroid-stimulating hormone [TSH] and normal serum T4 concentration in clinically euthyroid patients). As a result, all patients with new-onset AF should have serum TSH levels obtained as part of initial evaluation for early diagnosis and appropriate management of hyperthyroidism.\n\n(Choice A) Ankle brachial index measurement is used to detect peripheral arterial disease in patients with intermittent claudication.\n\n(Choice B) Patients using statin drugs (eg, rosuvastatin) can develop statin-induced myopathy with myalgia, muscle weakness, and/or elevation of serum creatine kinase levels. This patient has no such signs/symptoms.\n\n(Choice D) Treadmill exercise stress test may be used for diagnosis in patients with an intermediate probability of coronary artery disease. Atrial fibrillation is usually not associated with stable coronary heart disease and is also a relative contraindication to exercise treadmill testing.\n\n(Choice E) Urine albumin excretion is increased in patients with glomerular diseases (eg, focal or diffuse glomerulonephritis, nephrotic syndrome) and in systemic illnesses such as diabetes mellitus. The presence of albuminuria (micro or macro) has been found to be associated with a higher AF risk; however, routine measurement of urine albumin levels is not recommended.\n\nEducational objective:\nPatients with clinical or subclinical hyperthyroidism have a higher risk of developing atrial fibrillation (AF). Serum thyroid-stimulating hormone levels should be measured during the initial evaluation of all patients with new-onset AF.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_021",
"system": "Cardiovascular System",
"stem": "A 77-year-old woman comes to the physician because she \"passed out.\" She says that over the last few months she has had several episodes where she feels very lightheaded and must sit down. On one occasion, she did actually lose consciousness and hit her head against a bathroom counter. There are no clear precipitants of these episodes. She denies chest pain or pressure. She thinks that she is more short of breath while playing tennis than she used to be in the past. Her other medical problems include hypertension and mild chronic kidney disease. Her medications include amlodipine, lisinopril, simvastatin, and aspirin. Her blood pressure is 115/70 mm Hg, pulse is 62/min, and BMI is 23 kg/m². The patient is in no acute distress. There is a normal S1 and a soft S2. There is a III/VI mid-peaking systolic ejection murmur at the right upper sternal border that radiates to both carotid arteries. Her lungs are clear to auscultation. Her abdomen is soft and non-distended. Peripheral pulses are 2+ and symmetric. An echocardiogram showed normal left ventricular function, mild left ventricular hypertrophy, and moderate calcific aortic stenosis with an estimated aortic valve area of 1.4 cm (normal 3-4 cm). The patient was given a 24-hour Holter monitor. The tracing below was recorded at 1:25 pm. Which of the following would be the best next step in managing this patient?",
"choice_a": "Aortic valve replacement",
"choice_b": "Discontinuation of amlodipine with close follow-up",
"choice_c": "Exercise stress testing",
"choice_d": "Permanent pacemaker placement",
"choice_e": "Tilt table testing",
"correct_answer": "D",
"explanation": "This patient presents with syncope, most likely due to AV heart block as seen on the EKG. Neurocardiogenic (vasovagal or vasodepressor) syncope is the most common diagnosis in young and middle-aged populations. Left ventricular outflow obstruction and arrhythmias are more common in the elderly. After a thorough history and physical examination, many patients require further testing (e.g.. EKG, echocardiogram, stress test) to rule out structural heart disease. Patients with an unclear etiology should undergo ambulatory recording with a Holter monitor, mobile telemetry, or an implantable loop recorder. This patient's Holter shows high degree AV block with non-conducted p waves in the middle of the second strip continuing into the third. While this particular episode did not cause syncope, it strongly suggests that AV block is the etiology of her symptoms. Syncope due to advanced AV block is a class I indication for permanent pacing.\n\n(Choice A) Aortic valve replacement is reserved for symptomatic severe aortic stenosis (mean gradient > 40 mm Hg or aortic valve area < 1 cm on echocardiogram), which usually presents with syncope. However, this patient's echocardiogram shows moderate aortic stenosis that does not warrant valve replacement. The calcification that causes the aortic stenosis is also probably the same process that causes the degeneration of the conduction system.\n\n(Choice B) Patients with syncope may wait to see if symptoms improve after withholding AV nodal blockers such as beta blockers, non-dihydropyridine calcium channel blockers (e.g.. verapamil or diltiazem,), and digoxin. However, this patient is taking a dihydropyridine calcium channel blocker (e.g.. amlodipine, felodipine, nifedipine) that does not significantly affect the AV node.\n\n(Choice C) A stress test may help diagnose coronary artery disease, but this patient has no chest pain with these episodes. Her Holter also shows no ST segment changes, which makes the AV block less likely due to ischemia.\n\n(Choice E) Upright tilt testing has limited sensitivity and specificity for vasovagal syncope and usually does not help guide the patient's treatment. Also, the hemodynamic response during the test does not always reproduce the actual syncopal mechanism. Tilt testing can be employed in patients with recurrent unexplained syncope when other cardiac causes have been excluded with prolonged EKG monitoring (e.g.. loop recorders).\n\nEducational objective:\nIn the evaluation of syncope, it is critical to first rule out structural heart disease. If none is found, then ambulatory monitoring can be very helpful. Syncope due to high degree AV block is a class I indication for permanent pacemaker placement.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_022",
"system": "Cardiovascular System",
"stem": "A 35-year-old woman comes to the office for a routine physical examination. She is in good health and has no significant medical history. The patient does not use tobacco or alcohol. She takes no medications or supplements. Her paternal aunt had an unexpected death at age 32. Physical examination, including cardiac examination, is unremarkable. ECG shows normal sinus rhythm with a corrected QT interval of 505 msec. Serum electrolytes are normal. Echocardiogram shows normal heart structure and function. The patient is advised about lifestyle modification and medication safety. Which of the following is the best initial management for this patient?",
"choice_a": "Diltiazem",
"choice_b": "Disopyramide",
"choice_c": "Implantable cardioverter-defibrillator",
"choice_d": "Propranolol",
"choice_e": "Reassurance and routine follow-up",
"correct_answer": "D",
"explanation": "This patient's presentation - prolonged corrected QT interval (QTc) and family history of sudden death - is suggestive of congenital long QT syndrome (LQTS). A normal QTc interval is 370-440 msec. A QTC >450 msec in male patients and >470 msec in female patients is considered a prolonged QT interval. Patients with congenital LQTS may be asymptomatic or have palpitations, presyncope/syncope, seizures, or cardiac arrest. LQTS is associated with an increased risk of ventricular arrhythmias, such as torsades de pointes, which may terminate spontaneously or degenerate into ventricular fibrillation. Management includes avoidance of conditions (eg, strenuous exercise, electrolyte abnormalities such as hypokalemia or hypomagnesemia) and medications (eg, antipsychotics, fluoroquinolones) that may prolong the QT interval. Current guidelines also recommend that all patients with congenital LQTS (symptomatic or asymptomatic) be treated with beta blockers (eg, propanolol, nadolol) to decrease the risk of symptomatic arrhythmias and sudden cardiac death (Choice E).\n\n(Choice A) Diltiazem is commonly used to treat supraventricular tachycardias. It has no role in the management of patients with LQTS.\n\n(Choice B) Disopyramide is a class la antiarrhythmic agent that can cause further prolongation of the QT interval.\n\n(Choice C) An implantable cardioverter-defibrillator (ICD) is recommended for patients with LQTS who have syncope (especially if recurrent) or ventricular tachycardia (eg, torsade de pointes) on beta blocker therapy. ICDs may be considered in patients with a strong family history of sudden cardiac death. However, a beta blocker should be used as initial treatment for this patient, particularly given the risks associated with ICD placement (infection, lead fracture). ICDs are also used as secondary prevention in patients with an aborted cardiac arrest.\n\nEducational objective:\nBeta blockers are recommended for patients with congenital long QT syndrome to reduce the risk of symptomatic arrhythmias and sudden cardiac death. An implantable cardioverter-defibrillator is recommended for patients with syncope (especially if recurrent) or ventricular tachycardia (eg, torsade de pointes) on beta blocker therapy or for those with aborted cardiac arrest.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_023",
"system": "Cardiovascular System",
"stem": "A 67-year-old man comes to the office for routine follow-up. He has a history of hypertension, osteoarthritis, and chronic aortic regurgitation. He reports that he is doing well overall and plays doubles tennis three times a week for exercise, which he does without any chest pain or pressure. He denies shortness of breath, orthopnea, paroxysmal nocturnal dyspnea, or edema. His medications include aspirin, nebivolol, simvastatin, chlorthalidone, and acetaminophen. His blood pressure is 128/60 mm Hg and pulse is 67/min. His BMI is 27 kg/m². Cardiovascular examination reveals a normal S1 and S2. There is 2/6 mid-systolic murmur at the right upper sternal border followed by a high-pitched diastolic decrescendo murmur best heard at the left upper sternal border. The intensity of the diastolic murmur is increased with handgrip. His peripheral pulses are 3+ bilaterally. A transthoracic echocardiogram demonstrates normal left ventricular size and function. The aortic valve is calcified and demonstrates mild stenosis (mean gradient = 13 mm Hg) with moderate aortic regurgitation. When compared to the echocardiogram from two years ago, both the aortic stenosis and regurgitation are worse. Which of the following would be the most appropriate next step?",
"choice_a": "Aortic valve replacement",
"choice_b": "Coronary angiography",
"choice_c": "Lisinopril",
"choice_d": "Repeat echocardiogram in 6-12 months",
"choice_e": "Transesophageal echocardiography",
"correct_answer": "D",
"explanation": "This patient presents with asymptomatic mixed aortic valve disease, predominantly moderate aortic regurgitation (AR) seen on echocardiography (ECHO). Current guidelines recommend isolated aortic valve replacement for severe AR in symptomatic patients (i.e., shortness of breath, decreased exercise tolerance) and asymptomatic patients with abnormal ECHO findings (e.g.. ejection fraction < 50% or a dilated left ventricle with either end-diastolic size > 75 mm or end-systolic size > 55 mm). Vasodilators (ACEI or nifedipine) are indicated for severe AR in symptomatic patients with left ventricular (LV) dysfunction who are not surgical candidates for valve replacement. Symptomatic patients awaiting surgery should receive intense medical therapy with digoxin, diuretics, and vasodilators to help decrease congestive symptoms prior to surgery. Patients who do not meet surgical or medical therapy criteria need re-evaluation for symptoms and a repeat echocardiogram in 6-12 months. Patients with mild AR and normal LV function need only a yearly clinical evaluation and repeat ECHO every 2-3 years. There are no formal guidelines for patients with moderate AR, but most clinicians would re-evaluate the patient clinically every 6-12 months with repeat ECHO at each visit as clinically indicated (especially in patients who show progressive disease, such as this one).\n\n(Choice A) This patient only has moderate regurgitation and mild stenosis. Even if the valvular disease were severe, he does not meet any current criteria for valve replacement (i.e., symptomatic, dilatation, or LV dysfunction).\n\n(Choice B) Coronary angiography would only be needed if the patient were having symptoms of ischemic heart disease, or if the noninvasive tests were inconclusive to determine the valve severity. Coronary angiography is also needed prior to valve surgery to determine if coronary revascularization is required simultaneously.\n\n(Choice C) Lisinopril, an ACEI, is also a vasodilator that can be helpful for patients with decompensated heart failure from aortic regurgitation. However, they are not indicated for the long-term management of asymptomatic patients with mild to moderate aortic regurgitation and normal systolic function (such as this patient).\n\n(Choice E) Transesophageal echocardiograms (TEE) can be useful to get more detailed images of the left-sided valves in instances such as endocarditis or prosthetic valve dysfunction. They are rarely better than transthoracic echocardiograms (TTE) for estimating valve severity in native valves.\n\nEducational objective:\nValve replacement in patients with chronic severe aortic regurgitation should be considered based upon the development of symptoms or left ventricular dilatation/dysfunction. In the absence of those findings, close clinical follow up and echocardiograms every 6-12 months are warranted.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_024",
"system": "Cardiovascular System",
"stem": "A 32-year-old man with known hypertrophic cardiomyopathy is brought to the emergency department after an episode of syncope. He was carrying groceries to his car when he suddenly passed out. He had no chest pain, lightheadedness, nausea, or palpitations prior to the event. The patient now says he feels fine and wants to go home. He was diagnosed with hypertrophic cardiomyopathy 2 years ago. He had a mild provokable left ventricular outflow tract gradient with exercise due to systolic anterior motion of the mitral valve. The gradient was eliminated with metoprolol. The patient claims compliance with the therapy and has no exertional shortness of breath or chest pain. His paternal uncle died suddenly at age 40.\n\nBlood pressure is 132/80 mm Hg and pulse is 62/min. Fourth heart sound is heard at the apex with the patient in the left lateral decubitus position. Electrocardiogram shows normal sinus rhythm and T-wave inversion in leads 1, V5, and V6; it is unchanged from a previous reading. Which of the following is the best next step in management of this patient?",
"choice_a": "Disopyramide therapy",
"choice_b": "Electrophysiologic study",
"choice_c": "Implantable cardioverter-defibrillator",
"choice_d": "Increase in metoprolol dose",
"choice_e": "Tilt-table testing",
"correct_answer": "C",
"explanation": "Hypertrophic cardiomyopathy (HCM) is a relatively common autosomal dominant genetic cardiac disease with a prevalence of 1:500 in the general population. It has heterogeneous and variable clinical presentation, prognosis, and treatment strategies. Most patients with HCM have few or no symptoms and a normal life expectancy. Sudden cardiac death (SCD) is the most dreaded complication, with an annual incidence of approximately 1% of HCM patients. The following features confer a higher risk of SCD in patients with HCM: \n\n• History of cardiac arrest (or sustained spontaneous ventricular tachycardia) \n• Family history of sudden death \n• Syncope (recurrent and/or associated with exertion) \n• Nonsustained ventricular tachycardia on Holter monitoring \n• Hypotensive blood pressure response to exercise \n• Extreme left ventricular hypertrophy (>3 cm maximum septal wall thickness) \n\nAn implantable cardioverter-defibrillator (ICD) is indicated for both primary and secondary prevention of SCD in patients with 21 major high-risk features. This patient has a history of syncope and a family history of sudden death and should be referred for ICD placement for primary prevention of SCD. \n\n(Choice A) Disopyramide is a negative inotropic agent that can be used to alleviate left ventricular outflow tract (LVOT) gradient in patients with symptomatic obstructive HCM. It has no role in primary prevention of SCD. This patient had mild LVOT gradient on exercise that was eliminated with the use of metoprolol. There is no indication for additional therapy with disopyramide at this time.\n\n(Choice B) Electrophysiology testing has not been shown to be a reliable predictor of SCD in patients with HCM. It should not be used for risk stratification prior to ICD therapy.\n\n(Choice D) Therapy with beta blockers is indicated in symptomatic patients with heart failure and/or LVOT obstruction. This patient had effective reduction in gradient with metoprolol, and additional therapy with metoprolol is not indicated given his heart rate of 62/min.\n\n(Choice E) Tilt-table testing is indicated in patients with recurrent episodes of syncope in the absence of organic heart disease. This patient has a known history of HCM with high-risk features and should have an ICD placed for primary prevention of SCD.\n\nEducational objective:\nThe major high-risk features that increase risk of sudden cardiac death (SCD) in patients with hypertrophic cardiomyopathy include family history of sudden death, recurrent or exertional syncope, nonsustained ventricular tachycardia on Holter monitoring, hypotensive response during exercise, and massive left ventricular hypertrophy >3 cm. Patients with ≥1 high-risk features should have an implantable cardioverter- defibrillator for the primary prevention of SCD.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_025",
"system": "Cardiovascular System",
"stem": "A 60-year-old man comes to the physician complaining of occasional episodes of dizziness, usually when he tries to get up quickly. He had sustained an anterior wall myocardial infarction 4 months ago, and had emergent percutaneous revascularization of his proximal left anterior descending artery with placement of a stent. He denies any chest pain, shortness of breath, palpitations, or syncope. He has been able to resume walking about 3 miles every day. His home medications include aspirin, clopidogrel, rosuvastatin, carvedilol, valsartan, and spironolactone. Echocardiography performed 1 week ago showed a large area of dyskinesia in the anterior and anterolateral myocardial segments, with an ejection fraction of 25%. There was also mild mitral and tricuspid regurgitation present.\n\nHis blood pressure is 112/62 mm Hg and pulse is 68/min. A soft, 2/6 holosystolic murmur is heard at the cardiac apex in the left lateral position. Lungs are clear to auscultation. His ECG in the office shows sinus rhythm and Q waves in precordial leads. Which of the following is the most appropriate next step in management?",
"choice_a": "30-day ECG monitoring",
"choice_b": "Amiodarone",
"choice_c": "Electrophysiological study",
"choice_d": "ICD implantation",
"choice_e": "Submaximal exercise testing",
"correct_answer": "D",
"explanation": "Current guidelines recommend ICD therapy for primary prevention of sudden cardiac death in patients with myocardial infarction (MI) with persistent LVEF < 30% (or < 35% along with NYHA class II or III symptoms), who are at least 40 days post-MI and 3 months status-post CABG/percutaneous coronary intervention (if performed). This patient's MI was treated with percutaneous revascularization 4 months ago, and he is on optimal medical therapy. He has persistent left ventricular dysfunction with an ejection fraction of 25%. The most appropriate next step is to counsel and offer him ICD placement for primary prevention of sudden cardiac death.\n\n(Choice A) Long-term event monitor is indicated to evaluate for arrhythmias causing palpitations or syncope. This patient's dizziness is likely due to orthostatic hypotension, but he also meets criteria for ICD implantation.\n\n(Choice B) Amiodarone is effective for preventing recurrent ventricular arrhythmia in patients with prior myocardial infarction and low ejection fraction. However, its use has not been shown to improve long-term mortality in this patient's setting and is usually not recommended.\n\n(Choice C) Electrophysiological study (EPS) is reserved for patients with an ejection fraction of 35-40%, prior MI, and documented non-sustained VT on Holter monitoring. Inducible ventricular fibrillation or sustained ventricular tachycardia on EPS is an indication for ICD implantation for primary prevention. However, this patient already meets criteria for ICD placement and does not need further evaluation.\n\n(Choice E) Submaximal exercise testing can help risk stratify coronary artery disease patients and assess exercise capacity in heart failure patients awaiting cardiac transplantation. This patient is able to walk 3 miles every day and would likely not benefit from exercise testing.\n\nEducational objective:\nICD therapy for primary prevention of sudden cardiac death is recommended in patients with persistent LVEF ≤ 30% (or ≤35% along with NYHA class II or III symptoms) due to prior MI, who are at least 40 days post myocardial infarction and 3 months status-post percutaneous coronary intervention or CABG (if performed).",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_026",
"system": "Cardiovascular System",
"stem": "A 72-year-old man comes to the office 4 weeks following discharge from the hospital due to an episode of acute decompensated congestive heart failure. The patient feels much better now but claims that he gets tired easily. He becomes short of breath after walking a few blocks on a level surface. He has a history of myocardial infarction, coronary artery bypass grafting, ischemic cardiomyopathy, hypertension, hyperlipidemia, and type 2 diabetes mellitus. The patient has had several hospital admissions for decompensated heart failure over the past 2 years. His home medications include aspirin 81 mg/day, carvedilol 25 mg twice a day, quinapril 40 mg/day, atorvastatin 40 mg/day, furosemide 40 mg/day, and long- acting insulin. Temperature is 37.2 C (99 F), blood pressure is 128/76 mm Hg, pulse is 76/min, and respirations are 16/min. Pulse oximetry is 94% on room air. The patient is in no apparent respiratory distress. Jugular venous pressure is measured at 8 cm H2O. Lung examination reveals clear lung fields with decreased breath sounds at the bases. Cardiac examination reveals normal S1 and S2 along with a 2/6 holosystolic murmur heard over the cardiac apex. There is minimal pitting edema around the ankles.\n\nLaboratory results are as follows:\n\nComplete blood count\nHemoglobin: 12.5 g/dL\n\nSerum chemistry\nPotassium: 3.9 mEq/L\nCreatinine: 1.8 mg/dL\n\nECG is shown in this image. A recent echocardiogram showed a mildly dilated left ventricular cavity with akinesis of the anterior and anteroseptal walls as well as a left ventricular ejection fraction of 30%. Which of the following additional treatments would most benefit this patient?",
"choice_a": "Biventricular pacing",
"choice_b": "Digoxin",
"choice_c": "Hydralazine",
"choice_d": "Metolazone",
"choice_e": "Spironolactone",
"correct_answer": "E",
"explanation": "This patient has severe left ventricular systolic dysfunction due to prior myocardial infarction with New York Heart Association (NYHA) class II symptoms at baseline. The addition of an aldosterone antagonist (eg, spironolactone, eplerenone) to optimal therapy (beta blocker, ACE inhibitor) has been shown to reduce morbidity and mortality in patients with symptomatic heart failure with a left ventricular ejection fraction (LVEF) ≤35%. Aldosterone antagonists should be avoided in patients with significant renal disease (creatinine clearance <30 mL/min) or in patients with hyperkalemia (serum potassium >5 mEq/L). Patients receiving aldosterone antagonists should undergo serial monitoring of serum potassium and renal function.\n\n(Choice A) Cardiac resynchronization therapy with biventricular pacing is recommended in patients in sinus rhythm who have persistent symptoms despite optimal medical therapy, an LVEF ≤35%, a QRS duration 150 msec, and a left bundle branch block. This patient's ECG shows a narrow QRS complex with a duration <120 msec, and biventricular pacing is not indicated at this time.\n\n(Choice B) Digoxin is used as an adjunctive therapy in patients with systolic dysfunction with heart failure who continue to have symptoms despite adequate therapy with an ACE inhibitor, beta blocker, aldosterone antagonist, and diuretics. Digoxin reduces the rate of hospitalization for heart failure, but it has not been shown to improve overall survival. This patient should be started on an aldosterone antagonist first; if he still has symptoms, digoxin could be considered.\n\n(Choice C) Combination therapy with hydralazine and oral nitrates with optimal therapy (eg, beta blocker, ACE inhibitor, aldosterone antagonist if indicated) improves symptoms and survival in select patients (eg, African Americans with NYHA classes III-IV heart failure) with systolic dysfunction. Its use is also recommended in patients who are intolerant of ACE inhibitors and angiotensin receptor blockers, or who have persistent symptoms despite optimal therapy.\n\n(Choice D) Metolazone is a thiazide diuretic that is usually given to patients with peripheral edema (volume overload) refractory to loop diuretics (eg, furosemide). However, this patient has minimal peripheral edema/volume overload and likely would not benefit from metolazone.\n\nEducational objective:\nOptimal medical therapy in patients with heart failure due to left ventricular systolic dysfunction includes diuretics, a beta blocker, an ACE inhibitor, and an aldosterone antagonist. Digoxin and a combination of hydralazine and oral nitrates can be used in symptomatic patients despite optimal medical therapy. Cardiac resynchronization therapy with biventricular pacing is recommended in patients in sinus rhythm who have persistent symptoms despite optimal medical therapy, a left ventricular ejection fraction ≤35%, a QRS duration ≥150 msec, and a left bundle branch block.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_027",
"system": "Cardiovascular System",
"stem": "A 29-year-old woman who immigrated to the United States from India comes to the office to establish care. She has a mild sore throat that she believes may have come from her toddler, who recently had a fever. The patient has no other concerns. She has a history of gestational diabetes during her 2 pregnancies. In childhood, the patient had a febrile illness associated with loss of motor control. She takes no medications and does not use tobacco or alcohol. Temperature is 36.7 C (98.1 F), blood pressure is 130/80 mm Hg, pulse is 70/min, and respirations are 14/min. Examination shows mild erythema of the nasal mucosa and posterior pharynx. Jugular venous pulsation is normal and there is no cervical lymphadenopathy. The lungs are clear. There is a low-pitched diastolic murmur with presystolic accentuation at the apex. Neurologic examination is normal. She is referred for transthoracic echocardiography that shows normal left ventricular function with moderate left atrial enlargement and doming of the mitral valve leaflets in diastole. The estimated mitral valve area is 1.7 cm. There is mild mitral regurgitation. Which of the following is the most appropriate recommendation regarding antibiotic therapy in this patient?",
"choice_a": "Advise oral amoxicillin prior to dental procedures",
"choice_b": "Check antistreptococcal antibody titers to guide therapy",
"choice_c": "Explain that no antibiotic therapy is indicated",
"choice_d": "Initiate penicillin G benzathine injection every 4 weeks",
"choice_e": "Prescribe oral penicillin V potassium for 10 days for sore throat",
"correct_answer": "D",
"explanation": "This patient's childhood history of a febrile illness with movement disorder (chorea) is consistent with previous rheumatic fever complicated by persistent valvular disease (mitral stenosis). Rheumatic fever occurs as a complication of group A beta-hemolytic Streptococcus (GAS) pharyngitis; the initial acute disease and recurrences can be characterized by fever, arthritis, chorea, and heart failure. This patient's current presentation is not consistent with rheumatic fever recurrence; however, the sore throat raises suspicion for GAS pharyngitis. With repeated exposure to GAS, patients with prior rheumatic fever are at high risk for recurrent rheumatic fever and consequent progression of rheumatic heart disease. Therefore, they should receive continuous antibiotic prophylaxis to prevent GAS pharyngitis. Long-acting penicillin G benzathine given intramuscularly every 3-4 weeks is the preferred approach for secondary prevention of rheumatic fever recurrence, and the duration of antibiotic prophylaxis depends on the severity of underlying rheumatic heart disease (presence or absence of carditis and valvular disease). The first dose of intramuscular penicillin would also treat any current GAS colonization/infection. Regardless of whether this patient was previously on antibiotics for rheumatic fever, she should receive an intramuscular dose of penicillin now and should be on continuous antibiotic prophylaxis until age 40 (given her valvular disease).\n\n(Choice A) Antibiotic prophylaxis to lower the risk of infective endocarditis is indicated prior to dental procedures in only patients with the highest-risk cardiac conditions. It is not indicated for rheumatic disease of a native heart valve.\n\n(Choice B) Antistreptococcal antibody titers can be helpful in the initial diagnosis of rheumatic fever, but do not play a role in guiding antibiotic prophylaxis for secondary prevention.\n\n(Choice C) This patient is at risk for further heart damage with recurrent GAS infection, and long-term antibiotic prophylaxis is indicated. Recommending no antibiotic therapy is not appropriate.\n\n(Choice E) Oral penicillin V potassium is an acceptable treatment option for acute GAS pharyngitis (primary prevention of rheumatic fever). It is also an alternate treatment for secondary prevention of rheumatic fever recurrence; however, due to increased failure rates with orally administered antibiotics, intramuscular penicillin G is preferred.\n\nEducational objective:\nPatients with rheumatic fever should receive continuous antibiotic prophylaxis to prevent recurrent GAS pharyngitis and limit the risk of progression of rheumatic heart disease. Intramuscular penicillin G benzathine every 3-4 weeks is preferred, and the duration of therapy is determined by the severity of underlying rheumatic heart disease (presence or absence of carditis and valvular disease).",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_028",
"system": "Cardiovascular System",
"stem": "A 22-year-old man comes to the office due to 6 months of exertional shortness of breath. He describes himself as nonathletic and has never engaged in competitive sports. The patient has recently experienced dyspnea on moderate exertion. He also describes a pounding sensation in his head at night. He does not use tobacco, alcohol, or illicit drugs.\n\nBlood pressure is 150/65 mm Hg and pulse is 90/min. No jugular venous distension is present. There is no digital clubbing or cyanosis. The apical impulse is brisk and displaced to the left. A 2/6 continuous murmur is heard below the left clavicle. Upper and lower extremity pulses are prominent and equal. The lungs are clear on auscultation. If untreated, this patient's risk for which of the following is most increased?",
"choice_a": "Aortic dissection",
"choice_b": "Constrictive pericarditis",
"choice_c": "Infective endarteritis",
"choice_d": "Intracranial aneurysm",
"choice_e": "Mitral stenosis",
"correct_answer": "C",
"explanation": "This patient most likely has an unrepaired patent ductus arteriosus (PDA); the prevalence of PDA is increasing due to improved survival rates of premature infants. Small PDAs are typically asymptomatic and may be detected incidentally due to a continuous murmur in the left infraclavicular region. Moderate-sized PDAs often present later with dyspnea and exercise intolerance due to LV failure: wide pulse pressure, bounding pulses, and a laterally displaced apical impulse are characteristically present. With a large PDA, left-to-right shunting typically leads to left ventricular (LV) volume overload (ie, high- output heart failure) in infancy or early childhood, and if untreated can progress to pulmonary hypertension and Eisenmenger syndrome (right-to-left shunting). Patients with unrepaired PDA are at increased risk for infective endarteritis (PDA-related endocarditis), especially if there is associated pulmonary hypertension. Vegetations typically affect the pulmonary end of the PDA and lead to septic pulmonary emboli. PDA closure may be considered in patients who have had PDA-related endocarditis. Procedural antibiotic prophylaxis is recommended for unrepaired PDA if it is complicated by Eisenmenger syndrome or cyanotic pulmonary hypertension. Prophylaxis is also recommended within 6 months after surgical repair with prosthetic material or if there is a residual defect after surgery.\n\n(Choices A and D) Congenital coarctation of the aorta increases the risk of both aortic dissection and intracranial aneurysm. Patients typically have upper body hypertension and decreased blood flow to the lower extremities. Headaches and epistaxis may be present, and a continuous murmur is common; however, the equal upper and lower extremity pulses in this patient make this diagnosis unlikely.\n\n(Choice B) Constrictive pericarditis can occur due to viral pericarditis, radiation therapy, or tuberculosis, but it is not associated with PDA.\n\n(Choice E) Mitral stenosis most commonly occurs due to rheumatic fever. PDA does not carry a significant association with mitral stenosis.\n\nEducational objective:\nSymptomatic patent ductus arteriosus (PDA) characteristically presents with left ventricular failure accompanied by a continuous murmur, wide pulse pressure, and bounding pulses. Pulmonary hypertension, and in severe cases Eisenmenger syndrome, can also occur. Unrepaired PDA increases the risk of infective endarteritis that typically affects the pulmonary end of the PDA.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_029",
"system": "Cardiovascular System",
"stem": "A 35-year-old woman comes to the office as she missed her period 10 days ago and believes that she may be pregnant. She otherwise has regular monthly menstrual cycles. The patient moved to the United States from South Africa 6 months ago, and has a history of rheumatic heart disease. She had a \"ministroke\" 8 years ago and was found to be in atrial fibrillation at that time; she has since been on warfarin for anticoagulation. The patient took antibiotic prophylaxis for secondary prevention of rheumatic fever with intramuscular penicillin until age 30.\n\nTemperature is 37.2 C (99 F), blood pressure is 122/82 mm Hg, pulse is 96/min, and respirations are 14/min. The lungs are clear to auscultation. Cardiac examination reveals irregular heart sounds, an accentuated S1, and a loud \"snapping\" sound shortly after S2. There is also a faint mid-diastolic murmur heard over the cardiac apex.\n\nUrine pregnancy test is positive. ECG is shown in the exhibit. Which of the following is the best next step in management of this patient?",
"choice_a": "Continue warfarin with close INR monitoring throughout pregnancy",
"choice_b": "Stop warfarin and monitor closely throughout pregnancy",
"choice_c": "Stop warfarin and start daily dabigatran",
"choice_d": "Stop warfarin and start daily subcutaneous unfractionated heparin",
"choice_e": "Stop warfarin and start subcutaneous low-molecular-weight heparin",
"correct_answer": "E",
"explanation": "This patient, who has a history of rheumatic heart disease and physical examination findings of an accentuated S1, a loud \"snapping\" sound after S2 (opening snap), and a mid-diastolic murmur, has rheumatic mitral stenosis. Atrial fibrillation in the setting of mitral stenosis is associated with high thromboembolic risk, and this patient should continue anticoagulation therapy throughout pregnancy. Low-molecular-weight heparin (LMWH) is recommended in such patients until the final few weeks of pregnancy, at which time therapy is often transitioned to unfractionated heparin (UFH) for easier reversibility during labor and delivery. Both LMWH and UFH are not associated with teratogenicity and do not cross the placental barrier to cause fetal anticoagulation.\n\n(Choice A) Warfarin is associated with teratogenicity (eg, skeletal abnormalities) and can cross the placental barrier, leading to fetal bleeding. Low-dose warfarin ≤5 mg/day appears to provide a higher safety margin, and continuing this regimen throughout pregnancy (including the first trimester) is a potential option for pregnant patients with mechanical heart valves. However, pregnant patients with any other indication for anticoagulation (eg, atrial fibrillation, venous thromboembolism) and those with higher dose requirements (>5 mg/day) should be managed with subcutaneous LMWH.\n\n(Choice B) This patient is at high risk for systemic thromboembolism during pregnancy and requires anticoagulation. Monitoring without anticoagulation would not be appropriate.\n\n(Choice C) Oral direct thrombin inhibitors (eg, dabigatran) and factor Xa inhibitors (eg, apixaban, rivaroxaban, edoxaban) are not indicated in patients with valvular atrial fibrillation. Furthermore, these drugs do not have adequate safety and efficacy information for use during pregnancy.\n\n(Choice D) Subcutaneous UFH every 12 hours (not daily) is indicated for anticoagulation during pregnancy in patients with severe renal insufficiency (creatinine clearance < 30 mg/mL). However, when possible, the use of LMWH is preferred due to the lower risk of heparin-induced thrombocytopenia.\n\nEducational objective:\nWarfarin can cross the placental barrier and is associated with fetal bleeding and risk of teratogenicity when used during pregnancy. With the possible exception of patients on low-dose warfarin for a mechanical heart valve, all others who require anticoagulation during pregnancy should be switched to low-molecular- weight or unfractionated heparin.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_030",
"system": "Cardiovascular System",
"stem": "A 22-year-old African American man is evaluated for an abnormal ECG obtained at a health fair. He has no complaints and says that he has been healthy all his life. He runs 6-8 miles a day and plays basketball for several hours every weekend. The patient has no symptoms during physical activity. His paternal uncle suffered from diabetes mellitus and died of a heart attack at age 50. His mother had a minor stroke at age 40.\n\nExamination shows a muscular, well-built man. His blood pressure is 132/90 mm Hg on the right arm and 137/85 mm Hg on the left. His pulse is 54/min. Lungs are clear on auscultation, he has normal first and second heart sounds, and peripheral pulses are full and symmetric. ECG shows high voltage in precordial leads and downsloping ST-segment depression with T-wave inversion in leads V4-V6. An echocardiogram shows left ventricular hypertrophy with septal thickness of 18 mm and posterior wall thickness of 12 mm (normal ≤10 mm). There is no valvular disease, systolic anterior motion of the mitral valve, or left ventricular outflow tract gradient at rest or with Valsalva maneuver. Which of the following is the most likely diagnosis?",
"choice_a": "Athlete's heart",
"choice_b": "Coronary artery anomaly",
"choice_c": "Hypertensive heart disease",
"choice_d": "Hypertrophic cardiomyopathy",
"choice_e": "Sarcoidosis",
"correct_answer": "D",
"explanation": "The most likely diagnosis in this patient is hypertrophic cardiomyopathy (HCM), an autosomal dominant genetic disease. Depending on the degree of hypertrophy and left ventricular outflow obstruction, patients with HCM may have no symptoms at all or severe symptoms (eg, dyspnea, fatigue, chest pain, palpitations, and syncope). HCM must be distinguished from other causes of left ventricular hypertrophy (LVH). The diagnosis of HCM is generally suspected by evidence of LVH on ECG and confirmed by echocardiography. ECG often shows prominent Q waves in inferior and lateral leads, representing septal depolarization. The diagnostic criterion of HCM is LV wall thickness of 215 mm (anywhere in the LV wall) that is not readily explained by another cause (eg, hypertension and aortic stenosis). The degree and distribution of hypertrophy in HCM can be quite variable and include asymmetric septal, apical, left ventricular free wall, or concentric hypertrophy. This patient's LV septal wall thickness of 18 mm is consistent with HCM (regardless of the posterior wall thickness of 12 mm).\n\n(Choice A) Athlete's heart is a term describing the physiologic increase in left ventricular wall thickness, cavity size, and mass that occurs in response to intense endurance training or exercise. In athlete's heart, LVH is generally symmetric and ≤12 mm. By contrast, in patients with HCM, LVH is frequently asymmetric (as seen in this patient) and wall thickness is ≥15 mm. ECG can show increased QRS voltage in both athlete's heart and HCM; however, Q waves and T wave inversions (as seen in this patient) are more consistent with HCM. Sinus bradycardia at rest is a common feature in well-trained endurance athletes and is due to increased vagal tone induced by exercise conditioning. It will not help differentiate HCM from athlete's heart.\n\n(Choice B) Coronary artery anomalies are not associated with LVH. They are usually asymptomatic or can cause exertional angina due to compression of an anomalous coronary artery coursing between the aortic root and main pulmonary trunk.\n\n(Choice C) This patient has no history or evidence of severe hypertension. The increase in wall thickness in LVH due to hypertension is generally symmetric and usually <15 mm.\n\n(Choice E) Cardiac sarcoidosis commonly presents with conduction abnormalities, including heart block, ventricular arrhythmias, and heart failure, due to systolic or diastolic dysfunction. Severe LVH is not seen with cardiac sarcoidosis.\n\nEducational objective:\nHypertrophic cardiomyopathy (HCM) is an autosomal dominant genetic disorder characterized by left ventricular hypertrophy (LVH) of variable morphology. In HCM, LVH is frequently asymmetric and wall thickness is ≥15 mm; in individuals with athlete's heart, it is generally symmetric and wall thickness is ≤12 mm.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_031",
"system": "Cardiovascular System",
"stem": "A 46-year-old man comes to the emergency department after awakening with dyspnea and diaphoresis this morning. He has had 6 weeks of fever, increased weakness, and fatigue. The patient underwent a root canal procedure 4 months ago but reports that he has been otherwise healthy. He has no history of cardiovascular disease, pulmonary disease, or cardiac surgery. Temperature is 38.4 C (101.1 F), blood pressure is 144/76 mm Hg. pulse is 106/min, and respirations are 28/min. The patient is diaphoretic and appears uncomfortable. There are no skin rashes. The pupils are equal, round, and reactive without conjunctival lesions or suffusion. There is no neck stiffness or meningeal signs. A short, early diastolic murmur is heard at the left sternal border. Coarse inspiratory crackles are heard bilaterally halfway up the lung fields. The spleen is not palpable. His speech is abnormal. Chest x-ray reveals pulmonary congestion. Transthoracic echocardiogram shows a 7-mm, mobile echodensity on the aortic valve with high-grade aortic regurgitation. MRI of the brain reveals a small area of acute infarction in the left frontal lobe. Blood cultures are obtained and empiric antibiotics are initiated. Noninvasive positive-pressure ventilation is started with some improvement in respiratory distress. Which of the following is an indication for cardiac valve surgery in this patient?",
"choice_a": "Aortic valve involvement",
"choice_b": "Embolic left frontal lobe infarct",
"choice_c": "High-grade valvular regurgitation",
"choice_d": "Signs of acute heart failure",
"choice_e": "Size of the vegetation",
"correct_answer": "D",
"explanation": "This patient has developed subacute infective endocarditis (IE) likely due to bacteremia at the time of his recent root canal procedure. Medical management with long-term intravenous antibiotics is often successful in treating IE; however, early surgical intervention (ie, valvular repair or replacement prior to the completion of a full antibiotic course) is sometimes required. Vegetations in IE can impair valve leaflet coaptation and lead to valvular regurgitation and heart failure. Acute heart failure due to IE has a >90% mortality rate, which is reduced to 75% with medical therapy and 25% with surgical intervention. Therefore, signs of acute heart failure (eg, pulmonary edema) are a strong indication for early surgical intervention for IE.\n\n(Choice A) The location of IE alone (eg, aortic valve, mitral valve) does not indicate the need for surgery.\n\n(Choice B) This patient's brain MRI findings are with consistent with an acute septic embolic stroke that occurred prior to the initiation of antibiotics. This is not an indication for valvular surgery as the risk of septic embolization usually decreases rapidly once antibiotics are initiated. However, a systemic embolic event while on appropriate antibiotics would warrant surgical intervention.\n\n(Choice C) The cardiovascular system may be able to compensate for gradually developed valvular regurgitation. Therefore, echocardiographic evidence of high-grade valvular regurgitation alone is not an indication for surgery unless it causes acute heart failure.\n\n(Choice E) Large vegetation size may increase the likelihood of septic embolization. Current guidelines recommend early surgical intervention for a mobile aortic or mitral valve vegetation >10 mm in the setting of a prior systemic embolic event. This patient's 7-mm aortic valve vegetation in the setting of a prior systemic embolic event is not an indication for early surgical intervention.\n\nEducational objective:\nEarly surgical intervention is sometimes required in the management of infective endocarditis. Valvular regurgitation complicated by acute heart failure is a strong indication for early valvular repair or replacement. Other surgical indications include uncontrollable infection and embolic complications while on appropriate antibiotics.",
"source": "ABIM - Cardiovascular System -1.pdf" },
{
"id": "cardio_032",
"system": "Cardiovascular System",
"stem": "A 55-year-old man comes to the physician complaining of an episode of rectal bleeding. His past medical history includes chronic constipation for which he takes over-the-counter laxatives. He also has a history of intravenous drug use and an episode of tricuspid and mitral valve infective endocarditis 15 years ago. Since that episode, he has stopped using illicit drugs. The patient has a 20-pack-year smoking history and drinks 1-2 cans of beer daily. Family history is not significant. He is allergic to penicillin.\n\nHis vital signs are within normal limits. Physical examination shows no abnormalities. Stool is positive for occult blood.\n\nThe patient is scheduled for a colonoscopy.\n\nWhich of the following is the most appropriate next step in management?",
"choice_a": "Cephalexin prior to the procedure",
"choice_b": "Clindamycin prior to the procedure",
"choice_c": "Perform transthoracic echocardiogram",
"choice_d": "Proceed with the colonoscopy",
"choice_e": "Vancomycin prior to the procedure",
"correct_answer": "D",
"explanation": "This patient has a history of infective endocarditis (IE), which places him at high risk for developing a recurrent episode. However, current guidelines do not recommend routine antibiotic prophylaxis for the prevention of IE in patients undergoing gastrointestinal (eg, colonoscopy) or genitourinary procedures (eg, cystoscopy), even in those at high risk for IE. Antibiotic prophylaxis should be considered only for patients with the highest-risk cardiac conditions (eg, prosthetic heart valves, prior history of IE, unrepaired cyanotic congenital heart disease) who are undergoing dental procedures involving manipulation of the gingival tissue or the periapical region of the teeth or perforation of the oral mucosa. If a high-risk patient undergoing a GI or GU procedure has an active infection (eg, enterococcal urinary tract infection), then antibiotic therapy directed at the offending organism is indicated. This patient is currently asymptomatic and should proceed with colonoscopy without antibiotic prophylaxis.\n\n(Choices A, B, and E) Antibiotic prophylaxis is not indicated prior to colonoscopy in this patient.\n\n(Choice C) Routine echocardiography prior to procedures is not indicated in patients without new or worsening cardiac symptoms (eg, dyspnea, chest pain).\n\nEducational objective:\nAntibiotic prophylaxis for the prevention of infective endocarditis is not recommended for patients undergoing gastrointestinal or genitourinary procedures, even in those at high risk (eg, prior history of infective endocarditis). Prophylaxis is reserved for patients with the highest-risk cardiac conditions undergoing high-risk dental procedures.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_033",
"system": "Cardiovascular System",
"stem": "A 74-year-old man is hospitalized for an episode of acute decompensated heart failure. He was treated with intravenous loop diuretics and responded with significant diuresis. The patient has a history of nonischemic cardiomyopathy with a left ventricular ejection fraction of 25%, hypertension, and hyperlipidemia. His medications include lisinopril, carvedilol, and atorvastatin. Blood pressure is 106/62 mm Hg and pulse is 62/min. A 24-hour holter monitor performed during the hospitalization showed approximately 4,000 premature ventricular contractions and several episodes of non-sustained ventricular tachycardia (up to 4-5 beats). Which of the following is the most appropriate next step in management of the holter monitor findings?",
"choice_a": "Add amiodarone",
"choice_b": "Add mexiletine",
"choice_c": "Add sotalol",
"choice_d": "ICD placement",
"choice_e": "No specific treatment",
"correct_answer": "E",
"explanation": "Nonsustained ventricular tachycardia (NSVT) is common in patients with heart failure and systolic dysfunction, and its frequency and duration increase with the severity of the disease. In patients with nonischemic cardiomyopathy, NSVT has not been clearly shown to be a predictor of sudden cardiac death. As a result, in the absence of symptoms (eg, palpitations, syncope), specific antiarrhythmic therapy for NSVT is not indicated. These patients should instead be treated with optimal medical therapy for heart failure (eg, beta blockers, ACE inhibitors, aldosterone antagonists). Routine suppression of NSVT with antiarrhythmic drugs has not been shown to improve survival and may even increase mortality.\n\n(Choices A, B, and C) Antiarrhythmic therapy with drugs such as amiodarone, mexiletine, or sotalol is not indicated for asymptomatic NSVT in this patient.\n\n(Choice D) An implantable cardioverter-defibrillator (ICD) is recommended for primary prevention of sudden cardiac death in patients with symptomatic heart failure and an ejection fraction ≤35% (NYHA class II or III) or an ejection fraction ≤30% (NYHA class I) who have a life expectancy of >1 year. This patient has nonischemic cardiomyopathy and should be treated with optimal medical therapy for at least 3-6 months before being considered for ICD placement. In patients with ischemic cardiomyopathy, an ICD is recommended at least 40 days after a myocardial infarction.\n\nEducational objective:\nNonsustained ventricular tachycardia (NSVT) is common in patients with heart failure and systolic dysfunction. In the absence of symptoms, specific antiarrhythmic therapy for NSVT is not indicated. Treatment should focus on optimal medical therapy for the underlying heart failure.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_034",
"system": "Cardiovascular System",
"stem": "A 56-year-old man comes to the physician for an initial visit. He was recently diagnosed with hypertension at a health fair and has no other medical problems. He does not smoke, drink alcohol, or use illicit drugs. He has a 30-minute daily walking program and follows a healthy diet. His blood pressure in the office today is 154/96 mm Hg. Physical examination, including cardiac auscultation, is unremarkable. Fasting glucose, electrolytes, and renal function are normal. Fasting lipid panel reveals LDL of 140 mg/dL, HDL of 45 mg/dL, and triglycerides of 160 mg/dL. He is started on lisinopril. Which of the following is the most appropriate next step in the management of this patient?",
"choice_a": "Add amlodipine",
"choice_b": "Check 24-hour urine for metanephrines",
"choice_c": "Perform exercise stress test",
"choice_d": "Perform renal artery duplex ultrasound",
"choice_e": "Schedule follow-up in one month",
"correct_answer": "E",
"explanation": "This patient has newly diagnosed stage 2 hypertension (blood pressure ≥140/90 mm Hg). According to current guidelines, the goal blood pressure for most patients is <130/80 mm Hg. For patients with stage 2 hypertension, initial therapy with two antihypertensive agents from different classes is often recommended. However, for patients with stage 1 hypertension (130-139/80-89 mm Hg), a single agent is typically started. This patient has been started on lisinopril and should be reassessed in approximately one month to evaluate the response to therapy and monitor for adverse effects (eg, cough, hyperkalemia, creatinine elevation).\n\n(Choice A) While starting two agents is an option for stage 2 hypertension, it is also reasonable to start with one agent and titrate or add a second agent based on the follow-up blood pressure. Since he has already been started on lisinopril, the next step is follow-up.\n\n(Choices B and D) Evaluation for secondary causes of hypertension (eg, pheochromocytoma, renal artery stenosis) is not indicated in the absence of suggestive features such as resistant hypertension, sudden onset, or abdominal bruit.\n\n(Choice C) Routine exercise stress testing is not indicated in asymptomatic patients with newly diagnosed hypertension.\n\nEducational objective:\nPatients started on antihypertensive therapy should be reassessed in approximately one month to evaluate the blood pressure response and monitor for potential adverse effects of the medication.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_035",
"system": "Cardiovascular System",
"stem": "A 68-year-old man with a history of hypertension and hyperlipidemia comes to the emergency department with sudden-onset, severe chest pain that radiates to his back. The pain is described as 'tearing' and began 30 minutes ago. On physical examination, his blood pressure is 190/110 mm Hg in the right arm and 160/90 mm Hg in the left arm. He has a 3/6 diastolic decrescendo murmur at the right sternal border. His lungs are clear. Which of the following is the most appropriate next step in management?",
"choice_a": "Aspirin and heparin",
"choice_b": "CT angiography of the chest",
"choice_c": "Intravenous labetalol",
"choice_d": "Refer for emergent surgery",
"choice_e": "Transthoracic echocardiogram",
"correct_answer": "C",
"explanation": "This patient's presentation (sudden-onset tearing chest pain radiating to the back, blood pressure discrepancy, and a new aortic regurgitation murmur) is highly suggestive of an acute Type A aortic dissection. Type A dissections involve the ascending aorta and are a surgical emergency. The initial management focus for all patients with suspected aortic dissection is to reduce heart rate and blood pressure to limit the shear stress on the aortic wall. Intravenous beta blockers (eg, labetalol, esmolol) are first-line therapy to achieve a target heart rate of <60/min and a systolic blood pressure between 100-120 mm Hg.\n\n(Choice A) Aspirin and heparin are indicated for acute coronary syndromes but should be avoided in patients with suspected aortic dissection as they can worsen bleeding into the false lumen.\n\n(Choice B) CT angiography is an excellent diagnostic tool for aortic dissection, but initial stabilization of heart rate and blood pressure is the priority.\n\n(Choice D) While Type A dissection requires emergent surgery, stabilization must be initiated first.\n\n(Choice E) Transthoracic echocardiogram has limited sensitivity for detecting aortic dissection compared to TEE or CT angiography.\n\nEducational objective:\nThe initial management of acute aortic dissection involves rapid reduction of heart rate and blood pressure using intravenous beta blockers to minimize aortic wall shear stress.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_036",
"system": "Cardiovascular System",
"stem": "A 42-year-old man comes to the office for follow-up of palpitations. He reports feeling a 'skipping' or 'thumping' sensation in his chest several times a day. He has no chest pain, shortness of breath, or syncope. He drinks 2-3 cups of coffee daily and does not smoke. Physical examination is unremarkable. An ECG shows normal sinus rhythm with occasional premature ventricular contractions (PVCs). A 24-hour Holter monitor shows a total of 500 PVCs in 24 hours. Echocardiogram shows normal cardiac structure and function. Which of the following is the most appropriate next step in management?",
"choice_a": "Amiodarone",
"choice_b": "Electrophysiological study",
"choice_c": "Metoprolol",
"choice_d": "Radiofrequency ablation",
"choice_e": "Reassurance",
"correct_answer": "E",
"explanation": "Premature ventricular contractions (PVCs) are common and often benign in patients with no structural heart disease. For asymptomatic or minimally symptomatic patients with a low PVC burden and normal echocardiogram, no specific treatment is required other than reassurance and avoidance of triggers (eg, caffeine, tobacco, stress). If symptoms are significantly bothersome, beta blockers or calcium channel blockers can be used as first-line therapy.\n\n(Choice A) Amiodarone has a significant side effect profile and is not indicated for the management of benign PVCs.\n\n(Choice B) Electrophysiological studies are not indicated for low-burden, asymptomatic PVCs.\n\n(Choice C) Metoprolol is a treatment option if symptoms are distressing, but reassurance is the most appropriate initial step for mild symptoms.\n\n(Choice D) Radiofrequency ablation is reserved for patients with a very high PVC burden (usually >10-15% of total beats) that leads to PVC-induced cardiomyopathy or for those who remain highly symptomatic despite medical therapy.\n\nEducational objective:\nIn patients with no structural heart disease and a low burden of premature ventricular contractions, reassurance and avoidance of triggers are the most appropriate management steps.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_037",
"system": "Cardiovascular System",
"stem": "A 65-year-old man with a history of hypertension and a 40-pack-year smoking history comes for a routine visit. He has no symptoms. His blood pressure is 138/84 mm Hg. According to the United States Preventive Services Task Force (USPSTF) guidelines, which of the following screening tests should be performed?",
"choice_a": "Carotid artery duplex ultrasound",
"choice_b": "Computed tomography of the chest",
"choice_c": "Exercise stress test",
"choice_d": "One-time abdominal aortic ultrasound",
"choice_e": "Transthoracic echocardiogram",
"correct_answer": "D",
"explanation": "The USPSTF recommends a one-time screening for abdominal aortic aneurysm (AAA) with ultrasonography in men aged 65 to 75 who have ever smoked (defined as ≥100 cigarettes in their lifetime). Screening is not routinely recommended for men who have never smoked or for women.\n\n(Choice A) Screening for carotid artery stenosis in asymptomatic adults is not recommended.\n\n(Choice B) While annual screening for lung cancer with low-dose CT is recommended for certain smokers, this patient's age and smoking history need to meet specific criteria (age 50-80 and ≥20 pack-year history).\n\n(Choice C) Exercise stress testing is not recommended for screening asymptomatic adults for coronary artery disease.\n\n(Choice E) Routine echocardiography is not recommended for screening asymptomatic adults.\n\nEducational objective:\nMen aged 65 to 75 who have ever smoked should undergo a one-time screening for abdominal aortic aneurysm with ultrasonography.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_038",
"system": "Cardiovascular System",
"stem": "A 32-year-old woman at 28 weeks gestation comes to the emergency department with sudden-onset palpitations and lightheadedness. She has no chest pain or shortness of breath. Her blood pressure is 105/65 mm Hg and heart rate is 180/min and regular. The ECG shows a narrow-complex supraventricular tachycardia with no visible P waves. Vagal maneuvers are unsuccessful. Which of the following is the most appropriate next step in management?",
"choice_a": "Adenosine",
"choice_b": "Amiodarone",
"choice_c": "Diltiazem",
"choice_d": "Metoprolol",
"choice_e": "Synchronized cardioversion",
"correct_answer": "A",
"explanation": "The management of supraventricular tachycardia (SVT) in pregnancy is similar to that in non-pregnant patients. Vagal maneuvers are the initial step. If unsuccessful, intravenous adenosine is the first-line pharmacologic agent. Adenosine is safe in pregnancy as it has a very short half-life and does not cross the placenta in significant amounts.\n\n(Choice B) Amiodarone should be avoided in pregnancy if possible due to the risk of fetal thyroid dysfunction and other potential toxicities.\n\n(Choices C and D) Diltiazem and metoprolol can be used for rate control or termination of SVT if adenosine is unsuccessful, but adenosine is the preferred first-line agent for acute termination.\n\n(Choice E) Synchronized cardioversion is indicated for SVT in pregnancy if the patient is hemodynamically unstable or if pharmacologic therapy fails.\n\nEducational objective:\nIntravenous adenosine is the first-line pharmacologic treatment for the acute termination of supraventricular tachycardia in pregnant patients who are hemodynamically stable.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_039",
"system": "Cardiovascular System",
"stem": "A 78-year-old man comes to the office for follow-up of an abdominal aortic aneurysm (AAA). The AAA was incidentally discovered 2 years ago on a CT scan for kidney stones. At that time, it measured 3.8 cm. A follow-up ultrasound 1 year ago showed the AAA was 4.0 cm. His current ultrasound today shows the AAA is 4.3 cm. He has no abdominal or back pain. His blood pressure is 135/80 mm Hg and he takes lisinopril and atorvastatin. He quit smoking 10 years ago. Which of the following is the most appropriate next step in management?",
"choice_a": "Refer for elective surgical repair",
"choice_b": "Refer for endovascular aneurysm repair",
"choice_c": "Repeat ultrasound in 6-12 months",
"choice_d": "Repeat ultrasound in 3 years",
"choice_e": "Start aspirin and clopidogrel",
"correct_answer": "C",
"explanation": "The frequency of surveillance for an abdominal aortic aneurysm (AAA) depends on its size. For an AAA measuring 4.0 to 4.9 cm, follow-up with ultrasound or CT every 6 to 12 months is recommended. Surgical or endovascular repair is typically indicated for an AAA ≥5.5 cm in men (≥5.0 cm in women) or for an AAA that is rapidly expanding (≥0.5 cm in 6 months or ≥1.0 cm in a year), even if the patient is asymptomatic.\n\n(Choices A and B) This patient's AAA is 4.3 cm and is not rapidly expanding, so repair is not yet indicated.\n\n(Choice D) A 3-year interval is appropriate for a smaller AAA (eg, 3.0 to 3.9 cm).\n\n(Choice E) While smoking cessation and statin therapy are important, dual antiplatelet therapy is not standard for AAA management.\n\nEducational objective:\nAbdominal aortic aneurysms measuring 4.0 to 4.9 cm should be monitored with serial imaging every 6 to 12 months.",
"source": "ABIM - Cardiovascular System -2.pdf" },
{
"id": "cardio_040",
"system": "Cardiovascular System",
"stem": "A 58-year-old man comes to the physician for a follow-up of typical atrial flutter. He has been taking metoprolol for rate control, but he continues to experience episodes of palpitations and fatigue. He has no other medical problems. Echocardiogram shows normal heart structure and function. Which of the following is the most appropriate next step to restore and maintain sinus rhythm?",
"choice_a": "Adenosine",
"choice_b": "AV nodal blocking agents",
"choice_c": "Flecainide",
"choice_d": "Radiofrequency ablation",
"choice_e": "Sotalol",
"correct_answer": "D",
"explanation": "Radiofrequency ablation has an excellent success rate in restoring and maintaining sinus rhythm in patients with typical atrial flutter. It is generally preferred over long-term antiarrhythmic agents as a safe and effective first-line treatment in such patients.\n\n(Choice A) Adenosine is useful for acute termination of AV nodal reentrant tachycardia. However, it has no role in patients with atrial flutter.\n\n(Choice B) AV nodal blocking agents (i.e., calcium channel blockers, beta-blockers, or digoxin) are frequently used in patients with atrial flutter or fibrillation with rapid ventricular rates. In contrast to atrial fibrillation, typical atrial flutter is relatively difficult to control with pharmacologic agents. Radiofrequency ablation has emerged as a safe and effective first-line treatment option in such patients.\n\n(Choices C and E) Flecainide is a class IC antiarrhythmic agent and is occasionally used to maintain sinus rhythm in patients with paroxysmal atrial fibrillation. Sotalol is a class III antiarrhythmic agent. These drugs have marginal efficacy and a significant side effect profile. They are generally not preferred for restoring or maintaining sinus rhythm in patients with typical atrial flutter.\n\nEducational objective:\nRadiofrequency ablation has an excellent success rate in restoring and maintaining sinus rhythm in patients with typical atrial flutter. It is generally preferred over long-term antiarrhythmic agents as a safe and effective first-line treatment in such patients.",
"source": "ABIM - Cardiovascular System -2.pdf" },
  {
    "id": "cardio_041",
    "system": "Cardiovascular System",
    "stem": "A 54-year-old man comes to the physician with chest discomfort. During the last 6 months, the patient has had left-sided chest pain radiating to the left shoulder, which is commonly provoked by exertion but also occurs at rest. The chest pain lasts a few seconds to several minutes, and he can usually \"walk it off.\" Past medical history includes hypertension, hyperlipidemia, and peptic ulcer disease. The patient received a permanent pacemaker 6 years ago after an episode of syncope. His father also had a pacemaker. Current medications include lisinopril, amlodipine, famotidine, and rosuvastatin.\n\nHis blood pressure is 111/70 mm Hg and pulse is 67/min. Chest is clear to auscultation. No cardiac murmurs or carotid bruits are appreciated. The abdomen is nontender. Pulses are full and symmetric bilaterally.\n\nElectrocardiogram shows normal sinus rhythm with paced ventricular complexes (atrial sensed, ventricular paced rhythm).\n\nWhich of the following is the best next step in management of this patient?",
    "choice_a": "Coronary angiography",
    "choice_b": "Exercise echocardiography",
    "choice_c": "Exercise electrocardiogram (ECG) testing",
    "choice_d": "Exercise radionuclide imaging",
    "choice_e": "Pharmacologic radionuclide imaging",
    "correct_answer": "E",
    "explanation": "The pretest probability of coronary heart disease (CHD) is used to determine the need for noninvasive diagnostic evaluation or coronary angiography in patients with suspected chest pain symptoms. This patient has probable but not classic chest pain and an intermediate pretest probability of CHD (between 20%-80%) based on his age, gender, and symptoms. The next step in management is to perform a noninvasive evaluation with exercise or pharmacologic stress testing. Current guidelines recommend an exercise electrocardiogram (ECG) stress test without imaging as the preferred initial test in most patients with an intermediate pretest probability of CHD as the test also provides useful information about symptoms, functional capacity, and hemodynamic response to exercise. However, ST-segment changes during exercise ECG testing provide no diagnostic information in patients with paced ventricular rhythm or underlying left bundle branch block (LBBB) (Choice C). Also, a paced ventricular rhythm produces false-positive perfusion defects on exercise radionuclide myocardial perfusion imaging (Choice D). In such patients, pharmacologic radionuclide imaging (with adenosine, dipyridamole, or regadenoson) is preferred for evaluation of suspected CHD.\n\n(Choice A) Coronary angiography is a reasonable alternate test in patients with a high probability of CHD (greater than 90%). However, this patient has an intermediate probability of CHD and should be evaluated initially with a pharmacologic stress test.\n\n(Choice B) In patients with paced ventricular rhythm, a resting echocardiogram shows paradoxical septal motion due to early activation of the right ventricle. These findings can become more pronounced with exercise and lead to false-positive abnormalities.\n\nEducational objective:\nPharmacologic radionuclide perfusion imaging should be performed to evaluate suspected coronary heart disease in patients with paced ventricular rhythm or left bundle branch block.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_042",
    "system": "Cardiovascular System",
    "stem": "A 49-year-old woman comes to the office to discuss her risk of heart disease. Her husband recently died of an acute myocardial infarction, and she says, \"I need to take care of myself so I can be there for my kids.\" The patient's medical history is unremarkable and she takes no medications. Her mother died of dementia at age 76, and her father died of chronic obstructive pulmonary disease at age 68. She has a 30-pack-year smoking history but quit after her husband's heart attack, and she drinks a can of beer every day. The patient has a sedentary occupation and does not engage in regular exercise. Blood pressure is 129/79 mm Hg and pulse is 80/min. BMI is 32 kg/m². Physical examination shows central obesity but is otherwise unremarkable.\n\nLaboratory results are as follows:\n\nFasting lipid panel\nTotal cholesterol 196 mg/dL\nHDL 42 mg/dL\nLDL (calculated) 121 mg/dL\nTriglycerides 166 mg/dL\nGlucose 108 mg/dL\n\nIn addition to providing guidance on increasing physical activity, which of the following is the most appropriate recommendation to reduce the risk of cardiovascular disease in this patient?",
    "choice_a": "Add an antioxidant vitamin supplement to reduce the risk of coronary events",
    "choice_b": "Eliminate alcohol intake to reduce the risk of heart failure",
    "choice_c": "Initiate a low-carbohydrate diet to facilitate weight loss",
    "choice_d": "Initiate a Mediterranean-style diet to reduce the risk of cardiovascular mortality",
    "choice_e": "Restrict sodium intake to 1,500 mg/day to reduce the risk of stroke",
    "correct_answer": "D",
    "explanation": "This patient has quit smoking, which, if sustained, is associated with a reduced risk of heart disease. However, she also has mild obesity, elevated blood pressure, hyperglycemia, and suboptimal lipid values, all of which are likely to worsen with age and increase her cardiovascular risk. These risk factors do not require medication at this time, but the patient would benefit from changes in lifestyle to address them now. The Mediterranean-style diet emphasizes plant-based foods (eg, fruits, vegetables, whole grains, nuts), olive oil (in place of butter), fish and poultry (in place of red meat), and moderate salt intake. Studies have found reductions in the risk of cardiac events and cardiovascular mortality with the Mediterranean diet compared with a conventional diet. Alternately, the similar Dietary Approaches to Stop Hypertension (DASH) diet has been shown to lower blood pressure and can reduce the risk of cardiovascular disease. Either of these dietary interventions would be appropriate for this patient.\n\n(Choice A) Diets high in antioxidant-containing foods (eg, DASH diet, Mediterranean diet) are associated with a lower risk of coronary events. However, randomized trials of antioxidant supplements have consistently shown no benefit in preventing coronary events.\n\n(Choice B) Heavy alcohol intake (>4 drinks/day for men, >2 drinks/day for women) is associated with an increased risk of heart failure. However, this patient's moderate alcohol intake has minimal impact on her risk of heart failure and is associated with a slightly reduced overall cardiovascular risk.\n\n(Choice C) Both low-fat and low-carbohydrate diets are effective for weight loss, but evidence for reduced cardiac risk is weak. Patients who adhere to either the DASH diet or the Mediterranean diet frequently lose weight, and these programs are likely more effective for reducing cardiac risk.\n\n(Choice E) A moderate reduction in sodium intake may be helpful for some patients. However a very-low sodium diet (eg, <1,500 mg/day) is unlikely to benefit most individuals, is difficult to sustain, and is generally advised only for patients with uncontrolled hypertension.\n\nEducational objective:\nLifestyle interventions that can reduce the risk of cardiovascular disease include regular physical exercise, a Mediterranean-style diet, the Dietary Approaches to Stop Hypertension (DASH) diet, smoking cessation, and moderate but not excessive alcohol intake.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_043",
    "system": "Cardiovascular System",
    "stem": "A 20-year-old man comes to the office for a sports physical. The patient has played varsity basketball since high school. He has had no chest pain, shortness of breath, palpitations, or fainting spells. He has no medical history and takes no medications. There is no family history of sudden death. Blood pressure is 115/75 mm Hg, pulse is 56/min, and BMI is 22 kg/m². The patient is in no distress. The apical precordial impulse is hyperdynamic. There is a normal S1 and S2, and an S4 is heard. He has a 2/6 systolic murmur at the left sternal border that increases with Valsalva maneuver. The lungs are clear to auscultation. The abdomen is soft and nondistended. Peripheral pulses demonstrate a rapid upstroke followed by a decline and secondary rise. Tranthoracic echocardiogram reveals interventricular septal thickness of 1.8 cm (normal: <1.1 cm) and posterior left ventricular wall thickness of 0.9 cm (normal: <1.1 cm). Left ventricular ejection fraction is 75%. At rest, there is no left ventricular outflow gradient; however, Valsalva maneuver generates a gradient of 30 mm Hg. Which of the following is the most appropriate recommendation for this patient?",
    "choice_a": "Alcohol septal ablation",
    "choice_b": "Avoid high-intensity physical activity",
    "choice_c": "Implantable cardioverter defibrillator",
    "choice_d": "Metoprolol",
    "choice_e": "Nifedipine",
    "correct_answer": "B",
    "explanation": "This patient's presentation is consistent with hypertrophic cardiomyopathy (HCM), defined as left ventricular wall thickness ≥15 mm (1.5 cm) (at any location) in the absence of other potential causes (eg, hypertension, valvular heart disease). Patients with HCM may remain asymptomatic, or they may develop dyspnea, orthopnea, palpitations, chest pain, dizziness, or syncope. Exertional myocardial ischemia can lead to sustained ventricular arrhythmia and sudden cardiac death (SCD); HCM is the most common cause of SCD in young athletes. To lower the risk of SCD, patients with probable or definite HCM should not participate in high-intensity competitive sports regardless of the presence of symptoms, degree of wall thickness or left ventricular outflow tract (LVOT) obstruction, or prior treatment.\n\n(Choice A) Alcohol septal ablation or surgical septal myectomy is indicated for HCM patients with severe LVOT obstruction (resting or Valsalva gradient >50 mm Hg) and heart failure symptoms that are refractory to optimal medical therapy. This patient is currently asymptomatic; therefore, these procedures are not indicated.\n\n(Choice C) An implantable cardioverter defibrillator (ICD) is generally indicated for primary prevention in patients with risk factors for SCD (eg, left ventricular wall thickness >30 mm, family history of SCD due to HCM) and for secondary prevention in patients who survive an episode of sustained ventricular arrhythmia.\n\n(Choice D) Medical therapy with negative inotropic agents (eg, beta blockers, nondihydropyridine calcium channel blockers, disopyramide) is recommended in patients with LVOT obstruction and symptoms of heart failure. It is not currently indicated in this asymptomatic patient.\n\n(Choice E) Dihydropyridine calcium channel blockers (eg, amlodipine, nifedipine) as well as other vasodilators (eg, ACE inhibitors) and diuretics should be avoided in patients with HCM as they decrease afterload and can worsen LVOT obstruction and symptoms.\n\nEducational objective:\nPatients with probable or definite hypertrophic cardiomyopathy, the most common cause of sudden cardiac death (SCD) in young athletes, should be instructed to avoid competitive sports or high-intensity physical activity.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_044",
    "system": "Cardiovascular System",
    "stem": "A 32-year-old paramedic comes to the office for a routine health maintenance examination. He has had headaches for the past several months as well as episodes of nosebleeds. He has no other medical problems. The patient does not use tobacco or illicit drugs but drinks 1 or 2 cans of beer daily. He has no family history of heart failure or sudden death. Temperature is 36.1 C (97 F); blood pressure is 188/96 mm Hg in the right arm, 184/94 mm Hg in the left arm, and 114/76 mm Hg in the right leg; pulse is 68/min, and respirations are 14/min. Height is 180 cm (5 ft 11 in). Examination reveals no audible carotid bruits. There is a 2/6 mid-systolic murmur heard at the left sternal border as well as a continuous \"rumbling\" sound heard in the back over the interscapular area. Diagnostic testing is most likely to demonstrate which of the following findings?",
    "choice_a": "Atrial septal defect",
    "choice_b": "Bicuspid aortic valve",
    "choice_c": "Pulmonic stenosis",
    "choice_d": "Right ventricular dysplasia",
    "choice_e": "Wolff-Parkinson-White syndrome",
    "correct_answer": "B",
    "explanation": "This patient most likely has secondary hypertension due to coarctation of the aorta (CoA). A congenital narrowing of the descending aorta leads to proximal hypertension and decreased blood flow to the lower extremities. Asymptomatic hypertension of the upper body is the most common adult presentation, but patients can have headaches, epistaxis, lower extremity claudication, or symptoms of heart failure. On physical examination, brachial-femoral pulse delay strongly suggests the diagnosis. In addition, patients frequently have a continuous murmur, due to blood flow through collateral vessels (eg, intercostal arteries), that is best heard at the posterior interscapular area. An accompanying systolic murmur in a patient with CoA is typically the result of a coexisting cardiac lesion. Congenital bicuspid aortic valve is the most common defect associated with CoA (in approximately 40% of cases) and can be identified by echocardiography. Other commonly associated defects include ventricular septal defect, patent ductus arteriosus, and subvalvular or supravalvular aortic stenosis.\n\n(Choice A) Atrial septal defect (primum type) is seen in patients with Down syndrome but is not associated with CoA.\n\n(Choice C) Pulmonic stenosis is seen in association with tetralogy of Fallot and congenital rubella syndrome but does not have a significant association with CoA.\n\n(Choice D) Right ventricular dysplasia is characterized by a combination of regional or global right ventricular abnormalities, characteristic fibrofatty changes on tissue biopsy, arrhythmias, and a family history of sudden death, but it is not associated with CoA.\n\n(Choice E) Wolff-Parkinson-White syndrome is seen in up to 20% of patients with Ebstein anomaly of the tricuspid valve; however, it is not associated with CoA.\n\nEducational objective:\nCoarctation of the aorta is a congenital narrowing of the descending aorta that causes upper body hypertension and may lead to lower body claudication. It is associated with several other congenital cardiac defects, with bicuspid aortic valve being the most common.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_045",
    "system": "Cardiovascular System",
    "stem": "A 60-year-old man comes to the office for presurgical evaluation before right-sided total knee replacement. He has pain and limited mobility due to severe knee osteoarthritis, and has gained 4.5 kg (10 lb) over the last 6 months due to decreased physical activity. Other medical problems include coronary artery disease, hypertension, and hyperlipidemia. Four months ago, the patient underwent sirolimus-eluting stent implantation into the left anterior descending artery due to angina. Current medications are low-dose aspirin, prasugrel, metoprolol, valsartan, and rosuvastatin. ECG shows sinus rhythm with no pathologic Q waves or ST-segment abnormalities. Echocardiogram shows normal left ventricular systolic function and no wall motion abnormalities. Which of the following is the best recommendation for this patient before surgery?",
    "choice_a": "Continue aspirin, discontinue prasugrel",
    "choice_b": "Continue both antiplatelet medications",
    "choice_c": "Continue prasugrel, discontinue aspirin",
    "choice_d": "Hold both antiplatelet medications",
    "choice_e": "Postpone surgery",
    "correct_answer": "E",
    "explanation": "Dual antiplatelet therapy (DAPT) with aspirin and a P2Y12 inhibitor (eg, clopidogrel, prasugrel, ticagrelor) is recommended after intracoronary stent implantation to prevent stent thrombosis and subsequent myocardial infarction. Current guidelines recommend uninterrupted DAPT for at least 6-12 months after stent implantation to allow adequate endothelialization of the stent material. After that time, aspirin should be continued indefinitely. Whenever possible, elective noncardiac surgery should be postponed until at least 6 months after stent placement (or 1 month after bare-metal stent placement). If surgery cannot be delayed, DAPT (or at least aspirin alone) should be continued throughout the perioperative period to minimize the risk of catastrophic stent thrombosis. However, both drugs may need to be discontinued in patients undergoing surgery in which perioperative bleeding may cause significant morbidity, such as neurosurgery (Choice D).\n\n(Choices A and C) This patient had DES placement 4 months ago and needs DAPT with aspirin and prasugrel for a minimum of 2 more months. Whenever possible, elective surgery should be postponed until the minimum recommended duration of DAPT is completed.\n\n(Choice B) Continuing both aspirin and prasugrel increases the risk of perioperative bleeding; delaying surgery is preferred.\n\nEducational objective:\nCurrent guidelines recommend uninterrupted dual antiplatelet therapy with aspirin and a P2Y12 inhibitor (eg, clopidogrel, prasugrel, ticagrelor) for at least 6-12 months after intracoronary stent placement. Whenever possible, elective noncardiac surgery should be postponed until the minimum recommended duration of dual antiplatelet therapy is completed.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_046",
    "system": "Cardiovascular System",
    "stem": "A 35-year-old woman comes to the physician for follow-up of hypertension. When the patient was seen in the office two weeks ago, her blood pressure was 145/95 mm Hg initially and 140/92 mm Hg after recheck. Since then, she had her blood pressure taken three times at a nearby pharmacy, with readings averaging 120/80 mm Hg. The patient has no symptoms and feels \"pretty healthy.\" She takes no medications. The patient's father has hypertension and coronary artery disease, which required coronary artery bypass grafting. Her mother has hypertension and type 2 diabetes mellitus. The patient regularly salts her food before tasting it. She drinks alcohol socially and does not use tobacco or illicit drugs. The patient works as an information technology consultant and exercises moderately three times a week. Blood pressure during this visit is 149/94 mm Hg initially and 138/94 mm Hg after 20 minutes. BMI is 28 kg/m². The ocular fundi appear normal. Physical examination is unremarkable. A complete blood count, urinalysis, and comprehensive metabolic panel are normal. Serum creatinine is 0.9 mg/dL. ECG shows normal sinus rhythm and T wave inversion in leads V1 and V2. Which of the following is the best next step in management of this patient's blood pressure?",
    "choice_a": "Evaluate for pheochromocytoma",
    "choice_b": "Obtain echocardiogram to evaluate for left ventricular hypertrophy",
    "choice_c": "Order 24-hour ambulatory blood pressure monitoring",
    "choice_d": "Schedule repeat office blood pressure checks",
    "choice_e": "Start low-dose thiazide diuretic",
    "correct_answer": "C",
    "explanation": "This patient has elevated blood pressure in the physician's office and normal blood pressure outside the office, consistent with \"white coat\" hypertension. In such patients, 24-hour ambulatory blood pressure monitoring (ABPM) is indicated to more fully characterize the blood pressure pattern. ABPM measures and records pulse and blood pressure at 15- to 20-minute intervals during the day and at 30- to 60-minute intervals at night. ABPM more closely predicts future cardiovascular events and all-cause mortality than either physician's office or home blood pressure measurements. If ABPM results are normal and the patient has no evidence of end-organ damage, antihypertensive therapy may be deferred (Choice E). However, patients with white coat hypertension have an increased risk of developing sustained hypertension and warrant close long-term follow-up.\n\n(Choice A) In addition to hypertension, pheochromocytoma also causes episodic palpitations, tremor, and diaphoresis. Pheochromocytoma is a rare disorder, and this patient's lack of symptoms makes it even less likely. Additional evaluation could be considered if episodic, severe hypertension is noted on ABPM.\n\n(Choice B) Echocardiography is not necessary for routine evaluation of hypertension in asymptomatic patients. T wave inversion in only the right precordial leads is usually a normal finding and does not indicate left ventricular dysfunction or hypertensive heart disease.\n\n(Choice D) Initial elevations in blood pressure taken during office visits often decline on subsequent checks, possibly due to increased patient comfort or statistical regression to the mean. However, this patient has mild but persistent office blood pressure elevations, and ABPM can more readily differentiate white coat hypertension from sustained hypertension.\n\nEducational objective:\n\"White coat\" hypertension refers to elevated blood pressure in the physician's office with normal blood pressure readings elsewhere. In such patients, 24-hour ambulatory blood pressure monitoring can more fully characterize the blood pressure pattern and is a better predictor of future cardiovascular events and all-cause mortality than are office or home blood pressure measurements.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_047",
    "system": "Cardiovascular System",
    "stem": "A 26-year-old man comes to the physician for a pre-employment physical evaluation. He has no known medical problems. The patient weighs 65 kg (143.3 lb) and is 190.5 cm (6' 3\") tall. There is a faint early diastolic murmur best heard in the second right intercostal space. He has mild scoliosis. Physical examination findings in the extremities show positive wrist (thumb overlaps other fingers when wrapped around the contralateral wrist) and thumb (entire distal phalanx protrudes beyond the ulnar border of a clenched fist) signs. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Antinuclear antibody test",
    "choice_b": "Chromosomal karyotype analysis",
    "choice_c": "Serum homocystine and methionine level",
    "choice_d": "Skin biopsy",
    "choice_e": "Transthoracic echocardiogram",
    "correct_answer": "E",
    "explanation": "Aortic regurgitation (early diastolic murmur at the second right intercostal space) in association with long extremities and scoliosis are suggestive of Marfan syndrome (MFS) with aortic root dilation. MFS is an autosomal dominant disorder that causes abnormalities in the skeleton, eyes (lens dislocation), and cardiovascular system. This patient also has positive wrist and thumb signs due to long slender fingers (arachnodactyly). Aortic root dilation can be found in approximately 50% of children and 60%-80% of adults with MFS. Aortic dissection is the cause of death in 30%-45% of patients, followed by heart failure. Transthoracic echocardiography is recommended at the initial diagnosis and at routine intervals for close monitoring of the aortic root and ascending aorta. Elective operation is recommended for aortic root diameter ≥50 mm to reduce the risk of aortic dissection or rupture.\n\n(Choice A) Antinuclear antibody testing is used for the diagnosis of systemic lupus erythematosus (SLE) and other autoimmune diseases. There is no association with MFS.\n\n(Choice B) Chromosomal karyotype analysis is indicated for diagnosis of Klinefelter syndrome (KS). KS is characterized by hypogonadism, gynecomastia, and learning disabilities. There are usually no cardiac abnormalities associated with KS.\n\n(Choice C) Homocystinuria is an autosomal recessive disorder that presents with fair complexion, Marfanoid body habitus, developmental delays, and hypercoagulability. It is not associated with aortic root dilation.\n\n(Choice D) Skin biopsy is not helpful for MFS diagnosis but may be performed in the evaluation of patients with Ehlers-Danlos syndrome.\n\nEducational objective:\nAortic root disease, leading to aneurysmal dilation and dissection, is a common complication of Marfan syndrome, and is the main cause of morbidity and mortality in these patients. Transthoracic echocardiogram is recommended at initial diagnosis and at regular follow-up intervals.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_048",
    "system": "Cardiovascular System",
    "stem": "A 37-year-old school teacher comes to the physician for a preventive care appointment. She denies any current symptoms, and she has not seen a doctor for many years. She takes over-the-counter vitamin and calcium supplements. She does not smoke and she drinks alcohol only on social occasions. Her temperature is 37.2 C (99 F), blood pressure is 122/80 mm Hg, pulse is 84/min, and respirations are 14/min. Jugular venous pressure is normal. Cardiac auscultation reveals wide and fixed splitting of the second heart sound. There is a 2/6 mid-systolic ejection murmur heard best over the left second intercostal space. The remainder of her physical examination is unremarkable.\n\nWhich of the following would most likely be present on her electrocardiogram?",
    "choice_a": "Abnormal Q waves in the inferior leads",
    "choice_b": "Electrical alternans",
    "choice_c": "Left ventricular hypertrophy",
    "choice_d": "Right bundle branch block",
    "choice_e": "Short PR interval and delta waves",
    "correct_answer": "D",
    "explanation": "This patient has the classic physical examination findings of a large atrial septal defect (ASD) with a left-to-right shunt. Depending on the duration and the size of the shunt, ASD patients can develop a number of ECG abnormalities. The QRS complex can become slightly prolonged with a characteristic rSr' or rsR' configuration, causing an incomplete or complete right bundle branch block pattern on ECG. Other ECG changes include first degree AV block, right axis deviation, and P wave changes suggestive of right atrial enlargement.\n\n(Choice A) Inferior Q waves can be seen in prior myocardial infarction and various cardiomyopathies but are not associated with ASD.\n\n(Choice B) Electrical alternans refers to a cyclic beat-to-beat variation in the QRS axis and amplitude and is most frequently seen in patients with significant pericardial effusion.\n\n(Choice C) Pulmonary hypertension and right ventricular hypertrophy can develop in patients with an unrecognized, large ASD. Left ventricular hypertrophy is not typically seen.\n\n(Choice E) A short PR interval and delta waves are classically seen in patients with Wolf-Parkinson-White pattern.\n\nEducational objective:\nECG abnormalities commonly seen in patients with an atrial septal defect include first degree AV block, right axis deviation, and incomplete or complete right bundle branch block.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_049",
    "system": "Cardiovascular System",
    "stem": "A 32-year-old white man is referred for evaluation of a murmur noted on a pre-employment physical. He has no specific complaints. He is physically active and runs 4-5 miles almost every day. His older brother died of presumed sudden cardiac arrest at age 37 years. On physical examination, there is a wide, fixed splitting of the second heart sound. A faint mid-systolic ejection murmur is heard best over the left second intercostal space. Otherwise, his physical examination is unremarkable. An echocardiogram confirms the presence of a large secundum atrial septal defect. Which of the following is the most likely explanation for the murmur?",
    "choice_a": "Dilatation of the main pulmonary artery",
    "choice_b": "Increased flow through the pulmonic valve",
    "choice_c": "Increased flow through the tricuspid valve",
    "choice_d": "Prolapse of the anterior mitral leaflet",
    "choice_e": "Shunt flow through the atrial septal defect",
    "correct_answer": "B",
    "explanation": "Patients with atrial septal defect (ASD) and moderate-to-large left-to-right shunt have increased flow through the pulmonic valve. This produces a mid-systolic ejection murmur resulting from increased flow across the pulmonic valve. Another characteristic finding is the presence of wide and fixed splitting of the second heart sound.\n\n(Choice A) Dilatation of the pulmonary artery is associated with pulmonic regurgitation and a low-pitched diastolic murmur.\n\n(Choice C) Patients with large ASD and significant left-to-right shunting have increased flow across the tricuspid valve that produces a mid-diastolic murmur that does not increase with inspiration.\n\n(Choice D) Mitral valve prolapse produces a single or multiple clicks, followed by a late systolic murmur.\n\n(Choice E) The low-velocity left-to-right shunt flow across the atrial septal defect produces no audible murmur.\n\nEducational objective:\nAtrial septal defect with moderate-to-large left-to-right shunt causes a mid-systolic ejection murmur due to increased flow through the pulmonic valve.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_050",
    "system": "Cardiovascular System",
    "stem": "A 42-year-old woman comes to the physician before undergoing tooth extraction. She recently saw a dentist for lower jaw pain and was told that she needs extraction of a left lower molar. She has a past history of rheumatic heart disease and had mitral valve replacement at 35 years of age with a mechanical valve. She moved to the United States from the Philippines 3 years ago. Her past medical history is otherwise unremarkable. She takes warfarin daily and has been taking amoxicillin for the past 7 days for presumed \"tooth infection.\" Physical examination reveals crisp opening and closing clicks of a mechanical prosthetic mitral valve. No abnormal murmurs are heard. Her last INR was 2.6. Which of the following is the most appropriate management for this patient?",
    "choice_a": "Continue warfarin and proceed with dental extraction",
    "choice_b": "Hold warfarin, give subcutaneous vitamin K, and proceed with dental extraction",
    "choice_c": "Hold warfarin until INR is <1.5, bridge with subcutaneous enoxaparin, and proceed with dental extraction",
    "choice_d": "Hold warfarin, wait until INR is <1.5, and proceed with dental extraction",
    "choice_e": "Hold warfarin, wait until INR is <2.0, and proceed with dental extraction",
    "correct_answer": "A",
    "explanation": "In patients with a mechanical prosthetic valve undergoing elective surgery, the decision to continue or hold warfarin anticoagulation is based on the risk of systemic thromboembolism and the risk of post-procedure bleeding. The presence of a mechanical prosthetic mitral valve puts the patient at a high risk for systemic thromboembolism. In patients undergoing low risk surgical procedures, such as dental extraction, warfarin anticoagulation is associated with a minimal risk of serious bleeding and should be continued through the procedure.\n\n(Choice B) Withholding warfarin and administration of subcutaneous vitamin K will lead to a subtherapeutic INR and expose the patient to the risk of systemic thromboembolism.\n\n(Choice C) Holding warfarin and bridging therapy with subcutaneous enoxaparin is not indicated in this situation due to minimal bleeding risk.\n\n(Choices D & E) Warfarin should not be held for dental extraction as it exposes the patient to an excessive and unnecessary risk of systemic thromboembolism from a mechanical prosthetic mitral valve.\n\nEducational objective:\nIn patients undergoing low risk surgical procedures (e.g., dental extraction, excisional skin biopsy, cataract surgery), warfarin anticoagulation is associated with a minimal risk of serious bleeding and should be continued through the procedure.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_051",
    "system": "Cardiovascular System",
    "stem": "A 64-year-old man with diet-controlled type 2 diabetes mellitus, ischemic cardiomyopathy, and systolic heart failure comes to the physician for follow-up. The patient has New York Heart Association functional class II symptoms and shows no signs of fluid overload. His daily medications include furosemide, carvedilol, lisinopril, atorvastatin, and low-dose aspirin. The patient's blood pressure is 155/90 mm Hg and pulse is 60/min. His potassium level is 4.2 mEq/L and serum creatinine level is 0.9 mg/dL. Adding losartan to this patient's current regimen is most likely to result in which of the following?",
    "choice_a": "Higher risk for heart failure-associated hospital admission",
    "choice_b": "Higher risk for renal failure",
    "choice_c": "Lower risk for all-cause mortality",
    "choice_d": "Lower risk for arrhythmia",
    "choice_e": "Lower risk for hyperkalemia",
    "correct_answer": "B",
    "explanation": "Blockade of the renin-angiotensin system with ACE inhibitors or angiotensin receptor blockers (ARBs) significantly improves cardiovascular outcomes and overall mortality in patients with congestive heart failure due to left ventricular systolic dysfunction. However, dual blockade with both ACE inhibitors and ARBs has not been shown to provide any significant improvement in cardiovascular or all-cause mortality compared to monotherapy alone (Choice C). In addition, dual therapy is associated with an increased risk for hyperkalemia (Choice E), symptomatic hypotension, and worsening renal function and therefore is not recommended.\n\n(Choice A) While not improving mortality or total hospitalizations, dual blockade of the renin-angiotensin system with ACE inhibitors and ARBs is associated with a reduction in the risk of heart failure-associated hospital admission.\n\n(Choice D) Dual therapy is not associated with any significant change in the risk of arrhythmia compared to monotherapy alone.\n\nEducational objective:\nDual blockade of the renin-angiotensin system with both ACE inhibitors and ARBs does not provide any significant benefit to cardiovascular or all-cause mortality over ACE inhibitors alone. Dual therapy is associated with an increased risk for hyperkalemia, hypotension, and worsening renal function.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_052",
    "system": "Cardiovascular System",
    "stem": "An 86-year-old woman is evaluated in the office for a 2-month history of lightheadedness with episodes of near-syncope and imbalance that last for seconds. She has had no syncope or falls. The patient lives in a personal care home and performs most of her daily activities with some assistance. Her medical problems include mild Alzheimer dementia, hypertension, coronary artery disease with coronary artery bypass grafting, and mitral valve repair 10 years ago. Her medications include aspirin, quinapril, amlodipine, simvastatin, and donepezil.\n\nHer blood pressure is 162/82 mm Hg supine and 155/85 mm Hg standing. Her pulse is 50/min. Pulse oximetry is 96% on room air. She is alert and oriented to time and place. Cardiac examination shows a II/VI holosystolic murmur present at the apex. There are no carotid bruits. Lungs are clear to auscultation. ECG shows sinus bradycardia and QRS complex duration of 98 msec.\n\nWhich of the following is the best next step in management of this patient?",
    "choice_a": "Adding clonidine for better blood pressure control",
    "choice_b": "Discontinuation of donepezil",
    "choice_c": "Discontinuation of quinapril",
    "choice_d": "Pharmacologic stress testing",
    "choice_e": "Tilt table testing",
    "correct_answer": "B",
    "explanation": "Sinus bradycardia is usually asymptomatic and does not require treatment. However, a minority of patients become symptomatic. In these patients, reversible causes (eg, offending medications) should be addressed prior to further workup or intervention (eg, pacemaker). Donepezil, a cholinesterase inhibitor, can cause bradycardia or heart blocks, even in patients without prior history of conduction abnormalities. Its use has been associated with dizziness and syncopal spells in Alzheimer disease patients. As a result, the next step for this patient should be to discontinue the drug and monitor for symptom resolution.\n\n(Choice A) Clonidine can cause bradycardia and should not be used in this patient.\n\n(Choice C) ACE inhibitors can cause dizziness due to blood pressure reduction, but this patient has no orthostatic hypotension.\n\n(Choice D) A pharmacologic stress test is not needed at this time as the patient's absence of other angina symptoms makes CAD with LV dysfunction a less likely cause of bradycardia.\n\n(Choice E) Tilt table study is useful for vasovagal or neurocardiogenic syncope, which should be considered if symptoms continue despite stopping donepezil.\n\nEducational objective:\nA number of drugs can depress the sinoatrial node and cause symptomatic sinus bradycardia. All medications with this potential should be withdrawn or discontinued in symptomatic patients before further evaluation or treatment. These common medications include digoxin, beta blockers, calcium channel blockers, clonidine, amiodarone, and donepezil.",
    "source": "ABIM - Cardiovascular System -2.pdf"   },
  {
    "id": "cardio_053",
    "system": "Cardiovascular System",
    "stem": "A 62-year-old retired firefighter is brought to the emergency department due to shortness of breath. The patient has been fairly active most of his life and had been walking 2-3 miles a day until 2 months ago. For the past several weeks he has had progressive fatigue and shortness of breath. He becomes symptomatic after walking only a few blocks on a level surface. The patient has gained 4.5-kg (10-lb) over the last 2 months. Last night he suddenly woke up \"gasping for air\" and could not get comfortable in any position. He has no significant medical history and has had no recent illnesses. The patient takes no regular medications. He has a 40-pack-year smoking history and drinks 4-6 beers a day.\n\nOn physical examination, the patient appears comfortable at rest. Temperature is 37.2 C (99 F), blood pressure is 112/72 mm Hg, pulse is 92/min, and respirations are 22/min. Pulse oximetry shows 88% on room air. Jugular venous pressure is measured at 14 cm H2O. Lung examination reveals decreased breath sounds at the bases with bilateral crackles up to the lower one-third of the chest. Cardiac examination reveals irregular heart tones with an audible S3 over the cardiac apex. A 2/6 holosystolic murmur is heard over the cardiac apex. The patient has 2+ pitting edema of the lower extremities up to the level of the mid-calf. Which of the following is the most likely diagnosis?",
    "choice_a": "Constrictive pericarditis",
    "choice_b": "Cor pulmonale",
    "choice_c": "Dilated cardiomyopathy",
    "choice_d": "Hypertrophic cardiomyopathy",
    "choice_e": "Restrictive cardiomyopathy",
    "correct_answer": "C",
    "explanation": "This patient's clinical presentation (progressive dyspnea, paroxysmal nocturnal dyspnea, elevated jugular venous pressure, pulmonary crackles, S3, and peripheral edema) is consistent with acute decompensated heart failure due to left ventricular systolic dysfunction. Dilated cardiomyopathy (DCM) is characterized by ventricular dilation and impaired systolic function and is the most common cause of non-ischemic heart failure. Alcohol-induced cardiomyopathy is a common cause of DCM and should be suspected in patients with significant daily alcohol consumption. Atrial fibrillation, as suggested by the irregular heart tones in this patient, is often seen in DCM and can further exacerbate heart failure symptoms.\n\n(Choice A) Constrictive pericarditis typically presents with signs of right-sided heart failure (eg, elevated JVP, peripheral edema, ascites) and a pericardial knock, but pulmonary congestion is generally absent.\n\n(Choice B) Cor pulmonale refers to right-sided heart failure due to pulmonary disease. While this patient has a smoking history, his S3 and significant pulmonary edema suggest a primary left-sided cardiac process.\n\n(Choice D) Hypertrophic cardiomyopathy usually presents with exertional symptoms and a systolic ejection murmur that increases with Valsalva; it does not typically present with the global ventricular dilation seen in DCM.\n\n(Choice E) Restrictive cardiomyopathy often presents with right-sided heart failure symptoms that dominate over left-sided symptoms, and the ventricular size is usually normal or small with preserved systolic function.\n\nEducational objective:\nDilated cardiomyopathy is characterized by ventricular dilation and impaired systolic function. Alcohol-induced cardiomyopathy is a significant cause and should be considered in patients with a history of heavy alcohol use.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_054",
    "system": "Cardiovascular System",
    "stem": "A 74-year-old man comes to the office for evaluation of palpitations. He reports that for the past 2 weeks he has had intermittent episodes of a 'racing' heart rate accompanied by mild lightheadedness. These episodes occur at rest and during physical activity. He has a history of hypertension and takes lisinopril. On physical examination, his pulse is 135/min and irregular. His blood pressure is 128/76 mm Hg. The remainder of the examination is unremarkable. An ECG shows atrial fibrillation with rapid ventricular response. Which of the following is the best initial management for heart rate control in this patient?",
    "choice_a": "Amiodarone",
    "choice_b": "Digoxin",
    "choice_c": "Diltiazem",
    "choice_d": "Flecainide",
    "choice_e": "Sotalol",
    "correct_answer": "C",
    "explanation": "Rate control is the preferred initial management strategy for most patients with atrial fibrillation (AF). Beta blockers (eg, metoprolol, atenolol) or non-dihydropyridine calcium channel blockers (eg, diltiazem, verapamil) are first-line agents for rate control in AF. These medications work by increasing the refractory period of the atrioventricular (AV) node, thereby slowing the ventricular rate. Diltiazem is effective for achieving both acute and long-term rate control.\n\n(Choice A) Amiodarone is primarily a rhythm-control agent and is generally not used for initial rate control unless other agents are contraindicated or ineffective.\n\n(Choice B) Digoxin is typically a second-line agent for rate control and is less effective than beta blockers or calcium channel blockers, especially during exercise.\n\n(Choices D and E) Flecainide and sotalol are rhythm-control agents used to maintain sinus rhythm after cardioversion and have no role in initial rate control.\n\nEducational objective:\nNon-dihydropyridine calcium channel blockers (eg, diltiazem) and beta blockers are first-line agents for rate control in patients with atrial fibrillation.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_055",
    "system": "Cardiovascular System",
    "stem": "A 58-year-old woman comes to the emergency department with a 4-hour history of severe, constant, substernal chest pain. She describes the pain as pressure-like and says it radiates to her left jaw. She has nausea and has vomited twice. Medical history includes hypertension and type 2 diabetes mellitus. Her medications include lisinopril and metformin. On examination, she is diaphoretic and appears in distress. Her blood pressure is 158/94 mm Hg and heart rate is 102/min. The lungs are clear. An ECG shows 3-mm ST-segment elevation in leads V2-V5. Which of the following is the most appropriate next step in management?",
    "choice_a": "Intravenous alteplase",
    "choice_b": "Intravenous nitroglycerin",
    "choice_c": "Oral aspirin and clopidogrel",
    "choice_d": "Primary percutaneous coronary intervention",
    "choice_e": "Transthoracic echocardiogram",
    "correct_answer": "D",
    "explanation": "This patient is presenting with an acute anterior ST-elevation myocardial infarction (STEMI). For patients with STEMI, the goal is rapid reperfusion of the occluded coronary artery. Primary percutaneous coronary intervention (PCI) is the preferred reperfusion strategy if it can be performed within 90 minutes of first medical contact (or 120 minutes if transfer to a PCI-capable facility is required). Reperfusion therapy should be initiated as soon as possible to minimize myocardial necrosis.\n\n(Choice A) Fibrinolytic therapy (eg, alteplase) is indicated if primary PCI cannot be performed within the recommended timeframes.\n\n(Choice B) Nitroglycerin provides symptomatic relief but does not provide definitive reperfusion and should not delay PCI.\n\n(Choice C) While antiplatelet therapy is essential, it is given as adjunctive therapy to the primary reperfusion strategy.\n\n(Choice E) While an echocardiogram may show wall motion abnormalities, it should not delay emergency reperfusion in the setting of a diagnostic ECG.\n\nEducational objective:\nPrimary percutaneous coronary intervention is the preferred reperfusion strategy for patients with acute ST-elevation myocardial infarction.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_056",
    "system": "Cardiovascular System",
    "stem": "A 65-year-old man comes to the office for follow-up of a heart murmur. He is asymptomatic and exercises regularly. He was diagnosed with moderate calcific aortic stenosis 2 years ago. His blood pressure is 132/78 mm Hg. On examination, a 3/6 mid-systolic ejection murmur is heard at the right upper sternal border. S2 is normal. Carotid pulses are normal. A recent echocardiogram shows an aortic valve area of 1.2 cm² and a mean gradient of 25 mm Hg. The left ventricular ejection fraction is 60%. Which of the following is the best next step in management?",
    "choice_a": "Aortic valve replacement",
    "choice_b": "Exercise stress testing",
    "choice_c": "Repeat echocardiogram in 6-12 months",
    "choice_d": "Repeat echocardiogram in 3-5 years",
    "choice_e": "Start a beta blocker",
    "correct_answer": "C",
    "explanation": "This patient has asymptomatic moderate aortic stenosis (defined as an aortic valve area of 1.0-1.5 cm² or a mean gradient of 20-40 mm Hg). Asymptomatic patients with moderate aortic stenosis should undergo clinical evaluation annually and repeat echocardiography every 1-2 years to monitor for progression of the stenosis or development of left ventricular dysfunction.\n\n(Choice A) Aortic valve replacement is indicated for symptomatic severe aortic stenosis or for asymptomatic severe aortic stenosis with a left ventricular ejection fraction <50%.\n\n(Choice B) Exercise stress testing is generally reserved for patients with severe aortic stenosis who claim to be asymptomatic to confirm their symptom status.\n\n(Choice D) Repeat echocardiogram every 3-5 years is appropriate for mild aortic stenosis.\n\n(Choice E) Beta blockers have no role in the management of aortic stenosis itself, though they may be used for other indications like hypertension or CAD.\n\nEducational objective:\nAsymptomatic patients with moderate aortic stenosis should be monitored with clinical evaluation and repeat echocardiography every 1-2 years.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_057",
    "system": "Cardiovascular System",
    "stem": "A 72-year-old woman with a history of hypertension and heart failure with reduced ejection fraction (LVEF 30%) comes for a routine visit. She is currently taking lisinopril, carvedilol, and furosemide. Her symptoms are well-controlled (NYHA class II). Her blood pressure is 124/76 mm Hg and pulse is 68/min. Laboratory results show a potassium of 4.0 mEq/L and a creatinine of 1.1 mg/dL. Which of the following additional medications has been shown to improve survival in this patient?",
    "choice_a": "Amlodipine",
    "choice_b": "Digoxin",
    "choice_c": "Hydralazine",
    "choice_d": "Isosorbide mononitrate",
    "choice_e": "Spironolactone",
    "correct_answer": "E",
    "explanation": "Aldosterone antagonists (eg, spironolactone, eplerenone) have been shown to reduce morbidity and mortality in patients with symptomatic heart failure with reduced ejection fraction (HFrEF) who are already receiving optimal therapy with an ACE inhibitor and a beta blocker. They are recommended for patients with NYHA class II-IV heart failure and an LVEF ≤35%. Criteria for initiation include a serum potassium <5.0 mEq/L and adequate renal function (creatinine ≤2.5 mg/dL in men, ≤2.0 mg/dL in women).\n\n(Choice A) Amlodipine can be used for blood pressure control in heart failure but has not been shown to improve survival.\n\n(Choice B) Digoxin reduces heart failure hospitalizations but does not improve survival.\n\n(Choices C and D) The combination of hydralazine and isosorbide dinitrate improves survival in specific populations (eg, African Americans with class III-IV HFrEF) or those unable to tolerate ACE inhibitors/ARBs.\n\nEducational objective:\nAldosterone antagonists are recommended for patients with symptomatic heart failure and reduced ejection fraction to improve survival.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_058",
    "system": "Cardiovascular System",
    "stem": "A 25-year-old woman comes to the office for evaluation of syncopal episodes. She reports three episodes over the past year. Each episode was preceded by a feeling of warmth, nausea, and lightheadedness. On two occasions, she was standing in a crowded room, and once she was having blood drawn. She regained consciousness within seconds after falling. She has no family history of sudden death. On examination, her vital signs are normal and there are no cardiac murmurs. An ECG is normal. Which of the following is the most likely diagnosis?",
    "choice_a": "Arrhythmogenic right ventricular cardiomyopathy",
    "choice_b": "Brugada syndrome",
    "choice_c": "Long QT syndrome",
    "choice_d": "Orthostatic hypotension",
    "choice_e": "Vasovagal syncope",
    "correct_answer": "E",
    "explanation": "This patient's presentation is classic for neurocardiogenic (vasovagal) syncope. It is characterized by specific triggers (eg, prolonged standing, emotional stress, painful stimuli) and a typical prodrome (eg, nausea, warmth, diaphoresis, pallor). The episodes are brief and recovery is rapid. In a young patient with a normal physical examination and ECG, and no concerning family history, reassurance and education on avoiding triggers and using physical counterpressure maneuvers are usually sufficient.\n\n(Choices A, B, and C) These conditions can cause life-threatening arrhythmias leading to syncope, but would typically be associated with an abnormal ECG or a family history of sudden cardiac death.\n\n(Choice D) Orthostatic hypotension typically occurs immediately upon standing and is diagnosed by a significant drop in blood pressure with position changes.\n\nEducational objective:\nVasovagal syncope is characterized by specific triggers and a prodrome of autonomic symptoms in patients with structurally normal hearts.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_059",
    "system": "Cardiovascular System",
    "stem": "A 52-year-old man with a history of hypertension and a 30-pack-year smoking history comes to the office with a 2-month history of pain in his left calf when he walks more than two blocks. The pain is relieved with rest. On physical examination, his left dorsalis pedis pulse is diminished. The ankle-brachial index (ABI) is 0.75 on the left and 0.95 on the right. In addition to smoking cessation and a supervised exercise program, which of the following is the most appropriate initial medical therapy?",
    "choice_a": "Aspirin and atorvastatin",
    "choice_b": "Cilostazol",
    "choice_c": "Pentoxifylline",
    "choice_d": "Rivaroxaban",
    "choice_e": "Warfarin",
    "correct_answer": "A",
    "explanation": "This patient has symptomatic peripheral artery disease (PAD) with intermittent claudication. The primary goals of management are to reduce the risk of cardiovascular events (MI, stroke) and improve functional capacity. All patients with PAD should receive antiplatelet therapy (eg, aspirin or clopidogrel) and high-intensity statin therapy (eg, atorvastatin or rosuvastatin) for secondary prevention of cardiovascular disease.\n\n(Choice B) Cilostazol is used for symptom relief in patients with claudication who do not respond adequately to exercise and smoking cessation, but it is not the initial step for risk reduction.\n\n(Choice C) Pentoxifylline has limited efficacy and is generally not recommended.\n\n(Choices D and E) Anticoagulation is generally not indicated for stable PAD unless there is another indication like AF or VTE.\n\nEducational objective:\nInitial medical management of peripheral artery disease includes antiplatelet and high-intensity statin therapy for cardiovascular risk reduction.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_060",
    "system": "Cardiovascular System",
    "stem": "A 78-year-old woman is brought to the emergency department after a syncopal episode. She was sitting in a chair when she suddenly slumped over. She regained consciousness after about 30 seconds. She has no preceding symptoms. Her medical history includes hypertension and chronic kidney disease. Her blood pressure is 142/84 mm Hg and heart rate is 45/min. An ECG shows a second-degree AV block with a 2:1 conduction ratio. Which of the following is the most appropriate management?",
    "choice_a": "Atropine",
    "choice_b": "Carotid sinus massage",
    "choice_c": "Exercise stress test",
    "choice_d": "Permanent pacemaker placement",
    "choice_e": "Wait and re-evaluate in 24 hours",
    "correct_answer": "D",
    "explanation": "This patient has symptomatic high-grade AV block (2:1 block) leading to syncope. When a 2:1 AV block is present, it can be difficult to distinguish between Mobitz type I (usually benign) and Mobitz type II (more serious). However, in the setting of symptoms like syncope or lightheadedness without a reversible cause (eg, medication toxicity, electrolyte abnormality), the presence of second-degree AV block is an indication for permanent pacemaker placement regardless of the specific subtype.\n\n(Choice A) Atropine may be used for acute stabilization of unstable bradycardia but is not a definitive treatment for high-grade AV block.\n\n(Choice B) Carotid sinus massage could worsen the bradycardia.\n\n(Choice C) Exercise stress testing is not indicated in a patient who has already demonstrated symptomatic high-grade block at rest.\n\nEducational objective:\nSymptomatic second-degree AV block in the absence of a reversible cause is an indication for permanent pacemaker placement.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   }, 
  {
    "id": "cardio_061",
    "system": "Cardiovascular System",
    "stem": "An 84-year-old man comes to the emergency department due to a week-long history of dizziness, lightheadedness, and shortness of breath. His symptoms occur at any time but are worse with exertion. He has had no chest pain, palpitations, or syncope. Medical history includes hypertension, hypercholesterolemia, and benign prostatic hyperplasia. His medications are aspirin, lisinopril, atorvastatin, and tamsulosin. Temperature is 36.7 C (98 F), blood pressure is 120/60 mm Hg, pulse is 36/min, and respirations are 16/min. On examination, the patient appears in no acute distress and has no symptoms. Other than a slow pulse rate, physical examination shows no abnormalities. Initial laboratory studies, including complete metabolic panel, thyroid function tests, and cardiac markers, are within normal limits. ECG is shown in the exhibit. A transthoracic echocardiogram shows normal right and left ventricular size and function with an ejection fraction of 60%, along with mild mitral and tricuspid regurgitation. Which of the following is the best next step in management of this patient?",
    "choice_a": "24-hour ECG monitoring",
    "choice_b": "Intravenous atropine",
    "choice_c": "Intravenous dobutamine",
    "choice_d": "Permanent pacemaker",
    "choice_e": "Transcutaneous pacing",
    "correct_answer": "D",
    "explanation": "This patient has symptomatic bradycardia with ECG showing every other P wave blocked (ie, nonconducted), consistent with 2:1 second-degree atrioventricular (AV) block.[span_0](end_span) [span_1](start_span)Symptomatic second-degree AV block (eg, shortness of breath, lightheadedness, syncope) in the absence of a reversible cause (eg, pharmacologic AV nodal blockade, myocardial ischemia) is an indication for permanent pacemaker placement.[span_1](end_span) [span_2](start_span)ECG showing AV conduction at a 2:1 ratio represents a special scenario because it does not allow for the differentiation between Mobitz type I and Mobitz type II second-degree AV block.[span_2](end_span) [span_3](start_span)Symptomatic second-degree AV block necessitates pacemaker placement regardless of whether Mobitz type I or Mobitz type II AV block is present.[span_3](end_span) (Choice A) [span_4](start_span)Although he should be closely monitored for hemodynamic instability until a pacemaker is placed, further diagnostic testing will not change the need for a permanent pacemaker.[span_4](end_span) (Choices B and E) [span_5](start_span)Hemodynamically unstable patients with bradycardia should be treated with intravenous atropine or transcutaneous cardiac pacing; however, atropine can sometimes worsen bradycardia due to second-degree AV block and is not recommended in stable patients such as this one.[span_5](end_span)",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },  
  {
    "id": "cardio_062",
    "system": "Cardiovascular System",
    "stem": "A 62-year-old retired firefighter is brought to the emergency department due to shortness of breath. The patient has been fairly active most of his life and had been walking 2-3 miles a day until 2 months ago. For the past several weeks he has had progressive fatigue and shortness of breath. He becomes symptomatic after walking only a few blocks on a level surface. The patient has gained 4.5-kg (10-lb) over the last 2 months. Last night he suddenly woke up \"gasping for air\" and could not get comfortable in any position. He has no significant medical history and has had no recent illnesses. The patient takes no regular medications. He has a 40-pack-year smoking history and drinks 4-6 beers a day.\n\nOn physical examination, the patient appears comfortable at rest. Temperature is 37.2 C (99 F), blood pressure is 112/72 mm Hg, pulse is 92/min, and respirations are 22/min. Pulse oximetry shows 88% on room air. Jugular venous pressure is measured at 14 cm H2O. Lung examination reveals decreased breath sounds at the bases with bilateral crackles up to the lower one-third of the chest. Cardiac examination reveals irregular heart tones with an audible S3 over the cardiac apex. A 2/6 holosystolic murmur is heard over the cardiac apex. The patient has 3+ bilateral pitting edema up to the knees.\n\nLaboratory results show Sodium 132 mEq/L, Potassium 3.6 mEq/L, Creatinine 1.2 mg/dL, and Glucose 162 mg/dL. ECG shows atrial fibrillation at 94/min with an underlying left bundle branch block. Initial chest x-ray reveals cardiomegaly, pulmonary vascular congestion, and bilateral pleural effusions. Bedside echocardiogram shows a dilated and diffusely hypokinetic left ventricle with an ejection fraction of 30%. Which of the following is the best initial therapy for this patient?",
    "choice_a": "Carvedilol",
    "choice_b": "Dobutamine",
    "choice_c": "Furosemide",
    "choice_d": "Lisinopril",
    "choice_e": "Nitroglycerin",
    "correct_answer": "C",
    "explanation": "This patient has acute decompensated heart failure (ADHF). His severe left ventricular (LV) systolic dysfunction with a dilated and diffusely hypokinetic left ventricle suggests cardiomyopathy due to alcohol abuse with recent clinical deterioration resulting from the onset of atrial fibrillation. Intravenous diuretics (eg, furosemide) are the preferred therapy in patients with ADHF who have clinical evidence of volume overload. By reducing intravascular volume, diuretics provide rapid symptomatic relief and improve oxygenation. (Choices A and D) Beta blockers and ACE inhibitors improve long-term mortality in chronic heart failure but should not be used, or used only with extreme caution, in the acute decompensated phase as they can lead to worsening symptoms and hemodynamic instability. (Choice B) Inotropic agents are reserved for patients in cardiogenic shock. (Choice E) Intravenous nitroglycerin can be added to diuretics in normotensive patients who continue to have respiratory symptoms, but intravenous diuresis is a more appropriate initial therapy.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_063",
    "system": "Cardiovascular System",
    "stem": "A 54-year-old man comes to the emergency department with severe chest and neck pain that started 2 hours ago. His past medical history is significant for hypertension treated with amlodipine and irbesartan. His father died suddenly at the age of 43 years. He does not smoke or use illicit drugs. His blood pressure is 162/100 mmHg and pulse is 101/min. He appears mildly uncomfortable due to pain. EKG shows sinus tachycardia, voltage criteria for left ventricular hypertrophy, and T wave inversions in leads V5 and V6. Chest x-ray shows a widened mediastinum. He is initially treated with nitroglycerin. What is the best next step in managing this patient?",
    "choice_a": "Aspirin and clopidogrel",
    "choice_b": "Cardiac catheterization",
    "choice_c": "Chest tube",
    "choice_d": "CT angiogram",
    "choice_e": "Repeat EKG in 30 min and cardiac enzymes",
    "correct_answer": "D",
    "explanation": "This patient presents with hypertension, anterior chest pain, and neck pain with widening of the mediastinum on chest x-ray suggestive of acute aortic dissection involving the ascending aorta. Ascending aortic dissection is a surgical emergency. Rapid confirmation can be obtained by chest CT angiogram (CTA), which has high sensitivity and specificity for identifying the intimal flap. (Choice A) Anticoagulation is contraindicated in acute aortic dissection; the diagnosis must be excluded before treating with antiplatelet agents for suspected ischemia. (Choice B) There is no indication for urgent cardiac catheterization. (Choice C) Chest tube is indicated for pneumothorax or large effusions, not dissection. (Choice E) Repeat EKG/enzymes are appropriate only after dissection is ruled out.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_064",
    "system": "Cardiovascular System",
    "stem": "A 52-year-old construction worker is brought to the emergency department due to the sudden onset of severe substernal chest pain. His initial ECG shows sinus rhythm with left bundle branch block. Emergency cardiac catheterization shows an occluded proximal left anterior descending artery (LAD). He undergoes successful primary angioplasty with drug-eluting stent placement. Over the next 36 hours, his hemodynamics improve. Current medications include low-dose aspirin, clopidogrel, atorvastatin, lisinopril, and metoprolol succinate. A transthoracic echocardiogram shows a large area of akinesis in the anterior segments with a left ventricular ejection fraction (LVEF) of 25%. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Add amiodarone to the medical regimen",
    "choice_b": "Continue current medical therapy and discharge home",
    "choice_c": "Offer cardiac resynchronization therapy",
    "choice_d": "Perform submaximal exercise stress testing",
    "choice_e": "Place implantable cardioverter-defibrillator",
    "correct_answer": "B",
    "explanation": "This patient has a large area of myocardial akinesis corresponding with the occluded LAD, likely representing stunned myocardium which can recover function following revascularization and optimal medical therapy. Patients with significant LV dysfunction following MI should be continued on optimal medical therapy and have their LVEF reassessed in 3 months (90 days) after revascularization to determine the need for an implantable cardioverter-defibrillator (ICD) for primary prevention of sudden cardiac death. (Choice C) Cardiac resynchronization therapy requires at least 3 months of optimal medical therapy first to evaluate for recovery. (Choice E) ICD placement is premature; it is indicated only if LVEF remains ≤30% (or ≤35% with symptoms) on repeat evaluation 3 months later.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_065",
    "system": "Cardiovascular System",
    "stem": "A 62-year-old man comes to the emergency department with 2 episodes of retrosternal pressure-like chest pain over the last 6 hours. Medical history is significant for type 2 diabetes mellitus, hypertension, and end-stage renal disease (ESRD). He undergoes hemodialysis 3 times a week. Blood pressure is 152/89 mm Hg and pulse is 88/min. ECG shows 1-mm horizontal ST-segment depressions in leads II, III, aVF, and V4-V6. Initial troponin I level is 1.5 ng/mL. He is treated with aspirin. Which of the following is the most appropriate additional treatment for this patient?",
    "choice_a": "Amlodipine",
    "choice_b": "Enoxaparin",
    "choice_c": "Eptifibatide",
    "choice_d": "Metoprolol",
    "choice_e": "Spironolactone",
    "correct_answer": "D",
    "explanation": "This patient has a non-ST elevation myocardial infarction (NSTEMI). Management for NSTEMI in patients with ESRD is similar to other patients and includes aspirin, a P2Y12 inhibitor, a beta blocker, and anticoagulation. Metoprolol should be started to reduce infarct size and the risk of reinfarction. (Choice B) Enoxaparin (LMWH) is renally cleared and is contraindicated in patients with ESRD due to increased bleeding risk; unfractionated heparin is preferred. (Choice C) Eptifibatide is also renally cleared and contraindicated in ESRD; abciximab is the preferred GP IIb/IIIa inhibitor if one is needed.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_066",
    "system": "Cardiovascular System",
    "stem": "A 56-year-old man comes to the physician because of chest and epigastric discomfort since this morning. While sitting in the waiting area, he suddenly becomes unresponsive. He has scarce respiratory efforts and there is no palpable pulse over the carotid arteries. Which of the following is the most appropriate next step in managing this patient?",
    "choice_a": "Airway opening and rescue breathing",
    "choice_b": "Attachment of cardiac and oxygen monitors",
    "choice_c": "Attachment of defibrillation pads",
    "choice_d": "Chest compressions",
    "choice_e": "Intravenous access",
    "correct_answer": "D",
    "explanation": "Current BLS/ACLS guidelines utilize the 'CAB' order (Chest compressions, Airway, Breathing) for cardiac arrest. The timing and quality of chest compressions is the most important predictor of survival. Chest compressions should be initiated immediately and should not be interrupted once started. (Choice A) Rescue breaths are secondary to compressions. (Choices B, C, and E) Other maneuvers should be performed during compressions or with the briefest possible interruption.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_067",
    "system": "Cardiovascular System",
    "stem": "A 66-year-old retired police officer is brought to the emergency department due to abrupt-onset sharp anterior chest pain that radiates to his neck and lower jaw, described as \"the worst pain of my life.\" Blood pressure is 201/104 mm Hg in the right arm and 198/94 mm Hg in the left arm. There is a faint early diastolic murmur at the left sternal border and an S4 at the apex. ECG shows high-voltage QRS complexes. Which of the following is the most appropriate initial treatment for this patient?",
    "choice_a": "Clopidogrel",
    "choice_b": "Intravenous hydralazine",
    "choice_c": "Intravenous labetalol",
    "choice_d": "Intravenous nitroprusside",
    "choice_e": "Unfractionated heparin",
    "correct_answer": "C",
    "explanation": "The presentation of abrupt tearing chest pain, hypertension, and a murmur of acute aortic regurgitation (decrescendo diastolic murmur) strongly suggests acute aortic dissection. Initial therapeutic goals include lowering systolic blood pressure to ≤120 mm Hg and decreasing LV contractility to reduce aortic wall shear stress. Intravenous beta blockers (eg, labetalol, esmolol) are preferred as they reduce both blood pressure and the rate of rise in systolic pressure (dp/dt). (Choices A and E) Anticoagulants/antiplatelets are contraindicated as they propagate the dissection. (Choice B) Hydralazine causes reflex tachycardia/increased contractility, which can worsen dissection. (Choice D) Nitroprusside is a potent vasodilator but should only be used after adequate beta blockade to prevent reflex sympathetic stimulation.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_068",
    "system": "Cardiovascular System",
    "stem": "An 83-year-old woman is brought to the emergency department due to chest pressure accompanied by nausea and vomiting that occurred 3 days ago. She is currently asymptomatic. Troponin is 7.8 ng/mL and CK-MB is 63 ng/mL. ECG shows Q waves in leads II, III, and aVF. Shortly after admission, she becomes markedly dyspneic with a blood pressure of 90/45 mm Hg and pulse of 125/min. Lung exam reveals bilateral diffuse crackles. A pulmonary arterial catheter shows a Right Atrium pressure of 5, Right Ventricle 50/10, Pulmonary Artery 50/25, and PCWP 30. Oxygen saturation is 68% in all chambers. Which of the following is the most likely diagnosis?",
    "choice_a": "Left ventricular aneurysm",
    "choice_b": "Papillary muscle rupture",
    "choice_c": "Pulmonary embolism",
    "choice_d": "Right ventricular infarction",
    "choice_e": "Ruptured ventricular septum",
    "correct_answer": "B",
    "explanation": "This patient had an inferior wall MI 3 days ago and has developed acute-onset pulmonary edema and cardiogenic shock, which is most likely due to papillary muscle rupture. This complication typically occurs within 3-5 days of MI and results in acute severe mitral regurgitation. This causes elevated PCWP and pulmonary arterial pressures. (Choice E) Ventricular septal rupture also occurs 3-5 days post-MI but would show a 'step-up' in oxygen saturation from the right atrium to the right ventricle due to the left-to-right shunt. (Choice D) Right ventricular infarction typically presents with hypotension and flat lungs (low PCWP).",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_069",
    "system": "Cardiovascular System",
    "stem": "A 73-year-old woman with a history of nonischemic cardiomyopathy (EF 15%) comes to the emergency department with vision changes (black spots and blurriness), poor appetite, and fatigue since an episode of gastroenteritis 2 weeks ago. Her medications include torsemide, ramipril, carvedilol, spironolactone, and digoxin. Her pulse is 52/min. Mucous membranes are dry. There is mild epigastric tenderness. Neurologic exam shows a mild unsteady gait. Which of the following is the most likely diagnosis?",
    "choice_a": "Acute angle-closure glaucoma",
    "choice_b": "Cardiac cachexia",
    "choice_c": "Cerebellar stroke",
    "choice_d": "Diabetic retinopathy",
    "choice_e": "Medication toxicity",
    "correct_answer": "E",
    "explanation": "This patient's clinical presentation suggests digoxin toxicity, precipitated by volume depletion from recent gastroenteritis which impaired renal digoxin clearance. Chronic digoxin toxicity presents with gastrointestinal symptoms (anorexia, nausea), neurologic symptoms (lethargy, fatigue, unsteady gait), and classic visual changes (blurred vision, color changes, scotomas). It can also cause various arrhythmias, including bradycardia. (Choices A, C, and D) While these can cause vision/gait issues, they don't explain the systemic symptoms and bradycardia in the context of digoxin use and recent dehydration.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_070",
    "system": "Cardiovascular System",
    "stem": "A 73-year-old woman presents with substernal chest pressure and shortness of breath that began one hour after being involved in a low-velocity motor vehicle accident. She is very worried about her children taking her car away. ECG shows 2 mm ST elevation in leads V1 to V4 with T wave inversions. Emergent coronary angiography shows no obstructive coronary artery disease. Echocardiogram shows dyskinesis of the mid and apical left ventricle with hyperkinesis of the base and an LVEF of 25%. Which of the following best explains this patient's symptoms?",
    "choice_a": "Aortic stenosis",
    "choice_b": "Cardiac contusion",
    "choice_c": "Demand ischemia",
    "choice_d": "ST segment elevation myocardial infarction",
    "choice_e": "Stress cardiomyopathy",
    "correct_answer": "E",
    "explanation": "This presentation is consistent with stress cardiomyopathy (Takotsubo cardiomyopathy), which is defined as ischemic-appearing ECG changes and transient LV dysfunction (typically apical ballooning with basilar compensation) in the absence of obstructive coronary disease. It is most common in post-menopausal women following an intense emotional or physical stressor. (Choice B) Cardiac contusion requires significant blunt trauma and would not typically cause this large, symmetric area of apical dysfunction. (Choice D) STEMI is ruled out by the absence of obstructive lesions on angiography.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_071",
    "system": "Cardiovascular System",
    "stem": "A 68-year-old man comes to the emergency department due to lightheadedness upon standing. He has a history of coronary artery disease, hypertension, and lung cancer (hard supraclavicular lymph node present). Blood pressure is 97/70 mm Hg and pulse is 112/min. Neck veins are distended and demonstrate a rapid \"x\" descent. Pulse is not felt during some heart beats auscultated at the apex. ECG shows sinus tachycardia, low-voltage QRS complexes, and right bundle branch block. Which of the following is the most likely cause of this patient's current symptoms?",
    "choice_a": "Ischemic cardiomyopathy",
    "choice_b": "Medication side effect",
    "choice_c": "Pericardial disease",
    "choice_d": "Pulmonary embolism",
    "choice_e": "Superior vena cava syndrome",
    "correct_answer": "C",
    "explanation": "The clinical presentation (hypotension, tachycardia, distended neck veins with rapid 'x' descent, and pulsus paradoxus—suggested by the heart beats not felt at the radial pulse) is highly suggestive of subacute cardiac tamponade. Malignancy (lung cancer) is a common cause. Tamponade causes hypotension by preventing filling of both ventricles. (Choice A) Ischemic cardiomyopathy doesn't typically show rapid 'x' descent. (Choice E) SVC syndrome presents with upper extremity/facial edema, not hypotension and lower extremity edema.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_072",
    "system": "Cardiovascular System",
    "stem": "A 72-year-old man presents with 2 days of pleuritic mid-sternal chest pain and fatigue. He underwent coronary artery bypass grafting (CABG) 4 weeks ago. He reports that sleeping on his back \"hurts too much.\" Temperature is 38.2 C (100.8 F). Chest examination reveals a well-healing sternotomy site with mild erythema but no tenderness. ECG shows a stable LBBB. Chest x-ray shows a small left-sided pleural effusion. Which of the following best explains this patient's current complaints?",
    "choice_a": "Acute mediastinitis",
    "choice_b": "Acute pericarditis",
    "choice_c": "Coronary graft occlusion",
    "choice_d": "Hospital acquired pneumonia",
    "choice_e": "Pulmonary embolism",
    "correct_answer": "B",
    "explanation": "This patient's presentation is consistent with postpericardiotomy syndrome (PCIS), a form of acute pericarditis occurring weeks after cardiac surgery. It is an autoimmune response to cardiac antigens released during surgical damage. It presents with pleuritic chest pain (worse when lying flat), fever, and sometimes pericardial effusion. Treatment includes NSAIDs and colchicine. (Choice A) Mediastinitis usually presents with sternal wound tenderness or drainage and occurs earlier (within 2 weeks). (Choice C) Graft occlusion would typically cause ischemic symptoms or hemodynamic instability.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_073",
    "system": "Cardiovascular System",
    "stem": "A 32-year-old woman at 32 weeks gestation presents with acute chest and neck pain. She has Horner syndrome (right pupil 4 mm, left 2 mm, slight left ptosis). Blood pressure is 176/104 mm Hg in the right arm and 180/99 mm Hg in the left. ECG shows 1-mm ST depression in V5-V6. Urinalysis is negative for protein. Which of the following is the best next step in management of this patient?",
    "choice_a": "Cardiac catheterization",
    "choice_b": "Intravenous magnesium infusion",
    "choice_c": "Intravenous nitroprusside infusion",
    "choice_d": "MRI of the head",
    "choice_e": "Transesophageal echocardiography",
    "correct_answer": "E",
    "explanation": "This pregnant patient with hypertension and Horner syndrome likely has an acute aortic dissection. Horner syndrome (ptosis, miosis) occurs when the dissection extends into the carotid artery and compresses the sympathetic plexus. Transesophageal echocardiography (TEE) is an excellent diagnostic choice in pregnancy as it can be performed quickly and avoids fetal radiation exposure associated with CT angiography. (Choice B) Magnesium is for preeclampsia, but the absence of proteinuria and presence of Horner syndrome points to dissection. (Choice C) Nitroprusside is contraindicated in pregnancy due to fetal cyanide risk.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_074",
    "system": "Cardiovascular System",
    "stem": "A 65-year-old woman presents with severe chest pain of 7 hours duration. Six weeks ago she had an ischemic stroke. She is currently on warfarin for atrial fibrillation (INR 2.1). Blood pressure is 165/90 mm Hg. ECG shows 2 mm ST elevation in leads V1-V4. Which of the following is an absolute contraindication to fibrinolytic therapy in this patient?",
    "choice_a": "Aspirin therapy",
    "choice_b": "Blood pressure on presentation",
    "choice_c": "Ischemic stroke",
    "choice_d": "Time from onset of symptoms",
    "choice_e": "Warfarin therapy",
    "correct_answer": "C",
    "explanation": "In the management of STEMI, the only absolute contraindication listed for this patient is an ischemic stroke within the last 3 months. (Choice B) Poorly controlled hypertension (SBP >180) is a relative, not absolute, contraindication. (Choice D) Fibrinolytics can be given up to 12 hours from symptom onset. (Choice E) Warfarin therapy with an elevated INR is a relative contraindication.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_075",
    "system": "Cardiovascular System",
    "stem": "A 42-year-old man presents with fatigue, chest pain, and shortness of breath for 5 days following a viral illness. Blood pressure is 92/54 mm Hg and decreases to 75/42 mm Hg during inspiration. Jugular venous pressure is 16 cm H2O. Heart sounds are faint. Chest x-ray shows a 'water bottle' heart. An echocardiogram in this patient would most likely show which of the following?",
    "choice_a": "Dynamic left ventricular outflow obstruction",
    "choice_b": "Global left ventricular hypokinesis",
    "choice_c": "Left ventricular diastolic collapse",
    "choice_d": "Right atrial diastolic collapse",
    "choice_e": "Right ventricular dilation",
    "correct_answer": "D",
    "explanation": "This patient has classic signs of cardiac tamponade (muffled heart sounds, elevated JVP, and pulsus paradoxus). Right atrial collapse during end diastole is the earliest and most sensitive echocardiographic sign of cardiac tamponade, occurring because the right atrium has the lowest pressure of all chambers. (Choice C) Left ventricular collapse is rare because the LV is more muscular and high-pressure. (Choice E) Right ventricular dilation is seen in pulmonary embolism.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_076",
    "system": "Cardiovascular System",
    "stem": "A 78-year-old man presents with two episodes of syncope, one while reading and one in the bathroom after urination. He has a known history of aortic stenosis. Blood pressure is 124/60 mm Hg. Carotid upstrokes are delayed and S2 is soft. ECG shows P waves that have no relation to QRS complexes. Which of the following is the most likely cause of this patient's symptoms?",
    "choice_a": "Conduction system disease",
    "choice_b": "Left main coronary artery stenosis",
    "choice_c": "Severe narrowing of the aortic valve",
    "choice_d": "Vasovagal syncope",
    "choice_e": "Volume depletion",
    "correct_answer": "A",
    "explanation": "The ECG shows atrioventricular dissociation (P waves and QRS complexes are unrelated), confirming complete (third-degree) heart block. This is the most likely cause of his syncope. While he has severe aortic stenosis, syncope in AS is typically exertional. This patient's episodes occurred at rest. Complete heart block requires a permanent pacemaker. (Choice D) Vasovagal syncope is a diagnosis of exclusion in patients with structural heart disease or clear ECG abnormalities.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_077",
    "system": "Cardiovascular System",
    "stem": "A 34-year-old man with type 1 diabetes presents with retrosternal chest pain and left shoulder pain for 12 hours. The pain is worse on deep inspiration and improved by sitting up. ECG shows diffuse concave upward ST segment elevation and PR segment depression in leads I, II, III, aVF, and V2-V6. Which of the following changes would be expected on repeat ECG one week later?",
    "choice_a": "Diffuse T wave inversion",
    "choice_b": "First degree atrioventricular block",
    "choice_c": "Left axis deviation",
    "choice_d": "Pathologic Q waves in precordial leads",
    "choice_e": "ST segment depression in anterolateral leads",
    "correct_answer": "A",
    "explanation": "This patient has acute pericarditis. The ECG typically evolves through four stages: Stage 1 (diffuse ST elevation/PR depression), Stage 2 (normalization), Stage 3 (diffuse T wave inversion), and Stage 4 (normalization or persistent T wave inversion). One week later, the patient would likely be in Stage 3. (Choice D) Q waves are seen after myocardial infarction, not pericarditis.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_078",
    "system": "Cardiovascular System",
    "stem": "A 72-year-old man comes to the emergency department for a facial laceration. He has no other symptoms. Medical history is significant for hypertension, but he takes no medications. Blood pressure is 205/107 mm Hg. After the laceration is sutured, repeat blood pressure is 208/109 mm Hg. Physical exam is unremarkable with no focal neurologic deficits. Laboratory results (potassium, creatinine) and ECG (LVH only) are stable. What is the best next step in management of this patient?",
    "choice_a": "Admit for echocardiography and serial cardiac enzymes",
    "choice_b": "Admit for intravenous antihypertensive therapy",
    "choice_c": "Admit for secondary hypertension workup",
    "choice_d": "Discharge with outpatient follow-up arrangements",
    "choice_e": "Order oral antihypertensive medication and observe",
    "correct_answer": "E",
    "explanation": "This patient has hypertensive urgency (SBP ≥180 and/or DBP ≥120 without end-organ damage). Management involves initiating oral antihypertensive medication (eg, captopril or clonidine) and observing the patient for several hours to ensure the BP is gradually lowering and they remain asymptomatic. The goal is to lower BP over hours to days, not abruptly. (Choice B) Intravenous therapy is for hypertensive emergency (with end-organ damage). (Choice D) The patient should not be discharged until BP is controlled and a home plan is established.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_079",
    "system": "Cardiovascular System",
    "stem": "A 34-year-old man presents with chest pain after using cocaine. ECG shows 2 mm ST elevation in leads II, III, and aVF with reciprocal ST depression in lead I. He is treated with nitroglycerin, aspirin, and benzodiazepines with partial improvement. Which of the following is the best next step in managing this patient?",
    "choice_a": "Cardiac catheterization followed by observation in the coronary care unit",
    "choice_b": "Clopidogrel, heparin drip, morphine, and observation in the coronary care unit",
    "choice_c": "Esmolol drip, morphine, and observation in the coronary care unit",
    "choice_d": "Nitroglycerin as needed, diltiazem, and observation on a telemetry floor",
    "choice_e": "Nitroglycerine drip, morphine, and observation in the coronary care unit",
    "correct_answer": "A",
    "explanation": "Cocaine causes chest pain by increasing oxygen demand, causing vasoconstriction, and increasing thrombogenicity. When patients present with ST-elevation MI (STEMI) associated with cocaine use, they should undergo immediate cardiac catheterization with reperfusion. (Choice C) Beta blockers (like esmolol) are strictly contraindicated in cocaine-induced chest pain as they can cause unopposed alpha-adrenergic stimulation and worsen coronary vasoconstriction.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_080",
    "system": "Cardiovascular System",
    "stem": "A 78-year-old woman presents with a displaced intertrochanteric hip fracture after a fall. She had a MI 14 months ago and has a bare-metal stent. She has no current chest pain or dyspnea. She can walk only half a flight of stairs due to knee pain. Blood pressure is 154/80 mm Hg and pulse is 64/min. ECG shows old inferior Q waves. A recent echo showed an EF of 50% with inferior hypokinesis. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Order pharmacologic stress testing",
    "choice_b": "Proceed directly with surgical repair of hip fracture",
    "choice_c": "Repeat transthoracic echocardiogram",
    "choice_d": "Start ACE inhibitor therapy",
    "choice_e": "Start beta blocker therapy",
    "correct_answer": "B",
    "explanation": "Hip fracture repair is an intermediate-risk surgery. Based on the Revised Cardiac Risk Index (RCRI), this patient has a low perioperative cardiac risk (~1%) with only one risk factor (history of ischemic heart disease). Asymptomatic patients at low risk can proceed to surgery without further evaluation. (Choice A) Stress testing is reserved for patients at moderate/high risk (>1%) with poor functional capacity (<4 METS). (Choice E) Initiating beta blockers immediately before surgery is not recommended as it increases the risk of stroke and death.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_081",
    "system": "Cardiovascular System",
    "stem": "A 47-year-old man presents with lightheadedness and weakness. He has type 2 diabetes and hypertension and was recently started on losartan. ECG shows a rhythm with complete absence of P waves and QRS widening (sine wave pattern). Blood pressure is 105/80 mm Hg. Which of the following is the most likely cause of this patient's symptoms?",
    "choice_a": "Amitriptyline overdose",
    "choice_b": "Electrolyte abnormalities",
    "choice_c": "Ischemic stroke",
    "choice_d": "Myocardial infarction",
    "choice_e": "Sick sinus syndrome",
    "correct_answer": "B",
    "explanation": "The ECG findings (absent P waves, widened QRS) are classic for severe hyperkalemia. This was likely precipitated by losartan (an ARB) in a patient with probable diabetic nephropathy. Management includes intravenous calcium to stabilize the cardiac membrane, followed by therapies to shift potassium intracellularly (insulin/glucose). (Choice A) TCA overdose also causes QRS widening but usually features tachycardia and PR/QT prolongation.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_082",
    "system": "Cardiovascular System",
    "stem": "A 38-year-old man presents with 1 day of chest pain and a sore throat a week ago. ECG shows 1- to 2-mm diffuse ST-segment elevation and troponin is 0.09 ng/mL. He is diagnosed with viral myopericarditis. Which of the following initial therapies is most likely to cause recurrent symptomatic episodes in this patient?",
    "choice_a": "Aspirin",
    "choice_b": "Colchicine",
    "choice_c": "Immune globulin",
    "choice_d": "Indomethacin",
    "choice_e": "Prednisone",
    "correct_answer": "E",
    "explanation": "Glucocorticoids like prednisone are associated with higher rates of recurrence in pericarditis and myopericarditis. The standard of care is NSAIDs (eg, aspirin, indomethacin) plus colchicine. Steroids should only be used if NSAIDs are contraindicated or for specific underlying causes like autoimmune disease. (Choice B) Colchicine is actually recommended to decrease the rate of recurrence.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_083",
    "system": "Cardiovascular System",
    "stem": "A 72-year-old man with a history of COPD and CABG presents with worsening cough and dyspnea. Pulse is 132/min and irregular. ECG shows a tachycardia with at least 3 different P-wave morphologies and irregular R-R intervals. Which of the following is the best treatment for this patient's cardiac condition?",
    "choice_a": "Cardiac glycoside",
    "choice_b": "Corticosteroids and inhaled bronchodilators",
    "choice_c": "Electrical cardioversion",
    "choice_d": "Intravenous amiodarone",
    "choice_e": "Intravenous ibutilide",
    "correct_answer": "B",
    "explanation": "The ECG shows Multifocal Atrial Tachycardia (MAT), which is strongly associated with acute exacerbations of underlying pulmonary disease like COPD. Treatment is aimed at the inciting disturbance (the COPD exacerbation). (Choice C) Electrical cardioversion is ineffective in MAT. (Choices D and E) Antiarrhythmics are not effective for MAT management.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_084",
    "system": "Cardiovascular System",
    "stem": "A 76-year-old man with clinical signs of heart failure (JVP 12, crackles, edema) and an LVEF of 35% has a BNP level of 96 pg/mL (normal <100). His BMI is 35 kg/m². Which of the following best explains the normal brain natriuretic peptide value?",
    "choice_a": "High body mass index",
    "choice_b": "Hypertension",
    "choice_c": "Hyponatremia",
    "choice_d": "Noncardiac cause of dyspnea",
    "choice_e": "Older age",
    "correct_answer": "A",
    "explanation": "Obese patients (high BMI) have lower BNP and NT-proBNP levels than nonobese patients for unclear reasons. BNP <100 usually excludes heart failure, but in obese patients, these levels must be interpreted with caution as they can be falsely low despite clinical heart failure. (Choice E) Older age and CKD actually cause higher, not lower, BNP levels.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_085",
    "system": "Cardiovascular System",
    "stem": "A 61-year-old man with a 60-pack-year smoking history is found to have a 3.8-cm abdominal aortic aneurysm (AAA). Which of the following is associated with the highest rate of aneurysm expansion and rupture in this patient?",
    "choice_a": "Active smoking",
    "choice_b": "Chronic kidney disease",
    "choice_c": "Daily alcohol consumption",
    "choice_d": "LDL cholesterol >130 mg/dL",
    "choice_e": "Uncontrolled diabetes mellitus",
    "correct_answer": "A",
    "explanation": "Active cigarette smoking is the strongest predictor of AAA expansion and rupture. Other major risk factors include large diameter (>5.5 cm) and rapid expansion rate. (Choice E) Interestingly, diabetes mellitus is associated with a decreased risk for developing or expanding an AAA.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_086",
    "system": "Cardiovascular System",
    "stem": "A 31-year-old woman presents with paroxysmal atrial fibrillation and has a history of rheumatic heart disease with mild mitral stenosis. She spontaneously converts to sinus rhythm in the ED. Which of the following is the best treatment option for this patient?",
    "choice_a": "Anticoagulation with warfarin",
    "choice_b": "Low-dose aspirin",
    "choice_c": "Mitral valve replacement",
    "choice_d": "Reassurance and clinical follow-up",
    "correct_answer": "A",
    "explanation": "Patients with atrial fibrillation in the setting of rheumatic mitral stenosis have an extremely high risk of systemic thromboembolism. Long-term anticoagulation with warfarin (target INR 2.5) is recommended regardless of the CHA2DS2-VASc score. Newer oral anticoagulants (eg, dabigatran, rivaroxaban) are not approved for valvular atrial fibrillation.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   },
  {
    "id": "cardio_087",
    "system": "Cardiovascular System",
    "stem": "A 60-year-old woman with heart failure (EF 35%) presents with syncope and weakness. Her lisinopril dose was recently increased and she was started on spironolactone. ECG shows no P waves and a wide complex regular rhythm at 74/min. The patient would most likely benefit from which of the following?",
    "choice_a": "Amiodarone",
    "choice_b": "Atropine",
    "choice_c": "Calcium gluconate",
    "choice_d": "Furosemide",
    "choice_e": "Metoprolol",
    "correct_answer": "C",
    "explanation": "The ECG (absent P waves, wide complex rhythm) in the setting of ACE inhibitor and spironolactone use is diagnostic of severe hyperkalemia. Intravenous calcium gluconate is the most appropriate next step to rapidly antagonize the cell membrane effects of potassium and prevent life-threatening arrhythmias. (Choice D) Furosemide is too slow for emergency treatment.",
    "source": "ABIM - Cardiovascular System - 3.pdf"   }
]
