[
{
"id": "ENDO_001",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 36-year-old woman comes to the office for follow-up of hypothyroidism. She has no current symptoms. The patient was diagnosed with hypothyroidism secondary to Hashimoto's thyroiditis 4 years ago. She takes 150 µg levothyroxine daily before breakfast and her dose has been stable for the last year. Physical examination, including thyroid examination, is normal.\n\nThyroid function tests are as follows:\nTSH: 1.4 µU/mL (normal: 0.5-5.0 µU/mL)\nFree thyroxine (T4), serum: 2.6 ng/dL (normal: 0.9-2.4 ng/dL)\nTriiodothyronine (T3), serum: 65 ng/dL (normal: 70-195 ng/dL)\n\nWhich of the following is the best next step in management of this patient?",
"choice_a": "Add liothyronine (T3) to current therapy",
"choice_b": "Continue current therapy",
"choice_c": "Decrease levothyroxine dose",
"choice_d": "Increase levothyroxine dose",
"choice_e": "Obtain thyroid peroxidase antibody level",
"correct_answer": "B",
"explanation": "Synthetic levothyroxine (LT4) is the preferred replacement therapy for hypothyroidism. Most actions of the thyroid hormone in the body are mediated through triiodothyronine (T3), which is secreted in active form by the thyroid gland (15%-20%) and also converted from thyroxine (T4) in extrathyroidal tissues (80%-85%). Because a large percentage of T3 is formed from T4 conversion in the peripheral tissues, patients with hypothyroidism are usually able to achieve adequate T3 levels with LT4 treatment alone. The recommended therapeutic goal in patients with primary hypothyroidism is to maintain TSH within the normal reference range. Serum TSH is the most reliable marker of levothyroxine replacement therapy in hypothyroid patients as it reflects the biologic activity of thyroid hormones in the tissues (ie. hypothalamus). For this reason, TSH alone is usually sufficient to monitor LT4 treatment in patients with primary hypothyroidism. However, despite this recommendation, thyroid hormone levels are frequently ordered by practitioners along with TSH to monitor LT4 therapy. (Choices A and D) In most patients on LT4 therapy who have a TSH within the reference range, circulating T3 levels will also be within the reference range. In some cases, treatment with LT4 alone may fail to restore plasma T3 to a level within the reference range despite a normal TSH. However, the significance of this low T3 is unknown, and the American Thyroid Association recommends against increasing the LT4 dose, treating with combination LT4 and liothyronine (T3) or switching to liothyronine alone in these patients. (Choice C) Levels of free T4 above the reference range are often observed during replacement therapy with LT4, especially if the blood sample is drawn 1-3 hours after LT4 administration. This condition is not associated with adverse events, and the dose of LT4 should not be changed. (Choice E) Thyroid peroxidase (TPO) antibodies are useful for diagnosis in cases of subclinical hypothyroidism, recurrent miscarriages, and euthyroid diffuse goiters. However, there is no benefit to measuring TPO antibodies once the diagnosis of Hashimoto's thyroiditis has been established (as in this patient). Educational objective: The therapeutic goal in primary hypothyroidism is to maintain TSH levels within the normal reference range by replacement with levothyroxine. Levothyroxine dose adjustment should be based on TSH levels alone rather than direct measurement of thyroid hormone levels.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_002",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 50-year-old woman comes to the office to follow up type 2 diabetes mellitus. She was diagnosed 5 years ago and is treated with metformin at the maximal tolerated dose. She has been unable to lose weight despite following a healthy diet and exercising at least 5 times a week. The patient has no chronic complications of diabetes but has had recurrent episodes of vaginal candidiasis in the last 2 years. She works as a commercial bus driver for a tourist company and does not use tobacco, alcohol, or illicit drugs. Vital signs are normal. BMI is 27 kg/m². Physical examination is otherwise unremarkable. Serum creatinine is 1 mg/dL, fasting glucose is 156 mg/dL, and hemoglobin A1c is 7.9%. Six months ago her A1c was 7.2%. When added to metformin, which of the following medications is most appropriate for this patient?",
"choice_a": "Basal insulin",
"choice_b": "Dipeptidyl peptidase-4 inhibitor",
"choice_c": "Glucagon-like peptide-1 receptor agonist",
"choice_d": "Sodium-glucose cotransporter-2 inhibitor",
"choice_e": "Sulfonylurea",
"correct_answer": "C",
"explanation": "This patient with elevated BMI has uncontrolled type 2 diabetes mellitus despite appropriate diet, exercise, and metformin therapy. The addition of a second drug is indicated, and the choice should take into account efficacy, risk of hypoglycemia, weight gain, and other adverse effects. A glucagon-like peptide-1 (GLP-1) receptor agonist (eg, exenatide, liraglutide, dulaglutide) is most appropriate for this patient as it is likely to bring her hemoglobin A1c down to the target range while inducing significant weight loss without increasing the risk of hypoglycemia. The major side effects of GLP-1 receptor agonists are nausea, vomiting, abdominal pain, and diarrhea; these gastrointestinal effects typically abate in the first few weeks of therapy. Contraindications to nearly all GLP-1 receptor agonists include personal or family history of medullary thyroid cancer or multiple endocrine neoplasia type 2 and history of pancreatitis. Exenatide is also contraindicated in severe renal insufficiency. (Choice A) Basal insulin is likely to optimize glycemic control. However, insulin therapy would be suboptimal in this patient as it is associated with weight gain and risk of hypoglycemia and could complicate her licensure requirements as a commercial motor vehicle driver (eg, may require exemption via the Federal Diabetes Exemption Program). (Choice B) Dipeptidyl peptidase-4 inhibitors (eg, sitagliptin) affect the same pathway as GLP-1 agonists and are weight neutral and very safe. However, they are only modestly efficacious, with an average decline in hemoglobin A1c of 0.5%. (Choice D) Sodium-glucose cotransporter-2 (SGLT-2) inhibitors (eg, canagliflozin) decrease blood glucose levels by increasing urinary excretion of glucose. SGLT-2 inhibitors increase the risk of vaginal candidiasis, particularly in women with a history of previous infections, making the group unattractive for this patient. (Choice E) Although sulfonylureas (eg, glimepiride) are inexpensive and very effective, like insulin they can cause weight gain and hypoglycemia. Educational objective: Glucagon-like peptide-1 receptor agonists are very effective antidiabetic agents with additional benefits of weight loss and low risk of hypoglycemia.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_003",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 30-year-old woman comes to the office due to a nodule in the right lobe of the thyroid gland. The nodule was discovered incidentally on a CT scan of the neck performed 2 weeks ago to evaluate neck pain following a motor vehicle collision. The patient feels well and has experienced no weight change, temperature intolerance, hair or skin changes, or menstrual irregularities. She has no chronic medical problems, takes no prescription medications, and has no history of radiation exposure. Family history is negative for thyroid cancer. The patient does not use tobacco, alcohol, or illicit drugs. Blood pressure is 120/80 mm Hg and pulse is 72/min. Thyroid examination reveals a palpable, firm, 2-cm nodule on the right lobe. Neck lymph nodes are not enlarged. The remainder of the physical examination is normal. Laboratory results are as follows: TSH 0.12 µU/mL; T3, serum 190 ng/dL; Free T4 1.8 ng/dL (normal: 0.9-2.4). Ultrasonography of the thyroid gland shows a solid right lobe hyperechoic nodule measuring 2.3x1.6x1.2 cm with no evidence of microcalcification or internal vascularity. Which of the following is the best next step in evaluation of this patient?",
"choice_a": "Fine-needle aspiration",
"choice_b": "Repeat TSH level in 3-4 weeks",
"choice_c": "Serum anti-thyroid peroxidase antibody assay",
"choice_d": "Serum calcitonin assay",
"choice_e": "Thyroid scintigraphy",
"correct_answer": "E",
"explanation": "The initial evaluation of thyroid nodules includes a serum TSH assay and thyroid ultrasound to assess the risk of malignancy. This patient has biochemical evidence of subclinical hyperthyroidism (ie, suppressed TSH, normal or elevated thyroid hormone levels), suggesting that she may have a hyperfunctioning nodule. which is rarely malignant. She should therefore undergo thyroid scintigraphy (preferably with iodine- 123). Hyperfunctioning (\"hot\") nodules are managed with respect to the hyperthyroid state (eg, symptom control, radioactive iodine, resection), but fine-needle aspiration (FNA) is not necessary (Choice A). Hypofunctioning (\"cold\") or indeterminate nodules have a higher malignancy risk and may require FNA based on size, ultrasound findings, and patient characteristics: • High-risk findings on ultrasound include microcalcifications, increased vascularity, hypoechoic appearance, elongated shape, and indistinct or irregular nodule margins. FNA is indicated in such nodules ≥1 cm. • Low-risk nodules on ultrasound (eg, isoechoic, hyperechoic, partially cystic, spongiform) are monitored and biopsied if they grow to 1.5-2 cm. • Purely cystic nodules are almost always benign and do not require FNA. • High-risk patient characteristics include a personal or first-degree family history of thyroid cancer, history of radiation exposure in childhood, rapid nodule growth, and cervical lymphadenopathy. FNA should be considered for any size of nodule in this population. (Choice B) Subclinical hyperthyroidism from nodular disease usually worsens progressively over time. This patient has a large nodule with suppressed TSH, and the TSH will not likely normalize in 3-4 weeks. (Choice C) Anti-thyroid peroxidase antibodies are associated with chronic lymphocytic (Hashimoto) thyroiditis and related disorders (eg, silent and postpartum thyroiditis). Although these conditions can cause a transient hyperthyroid state, they are associated with diffuse, rather than nodular, thyroid enlargement. (Choice D) Serum calcitonin, which is elevated in medullary thyroid cancer and C-cell hyperplasia, is useful for evaluating patients with suspected medullary thyroid cancer. However, routine measurement in patients with thyroid nodules is not recommended due to high false-positive rates. Educational objective: The initial evaluation of thyroid nodules includes a serum TSH assay and thyroid ultrasound. Most patients with normal or elevated TSH should undergo fine-needle aspiration of the nodule for cytologic assessment. Patients with a suppressed TSH should undergo thyroid scintigraphy. Hyperfunctioning nodules are rarely malignant and do not usually require fine-needle aspiration.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_004",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 65-year-old woman comes to the office to discuss the results of a screening DXA test. She has been healthy all her life, has no chronic medical conditions, and takes no medications. The patient experienced menopause at age 52; she was treated with combined estrogen/progestin menopausal hormone therapy due to hot flashes but discontinued the treatment after a few months due to concerns regarding adverse effects. She has experienced a 1 cm (0.4 in) loss of height since that time. The patient quit smoking 30 years ago and drinks wine only on social occasions. She lives alone and has no children. Her mother died of breast cancer at age 56 and her father died at age 82 from a stroke. BMI is 22 kg/m². Physical examination is unremarkable. DXA reveals a T score of -2.1 and -2.6 at femoral neck and lumbar spine, respectively. Complete blood count, comprehensive metabolic panel, and serum phosphorus are normal. Which of the following additional investigations should be performed for this patient at this time?",
"choice_a": "24-hour urine calcium excretion",
"choice_b": "25-hydroxyvitamin D level",
"choice_c": "Lateral spine x-ray",
"choice_d": "No additional investigation",
"choice_e": "Serum protein electrophoresis",
"correct_answer": "B",
"explanation": "Osteoporosis is a common disorder in postmenopausal women. It has a long asymptomatic phase, and treatment can reduce the risk of fracture in patients with osteoporosis. It is therefore an ideal subject for a routine screening program. Screening for osteoporosis by DXA is recommended for women age ≥65, and for younger women with significant risk factors (eg, prior low-trauma fracture, long-term glucocorticoid use, low body weight). Screening DXA is typically performed at the lumbar spine and hips; a T score ≤-2.5 at any location is consistent with osteoporosis. Osteoporosis is most commonly due to age-related bone loss, which accelerates following menopause in most women. However, patients with a new diagnosis of osteoporosis warrant a basic laboratory evaluation for reversible secondary causes. Typical studies include serum chemistries (eg, calcium, phosphorus, albumin, total protein, and renal and hepatic function markers) and complete blood count. In addition, vitamin D stores should be assessed with a 25-hydroxyvitamin D level. Intake of adequate amounts of vitamin D and calcium helps reduce bone loss. (Choice A) Many experts advise measurement of 24-hour urine calcium excretion, especially in women who are likely to have inadequate intestinal absorption of calcium (eg, malabsorptive syndromes) or signs of excess calcium excretion (eg, kidney stones). However, this should be performed only after correction of vitamin D deficiency, and patients should have adequate intake of calcium (1,000-1,200 mg/day) for 2 weeks prior to the test. (Choice C) Spinal imaging (eg, lateral spine x-ray) is indicated for patients with low bone density who are most likely to have vertebral fracture, including women age ≥70 (men age ≥80), loss of height >4 cm, self-reported vertebral fracture, and systemic glucocorticoid therapy >3 months. This patient's minimal loss of height does not require imaging. (Choice D) Patients with a new diagnosis of osteoporosis warrant a basic laboratory evaluation for reversible secondary causes. (Choice E) Serum protein electrophoresis is indicated in patients with evidence of a possible plasma cell dyscrasia (eg, multiple myeloma), such as anemia, renal insufficiency, hypercalcemia, or proteinuria. Educational objective: Patients with osteoporosis warrant laboratory testing for reversible secondary causes. The evaluation should include serum chemistries and complete blood count. In addition, vitamin D stores should be assessed with a 25-hydroxyvitamin D level.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_005",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 32-year-old woman comes to the physician because of palpitations and mild anxiety over the last two months. She feels fatigued and has difficulty falling asleep at night. She delivered a healthy child 9 months ago, and her pregnancy was complicated by hypertension that resolved after delivery. She also gained excessive weight during pregnancy and has been trying to lose weight. Three months ago, she had an episode of acute sinusitis requiring antibiotic therapy. She has no other medical issues and does not take any prescription medications. She does not smoke cigarettes but drinks a few glasses of wine on the weekends. Her blood pressure is 140/80 mm Hg and pulse is 100/min. Her BMI is 32 kg/m². The thyroid gland is non-tender and is not enlarged. The remainder of the physical examination is unremarkable. Laboratory results are as follows: Thyroid stimulating hormone 0.01 µU/mL; Triiodothyronine (T3) 340 ng/dL; Free T4 0.9 ng/dL; Radioactive iodine uptake < 1%; Thyroglobulin 4 ng/mL (5-40 ng/mL); Urine pregnancy test negative. Which of the following is the most likely diagnosis?",
"choice_a": "Chronic autoimmune thyroiditis",
"choice_b": "Factitious thyrotoxicosis",
"choice_c": "Graves' disease",
"choice_d": "Postpartum thyroiditis",
"choice_e": "Subacute (de Quervain's) thyroiditis",
"correct_answer": "B",
"explanation": "This patient presents with thyrotoxicosis that is most likely due to exogenous thyroid supplements. Obese patients often attempt to lose weight by taking dietary supplements that may contain high T3 amounts. Patients present with typical hyperthyroid symptoms (e.g., weight loss, palpitations, etc.), but do not have exophthalmos as seen in Graves' disease. However, patients may have lid lag. There is usually no goiter on examination, since the exogenous thyroid hormones inhibit TSH secretion and cause thyroid atrophy. Laboratory studies usually show high T3, low serum thyroglobulin levels, and suppressed TSH. Radioactive iodine uptake scan shows < 1% uptake (due to suppressed TSH). Serum thyroglobulin is low in exogenous thyroid hormone-induced thyrotoxicosis, but normal to elevated in all other causes of thyrotoxicosis. Fecal measurement of thyroid hormones has also been used to diagnose factitious thyrotoxicosis. (Choice A) Chronic autoimmune thyroiditis more commonly presents with hypothyroidism with elevated TSH and low T4. A small percentage of patients can present with hyperthyroidism, but those patients have suppressed TSH with elevated T4. This patient has normal T4 and elevated T3. (Choice C) Many patients with Graves' disease also do not have thyromegaly or extrathyroidal manifestations. Graves' disease can be ruled out in this patient based on serum thyroglobulin and radioactive iodine uptake, which are elevated in patients with Graves' disease. (Choice D) In most patients, postpartum painless thyroiditis occurs within 1-6 months after delivery. The radioactive iodine uptake is low, but in contrast to factitious thyrotoxicosis, serum thyroglobulin is elevated. (Choice E) Patients with subacute (de Quervain's) thyroiditis have moderate to severe pain and tenderness in the thyroid gland. Educational objective: Suppressed serum thyroglobulin differentiates factitious thyrotoxicosis from other causes of thyrotoxicosis associated with low radioactive iodine uptake.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_006",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 50-year-old man comes to the physician for follow-up of epigastric pain. He was evaluated in the emergency department 3 days ago. Abdominal CT scan with and without contrast showed a 2-cm left adrenal mass. The lesion was homogenous with well-defined margins and low x-ray attenuation (2 Hounsfield units measured on noncontrast images). The abdominal pain resolved with antacids. The patient has no other medical problems and takes no medications. He denies weight gain, headache, flushing, sweating, muscle weakness, myalgias, or polyuria. He smokes 5 cigarettes a day but does not drink alcohol or use illicit drugs. Family history is unremarkable. His blood pressure is 112/76 mm Hg and pulse is 67/min. His BMI is 25 kg/m². The physical examination is unremarkable. Laboratory results are as follows: Sodium 140 mEq/L, Potassium 4.0 mEq/L, Chloride 106 mEq/L, Bicarbonate 24 mEq/L, Blood urea nitrogen 10 mg/dL, Creatinine 1.0 mg/dL, Calcium 9.6 mg/dL, Glucose 86 mg/dL. What is the most appropriate next step in managing this patient?",
"choice_a": "Evaluation for hormonal secretion",
"choice_b": "Left adrenalectomy",
"choice_c": "MRI of the abdomen",
"choice_d": "No further work-up",
"choice_e": "Repeat CT scan in 6 months",
"correct_answer": "A",
"explanation": "This patient has a small, incidentally discovered adrenal nodule on abdominal CT scan. Adrenal incidentalomas are commonly seen due to widespread use of abdominal imaging, with an overall frequency of nearly 6%. Patients with adrenal incidentalomas should be evaluated for excess adrenal hormone production and possible adrenal malignancy. A careful history and physical examination should focus on features of Cushing's syndrome, primary hyperaldosteronism, pheochromocytoma, and adrenal androgen excess in women. CT features suggesting malignancy include > 10 Hounsfield units, mass size > 4 cm, and > 50% contrast retention seen 10 minutes after contrast administration. This patient has no clinical features to suggest adrenal excess or CT findings worrisome for malignancy. The next step is biochemical testing with overnight dexamethasone test to evaluate for excess cortisol and urinary fractionated catecholamines and metanephrines. Biochemical testing for pheochromocytoma and excess cortisol is required even in the absence of symptoms as these disorders can be clinically silent. Plasma aldosterone and plasma aldosterone to renin activity ratio are done only in hypertensive patients to evaluate for primary hyperaldosteronism. (Choice B) Adrenalectomy is considered for large tumors (generally > 4 cm in diameter) or for masses with positive biochemical testing. (Choice C) MRI is preferred over CT for evaluating pheochromocytoma because iodinated contrast can precipitate hypertensive crisis in these patients. However, MRI would be considered only if biochemical testing showed elevated catecholamines and metanephrines. (Choice E) CT follow-up is required to monitor mass stability once adrenal hormonal excess is excluded. Educational objective: Patients with adrenal incidentaloma usually require evaluation for malignancy risk and biochemical testing (eg, overnight dexamethasone test, urinary fractionated catecholamines, and metanephrines) to document excess adrenal hormone production.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_007",
"system": "Endocrine, Diabetes Metabolism",
"stem": "An 82-year-old woman comes to the office due to fatigue. For the last 6 months since her husband died, she has had low energy associated with decreased appetite. The patient has had no weight change, fevers, chills, or night sweats. She sleeps 5-6 hours a night. Medical history is notable for hypertension, depression, and osteoporosis, for which she takes hydrochlorothiazide, sertraline, and alendronate, respectively. She does not smoke, and she drinks alcohol only once or twice a year on social occasions. Temperature is 36.8 C (98.2 F), blood pressure is 128/82 mm Hg, and pulse is 68/min. BMI is 24 kg/m². On examination, the patient is awake, alert, and cooperative. Neck examination is normal with no goiter. Cardiopulmonary examination is normal. Neurologic examination shows normal cranial nerves and motor strength. Ankle reflexes are absent. Laboratory studies show normal glucose, electrolytes, and blood counts. TSH is 7.2 µU/mL, and free T4 is 1.1 ng/dL (normal: 0.9-1.7 ng/dL). Which of the following is the most appropriate next step in management of this patient's symptoms?",
"choice_a": "Initiate low-dose levothyroxine treatment",
"choice_b": "Obtain periodic thyroid function studies",
"choice_c": "Order serum free T3 level",
"choice_d": "Order thyroid ultrasound",
"choice_e": "Order thyrotropin receptor antibody titer",
"correct_answer": "B",
"explanation": "This patient has subclinical hypothyroidism, defined as a serum TSH above the upper limit of normal with serum free T4 in the normal range. Subclinical hypothyroidism is often associated with symptoms that suggest a hypothyroid state, but in most cases symptoms are vague and highly nonspecific (eg, fatigue, constipation). Treatment of subclinical hypothyroidism is recommended for all patients with TSH ≥10 or those age <70 with convincing hypothyroid symptoms or features associated with progression to overt hypothyroidism (eg, enlarging goiter, elevated anti-thyroid peroxidase antibody titer). In contrast, older (age ≥70) patients with subclinical hypothyroidism warrant more conservative management. Levothyroxine replacement in this population confers less benefit than in younger patients and carries an increased risk for adverse events (eg, atrial fibrillation). In addition, some experts believe that the true normal TSH range in older patients may be higher than in younger patients, and levels as high as 8 µU/mL may represent physiologic euthyroidism in patients age >80. In lieu of treatment, older patients should be monitored with periodic retesting (eg, in 1-3 months and every 6-12 months thereafter), and treatment should be considered for those who progress to overt hypothyroidism (Choice A). (Choice C) T3 is produced primarily in peripheral tissues; serum levels correlate poorly with thyroid status. Free T3 levels have some utility in evaluating hyperthyroidism but are not recommended in hypothyroidism. (Choice D) Thyroid ultrasound is primarily used for evaluation of patients with a palpable goiter or thyroid nodules. It is not indicated in routine evaluation of hypothyroid conditions. (Choice E) Thyrotropin (TSH) receptor antibodies are involved in the pathogenesis of Graves disease, the most common cause of hyperthyroidism. Serum titers have little utility in evaluation of hypothyroidism. Educational objective: Patients age ≥70 with subclinical hypothyroidism should generally not be treated but should have periodic monitoring for progression to overt hypothyroidism.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_008",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 63-year-old man comes to the office due to fatigue, lethargy, constipation, dry skin, loss of libido, and cold intolerance for the past 4 months. He has been previously healthy except for a stage I nasopharyngeal tumor treated with radiation 10 years ago. He currently takes no medications. The patient has a 20-pack-year smoking history but quit after being diagnosed with cancer. There is no history of alcohol or illicit drug use. Blood pressure is 100/70 mm Hg and pulse is 60/min. Examination shows dry skin with normal pigmentation. Visual fields are normal on confrontation. The oropharynx is normal. Testes are normal in size but soft. Deep-tendon reflex relaxation time is prolonged. Laboratory results received at 8:00 AM are as follows: Hemoglobin 10.0 g/dL, Hematocrit 30%, MCV 84 fL, Sodium 130 mEq/L, Potassium 3.8 mEq/L, Bicarbonate 22 mEq/L, Creatinine 0.8 mg/dL, Glucose 70 mg/dL, Cortisol 6 µg/dL, FSH 5 mU/mL, TSH 0.4 µU/mL, T3 88 ng/dL, Free T4 0.6 ng/dL, Testosterone total 279 ng/dL, IGF1 normal for age. An MRI of the pituitary reveals no mass lesions. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "24-hour urinary cortisol excretion",
"choice_b": "Cosyntropin stimulation test",
"choice_c": "Free testosterone levels",
"choice_d": "Levothyroxine therapy",
"choice_e": "Thyroid peroxidase antibody titer",
"correct_answer": "B",
"explanation": "This patient's symptoms and low-normal TSH/low free T4 suggest central hypothyroidism. Central hypothyroidism is much less common than primary hypothyroidism and is usually due to destruction of pituitary thyrotrophs by mass lesions, intracranial radiation therapy, or infiltrative disorders. Central hypothyroidism often coexists with other pituitary abnormalities. Initiating treatment for hypothyroidism prior to diagnosing and treating concurrent adrenal insufficiency may induce adrenal crisis (Choice D). Although this patient's morning cortisol level is within the normal range, low-normal cortisol levels may be seen frequently in adrenal insufficiency. A cosyntropin stimulation test is recommended. (Choice A) A 24-hour urinary cortisol excretion is used for evaluation of suspected Cushing's syndrome. (Choice C) Total testosterone is usually an accurate reflection of total body testosterone secretion. (Choice E) Thyroid peroxidase antibody titers are typically elevated in autoimmune (Hashimoto's) thyroiditis, which usually presents with primary hypothyroidism (low free T4, elevated TSH). Educational objective: Central hypothyroidism can be due to mass lesions, intracranial radiation therapy, or infiltrative disorders of the pituitary/hypothalamus. It often coexists with other pituitary deficiencies. Initiating treatment of hypothyroidism prior to diagnosing and treating coexisting adrenal insufficiency may induce adrenal crisis.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_009",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 27-year-old man comes to the physician with fatigue, erectile dysfunction, and muscle weakness. He says, \"I am losing my muscles despite working out every day in the gym.\" He has no past medical history. He had taken over-the-counter supplements to improve his endurance but now cannot afford them as he was recently laid off from his job. He requests a prescription to improve his fatigue and sex drive. He has no headaches, peripheral vision loss, weight gain, decrease in facial hair growth, or joint pain. His vital signs are normal, and BMI is 26 kg/m². He is a well-built, muscular man with minimal gynecomastia. The testes are small and soft. The remainder of the physical examination is normal. Initial laboratory results show normal chemistry profile and hematocrit of 52%. Which of the following laboratory abnormalities would most likely be present on further evaluation?",
"choice_a": "High prolactin levels",
"choice_b": "High TSH levels",
"choice_c": "Increased transferrin saturation",
"choice_d": "Increased insulin-like growth factor 1 levels",
"choice_e": "Low luteinizing hormone",
"correct_answer": "E",
"explanation": "This patient's presentation is suggestive of testosterone deficiency from cessation of anabolic-androgenic steroid use. Anabolic steroids and exogenous testosterone suppress the pituitary-testicular axis, resulting in decreased testicular size and function. The suppression is reversible when anabolic steroids are stopped, but reversal of hypogonadism may take months. Some features such as gynecomastia may not be reversible. However, as long as patients continue use, they may not have erectile dysfunction despite low laboratory values of endogenous testosterone, luteinizing hormone, and follicle-stimulating hormone. (Choice A) Men with prolactinomas typically have galactorrhea, decreased libido, and erectile dysfunction. (Choice B) Although this patient is fatigued, he has no other symptoms of hypothyroidism. (Choice C) This patient's increased hematocrit is due to anabolic-androgenic steroid use; transferrin saturation will be normal. (Choice D) Features of acromegaly include frontal bossing, enlargement of hands and feet, etc.; this patient has no features suggestive of acromegaly. Educational objective: Laboratory testing in patients with anabolic-androgenic steroid abuse shows increased hematocrit and decreased levels of endogenous testosterone, luteinizing hormone, and follicle-stimulating hormone.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_010",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the clinic with concerns about his sexual desire. The patient's libido was previously normal but has progressively diminished over the last 6 months. The patient has also experienced fatigue and malaise without weakness or weight changes. He says, \"I just do not feel like myself anymore.\" The patient is married and has 2 children. He reports a satisfying relationship with his wife, although his recent symptoms have been a source of tension between them. The patient's medical issues include gastroesophageal reflux, irritable bowel syndrome, and chronic low back pain from a workplace injury 2 years ago. He underwent spinal surgery after the incident but has had continuing pain, requiring opioid treatment for the last 2 years. Current medications include omeprazole, long-acting oxycodone, and as-needed acetaminophen and polyethylene glycol. He does not use alcohol, tobacco, or illicit drugs. Vital signs are within normal limits. BMI is 26 kg/m². Physical examination shows normal muscle bulk and body hair distribution. Auscultation of the heart and lungs is normal. Extremities are warm with palpable pulses. The testicles are small in volume with no tenderness or palpable masses. Neurological examination is normal, and visual fields are full to confrontation. Morning serum total testosterone level is 180 ng/dL (normal 300-1200 ng/dL), which is consistent on repeat evaluation. Subsequent laboratory testing shows FSH 3.5 mU/mL, LH 1 mU/mL, TSH 4.7 µU/mL, Free T4 1.6 ng/dL. Which of the following is the most likely cause of the patient's diminished sexual desire?",
"choice_a": "Chronic opioid use",
"choice_b": "Mood disorder",
"choice_c": "Normal aging",
"choice_d": "Pituitary dysfunction",
"choice_e": "Primary gonadal dysfunction",
"correct_answer": "A",
"explanation": "This patient has decreased libido and fatigue associated with testicular atrophy. He also has a persistently low serum testosterone with inappropriately low FSH and LH levels, which is consistent with secondary (central) hypogonadism rather than primary gonadal dysfunction (Choice E). In the setting of a chronic pain disorder and long-term opioid use, this is most likely opioid-related hypogonadism. Chronic opioid use leads to decreased gonadotropin-releasing hormone secretion and is a common cause of hypogonadism. Additional manifestations can include depression, hot flashes, night sweats, osteoporosis, and menstrual irregularities. The ideal management is cessation of opioid therapy, although dose reduction and rotating types may be adequate. (Choice B) A primary mood disorder could explain decreased libido but not testicular atrophy and low LH/FSH. (Choice C) Libyan is typically intact in normal aging, and this patient is too young. (Choice D) TSH and free T4 are normal, and there are no other signs of pituitary dysfunction; the effect is primarily in the hypothalamus. Educational objective: Chronic opioid use leads to decreased gonadotropin-releasing hormone secretion, and is a common cause of hypogonadism.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_011",
"system": "Endocrine, Diabetes Metabolism",
"stem": "An 18-year-old man comes to the physician with bilateral breast enlargement. He has not seen a physician for the past 6 years. He says that his puberty was \"somewhat delayed.\" The patient has no past medical problems and takes no medications. He does not use tobacco, alcohol, or illicit drugs. He has not used any \"steroids\" to build muscle. The patient is 6' 2\" tall and weighs 187 lbs. He has sparse facial hair. His axillary and pubic hair is normal. He has Stage 3 bilateral gynecomastia without any mass or nipple discharge. Visual fields are normal on confrontation. The testes are firm and small (8 mL). Laboratory evaluation shows normal hematocrit and basic metabolic profile. Serum luteinizing and follicle-stimulating hormones are elevated and testosterone is low. Serum prolactin and thyroid-stimulating hormone are normal. The patient is at highest risk for a malignancy at which of the following sites?",
"choice_a": "Adrenal glands",
"choice_b": "Breast",
"choice_c": "Pancreas",
"choice_d": "Prostate",
"choice_e": "Thyroid gland",
"correct_answer": "B",
"explanation": "This patient has characteristic features of Klinefelter's syndrome, which include delayed puberty, tall stature, gynecomastia, small firm testes, testosterone deficiency, and elevated gonadotrophins. The testes are firm due to damaged seminiferous tubules. The most common genotype is 47,XXY. Patients with Klinefelter's syndrome are at increased risk of breast cancer. Mortality is high compared to the general population. Clinicians may order periodic mammograms after age 45. They also have a higher risk of developing extra-gonadal germ cell tumors, non-Hodgkin's lymphoma, and lung disease. (Choices A and D) Klinefelter's is rarely associated with adrenal or prostate cancer. (Choice C) Pancreatic cancer risk is associated with tobacco use and chronic pancreatitis. (Choice E) Thyroid cancer risk is associated with radiation exposure and familial syndromes. Educational objective: Klinefelter's syndrome is the most common genetic cause of primary hypogonadism. Patients with Klinefelter's syndrome are at increased risk of breast cancer.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_012",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 50-year-old woman comes to the clinic to follow up diabetes. She feels well, exercises 1 or 2 days a week for 20-30 minutes, and has a healthy diet. The patient's medical issues include type 2 diabetes mellitus treated with metformin and hyperlipidemia treated with 20 mg atorvastatin daily. She has no chronic complications of diabetes. The patient drinks a glass of red wine 4 or 5 times a week to increase her \"good cholesterol.\" Her weight has not changed in the last year. She has a 10-pack-year smoking history but quit when she was in her early 30s. Her father had a myocardial infarction at age 55. Blood pressure is 110/70 mm Hg and pulse is 66/min. BMI is 26 kg/m². Laboratory results: Total cholesterol 159 mg/dL, LDL 92 mg/dL, Triglycerides 180 mg/dL, HDL 34 mg/dL, Glucose 108 mg/dL, A1c 6.1%. The patient's baseline LDL was 145 mg/dL with an estimated 10-year risk of ASCVD of 3.1%. Which of the following is the most appropriate next step to address this patient's lipid abnormalities?",
"choice_a": "Fenofibrate",
"choice_b": "Fish oil supplement",
"choice_c": "Increased dose of atorvastatin",
"choice_d": "Increased frequency and intensity of exercise",
"choice_e": "Niacin",
"correct_answer": "D",
"explanation": "Current guidelines recommend that patients age 40-75 with diabetes receive statin therapy. Patients with a calculated 10-year risk ≥7.5% should receive high-intensity statin therapy; those with a risk <7.5% may receive moderate-intensity statin therapy (eg, atorvastatin 10-20 mg). This patient is on appropriate statin therapy (Choice C). She has low HDL and borderline high triglycerides. Trials of medications to raise HDL or lower mild triglyceride elevations (Choice A, B, E) have not consistently shown benefits in cardiovascular outcomes. This patient may benefit from the improved cardiovascular fitness and possible rise in HDL attained through a more intense and frequent exercise regimen. (Choice E) Niacin may worsen glycemic control in diabetic patients and has not shown additional benefit. Educational objective: Targeting low HDL with nonstatin medications has not been shown to improve cardiovascular outcomes.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_013",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old woman comes to the office to discuss an elevated calcium level. Mild hypercalcemia was recently noted on a serum chemistry panel. The patient has no musculoskeletal symptoms other than occasional low back pain. She experienced menopause 2 years ago. Current medications include lisinopril and a daily over-the-counter calcium and vitamin D supplement. Her mother suffered a hip fracture at age 60. BMI is 25 kg/m². Laboratory results: Creatinine 1.0 mg/dL, Calcium 10.8 mg/dL, Albumin 4.0 g/dL, TSH 2.7 µU/mL, 25-hydroxyvitamin D 32 ng/mL. Repeat serum calcium is 10.9 mg/dL and parathyroid hormone level is 89 pg/mL (normal: 10-65). DXA T-scores: Femoral neck -1.3, Lumbar spine -0.9, Radius -1.8. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "24-hour urinary calcium measurement",
"choice_b": "Bisphosphonate therapy",
"choice_c": "Follow-up in 6-12 months",
"choice_d": "Referral for parathyroid surgery",
"choice_e": "Ultrasound of the neck",
"correct_answer": "A",
"explanation": "This patient has primary hyperparathyroidism (PHPT). Most patients are asymptomatic. Definitive treatment is surgical parathyroidectomy. Indications for surgery include age <50, symptomatic hypercalcemia, or complications (osteoporosis T-score <-2.5, GFR <60). Other patients at elevated risk include those with serum calcium ≥1 mg/dL above normal or excessive urinary calcium loss (>400 mg/day). This patient has no confirmed complications but should have a 24-hour urine calcium measurement to determine the need for parathyroidectomy. Urine calcium measurement can also identify familial hypocalciuric hypercalcemia (FHH). (Choice B) Bisphosphonates may be considered for patients with osteopenia who do not meet surgical criteria. (Choice E) Localization with neck ultrasound is performed if surgery is required. Educational objective: Indications for parathyroidectomy include age <50, symptomatic hypercalcemia, complications, or elevated risk of complications (urinary calcium excretion >400 mg/day).",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_014",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 44-year-old woman with celiac disease comes to the physician with complaints of bone pain in her lower back and extremities. She followed a gluten-free diet for the first 5 years but has not done so for the last 2 years. The patient has 2 or 3 loose bowel movements a day. She also complains of weakness and low energy. Physical examination shows no bony deformities. Her conjunctivae are pale. Which of the following is the most likely finding in this patient's initial laboratory workup?",
"choice_a": "Calcium: Normal, Phosphorus: Low, Alkaline phosphate: High, Intact parathyroid hormone: High",
"choice_b": "Calcium: Low, Phosphorus: High, Alkaline phosphate: Normal, Intact parathyroid hormone: High",
"choice_c": "Calcium: Low, Phosphorus: High, Alkaline phosphate: Normal, Intact parathyroid hormone: Low",
"choice_d": "Calcium: Normal, Phosphorus: High, Alkaline phosphate: High, Intact parathyroid hormone: High",
"choice_e": "Calcium: High, Phosphorus: Low, Alkaline phosphate: High, Intact parathyroid hormone: High",
"correct_answer": "A",
"explanation": "Uncontrolled celiac disease results in decreased vitamin D absorption. This leads to hypocalcemia and secondary hyperparathyroidism (elevated PTH). PTH causes increased bone resorption (increasing alkaline phosphatase), decreases urinary calcium excretion, and increases urinary phosphate excretion, which often normalizes serum calcium but lowers serum phosphate. Prolonged deficiency leads to osteomalacia and eventual hypocalcemia. (Choice B) suggestive of pseudohypoparathyroidism. (Choice C) seen in hypoparathyroidism. (Choice D) Renal osteodystrophy causes high phosphorus. (Choice E) Primary hyperparathyroidism results in high calcium. Educational objective: Vitamin D deficiency due to malabsorption leads to secondary hyperparathyroidism and increased bone turnover.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_015",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 34-year-old woman comes to the office due to fatigue. She feels excessively sleepy during the day and has dull, achy headaches almost every morning. The patient had papillary thyroid cancer 3 years ago, treated with thyroidectomy and iodine ablation. She has post-ablative hypothyroidism. Current medications include levothyroxine, vitamin D, calcium carbonate, and a combination oral contraceptive. The patient has gained 1.8 kg since starting the oral contraceptive. She has a sedentary lifestyle. Blood pressure is 144/80 mm Hg. BMI is 34 kg/m². There is trace pitting ankle edema. Laboratory results: Hemoglobin 16.5 g/dL, Hematocrit 51%, Bicarbonate 30 mEq/L, Total T4 15 µg/dL, TSH 0.56 µU/mL, Thyroglobulin undetectable. Which of the following is the best next step in management of this patient?",
"choice_a": "Decrease the dose of levothyroxine",
"choice_b": "Discontinue birth control pills",
"choice_c": "Order polysomnogram",
"choice_d": "Perform overnight dexamethasone suppression test",
"choice_e": "Start hydrochlorothiazide",
"correct_answer": "C",
"explanation": "This patient has fatigue, daytime sleepiness, and morning headaches. She is obese with mild hypertension, polycythemia (Hct 51%), and increased bicarbonate (likely due to hypercarbia). These clinical features suggest obstructive sleep apnea (OSA). A sleep study (polysomnogram) is needed to confirm the diagnosis. (Choice A) This patient's elevated total T4 is explained by increased thyroxine-binding globulin from estrogen in oral contraceptives and does not indicate over-replacement. (Choice B) Oral contraceptives have not been confirmed to cause weight gain in randomized studies. (Choice D) While Cushing syndrome can cause hypertension and obesity, daytime sleepiness and polycythemia make OSA more likely. Educational objective: Clinical features of OSA include obesity, fatigue, daytime sleepiness, morning headaches, hypertension, and polycythemia.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_016",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the office for follow-up of type 2 diabetes mellitus. He feels well. The patient was diagnosed 10 years ago; history is notable for hypertension, hypercholesterolemia, obesity, and osteoarthritis. Three years ago, he had a bleeding peptic ulcer. Current medications include metformin, insulin glargine, hydrochlorothiazide, atorvastatin (10 mg), ramipril, ranitidine, and amlodipine. He currently smokes a half pack of cigarettes daily. BMI is 40 kg/m². Laboratory results: Glucose 148 mg/dL, LDL 130 mg/dL, Triglycerides 220 mg/dL, A1c 7.9%. The patient's estimated 10-year risk of cardiovascular events is 15%. Which of the following is the most appropriate intervention to reduce this patient's risk for coronary events?",
"choice_a": "Add daily low-dose aspirin",
"choice_b": "Add fenofibrate",
"choice_c": "Increase atorvastatin dose",
"choice_d": "Intensify antihypertensive regimen",
"choice_e": "Intensify diabetic regimen",
"correct_answer": "C",
"explanation": "Current guidelines recommend statin therapy for all diabetic patients age 40-75. High-intensity statin therapy (atorvastatin 40-80 mg or rosuvastatin 20-40 mg) is recommended for those with a 10-year risk ≥7.5%. This patient's risk is 15%, so the dose of atorvastatin should be increased. (Choice A) Aspirin for primary prevention is recommended for diabetes with risk >10%, but the benefit is offset by the risk of GI bleeding, especially in this patient with a prior peptic ulcer. (Choice B) Fibrates have not been shown to reduce CVD risk when added to statins. (Choice D) Blood pressure is 130/77, which is within the target of 140/90. (Choice E) Intensive glycemic control (A1c ≤7%) reduces microvascular complications but does not appear to reduce CVD risk. Educational objective: Patients age 40-75 with diabetes and a 10-year risk ≥7.5% should receive high-intensity statin therapy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_017",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 50-year-old woman comes to the physician for follow-up of type 2 diabetes mellitus. She was diagnosed 2 years ago and currently takes metformin 1000 mg twice daily. Her blood pressure is 152/92 mm Hg and pulse is 88/min. Her BMI is 39 kg/m². Acanthosis nigricans is present. Laboratory results: A1c 9.0%, Creatinine 0.8 mg/dL, LDL 132 mg/dL. Urine is positive for microalbumin. Which of the following measures is most likely to achieve a hemoglobin A1c <6.0% in one year in this patient?",
"choice_a": "Adding a sulfonylurea",
"choice_b": "Adding an incretin mimetic",
"choice_c": "Bariatric surgery",
"choice_d": "Continued intensive nutritional counseling",
"choice_e": "Starting insulin therapy",
"correct_answer": "C",
"explanation": "This patient has uncontrolled diabetes, hyperlipidemia, hypertension, and severe obesity (BMI 39). Candidates for bariatric surgery include those with BMI ≥40 or BMI 35-40 with a comorbid illness. Randomized controlled trials have shown that Roux-en-Y gastric bypass is more effective than conventional medical therapy in achieving diabetic remission (A1c <6.0% or <7.0%) in patients with severe obesity. (Choices A, B, D, and E) Medical management and nutritional counseling are less likely to achieve remission compared to surgery. Educational objective: Severely obese patients with type 2 diabetes have a higher likelihood of achieving diabetic remission with bariatric surgery compared to conventional medical therapy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_018",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 72-year-old man with a seven-year history of type 2 diabetes mellitus comes to the physician because of pain in his feet. He has had numbness and tingling for two years. He recently began experiencing burning pain in both feet that extends to the mid-calf and keeps him awake at night. He has tried capsaicin ointment without relief. Examination shows decreased sensation to light touch and pinprick; ankle jerk reflex is absent bilaterally. Laboratory data: TSH, protein electrophoresis, and B12 are normal. HbA1c is 7.5%. Which of the following would be the best initial therapeutic option for this patient?",
"choice_a": "Amitriptyline",
"choice_b": "Carbamazepine",
"choice_c": "Naproxen",
"choice_d": "Oxycodone",
"choice_e": "Pregabalin",
"correct_answer": "E",
"explanation": "This patient has painful diabetic neuropathy. Pregabalin is an effective first-line agent for decreasing pain with a low side effect profile. (Choice A) Tricyclic antidepressants are usually preferred in younger patients; in older patients, they cause significant anticholinergic side effects (dry mouth, urinary retention). (Choice B) Carbamazepine is usually a second-line therapy. (Choice C) NSAIDs do not treat neuropathic pain effectively. (Choice D) Opiates are not first-line and carry potential side effects like somnolence and constipation. Educational objective: Pregabalin is an effective first-line agent in elderly patients for diabetic neuropathy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_019",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 46-year-old man is evaluated for decreased sexual performance and moderate fatigue over the last 2 years. He was diagnosed with sick sinus syndrome a year ago and received a permanent pacemaker. Physical examination shows mild testicular atrophy without gynecomastia. Laboratory results: FSH 5 mU/mL (5-15), LH 4 mU/mL (3-15), Testosterone 175 ng/dL (300-1200). The patient should be evaluated specifically for which of the following conditions?",
"choice_a": "Adrenal neoplasm",
"choice_b": "Hereditary hemochromatosis",
"choice_c": "Karyotype abnormalities",
"choice_d": "Lyme disease",
"choice_e": "Varicocele",
"correct_answer": "B",
"explanation": "This patient with cardiac conduction abnormalities (sick sinus syndrome) and secondary hypogonadism likely has hereditary hemochromatosis (HH). Cardiac conduction abnormalities occur in about 31% of cases. Approximately 45% of patients develop secondary hypogonadism due to iron accumulation in pituitary gonadotrophs, resulting in low testosterone, LH, and FSH. (Choice A) Estrogen-secreting adrenal adenomas would typically cause gynecomastia. (Choice C) Klinefelter syndrome presents with primary hypogonadism (elevated LH/FSH). (Choice D) Lyme carditis causes AV block but not hypogonadism. (Choice E) Varicocele causes primary hypogonadism. Educational objective: Hereditary hemochromatosis is an important cause of secondary hypogonadism due to iron deposition in the pituitary gonadotrophs.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_020",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 56-year-old woman is evaluated for persistent fatigue. A year ago, she developed panhypopituitarism following resection of a large pituitary tumor. Current treatment includes hydrocortisone and levothyroxine. BMI is 26 kg/m². Laboratory results: Sodium 137 mEq/L, Creatinine 0.8 mg/dL, TSH 0.3 µU/mL. An MRI of the pituitary 6 months ago showed no residual tumor. Which of the following is the most appropriate next step in management of this patient's disorder?",
"choice_a": "Add liothyronine therapy",
"choice_b": "Measure free T4 level",
"choice_c": "Measure insulin-like growth factor-1 level",
"choice_d": "Measure total T3 level",
"choice_e": "Reduce levothyroxine dose",
"correct_answer": "B",
"explanation": "This patient has central (secondary) hypothyroidism. The diagnosis is established by a low free T4 with a low or inappropriately normal TSH. Unlike primary hypothyroidism, TSH in central hypothyroidism demonstrates minimal response to levothyroxine supplementation and is usually undetectable even if the dose is inadequate. Therefore, dosing should be based on serum free T4 levels, adjusted to maintain T4 in the high-normal range. (Choices A and D) T3 levels correlate poorly with overall thyroid status. (Choice C) IGF-1 can be low in a hypothyroid state; T4 should be confirmed first. (Choice E) Reducing the dose based on a low TSH is appropriate for primary hypothyroidism but not central. Educational objective: Levothyroxine therapy in central hypothyroidism should be based on serum free T4 levels, as TSH may not rise in patients with inadequate replacement.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_021",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 51-year-old woman comes to the office due to fatigue and vague upper abdominal pain. She has a 15-pack-year smoking history. Laboratory results: Calcium 11.0 mg/dL, Bicarbonate 27 mEq/L, TSH 0.5 µU/mL. Repeat serum calcium is 11.1 mg/dL. Parathyroid hormone is 85 pg/mL (10-65 pg/mL). 25-hydroxyvitamin D is 10 ng/mL (30-74 ng/mL). Which of the following is the most likely cause of this patient's hypercalcemia?",
"choice_a": "Granulomatous disease",
"choice_b": "Milk-alkali syndrome",
"choice_c": "Primary hyperparathyroidism",
"choice_d": "Squamous cell lung carcinoma",
"choice_e": "Vitamin D deficiency",
"correct_answer": "C",
"explanation": "Hypercalcemia with an elevated or inappropriately normal PTH (PTH-dependent) is mainly caused by primary hyperparathyroidism (PHPT). Parathyroid adenoma causes 90% of PHPT. (Choice A) Granulomatous disease causes PTH-independent hypercalcemia (low PTH). (Choice B) Milk-alkali syndrome is associated with low PTH and renal insufficiency. (Choice D) Squamous cell carcinoma hypercalcemia is PTH-independent. (Choice E) Vitamin D deficiency causes hypocalcemia with secondary high PTH; it does not cause hypercalcemia, though it can coexist with PHPT. Educational objective: Hypercalcemia with an elevated or inappropriately normal PTH is caused by very few disorders, mainly primary hyperparathyroidism.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_022",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old woman comes to the office due to fatigue, weight loss, and heat intolerance. Neck examination reveals a 2.5-cm nodule in the right lobe. Laboratory results: TSH <0.03 µU/mL, T3 200 ng/dL, Free T4 1.8 ng/dL. Thyroid ultrasound shows a solitary 2.5-cm nodule. Radioactive iodine uptake scan at 24 hours is 30%, predominantly in the nodule with minimal surrounding uptake. Which of the following additional interventions is the most appropriate management for this patient's condition?",
"choice_a": "Fine-needle aspiration of the right thyroid nodule",
"choice_b": "Long-term methimazole therapy",
"choice_c": "Prednisone administration",
"choice_d": "Radioactive iodine ablation",
"choice_e": "Reassurance and repeat thyroid function in 6 weeks",
"correct_answer": "D",
"explanation": "This patient has hyperthyroidism associated with a toxic adenoma (RAIU concentrated within the nodule). Definitive treatment for overt hyperthyroidism from a toxic adenoma is radioactive iodine ablation or surgery. Radioiodine is taken up primarily in the abnormal tissue, leaving healthy tissue intact. (Choice A) FNA is not recommended for \"hot\" nodules as they are rarely malignant. (Choice B) Chronic use of thionamides is generally for patients who are poor surgical candidates. (Choice C) Prednisone is not indicated for toxic adenoma. Educational objective: Toxic thyroid adenoma or multinodular goiter with hyperthyroidism is treated with radioactive iodine ablation or surgical thyroidectomy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_023",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 66-year-old woman with a history of hypothyroidism takes levothyroxine. Her TSH level is <0.01 mU/L. The patient refuses to decrease the dose as she feels exhausted on lower doses. Which of the following is a possible complication of levothyroxine overreplacement in this patient?",
"choice_a": "Cardiac arrhythmia",
"choice_b": "Dementia",
"choice_c": "Hyperlipidemia",
"choice_d": "Ophthalmopathy",
"choice_e": "Thyroid cancer",
"correct_answer": "A",
"explanation": "Overtreatment with levothyroxine is associated with excessive bone loss and cardiac arrhythmias (eg, atrial fibrillation), particularly in older patients with suppressed TSH. (Choice B) No proven association with dementia. (Choice C) Hypothyroidism increases LDL; thyrotoxicosis decreases it. (Choice D) Ophthalmopathy is specific to Graves' disease. (Choice E) Low TSH may actually be protective against thyroid cancer. Educational objective: Overtreatment of hypothyroidism with levothyroxine is associated with an increased risk of excessive bone loss and atrial fibrillation.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_024",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 42-year-old man comes for evaluation of fatigue, constipation, and a 4.5-kg weight gain. Blood pressure is 145/95 mm Hg; pulse is 66/min. BMI is 31 kg/m². Laboratory results: Total cholesterol 216 mg/dL, LDL 140 mg/dL, Triglycerides 200 mg/dL. Which of the following is the most appropriate next step in management of this patient's metabolic abnormalities?",
"choice_a": "Advise weight loss and reassess in 3 months",
"choice_b": "Initiate statin and ACE inhibitor therapy",
"choice_c": "Initiate statin therapy only",
"choice_d": "Obtain apolipoprotein B level",
"choice_e": "Obtain serum TSH level",
"correct_answer": "E",
"explanation": "This patient has dyslipidemia and symptoms (fatigue, weight gain, constipation) suggestive of hypothyroidism. Hypothyroidism is a common cause of dyslipidemia. Current guidelines recommend screening for thyroid disorders with serum TSH in all patients with newly diagnosed dyslipidemia. Treatment with levothyroxine often improves the lipid profile. TSH should also be checked before statins because untreated hypothyroidism increases the risk of statin-induced myopathy. Educational objective: Hypothyroidism is a common cause of dyslipidemia; patients should be screened with serum TSH.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_025",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 54-year-old man is evaluated for a thyroid nodule. Ultrasound reveals a 2-cm nodule in the right lobe. Fine-needle aspiration findings are consistent with medullary thyroid cancer. MRI of the neck shows no local extension. Laboratory results: TSH 1.2 µU/mL, Calcitonin 100 pg/mL (normal <10). Plasma fractionated metanephrines are normal. Which of the following is the best next step in managing this patient?",
"choice_a": "CT scan of abdomen",
"choice_b": "Germline RET mutation analysis",
"choice_c": "Somatic RAS mutation testing",
"choice_d": "Thyroglobulin levels",
"choice_e": "Triphasic bone scan",
"correct_answer": "B",
"explanation": "The American Thyroid Association recommends germline RET mutation testing in all patients with newly diagnosed medullary thyroid cancer (MTC) to identify MEN2 syndromes. (Choice A) CT of abdomen is indicated if calcitonin is >400 or local lymph nodes are present. (Choice D) Thyroglobulin is a marker for follicular cell-derived cancer, not MTC. Educational objective: Germline RET gene mutation testing is recommended in all patients with medullary thyroid cancer.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_026",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 59-year-old man with ischemic cardiomyopathy (EF 25%) presents with painful enlargement of both breasts. Spironolactone was added to his regimen 8 weeks ago. He also started over-the-counter omeprazole. On examination, bilateral tender gynecomastia is noted. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Discontinue omeprazole",
"choice_b": "Discontinue spironolactone and start eplerenone",
"choice_c": "Obtain serum prolactin and thyroid-stimulating hormone levels",
"choice_d": "Obtain serum testosterone levels",
"choice_e": "Start testosterone replacement therapy",
"correct_answer": "B",
"explanation": "This patient has gynecomastia likely due to spironolactone, which blocks testosterone receptors and increases testosterone conversion to estrogen. Eplerenone is a more specific mineralocorticoid receptor antagonist and can be substituted as it has fewer endocrine side effects. (Choice A) Omeprazole has a <1% risk of gynecomastia. (Choices C, D, E) Symptoms are likely due to receptor blockade, so measuring or adding testosterone is not indicated. Educational objective: Spironolactone can cause anti-androgenic effects like gynecomastia; eplerenone is a more specific alternative.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf"
},
{
"id": "ENDO_027",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 42-year-old man comes to the physician because of a tingling sensation and pain in both hands. He believes that his hands are 'swollen.' He reports bilateral tingling and electric shock-like pain on the lateral aspect of his palms and first three digits. He is a software engineer and has difficulty typing because of bilateral hand pain. He also complains of fatigue and excessive malodorous sweat. His other medical problems include obstructive sleep apnea and hypertension and he uses CPAP at night. His medications include enalapril, amlodipine, chlorthalidone, and aspirin. He does not smoke cigarettes or drink alcohol. His blood pressure is 146/88 mm Hg, pulse is 88/min, and BMI is 34 kg/m². Skin examination reveals oily skin with skin tags over the nape of his neck. Tinel's sign is positive bilaterally. Laboratory results are as follows:\r\n\r\nSerum chemistry\r\nSodium 135 mEq/L\r\nPotassium 4.0 mEq/L\r\nCreatinine 1.2 mg/dL\r\nCalcium 9.0 mg/dL\r\nGlucose 112 mg/dL\r\n\r\nLiver function studies\r\nTotal protein 6.0 g/dL\r\nAlbumin 3.7 g/dL\r\nAlkaline phosphatase 70 U/L\r\nAspartate aminotransferase (SGOT) 37 U/L\r\nAlanine aminotransferase (SGPT) 24 U/L\r\n\r\nEndocrine\r\nThyroid stimulating hormone 1.3 µU/mL\r\n\r\nWhich of the following is the best next step in managing this patient?",
"choice_a": "Rheumatoid factor levels",
"choice_b": "Growth hormone level",
"choice_c": "Insulin-like growth factor I levels",
"choice_d": "MRI of the brain",
"choice_e": "Nerve conduction studies",
"correct_answer": "C",
"explanation": "This patient presents with carpal tunnel syndrome (CTS). His other clinical features (eg, skin tags, oily skin, excessive malodorous sweat, enlarging hands, and sleep apnea) suggest a secondary cause of CTS such as acromegaly. Carpal tunnel syndrome can occur in up to 20% of patients with acromegaly, likely due to edema of the median nerve. The symptoms resolve rapidly with treatment of acromegaly. Elevated growth hormone (GH) also stimulates hepatic insulin-like growth factor I (IGF-I) secretion, which is responsible for most of the clinical features. IGF-I levels are consistently elevated (without fluctuations) in all patients with acromegaly. In contrast, GH levels can fluctuate in a diurnal pattern and cannot be used alone to make a diagnosis (Choice B). As a result, measuring IGF-I is the preferred single screening test for acromegaly; however, IGF-I levels can decrease with age and require interpretation according to the patient's age. Patients with elevated IGF-I levels should undergo confirmatory dynamic testing with an oral glucose suppression test (75 g oral glucose load). Patients without acromegaly have a decrease in GH to < 1 ng/mL within 2 hours of glucose load. Acromegaly patients usually have GH levels >2 ng/mL and should undergo brain MRI to look for a pituitary mass (found in nearly 70% of patients) (Choice D). Patients with a normal MRI should be evaluated for ectopic GH secretion. (Choice A) Carpal tunnel syndrome is associated with hypothyroidism and rheumatoid arthritis (RA). However, this patient has no symptoms of RA. (Choice E) Carpal tunnel syndrome is diagnosed clinically in most patients, and nerve conduction studies are usually reserved for doubtful cases or assessing the severity of median nerve compression. Educational objective: Insulin-like growth factor I (IGF-I) is the preferred screening test for acromegaly. Measuring random GH is not as sensitive because of wide fluctuations in circulating levels.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_028",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 75-year-old woman is seen in consultation prior to hip surgery. She fell on icy ground 36 hours ago and sustained an intertrochanteric right hip fracture. The patient lives independently. Her other medical problems include hypertension, osteoporosis, type 2 diabetes mellitus, and mild cognitive impairment. Her right lower extremity is shortened and externally rotated, but physical examination is otherwise unremarkable. Records indicate that her primary care provider obtained thyroid function tests a month ago as part of an evaluation for hypertension that showed the following: TSH 8 µU/mL, Thyroxine (T4), serum 7 µg/dL (normal: 5-12 µg/dL). Her current laboratory results are as follows: Hemoglobin 11.5 g/dL, Platelets 155,000/mm³, Creatinine 1.2 mg/dL. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Delay surgery and start oral levothyroxine",
"choice_b": "Delay surgery until results of cortisol, free T4, and repeat TSH return",
"choice_c": "Give intravenous thyroxine and hydrocortisone and proceed with surgery",
"choice_d": "Give intravenous thyroxine and proceed with surgery",
"choice_e": "Proceed with surgery",
"correct_answer": "E",
"explanation": "This patient has subclinical hypothyroidism (elevated TSH with normal T4), which can gradually progress to overt hypothyroidism over a period of many months to years. Overt hypothyroidism, especially when severe, is associated with an increased risk of perioperative complications (eg, atrial fibrillation). In addition, severe hypothyroidism due to autoimmune thyroiditis may coexist with adrenal insufficiency, which can further increase the risk of perioperative complications. However, subclinical hypothyroidism is not associated with a significant risk of adverse short-term outcomes. A delay in hip surgery >48-72 hours can impair rehabilitation and possibly increase postoperative complications. This patient is asymptomatic with a normal T4 level; surgery should proceed with close clinical monitoring (Choices A and B). (Choices C and D) Intravenous thyroxine is usually given to patients with profound hypothyroidism, which is not present in this patient. Although untreated adrenal insufficiency can coexist with hypothyroidism, this patient's normal physical examination and laboratory results make this less likely. Educational objective: Subclinical hypothyroidism is relatively common in women age >60. Severe overt hypothyroidism is associated with an increased risk of surgical complications, but asymptomatic subclinical hypothyroidism does not warrant delay of urgent surgical procedures.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_029",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 56-year-old man comes to the office due to blurry vision and numbness in his feet. He was diagnosed with type 2 diabetes mellitus 12 years ago, and his other medical issues include hypertension and hyperlipidemia. The patient's daily blood glucose readings vary from 250 to 300 mg/dL. He has had no hypoglycemic episodes. The patient's medications include metformin, lisinopril, extended-release nifedipine, atorvastatin, and aspirin. He is noncompliant with his diet and does not exercise. The patient drinks 2 cans of beer on Sundays and does not smoke. His father had diabetes and died of a myocardial infarction at age 56. Blood pressure is 140/80 mm Hg and pulse is 70/min. BMI is 31 kg/m². 10-g monofilament sensation is decreased at the soles bilaterally. The remainder of the examination is unremarkable. Fasting laboratory results are as follows: Serum sodium 134 mEq/L, Serum potassium 3.8 mEq/L, Creatinine 1.6 mg/dL, Glucose 307 mg/dL, Estimated glomerular filtration rate 48 mL/min/1.73 m², Aspartate aminotransferase 37 U/L, Alanine aminotransferase 24 U/L, Hemoglobin A1c 10.1%, TSH 1.8 µU/mL. Along with diet and exercise, which of the following options would be most appropriate to improve this patient's glycemic control?",
"choice_a": "Continue metformin and add insulin",
"choice_b": "Continue metformin and add liraglutide",
"choice_c": "Continue metformin and add sitagliptin",
"choice_d": "Discontinue metformin and add canagliflozin",
"choice_e": "Discontinue metformin and add insulin",
"correct_answer": "A",
"explanation": "This patient has poorly controlled diabetes mellitus with complications (peripheral neuropathy, nephropathy). Strict control (hemoglobin A1c <7%) is associated with a reduced risk of microvascular complications and is advised for most patients. Metformin is the preferred first-line medication, although it must be used with caution in patients with chronic kidney disease. Metformin should not be initiated if the estimated glomerular filtration rate (eGFR) is < 30 mL/min/1.73 m². In patients already taking metformin, it may be continued cautiously if the eGFR drops to 30-45 mL/min/1.73 m² but should be stopped if the eGFR drops to <30 mL/min/1.73 m². Patients whose diabetes is not controlled on metformin alone should receive dual therapy with metformin plus a second agent, with the choice individualized based on side effects and patient comorbidities. However, patients with A1c ≥10%, glucose ≥300 mg/dL, or osmotic (eg, polyuria, polydipsia) or catabolic symptoms (eg, weight loss, urine ketosis) should be considered for insulin. Patients who do not achieve glycemic targets on 2 or 3 oral agents should also be considered for insulin. At the time of insulin initiation, most oral agents can be discontinued, but metformin is usually continued and can reduce insulin requirements (Choice E). (Choices B and C) Glucagon-like peptide-1 receptor agonists (eg, liraglutide) increase endogenous insulin secretion and suppress appetite and glucagon release. They decrease A1c by 0.5%-1%. Dipeptidyl peptidase-4 inhibitors (eg, sitagliptin) decrease A1c by 0.5%-0.8%. Neither would be sufficient for this patient, but either could be combined with basal insulin if control is not achieved with the addition of insulin. (Choice D) Sodium-glucose cotransporter-2 inhibitors (eg, canagliflozin) inhibit reabsorption of glucose in the proximal renal tubules. They can be used as a second agent in combination with metformin. However, they are contraindicated in patients with renal impairment, and they provide only an average reduction in A1c of 0.5%-1%, which would be insufficient for this patient. Educational objective: Patients whose type 2 diabetes is not controlled on metformin should receive dual therapy with metformin plus a second agent. However, patients with hemoglobin A1c ≥10%, glucose ≥300 mg/dL, or osmotic or catabolic symptoms should be considered for the addition of insulin.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_030",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 28-year-old man comes to the office for follow-up of hypertension. The patient has a 6-month history of fatigue and occasional headaches. When he came for evaluation 3 weeks ago, his blood pressure was 160/100 mm Hg. Medical history is unremarkable and he takes no medications. He has no family history of stroke or early heart disease. The patient smokes a pack of cigarettes daily but does not use alcohol or illicit drugs. Blood pressure is 164/102 mm Hg and pulse is 82/min. BMI is 28 kg/m². Physical examination is unremarkable. Laboratory results are as follows: Hemoglobin 14.4 g/dL, Creatinine 0.8 mg/dL, Potassium 3.1 mEq/L, Plasma renin activity Undetectable, Plasma aldosterone concentration 35 ng/dL (normal: 7-30). ECG shows normal sinus rhythm without ischemic changes. Urinalysis shows 1+ proteinuria. CT scan of the abdomen reveals normal adrenal glands. Which of the following is the best next step in management of this patient's disorder?",
"choice_a": "Adrenal venous sampling",
"choice_b": "CT angiogram of the renal vessels",
"choice_c": "Dexamethasone suppression test",
"choice_d": "Laparoscopy",
"choice_e": "Treatment with eplerenone",
"correct_answer": "A",
"explanation": "Primary hyperaldosteronism (PH) is characterized by hypertension associated with hypokalemia and metabolic alkalosis. Some patients may not have spontaneous hypokalemia but rapidly develop hypokalemia if given diuretics. Despite increased renal reabsorption of sodium, edema and hypernatremia are usually minimal or absent due to aldosterone escape. The initial evaluation for PH should include a morning plasma aldosterone concentration (PAC) to plasma renin activity (PRA) ratio. A PAC/PRA ratio >20 with plasma aldosterone >15 ng/dL suggests PH. The diagnosis is most often confirmed with an aldosterone suppression test (either an oral sodium load test or a saline infusion test); persistent aldosterone production despite an oral or intravenous sodium load confirms PH. However, for patients with spontaneous hypokalemia, undetectable PRA, and PAC >30 ng/dL (as seen in this patient), confirmatory adrenal suppression testing may be omitted as the findings are unlikely to be from any other cause. Once PH is confirmed, adrenal imaging (usually with CT scan) should be obtained to differentiate bilateral adrenal hyperplasia (50%-60%) from aldosterone-producing adrenal adenoma (40%-50%). However, CT has low sensitivity for small tumors; therefore, if CT does not reveal a discrete unilateral mass (as with this patient), adrenal venous sampling should be obtained to differentiate between hyperplasia and adenoma. (Choice B) Renal CT angiogram is used to diagnose renovascular hypertension due to renal artery stenosis or fibromuscular dysplasia. However, renovascular hypertension is associated with secondary hyperaldosteronism (elevated renin and aldosterone levels), not primary. (Choice C) A dexamethasone suppression test is used in evaluation of Cushing syndrome. In addition to hypertension, patients typically have central obesity, purple striae, proximal muscle wasting, and glucose intolerance. (Choices D and E) Surgery is the preferred treatment for PH due to an adrenal adenoma, whereas medical therapy (eg, spironolactone, eplerenone) is preferred for bilateral adrenal hyperplasia. However, this patient needs further testing to identify the etiology before undergoing treatment. Educational objective: Primary hyperaldosteronism (PH) is characterized by hypertension, hypokalemia, and an elevated plasma aldosterone to plasma renin activity ratio. The diagnosis is confirmed with an aldosterone suppression test. CT of the adrenals can differentiate adrenal adenoma from bilateral adrenal hyperplasia, but if no adenoma is seen adrenal venous sampling is recommended. Surgery is preferred for an adrenal adenoma; medical therapy (eg, spironolactone, eplerenone) is preferred for bilateral adrenal hyperplasia.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_031",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 36-year-old man comes to the physician for a routine visit. He has no complaints except for gradual weight gain over the past few years. He is an administrative assistant in a law firm and spends most of his time working at his desk. He eats mainly fast food for lunch and drinks a few beers while watching television on weekends. The patient does not use tobacco or recreational drugs. He has no family history of coronary heart disease, hypertension, or diabetes mellitus. His father died at age 47 in a ski accident. His mother is 66 years old and has no medical problems. The patient's blood pressure is 124/70 mm Hg, pulse is 70/min, and body mass index is 30 kg/m². He has no other notable physical findings such as acanthosis, skin or tendon xanthomas, or thyromegaly. Examination of his fundi is normal. Fasting laboratory results are as follows: Total cholesterol 255 mg/dL, Low-density lipoprotein (calculated) 125 mg/dL, High-density lipoprotein 60 mg/dL, Triglycerides 346 mg/dL, Glucose 92 mg/dL. His serum creatinine, liver function tests, and thyroid-stimulating hormone are normal. His calculated 10-year risk of cardiovascular disease is approximately 1%. In addition to lifestyle modification, which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Atorvastatin",
"choice_b": "Fenofibrate",
"choice_c": "Low-dose aspirin",
"choice_d": "Nicotinic acid",
"choice_e": "No medication at this time",
"correct_answer": "E",
"explanation": "This patient presents with borderline high low-density lipoprotein cholesterol and mild hypertriglyceridemia. Hypertriglyceridemia is associated with an increased risk of atherosclerotic cardiovascular disease (CVD). However, it is unclear if this is due to a direct effect of triglycerides or to concurrent diabetes and hypercholesterolemia which are often present. It is also unclear whether treating hypertriglyceridemia with fibrates or niacin (without statins) reduces CVD risk (Choices B and D). Drug therapy is generally not recommended for low-risk patients such as this with no CVD and mild hypertriglyceridemia (150-500 mg/dL). These patients should be counseled about lifestyle interventions such as a reduced-calorie diet, moderate alcohol intake, and increased daily exercise. However, patients with high CVD risk and mild-to-moderate hypertriglyceridemia benefit from statin therapy (Choice A). Statins alone may reduce serum triglyceride levels by about 10%-30%. In addition to lifestyle modifications, patients with more significant triglyceride elevations, especially >1000 mg/dL should be given fibrate therapy (or fish oil or niacin if fibrates are not tolerated) to reduce the risk of pancreatitis. Once the triglyceride levels are lowered, adding statin therapy is generally recommended to reduce the risk of CVD. (Choice C) Aspirin is recommended for men age 45-79 with a high risk of CVD in whom the benefit of myocardial infarction prevention is greater than the risk of gastrointestinal hemorrhage. This patient does not need aspirin at this time. Educational objective: Mild hypertriglyceridemia (<500 mg/dL) with no cardiovascular disease risk is generally treated with lifestyle modifications. Patients with higher triglyceride levels (especially >1000 mg/dL) benefit from fibrate therapy to reduce the risk of pancreatitis.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_032",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 62-year-old man with type 2 diabetes mellitus comes to the office due to recurrent morning episodes of headaches, tremor, and diaphoresis over the last 4 weeks. The patient does not regularly check blood glucose levels, but during one of the episodes his fingerstick glucose level was 57 mg/dL. His appetite has been decreased. The patient's diabetes is currently managed with glipizide. He was previously treated with insulin but discontinued due to fear of injecting himself and technical difficulty with the injections caused by impaired vision. Medical history is notable for hypertension, stage IV chronic kidney disease, hyperlipidemia, hypothyroidism, nonischemic cardiomyopathy (left ventricular ejection fraction 20%), and proliferative diabetic retinopathy. Other medications include lisinopril, metoprolol, amlodipine, calcium acetate, vitamin D3, levothyroxine, aspirin, and simvastatin. The patient lives alone and uses a home meal service. Blood pressure is 144/90 mm Hg and pulse is 90/min. Cardiovascular examination shows a 2/6 holosystolic murmur best heard at the apex. There is 1+ pitting edema to the ankles bilaterally. Laboratory results are as follows: Serum chemistry: Sodium 136 mEq/L, Potassium 5.0 mEq/L, Chloride 94 mEq/L, Bicarbonate 20 mEq/L, Blood urea nitrogen 58 mg/dL, Creatinine 2.5 mg/dL, Glomerular filtration rate (estimated) 27 mL/min/1.73m², Calcium 8.4 mg/dL, Glucose 160 mg/dL, Hemoglobin A1c 8.3%, TSH 3.9 µU/mL. Which of the following is the most appropriate replacement medication after glipizide is discontinued?",
"choice_a": "Acarbose",
"choice_b": "Linagliptin",
"choice_c": "Metformin",
"choice_d": "Pioglitazone",
"choice_e": "Repaglinide",
"correct_answer": "B",
"explanation": "Chronic kidney disease (CKD) increases the risk of hypoglycemia in patients with diabetes due to decreased renal insulin degradation, impaired gluconeogenesis, and diminished appetite. In addition, patients with CKD taking sulfonylureas have delayed excretion of the drugs and their metabolites. Although short-acting sulfonylureas (eg, glipizide, glimepiride) are usually safe for patients with CKD and are preferred to long-acting sulfonylureas (eg, glyburide), any sulfonylurea can cause hypoglycemia. Insulin therapy allows for fine dose adjustments and is often useful for patients with CKD, but this patient was unable to tolerate insulin. Linagliptin is a dipeptidyl peptidase-4 (DPP-4) inhibitor that decreases the breakdown of glucagon-like peptide 1 and glucose-dependent insulinotropic peptide. It is administered orally and is cleared primarily by hepatobiliary excretion into the feces. It therefore requires no dose adjustment in patients with CKD (dose reduction is required for other DPP-4 inhibitors [eg, sitagliptin, saxagliptin]). In addition, DPP-4 inhibitors are associated with a low risk of hypoglycemia when used in monotherapy and therefore would be a good choice for this patient. Although DPP-4 inhibitors are less potent than other drug classes, they may be adequate for older patients with CKD and other comorbidities who are usually managed to less stringent glycemic targets. (Choice A) Alpha-glucosidase inhibitors (eg, acarbose) are used to control post-prandial glucose excursions in patients already taking other agents. They are relatively contraindicated in patients with CKD due to impaired drug clearance. (Choice C) Metformin is associated with an increased risk of lactic acidosis in patients with CKD. It is contraindicated in patients with estimated glomerular filtration rate (eGFR) <30 mL/min/1.73 m² and should not be initiated in those with eGFR 30-45 mL/min/1.73 m². (Choice D) Thiazolidinediones (eg, pioglitazone) can cause edema due to decreased renal excretion of sodium. They are contraindicated in patients with heart failure. (Choice E) Meglitinides (eg, repaglinide) are short-acting non-sulfonylurea insulin secretagogues that are metabolized primarily by the liver. Repaglinide may be used in patients with CKD but requires multiple daily doses and can cause hypoglycemia; therefore, it would not be ideal for this patient. Educational objective: Chronic kidney disease (CKD) increases the risk of hypoglycemia in patients with diabetes. Short-acting sulfonylureas are usually safe to use in patients with CKD but can cause hypoglycemia. Linagliptin is a dipeptidyl peptidase-4 inhibitor that can be used in patients with CKD and has a low risk of hypoglycemia when used in monotherapy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_033",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 76-year-old woman is brought to the office by her daughter due to generalized weakness, muscle aches, and loss of appetite for the past 2-3 weeks. The patient has a history of hypertension and hypercholesterolemia. Current medications include amlodipine and rosuvastatin which was started 6 weeks ago. The patient is an ex-smoker with a 40-pack-year history. Temperature is 35.6 C (96 F), blood pressure is 140/100 mm Hg, and pulse is 62/min. Examination shows normal first and second heart sounds. The lungs are clear to auscultation. There is no jugular venous distension. The abdomen is soft and nontender. Muscle strength is 4/5 in both upper and lower extremities, with diffuse muscle tenderness but no joint swelling. Laboratory results are as follows: \r\n\r\nComplete blood count\r\nHemoglobin 10.4 g/dL\r\nHematocrit 30%\r\nMean corpuscular volume 90 fL\r\nPlatelets 180,000/mm³\r\nLeukocytes 6,100/mm³\r\n\r\nSerum chemistry\r\nSodium 135 mEq/L\r\nPotassium 4.2 mEq/L\r\nChloride 90 mEq/L\r\nBicarbonate 22 mEq/L\r\nBlood urea nitrogen 28 mg/dL\r\nCreatinine 1.4 mg/dL\r\nCalcium 8.2 mg/dL\r\nGlucose 70 mg/dL\r\nPhosphorus 4.1 mg/dL\r\n\r\nLiver function studies\r\nTotal protein 5.5 g/dL\r\nAlbumin 2.8 g/dL\r\nBilirubin Total 0.3 mg/dL, Direct 0.1 mg/dL\r\nAlkaline phosphatase 70 U/L\r\nAspartate aminotransferase (SGOT) 62 U/L\r\nAlanine aminotransferase (SGPT) 24 U/L\r\nCreatine kinase 436 U/L (normal: 38-239)\r\n\r\nRosuvastatin is held. Which of the following is the most appropriate next step in management?",
"choice_a": "Antinuclear antibodies and electromyogram",
"choice_b": "Coenzyme Q10 supplementation",
"choice_c": "Erythrocyte sedimentation rate",
"choice_d": "Thyroid function testing",
"choice_e": "Vitamin D metabolite levels",
"correct_answer": "D",
"explanation": "This patient has features suggesting hypothyroidism, including weakness, normocytic anemia, borderline low body temperature, and diastolic hypertension. Many patients with hypothyroidism also have musculoskeletal symptoms such as myalgias, joint pain, and stiffness. Symmetrical, progressive myopathy can be seen, often with a mild creatinine kinase (CK) elevation (usually <10 times the upper limit of normal). In addition, statins can cause myopathy ranging from very mild muscle pain without CK elevation to myonecrosis or severe rhabdomyolysis. Factors influencing the risk include choice of drug (lower risk with pravastatin and rosuvastatin), dose, and concurrent medications (eg, fibrates). Hypothyroidism can precipitate statin myopathy, and conversely statins can aggravate hypothyroid myopathy. Therefore, many experts suggest screening for hypothyroidism prior to initiating statin therapy, and patients with new muscular symptoms after starting statins should have assay of thyroid function. (Choice A) Polymyositis can resemble hypothyroid myopathy with proximal muscle weakness and elevated CK levels. Antinuclear antibody titers and characteristic findings on electromyography can support the diagnosis. However, polymyositis is much less common than hypothyroid myopathy, and patients typically have only mild, if any, muscle pain. (Choice B) Statin therapy is associated with reduced concentrations of coenzyme Q10 in muscle cells. However, supplementation with coenzyme Q10 has not been shown to prevent or treat statin myopathy. (Choice C) Polymyalgia rheumatica presents with proximal myalgias associated with elevated inflammatory markers (eg, erythrocyte sedimentation rate, C-reactive protein). However, muscle weakness and CK elevation are not usually seen. (Choice E) Prolonged vitamin D deficiency can lead to secondary hyperparathyroidism and osteomalacia. Symptoms can include bone pain and muscle weakness. However, patients with this degree of deficiency often also have hypophosphatemia and elevated bone turnover markers (eg, alkaline phosphatase). Educational objective: Hypothyroidism can cause myopathy with pain, weakness, and elevated creatine kinase. Statins can worsen hypothyroid myopathy, and hypothyroidism can exacerbate statin myopathy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_034",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 54-year-old man comes to the physician because of headaches, fatigue, and joint pains involving both his wrists and knees. His wife has noticed that he has been snoring excessively at night. He has been healthy all his life and takes no medications. He has not seen a physician for more than 5 years. He denies tobacco or alcohol use. Family history is not significant. His blood pressure is 146/70 mm Hg and pulse is 70/min. Body mass index (BMI) is 28 kg/m². Physical examination shows numerous skin tags, widened interdental spaces, and large hands. Visual fields are normal on confrontation. Laboratory results are as follows:\r\n\r\nSerum chemistry\r\nSodium 140 mEq/L\r\nPotassium 4.0 mEq/L\r\nChloride 103 mEq/L\r\nBicarbonate 24 mEq/L\r\nBlood urea nitrogen 20 mg/dL\r\nCreatinine 0.8 mg/dL\r\nGlucose 108 mg/dL\r\n\r\nEndocrine\r\nThyroid stimulating hormone 4.5 µU/mL\r\nInsulin-like growth factor-1 (IGF-1) 670 mg/mL (normal: 90-360 mg/mL)\r\n\r\nThe patient is at the highest risk of developing which of the following conditions if left untreated?",
"choice_a": "Ascending aortic aneurysm",
"choice_b": "Colonic neoplasia",
"choice_c": "Hypophosphatemic osteomalacia",
"choice_d": "Liver cirrhosis",
"choice_e": "Panacinar emphysema",
"correct_answer": "B",
"explanation": "This patient's presentation is consistent with acromegaly based on the clinical symptoms (summarized in the above table) and elevated IGF-1 levels. Acromegaly is associated with an increased risk of cancer (e.g., colon, esophageal, gastric, and melanoma), likely due to IGF-1 stimulating mucosal cell proliferation. The mortality rate from colon cancer is also higher in acromegaly patients compared to the general population. Acromegaly increases the risk of developing adenomatous colonic polyps, especially in patients with a family history of colon cancer, age >50, male sex, longer duration of acromegaly, and ≥3 skin tags. Screening colonoscopy is recommended in acromegaly patients at the time of diagnosis and every 3-4 years after age 50. Untreated acromegaly also has a higher mortality, usually due to cardiovascular disease and cancer. (Choice A) Cardiovascular complications of acromegaly include concentric hypertrophy of the myocardium with diastolic dysfunction, congestive heart failure, and hypertension. Ascending aortic aneurysms are usually not associated with acromegaly, but they are associated with other conditions (e.g., giant cell arteritis, Marfan syndrome, Ehlers-Danlos) that require routine screening. (Choice C) Hyperphosphatemia is seen in up to 70% of acromegaly patients, likely due to IGF-1 stimulation of renal tubular phosphate reabsorption. Hypophosphatemic osteomalacia is more commonly seen in vitamin D deficiency, mesenchymal tumors, and Fanconi syndrome. (Choice D) Growth hormone receptors are abundant in the liver, and high GH from acromegaly can cause liver enlargement. However, it does not usually increase liver fibrosis leading to cirrhosis. (Choice E) Acromegaly increases the incidence of sleep apnea (central and obstructive) and narcolepsy, but it is not associated with an increased risk of emphysema. Educational objective: Acromegaly is associated with an increased risk of esophageal cancer, gastric cancer, colon cancer, and melanoma. Screening colonoscopy is recommended at the time of diagnosis and every 3-4 years after age 50. The mortality of untreated acromegaly is higher than the general population, usually due to cardiovascular disease and cancer.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_035",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 29-year-old woman comes to the physician because of recurrent headaches for the past 3 weeks. She describes her headaches as bifrontal and throbbing. She denies decreased vision, vomiting, fever, or head injury. Her stress level has increased over the past few weeks after she was laid off from her job. She has a history of migraine headaches as a teenager. She does not use tobacco or drink alcohol. She takes no medications. She stopped having menstrual periods after a progesterone-containing intra-uterine device was placed 18 months ago. Examination, including neurologic examination, shows no abnormalities. Complete blood count, chemistry profile, thyrotropin (TSH), and liver function tests are all within normal limits. MRI of the brain shows a 7 mm hypointense mass in the pituitary without stalk deviation. Which of the following is the most appropriate next step?",
"choice_a": "Automated visual perimetry",
"choice_b": "Cosyntropin stimulation test",
"choice_c": "Neurosurgery referral",
"choice_d": "No further testing and follow-up MRI in 12 months",
"choice_e": "Prolactin level",
"correct_answer": "E",
"explanation": "Pituitary incidentalomas occur in up to 10% of patients undergoing MRI for unrelated reasons. Lesions < 10 mm require careful clinical evaluation to look for pituitary hormonal hyperfunction. If there are no clinical features of pituitary hormonal hyperfunction, then the most cost effective strategy is to measure only prolactin levels. Small lesions (2-4 mm) require no further testing, while lesions 5-9 mm usually require follow-up MRI in 12 months to document a lack of growth (Choice D). Lesions > 10 mm should be evaluated with biochemical testing for both pituitary hormonal hyperfunction/hypofunction (e.g., Cushing's, acromegaly, and prolactin) and formal visual field/acuity testing (Choice A). Most pituitary masses do not grow rapidly over time. Lesions without mass effect or hormonal dysfunction can be safely followed with periodic clinical, biochemical, and radiological evaluation. Surgery is considered for macroadenomas with hormonal dysfunction or tumor mass effect, except for prolactinoma where medical therapy is effective (Choice C). (Choice B) Cosyntropin stimulation test screens for adrenal insufficiency. Small pituitary lesions rarely cause adrenal insufficiency and do not require testing. This patient's normal laboratory tests and vital signs also make this less likely. Educational objective: Pituitary incidentalomas measuring < 10 mm usually do not cause visual defects or pituitary hypofunction. Patients with small (<10 mm) pituitary lesions only require monitoring with prolactin levels if there is no clinical evidence of pituitary hormonal hypersecretion.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_036",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 56-year-old woman comes to the emergency department due to acute dyspnea and cough. She has a history of chronic obstructive pulmonary disease (COPD) treated with inhaled albuterol, tiotropium, and fluticasone. The patient's other medical problems include hypertension and hypothyroidism, for which she takes lisinopril, hydrochlorothiazide, and levothyroxine. She also takes a daily over-the-counter supplement containing vitamin D and calcium carbonate. The patient has a 25-pack-year smoking history but quit after the diagnosis of COPD was made 4 years ago. She experienced menopause at age 49 and has no history of low trauma fracture or loss of height. Blood pressure is 140/80 mm Hg, pulse is 108/min, and respirations are 24/min. Oxygen saturation is 94% on 2 L of oxygen via nasal cannula. BMI is 29 kg/m². Chest examination reveals coarse rhonchi bilaterally, and the remainder of the physical examination is unremarkable. Laboratory results are as follows:\r\n\r\nSerum chemistry\r\nSodium 136 mEq/L\r\nPotassium 4 mEq/L\r\nChloride 98 mEq/L\r\nBicarbonate 26 mEq/L\r\nBlood urea nitrogen 24 mg/dL\r\nCreatinine 1.1 mg/dL\r\nCalcium 11.1 mg/dL\r\nGlucose 121 mg/dL\r\n\r\nLiver function studies\r\nAlbumin 4 g/dL\r\nAlanine aminotransferase (SGPT) 24 U/L\r\nAlkaline phosphatase 98 U/L\r\nAspartate aminotransferase (SGOT) 37 U/L\r\nTSH 0.63 µU/mL\r\n\r\nThe patient is admitted to the hospital and treated with systemic glucocorticoids, antibiotics, and inhaled bronchodilators. On the third day of hospitalization, repeat serum calcium is 11.2 mg/dL and parathyroid hormone is 60 pg/mL (normal: 10-65). Which of the following is the most likely cause of this patient's hypercalcemia?",
"choice_a": "Dehydration-induced hypercalcemia",
"choice_b": "Drug-induced hypercalcemia",
"choice_c": "Hypercalcemia of malignancy",
"choice_d": "Parathyroid hormone-mediated hypercalcemia",
"choice_e": "Vitamin D toxicity",
"correct_answer": "D",
"explanation": "This patient has mild, asymptomatic hypercalcemia associated with a nonsuppressed parathyroid hormone (PTH) level. This is most consistent with primary hyperparathyroidism (PHPT). Although PTH is elevated in a majority of patients with PHPT, approximately 10%-20% of these patients have PTH levels that are only borderline elevated or in the upper half of the normal range (as in this patient). Normally, even mild hypercalcemia suppresses PTH to very low levels (usually <20 pg/mL) therefore, hypercalcemia associated with a nonsuppressed PTH level suggests inappropriate PTH secretion due to PHPT. Familial hypocalciuric hypercalcemia can also cause PTH-dependent hypercalcemia, but this is much less common. (Choice A) Up to 50% of total circulating calcium is protein-bound. Dehydration can increase the serum albumin concentration, with a corresponding increase in the bound calcium fraction, although, the ionized calcium concentration (and albumin-corrected serum calcium concentration) is normal. However, this patient's serum albumin is normal and her calcium level does not need to be corrected. (Choice B) Thiazide diuretics increase urinary reabsorption of calcium and can occasionally cause mild hypercalcemia, but PTH in such patients is suppressed. More frequently, thiazide diuretics worsen or unmask hypercalcemia in patients with an underlying bone and calcium disorder (eg, PHPT). (Choice C) Malignancy is the most common cause of PTH-independent hypercalcemia and is usually due to secretion of PTH-related protein by cancer cells. Hypercalcemia due to malignancy is typically more severe than in PHPT, and serum PTH is very low. (Choice E) Excess intake of vitamin D (iatrogenic or accidental) can lead to vitamin D toxicity with resulting hypercalcemia. Excess intake of calcium carbonate for treatment of acid reflux or prevention of osteoporosis can cause milk-alkali syndrome and also lead to severe hypercalcemia. However, PTH in these disorders is suppressed. Educational objective: Hypercalcemia normally suppresses parathyroid hormone (PTH) secretion to very low levels. In the setting of hypercalcemia, a high-normal PTH level suggests primary hyperparathyroidism. Although PTH is elevated in most patients with primary hyperparathyroidism, it is only borderline or high-normal in 10%-20% of these patients.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_037",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 36-year-old woman comes to the office due to fatigue and neck discomfort. Her symptoms began several weeks ago following an upper respiratory infection. The patient's medical history is unremarkable and she takes no medications. She works as a nuclear medicine technician, has a current 20-pack-year smoking history, and does not use alcohol or illicit drugs. There is no family history of thyroid cancer, but the patient's mother has hypothyroidism treated with thyroid replacement therapy. Vital signs are normal. On examination, the thyroid gland is low lying and difficult to palpate. There is no cervical lymphadenopathy and the remainder of the examination is unremarkable. Laboratory results show a TSH of 12 µU/mL and free T4 of 1.1 ng/dL (normal: 0.9-2.4). Ultrasound reveals 2 nodules in the right thyroid lobe, each measuring 1.7 cm in maximal diameter, and a 1.4 cm nodule in the left lobe. All of the nodules are hypoechoic without internal vascularity or microcalcification. Which of the following increases the risk for thyroid cancer in this patient?",
"choice_a": "Elevated TSH",
"choice_b": "Occupation as a nuclear medicine technician",
"choice_c": "Presence of multiple nodules",
"choice_d": "Recent upper respiratory infection",
"choice_e": "Smoking history",
"correct_answer": "A",
"explanation": "In the evaluation of thyroid nodules, a number of patient characteristics have been associated with an increased risk of malignancy. Prominent among them is history of ionizing radiation exposure to the head and neck in childhood (eg, cancer treatment, nuclear fallout). Family history of thyroid cancer and cancer syndromes also increase the risk (eg, multiple endocrine neoplasia type 2 is associated with medullary thyroid cancer). In addition, an elevated TSH (as in this patient) is associated with a higher likelihood of malignancy, whereas a suppressed TSH suggests a possible hyperfunctioning nodule, which is typically benign. Other factors associated with malignancy are noted in the table. This patient also has ultrasound findings associated with increased risk of malignancy, including size >1 cm and hypoechoic echotexture. This patient should therefore be considered for fine-needle aspiration of the nodules. (Choice B) Radiology technicians who frequently hold patients during roentgenogram procedures may have a moderately increased risk of thyroid cancer. In contrast, exposure to radioiodine isotopes used in nuclear diagnostics is not associated with increased risk. (Choice C) The risk of thyroid cancer is similar in patients with a solitary thyroid nodule compared to those with a multinodular goiter. (Choice D) Upper respiratory infections commonly precipitate subacute (de Quervain) thyroiditis, which may present as a painful goiter. Although concurrent subacute thyroiditis may have brought this patient's nodules to attention, it would not increase the risk of malignancy. (Choice E) Although benign nodules are more common in smokers, smoking and alcohol intake have not been shown consistently to increase the risk for thyroid cancer (and may be associated with lower risk). Educational objective: Major risk factors for thyroid cancer in patients with thyroid nodules include a history of radiation exposure or a family history of thyroid cancer. A higher serum TSH level is associated with increased risk of malignancy in a thyroid nodule.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_038",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 30-year-old woman without significant past medical history comes to the physician with a palpable lump in her neck. She has no associated symptoms and no family history of thyroid or other endocrine disorders. Her TSH level is 1.3 µU/mL (normal 0.5-5.0 µU/mL). Thyroid ultrasound shows a 16-mm round, hypoechoic nodule in the right lobe of the thyroid. There is no lymph node enlargement. Which of the following is the most appropriate course of action?",
"choice_a": "Anti-thyroid peroxidase antibodies",
"choice_b": "Fine-needle aspiration",
"choice_c": "Repeat thyroid ultrasound in 6 months",
"choice_d": "Right thyroid lobectomy",
"choice_e": "Thyroid scintigraphy",
"correct_answer": "B",
"explanation": "Thyroid nodules can be malignant in 4%-6% of cases. The likelihood of malignancy can be estimated based on nodule size, historical factors, TSH level, and ultrasound characteristics: • Historical risk factors include a personal or first-degree family history of thyroid cancer, head/neck or total body radiation exposure in childhood, rapid nodule growth, and cervical lymphadenopathy • Low (suppressed) TSH levels suggest a hyperfunctioning nodule, which is usually benign; a normal or elevated TSH raises risk • Suspicious ultrasound findings include larger nodules, microcalcifications, increased nodular vascularity, hypoechoic appearance, and indistinct nodule margins Fine-needle aspiration (FNA) is recommended in patients with high risk for malignancy based on initial assessment. In most cases, patients with a normal/elevated TSH and a solid nodule >1 cm in diameter should be evaluated further with FNA. (Choice A) Anti-thyroid peroxidase (TPO) antibodies suggest Hashimoto's thyroiditis (chronic autoimmune thyroiditis). They are most often assayed in patients with goiter or with thyroid nodules and elevated TSH. However, TPO antibodies do not exclude malignancy or alter indications for FNA. (Choice C) Repeat thyroid ultrasound in 6-12 months is recommended for patients with FNA showing benign thyroid nodules. This patient would first need FNA to evaluate whether the nodule is benign or malignant. (Choice D) Surgery is indicated for patients with FNA showing cytological features (definitive or suspicious) of malignancy, non-diagnostic cytology on multiple FNAs, or compressive symptoms. (Choice E) Thyroid scintigraphy is used to assess hyperfunctioning nodules or a multinodular goiter in patients with low TSH, which is not present in this patient. Educational objective: TSH and thyroid ultrasound should be performed in all patients with thyroid nodules. The risk of malignancy can be assessed based on historical risk factors, TSH, nodule size, and ultrasound characteristics. High-risk nodules should be further evaluated with fine-needle aspiration.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_039",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 35-year-old man comes to the physician with complaints of dizziness and fatigue. These episodes occur immediately after he exercises on the treadmill for 30 minutes, and are accompanied by shaking and sweating. He has a history of type 1 diabetes mellitus and takes insulin glargine once daily at breakfast and pre-meal injections of insulin aspart. The patient checks his blood glucose every day prior to breakfast; the usual range is 110-140 mg/dL. His last hemoglobin A1C was 7.2%. He has no other medical problems. Which of the following is the best next step in management of this patient?",
"choice_a": "Decrease exercise intensity and duration",
"choice_b": "Decrease insulin glargine dose",
"choice_c": "Extra food consumption before exercise",
"choice_d": "Increase the dose of pre-breakfast aspart",
"choice_e": "Replace insulin glargine with NPH insulin",
"correct_answer": "C",
"explanation": "Hypoglycemia is a common side effect of insulin therapy. Risk factors for hypoglycemic episodes include excessive insulin dose, very strict glycemic control, excessive physical activity, and decreased food intake. Hypoglycemia also appears to be more common in patients with type 1 as compared with type 2 diabetes. Patients on insulin therapy (or insulin secretagogues) should monitor blood glucose before, during, and after exercise. Strenuous exercise should be avoided in the presence of significant hyperglycemia (>250 mg/dL) or ketosis. Guidelines for the management of blood glucose during exercise include: • Adequate fluid intake • Monitoring and documenting blood glucose before, during, and after exercise for subsequent sessions • For low blood sugar (<100 mg/dL) before and during exercise, 15-30 g of rapidly absorbed carbohydrates (eg, hard candies, juice) are helpful • For delayed post-exercise hypoglycemia (4-8 hours after), slowly absorbed carbohydrates (eg, dried fruit, nuts) are recommended • Decreasing insulin dose prior to exercise by 30% This patient with hypoglycemia related to exercise would benefit from 15-30 g of rapidly absorbed carbohydrate before (15-30 minutes) and during (every 30 minutes) exercise, as well as adequate fluid intake. (Choice A) Diabetics are encouraged to exercise at least 150 minutes/week at moderate intensity to improve glycemic control, lose weight, and improve cardiovascular health. Decreasing physical activity is generally not recommended as the first option for preventing hypoglycemic episodes in insulin-treated diabetics. (Choice B) Decreasing the dose of glargine would be effective in reducing nocturnal hypoglycemia. However, this patient's hypoglycemic episodes are related to exercise, not glargine administration. In addition, reductions in basal insulin will most likely worsen his overall glycemic control. (Choice D) Increasing the dose of aspart insulin is likely to increase the risk of hypoglycemia. (Choice E) The risk of hypoglycemia with long-acting basal insulin analogues such as glargine or detemir is much lower compared to NPH insulin. In addition, NPH generally must be administered twice daily to achieve adequate basal insulin coverage due to its shorter duration of action. Educational objective: Hypoglycemic episodes may occur in patients on insulin therapy (or insulin secretagogues) during and after exercise. These can be avoided by adequate hydration, frequent monitoring of blood glucose, consumption of rapid-acting carbohydrates before and during exercise, and, if necessary, insulin dose adjustment prior to exercise.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_040",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 51-year-old woman comes to the physician because of a persistent dry cough after an upper respiratory infection 2 months ago. She denies hemoptysis, chest pain, or weight loss. She is an ex-smoker with a 25 pack-year smoking history. Her blood pressure is 130/72 mm Hg and her pulse is 74/min. Her BMI is 24 kg/m². Lungs are clear to auscultation. The abdomen is soft and non-tender. The remainder of the physical examination is within normal limits. Laboratory results are as follows: Serum creatinine 0.7 mg/dL, Serum calcium 11.0 mg/dL, Intact PTH 15 pg/mL, TSH 0.2 mU/L, 1,25-hydroxy vitamin D 95 ng/mL (normal 15-80 ng/mL). Chest x-ray reveals hilar adenopathy and a 2.0 cm left lower lung nodule. Which of the following is the most likely cause of this patient's hypercalcemia?",
"choice_a": "Parathyroid adenoma",
"choice_b": "Sarcoidosis",
"choice_c": "Squamous cell carcinoma",
"choice_d": "Thyrotoxicosis",
"choice_e": "Vitamin D intoxication",
"correct_answer": "B",
"explanation": "The first step in evaluation of confirmed hypercalcemia is to measure the PTH level. Patients with elevated PTH should then have their urinary calcium excretion measured. Primary and tertiary hyperparathyroidism present with elevated urinary calcium, while familial hypocalciuric hypercalcemia has low urinary calcium. Patients with suppressed PTH should have measurement of PTH-related peptide (PTHrP) and both 1,25-hydroxy vitamin D and 25-hydroxy vitamin D. Elevated PTHrP usually indicates solid tumor malignancy, while elevated 25-hydroxy vitamin D indicates vitamin D toxicity. This patient has elevated 1,25-hydroxy vitamin D, which is usually seen in granulomatous diseases and lymphoma. Sarcoidosis is a multisystem granulomatous disease with noncaseating tissue granulomas. Activated pulmonary macrophages produce calcitriol, which is responsible for the hypercalcemia and hypercalciuria. (Choice A) Parathyroid adenoma usually presents with elevated or high-normal PTH out of proportion to calcium levels. (Choice C) Squamous cell carcinoma typically causes hypercalcemia via secretion of PTHrP, not elevated 1,25-hydroxy vitamin D. (Choice D) Thyrotoxicosis can cause mild hypercalcemia through increased bone resorption, but would not cause elevated 1,25-hydroxy vitamin D. (Choice E) Vitamin D intoxication increases calcium and bone resorption causing hypercalcemia, but usually occurs at 25-hydroxy vitamin D levels >150 ng/mL. Vitamin D intoxication does not cause elevated 1,25-hydroxy vitamin D. Given this patient's hilar adenopathy, sarcoidosis or lymphoma is more likely. Educational objective: Patients with hypercalcemia and elevated 1,25-hydroxy vitamin D require a chest x-ray to evaluate for granulomatous diseases (sarcoidosis) and lymphoma.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_041",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the office due to progressive erectile dysfunction and loss of libido for the last 8 months. He is unable to obtain an erection and also has malaise and poor energy. The patient has no history of headaches, visual loss, anabolic steroid use, daytime sleepiness, or prior testicular injury. His other medical problems include type 2 diabetes mellitus, hypertension, and hyperlipidemia. Medications include metformin, atorvastatin, and ramipril. The patient is married and has 2 children. Blood pressure is 120/80 mm Hg and pulse is 66/min. BMI is 31 kg/m². The patient has normal secondary sexual characteristics without gynecomastia. Peripheral vision is intact on confrontation testing. The testes are normal in size with a soft consistency. The remainder of the physical examination is normal. Laboratory results are as follows: Glucose 125 mg/dL, Creatinine 1.1 mg/dL, Hemoglobin A1c 7.4%, Testosterone, serum (8:00 AM) 130 ng/dL (normal: 240-950), TSH 0.6 µU/mL. Repeat serum testosterone is 136 ng/dL, with serum FSH of 5 mU/mL, LH of 4 mU/mL, and prolactin of 10 ng/mL. Which of the following is the most appropriate next step in addressing this patient's current condition?",
"choice_a": "Intensify diabetes treatment",
"choice_b": "Measure nocturnal penile tumescence",
"choice_c": "Obtain MRI of the pituitary",
"choice_d": "Perform nerve conduction studies",
"choice_e": "Start testosterone replacement therapy",
"correct_answer": "C",
"explanation": "This patient has hypogonadal symptoms with a low serum testosterone level and low/inappropriately normal FSH and LH levels. This is consistent with hypogonadotropic (central) hypogonadism. Hypogonadism is common in men with type 2 diabetes, especially those age ≥65 or with concurrent obesity. Younger men with more pronounced declines in serum testosterone (as in this patient) and/or abnormalities in additional pituitary hormones (eg, central hypothyroidism) are more likely to have sellar masses or other structural disruptions of the hypothalamic-pituitary axis. These patients should have pituitary imaging, preferably with MRI. Educational objective: Patients with type 2 diabetes and obesity commonly have hypogonadotropic hypogonadism with borderline low testosterone levels (200-300 ng/dL) and do not routinely need pituitary imaging. However, patients with markedly low serum testosterone levels or abnormalities of additional pituitary hormones are more likely to have a pituitary mass and warrant pituitary MRI.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_042",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 23-year-old woman comes to the office due to palpitations, increased frequency of bowel movements, and a 4.5-kg (10-lb) weight loss despite adequate food intake. The patient's symptoms also include redness of the eyes associated with tearing, grittiness, and photophobia, as well as intermittent diplopia when reading or watching television. Medical history is unremarkable; she has never been pregnant. The patient is not sexually active. She has smoked half a pack of cigarettes a day for the last 2 years. Blood pressure is 138/66 mm Hg and pulse is 110/min and regular. The patient appears anxious. The thyroid gland shows diffuse symmetrical enlargement without tenderness. A thyroid bruit is audible. Ocular examination shows bilateral proptosis with conjunctival injection and periorbital edema. Laboratory evaluation shows a serum TSH level of 0.005 µU/mL and a free thyroxine level of 4.1 ng/dL (normal: 0.9-2.4). Thyroid scintigraphy shows 24-hour radioactive iodine uptake of 56% (normal: 10%-30%) with a diffuse pattern. The patient is started on a beta blocker and oral prednisone. Which of the following additional interventions should be initiated at this time?",
"choice_a": "Methimazole",
"choice_b": "Propylthiouracil",
"choice_c": "Radioactive iodine",
"choice_d": "Selenium",
"choice_e": "Thyroidectomy",
"correct_answer": "A",
"explanation": "This patient has hyperthyroidism consistent with Graves disease and moderate Graves ophthalmopathy. Initial management should include a beta blocker for adrenergic symptoms and systemic glucocorticoids for moderate to severe ophthalmopathy. In addition, this patient should be started on an antithyroid drug (ATD) like methimazole to inhibit thyroid hormone synthesis. Methimazole is usually preferred due to the risk of hepatotoxicity with propylthiouracil. Radioactive iodine (RAI) should be avoided in patients with significant ocular symptoms as it can worsen ophthalmopathy. Educational objective: Antithyroid drugs (eg, methimazole) can induce remission in mild Graves disease or prepare patients for definitive treatment. Radioactive iodine can worsen Graves ophthalmopathy and should be avoided in patients with significant ocular symptoms.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_043",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 41-year-old woman comes to the office due to irregular menstrual periods and intermittent milky discharge from both breasts for the past 6 months. During this time, she has also had vaginal dryness and dyspareunia. The patient has had no headaches, visual loss, weight changes, or hirsutism. She has had no prior medical problems and takes no medications except for over-the-counter vitamin supplements. Blood pressure is 112/70 mm Hg and pulse is 66/min. BMI is 21 kg/m². Physical examination shows no abnormalities except mild expressive galactorrhea from both breasts. Laboratory results are as follows: Prolactin, serum 90 ng/mL, TSH 1.6 µU/mL, T4, serum 7.0 µg/dL. MRI of the brain shows a 7-mm pituitary mass. The patient is very reluctant to start any treatment. Which of the following is the patient at an increased risk of developing if her current condition is left untreated?",
"choice_a": "Endometrial cancer",
"choice_b": "Osteoporosis",
"choice_c": "Panhypopituitarism",
"choice_d": "Tricuspid regurgitation",
"choice_e": "Vision loss",
"correct_answer": "B",
"explanation": "This patient has a microprolactinoma (<10 mm). Hyperprolactinemia suppresses gonadotropin secretion, leading to hypogonadism and low estrogen levels. Low estrogen is a significant risk factor for rapid bone loss and osteoporosis. While macroprolactinomas (>10 mm) may cause compressive effects like vision loss or panhypopituitarism, microprolactinomas are generally slow-growing and carry a low risk of rapid enlargement. Educational objective: Hyperprolactinemia suppresses gonadotropin secretion and leads to hypogonadism, which leads to low estrogen levels with bone loss and osteoporosis in women.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_044",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 51-year-old woman comes to the office due to excessive sweating at night. She has had type 2 diabetes mellitus for the past 10 years and was started on insulin therapy 3 years ago; metformin was continued but glipizide was stopped. The patient currently takes 34 units of insulin glargine at bedtime and 6 units of insulin lispro before meals 3 times a day. She also eats a bedtime snack daily. Hemoglobin A1c is 6.7%. Fingerstick blood glucose levels (mg/dL) show 3:00 AM readings of 60 and 54 on two of the four days prior to the visit, with fasting morning glucose between 88-101 mg/dL. Which of the following is the most appropriate next step in management of this patient's diabetes mellitus?",
"choice_a": "Decrease the dose of insulin glargine",
"choice_b": "Decrease the dose of pre-dinner insulin lispro",
"choice_c": "Decrease the doses of insulin glargine and pre-dinner insulin lispro",
"choice_d": "Discontinue metformin",
"choice_e": "Increase the amount of carbohydrate in the bedtime snack",
"correct_answer": "A",
"explanation": "This patient is experiencing early-morning (3:00 AM) hypoglycemia, most likely due to the effect of the long-acting insulin analog (glargine). Reducing the glargine dose by 10%-20% should alleviate the nocturnal hypoglycemia while maintaining fasting glucose levels at goal. Reducing lispro alone would not correct the 3:00 AM lows. Metformin contributes little to hypoglycemia risk and should be continued. Educational objective: In patients receiving basal-bolus insulin therapy, the dose of basal insulin is reduced for preprandial and early-morning hypoglycemia.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_045",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 76-year-old man comes to the physician due to a several-week history of fatigue and lethargy. His medical problems include hypertension, type 2 diabetes, coronary artery disease, and ischemic cardiomyopathy. He was started on amiodarone and high-dose metoprolol 4 months ago for ventricular tachycardia. Examination shows dry skin and diminished deep tendon reflexes. Laboratory studies show: Free T4 0.7 ng/dL (Normal: 0.8-1.8 ng/dL), TSH 12.0 µU/mL, T3 66 ng/dL. Which of the following is the best next step in managing this patient?",
"choice_a": "Check anti-thyroid peroxidase (anti-TPO) antibodies",
"choice_b": "Continue amiodarone and start levothyroxine",
"choice_c": "Discontinue amiodarone and repeat thyroid function tests in a few weeks",
"choice_d": "Discontinue amiodarone and start levothyroxine",
"choice_e": "Order thyroid ultrasound",
"correct_answer": "B",
"explanation": "This patient's presentation is consistent with amiodarone-induced hypothyroidism. Long-term amiodarone use can cause thyroid dysfunction in 5%-30% of patients. Because amiodarone is indicated here for the prevention of recurrent ventricular tachycardia in a patient with severe cardiomyopathy, it should be continued. The hypothyroidism can be easily corrected by adding levothyroxine. Educational objective: Patients with overt amiodarone-induced hypothyroidism should continue amiodarone but initiate thyroid replacement therapy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_046",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 78-year-old woman is brought to the physician due to intermittent dizziness, weakness, and confusion. She was started on trimethoprim/sulfamethoxazole 3 days ago for a urinary tract infection. Her chronic medications include hydrochlorothiazide, amlodipine, glyburide, atorvastatin, calcium, vitamin D, and alendronate. Medical history includes chronic kidney disease (baseline creatinine 1.3 mg/dL). Laboratory results: Creatinine 1.4 mg/dL, Glucose 70 mg/dL, Hemoglobin A1c 6.1%. Which of the following is the best next step in management of this patient?",
"choice_a": "Discontinue glyburide",
"choice_b": "Discontinue hydrochlorothiazide",
"choice_c": "Order CT scan of the head",
"choice_d": "Order renal ultrasound",
"choice_e": "Send urine cultures and adjust antibiotics",
"correct_answer": "A",
"explanation": "This patient's symptoms suggest hypoglycemia due to a drug interaction between trimethoprim/sulfamethoxazole (TMP-SMX) and glyburide. Glyburide is a long-acting sulfonylurea that can accumulate in patients with CKD, and TMP-SMX potentiates its effect. In elderly patients with CKD, glycemic targets should be relaxed (HbA1c 7.0%-7.9%). Educational objective: Sulfonylureas can accumulate in elderly patients with CKD and cause hypoglycemia; this effect is potentiated by TMP-SMX.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_047",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old woman comes to the office to follow up elevated blood pressure (140/100 mm Hg). She feels well and takes no medications. Physical examination is unremarkable. Laboratory results: Sodium 142 mEq/L, Potassium 3.9 mEq/L, Calcium 9.9 mg/dL, Creatinine 1.1 mg/dL, Glucose 95 mg/dL. Lipid profile: Total cholesterol 205 mg/dL, LDL 122 mg/dL. Urinalysis and ECG are normal. Which of the following additional studies is most appropriate for this patient?",
"choice_a": "Duplex ultrasound of the renal arteries",
"choice_b": "Parathyroid hormone level",
"choice_c": "Plasma aldosterone and plasma renin activity assay",
"choice_d": "Plasma fractionated metanephrines",
"choice_e": "Serum TSH level",
"correct_answer": "E",
"explanation": "As part of the initial laboratory evaluation for new hypertension, patients should be screened for thyroid disease with a serum TSH. Both hyperthyroidism and hypothyroidism can raise blood pressure, and treating the underlying thyroid disorder can often normalize it. Endocrine tests for hyperaldosteronism or pheochromocytoma (Choices C and D) are reserved for resistant or severe hypertension. Educational objective: Patients with hypertension warrant screening for thyroid disease in the initial laboratory evaluation.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_048",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 43-year-old woman comes to the emergency department with a 2-day history of nausea, vomiting, and stabbing epigastric pain radiating to her back. Her medical history includes hyperlipidemia and hypothyroidism. Current medications include levothyroxine, hydrochlorothiazide, and metoprolol. Blood pressure is 90/60 mm Hg and pulse is 112/min. Abdominal ultrasound shows an enlarged, hypoechoic pancreas and a normal gallbladder. Laboratory results: Calcium 6.7 mg/dL, Creatinine 1.8 mg/dL, Lipase 512 U/L (normal: 0-50), Triglycerides 2600 mg/dL, Glucose 130 mg/dL. Which of the following is the best additional therapy for this patient at this time?",
"choice_a": "Gemfibrozil",
"choice_b": "Heparin infusion",
"choice_c": "No additional therapy needed",
"choice_d": "Therapeutic plasma exchange",
"choice_e": "Ultrafiltration",
"correct_answer": "D",
"explanation": "This patient has severe hypertriglyceridemia-induced pancreatitis (triglycerides >1000 mg/dL and evidence of organ dysfunction/hypocalcemia). Severe cases with glucose <500 mg/dL require therapeutic plasma exchange (apheresis) to quickly lower triglyceride levels. Insulin infusion is an alternative if glucose is >500 mg/dL. Gemfibrozil is used for long-term management but does not lower lipids rapidly enough in the acute setting. Educational objective: Severe hypertriglyceridemia-induced pancreatitis (eg, hypocalcemia, lactic acidosis) requires rapid lowering of triglycerides with therapeutic plasma exchange.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_049",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 36-year-old woman comes to the office due to weight gain (9 kg), facial hair growth, easy bruising, and muscle weakness over the last 4 months. Examination shows a round face, fat deposition in supraclavicular areas, terminal facial hair, and wide abdominal striae. Laboratory results: Potassium 3.2 mEq/L, Bicarbonate 30 mEq/L, Glucose 140 mg/dL. Screening tests: Overnight 1 mg dexamethasone suppression test 10 µg/dL (normal: <1.8), Urine free cortisol 200 µg/24 hr (normal: <90). Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "ACTH level",
"choice_b": "CT scan of the adrenal glands",
"choice_c": "High-dose dexamethasone suppression test",
"choice_d": "MRI of the pituitary gland",
"choice_e": "Petrosal venous sinus sampling",
"correct_answer": "A",
"explanation": "Once the diagnosis of Cushing syndrome is confirmed by abnormal screening tests (Step 1), the next step is to establish the etiology by measuring a plasma ACTH level (Step 2). This differentiates ACTH-independent (low ACTH) from ACTH-dependent (normal/high ACTH) causes. Imaging or further suppression tests (Choices B, C, D) are performed only after the ACTH level is known. Educational objective: After confirming Cushing syndrome, ACTH-dependent and ACTH-independent causes should be differentiated with a plasma ACTH level.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_050",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 75-year-old woman comes to the office due to a compression fracture of her tenth thoracic vertebra after a fall. Her history includes hypertension, hyperlipidemia, type 2 diabetes, and stage 4 chronic kidney disease. She takes calcium and vitamin D. Laboratory results: Vitamin D 35 ng/mL, Calcium 8.9 mg/dL, Creatinine 2.3 mg/dL, Calculated creatinine clearance 21 mL/min. DXA shows a T-score of -2.0 at the lumbar spine and -1.8 at the femoral neck. In addition to continuing vitamin D and calcium, which of the following is the best therapeutic option to decrease this patient's risk of future fractures?",
"choice_a": "Alendronate orally",
"choice_b": "Calcitonin intranasally",
"choice_c": "Denosumab subcutaneously",
"choice_d": "FRAX assessment tool calculation to determine treatment",
"choice_e": "Teriparatide subcutaneously",
"correct_answer": "C",
"explanation": "This patient has clinical osteoporosis due to a fragility fracture. Bisphosphonates (alendronate) are first-line but are contraindicated in patients with creatinine clearance <30-35 mL/min. Denosumab is a human monoclonal antibody that inhibits RANK ligand and is appropriate for use in patients with CKD, although calcium levels must be monitored for hypocalcemia. FRAX (Choice D) is not needed since treatment is already indicated by the fracture. Educational objective: Denosumab reduces the risk of fracture in postmenopausal women with osteoporosis and is appropriate for use in patients with CKD where bisphosphonates are contraindicated.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_051",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 45-year-old woman comes to the physician with imbalance, repeated falls (worse in the dark), numbness of her toes, and lower extremity weakness. She had Roux-en-Y gastric bypass 3 years ago. Medications include ramipril, fenofibrate, B12, calcium, iron, and multivitamins. She began taking over-the-counter zinc supplements 4 months ago. Neurological examination reveals loss of proprioception/touch in feet, absent ankle reflexes, brisk knee reflexes, and bilateral extensor plantar response. Laboratory results: Hemoglobin 10.4 g/dL, MCV 86 fL, Leukocytes 3,100/µL, Vitamin B12 450 pg/mL. Which of the following is the best next step in management of this patient?",
"choice_a": "Check serum methylmalonic acid and homocysteine levels",
"choice_b": "Check serum copper levels",
"choice_c": "Check RBC folate levels",
"choice_d": "Order MRI of the thoracic spine",
"choice_e": "Perform nerve conduction studies",
"correct_answer": "B",
"explanation": "This patient's myeloneuropathy and hematologic findings (anemia, leukopenia) following gastric bypass and recent zinc supplementation are highly suggestive of copper deficiency. Zinc competes with copper for absorption. The clinical presentation is similar to B12 deficiency, but B12 levels here are normal. Low serum copper and ceruloplasmin confirm the diagnosis. Educational objective: Copper deficiency, often precipitated by gastric surgery or excessive zinc, presents with anemia, leukopenia, and myeloneuropathy similar to B12 deficiency.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_052",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the physician concerned about high triglycerides (456 mg/dL). He has gradual weight gain, a sedentary lifestyle, and drinks a few beers on weekends. His father died of a heart attack at 50. BMI is 31 kg/m². Blood pressure is 144/90 mm Hg. Laboratory results: Total cholesterol 240 mg/dL, HDL 40 mg/dL, HbA1c 7.2%, Glucose 140 mg/dL. He is instructed about lifestyle changes. Which of the following will provide the greatest benefit in reducing this patient's cardiovascular risk?",
"choice_a": "Fenofibrate",
"choice_b": "Fish oil",
"choice_c": "Glyburide",
"choice_d": "Niacin",
"choice_e": "Rosuvastatin",
"correct_answer": "E",
"explanation": "This patient has diabetes, a calculated 10-year ASCVD risk of 15%, and mild hypertriglyceridemia (150-500 mg/dL). Statin therapy (rosuvastatin) is the most effective intervention to reduce cardiovascular risk and will also lower triglycerides by 10%-30%. Fibrates, fish oil, and niacin (Choices A, B, D) are primarily used to prevent pancreatitis when triglycerides are >1000 mg/dL and have not consistently shown ASCVD risk reduction. Educational objective: In patients with mild hypertriglyceridemia, statins are preferred over non-statin medications for preventing cardiovascular events.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_053",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the office due to fatigue and muscle pain over the last several months. He has also experienced weight gain, dry skin, daytime sleepiness, and erectile dysfunction. Medical history is notable for hypertension treated with enalapril, hypercholesterolemia treated with rosuvastatin, and a nonfunctioning pituitary adenoma that was treated with trans-sphenoidal resection followed by radiation therapy 8 years ago. MRI 8 months ago showed a stable, 5-mm, residual pituitary mass. He has no headaches, vision loss, dark stools, or shortness of breath. The patient does not drink alcohol but has a 20-pack-year smoking history. Blood pressure is 130/80 mm Hg and pulse is 58/min with no orthostatic changes. BMI is 29 kg/m². The remainder of the physical examination (including peripheral vision, testes, and thyroid) is normal. Laboratory results are as follows: Hemoglobin 10 g/dL, Hematocrit 30%, MCV 80 µm³, Sodium 132 mEq/L, Potassium 3.7 mEq/L, Chloride 96 mEq/L, Bicarbonate 24 mEq/L, Blood urea nitrogen 10 mg/dL, Creatinine 0.8 mg/dL, Calcium 9.2 mg/dL, Glucose 80 mg/dL, AST 56 U/L, ALT 44 U/L, Creatine kinase 450 U/L (normal: 38-239), TSH 1.2 µU/mL, Free T4 0.6 ng/dL (normal: 0.8-1.8). Which of the following is the most likely cause of this patient's symptoms?",
"choice_a": "Amiodarone-induced hypothyroidism",
"choice_b": "Central hypothyroidism",
"choice_c": "Primary hypothyroidism",
"choice_d": "Rosuvastatin-induced myopathy",
"choice_e": "Sleep apnea-associated fatigue",
"correct_answer": "B",
"explanation": "This patient has clinical features of hypothyroidism (fatigue, weight gain, dry skin, bradycardia, and elevated creatine kinase) and laboratory evidence of central hypothyroidism (low free T4 with a low-normal or inappropriately normal TSH). Central hypothyroidism is caused by disorders of the pituitary or hypothalamus that interfere with TSH secretion. This patient’s history of a pituitary adenoma treated with surgery and radiation is a classic risk factor for developing hypopituitarism, which often manifests years after treatment. Radiation therapy, in particular, can cause progressive pituitary dysfunction. The presence of normocytic anemia and hyponatremia further supports the diagnosis of pituitary insufficiency. (Choice A) Amiodarone can cause thyroid dysfunction, but there is no mention of its use in this patient. (Choice C) Primary hypothyroidism would present with a significantly elevated TSH. (Choice D) While statins can cause myopathy, the constellation of systemic symptoms and low T4 points to a thyroid etiology. (Choice E) While he has daytime sleepiness and a high BMI, sleep apnea would not explain the low T4 or elevated CK. Educational objective: Central hypothyroidism is characterized by low serum free T4 and a low or inappropriately normal TSH. It is commonly caused by pituitary mass lesions or prior treatment with surgery or radiation.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_054",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 34-year-old woman comes to the office for follow-up of a pituitary mass. Two months ago, she sought evaluation for several months of amenorrhea and milky nipple discharge. She is not sexually active and has no other medical problems. She takes no medications. Physical examination was unremarkable except for bilateral galactorrhea. Laboratory evaluation at that time showed a serum prolactin level of 145 ng/mL (normal: 5-25) and normal TSH and kidney function. MRI of the brain showed a 1.2-cm pituitary mass with no compression of the optic chiasm. She was started on cabergoline 0.25 mg twice weekly. Since starting treatment, her menstrual periods have returned, and the galactorrhea has resolved. Repeat serum prolactin level is now 15 ng/mL. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Continue cabergoline and repeat MRI in 6-12 months",
"choice_b": "Decrease the dose of cabergoline",
"choice_c": "Discontinue cabergoline",
"choice_d": "Increase the dose of cabergoline",
"choice_e": "Refer for trans-sphenoidal resection",
"correct_answer": "A",
"explanation": "This patient has a macroprolactinoma (>10 mm) that has responded well to treatment with a dopamine agonist (cabergoline). The goals of therapy for macroprolactinomas are to normalize prolactin levels and reduce tumor size. Because she has a macroprolactinoma, she requires monitoring with a follow-up MRI to document tumor shrinkage, typically performed 6-12 months after starting therapy. If the tumor size decreases significantly and prolactin remains normal, the dose of cabergoline can eventually be tapered, but it is generally continued for at least 2 years before discontinuation is considered. (Choice B) Although her prolactin is normal, the current dose is effective and well-tolerated; tapering is usually not considered until after tumor shrinkage is confirmed on MRI. (Choice C) Discontinuing treatment early carries a high risk of tumor regrowth and recurrence of hyperprolactinemia. (Choice E) Surgery is reserved for patients who are resistant to or intolerant of dopamine agonists or those with rapidly progressive visual field defects. Educational objective: Patients with macroprolactinomas treated with dopamine agonists should be monitored with serial prolactin levels and follow-up MRI to ensure biochemical response and tumor size reduction.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_055",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 64-year-old man comes to the office for a routine visit. He has type 2 diabetes mellitus, hypertension, and hyperlipidemia. His medications include metformin 1,000 mg twice daily, lisinopril 20 mg daily, and atorvastatin 40 mg daily. He follows a healthy diet and walks for 30 minutes daily. He has no symptoms of hyperglycemia or hypoglycemia. Blood pressure is 128/78 mm Hg, and BMI is 30 kg/m². Laboratory results show a hemoglobin A1c of 7.2% and a serum creatinine of 1.2 mg/dL. Urine albumin-to-creatinine ratio is 150 mg/g (normal: <30). Which of the following is the most appropriate next step to reduce the risk of progression of this patient's renal disease?",
"choice_a": "Add a sodium-glucose cotransporter-2 (SGLT2) inhibitor",
"choice_b": "Increase the dose of lisinopril",
"choice_c": "Intensify glycemic control to a target A1c <6.5%",
"choice_d": "Replace lisinopril with an angiotensin receptor blocker",
"choice_e": "Restrict dietary protein intake to <0.8 g/kg/day",
"correct_answer": "A",
"explanation": "In patients with type 2 diabetes and chronic kidney disease (manifested here by albuminuria), SGLT2 inhibitors (e.g., empagliflozin, canagliflozin, dapagliflozin) have been shown to significantly reduce the risk of progression of renal disease and cardiovascular events. These benefits are observed even in patients with well-controlled blood pressure and glycemic control. (Choice B) His blood pressure is already at goal (<130/80 mm Hg); increasing the ACE inhibitor dose further may increase the risk of hyperkalemia or acute kidney injury without significant additional benefit. (Choice C) Intensive glycemic control reduces the risk of developing albuminuria but has not been shown to slow the progression of established kidney disease more effectively than standard control (A1c 7.0%-8.0%). (Choice D) Switching classes within the RAAS-blocker family is not indicated unless the patient is intolerant of the current medication (e.g., due to cough). (Choice E) Routine protein restriction is no longer recommended as it does not consistently slow GFR decline. Educational objective: SGLT2 inhibitors should be considered in patients with type 2 diabetes and albuminuric chronic kidney disease to reduce the risk of renal disease progression.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_056",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 48-year-old man is evaluated for a 6-month history of decreased libido and erectile dysfunction. He also reports generalized fatigue. He has no other medical problems and takes no medications. He has no headaches or visual changes. Physical examination shows a BMI of 33 kg/m². Testicular volume is normal. Visual fields are full. Laboratory results: Morning total testosterone 180 ng/dL (normal: 300-1,000), LH 2.1 mU/mL (normal: 2-12), FSH 3.0 mU/mL (normal: 1-12), Prolactin 12 ng/mL (normal: 3-15), TSH 1.8 µU/mL. Ferritin 1,200 ng/mL (normal: 20-250), Transferrin saturation 75% (normal: 15-50%). Which of the following is the most likely cause of this patient's hypogonadism?",
"choice_a": "Hereditary hemochromatosis",
"choice_b": "Klinefelter syndrome",
"choice_c": "Obesity-associated hypogonadism",
"choice_d": "Pituitary macroadenoma",
"choice_e": "Prolactinoma",
"correct_answer": "A",
"explanation": "This patient has secondary (hypogonadotropic) hypogonadism, characterized by low testosterone with inappropriately normal/low LH and FSH. The elevated ferritin and transferrin saturation strongly suggest hereditary hemochromatosis. Iron deposition in the anterior pituitary (specifically the gonadotrophs) is a common cause of secondary hypogonadism in these patients. (Choice B) Klinefelter syndrome (47,XXY) causes primary (hypergonadotropic) hypogonadism with high LH and FSH. (Choice C) While obesity can cause mildly low testosterone, the significant elevation in iron markers points to hemochromatosis. (Choices D and E) Prolactin is normal, and he has no mass-effect symptoms, making a pituitary tumor less likely than a systemic infiltrative process. Educational objective: Hereditary hemochromatosis can cause secondary hypogonadism due to iron deposition in the pituitary gland.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_057",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 28-year-old woman comes to the office due to a 3-month history of amenorrhea. She previously had regular menstrual cycles. She has no other medical problems and takes no medications. She denies headaches or galactorrhea. Physical examination is normal. Laboratory results: Pregnancy test negative, TSH 2.1 µU/mL, Prolactin 85 ng/mL (normal: 5-25). Creatinine 0.8 mg/dL. Which of the following is the most appropriate next step in management?",
"choice_a": "Initiate cabergoline",
"choice_b": "MRI of the pituitary gland",
"choice_c": "Repeat prolactin level after fasting",
"choice_d": "Repeat prolactin level with serial dilution",
"choice_e": "Visual field testing",
"correct_answer": "B",
"explanation": "Once a pregnancy test, primary hypothyroidism, and kidney disease have been ruled out, a persistent elevation in prolactin (typically >20-25 ng/mL) warrants an MRI of the pituitary gland to look for a mass or stalk effect. Prolactin levels >50-100 ng/mL are frequently associated with a pituitary adenoma. (Choice A) Treatment should not be started until the underlying etiology is confirmed by imaging. (Choice C) While prolactin can be mildly elevated by food or stress, a level of 85 ng/mL is unlikely to be purely physiologic. (Choice D) Serial dilution is used to overcome the 'hook effect' in cases of very high prolactin levels (>1,000 ng/mL) that measure falsely low; it is not indicated here. (Choice E) Visual field testing is indicated if the MRI identifies a large mass (>10 mm) near the optic chiasm. Educational objective: Evaluation of hyperprolactinemia (after ruling out pregnancy, hypothyroidism, and renal failure) requires MRI of the pituitary to identify the underlying cause.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_058",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man with a history of generalized tonic-clonic seizures comes to the office due to decreased libido. His seizures are well-controlled with phenytoin. He has no other medical problems. Physical examination is normal. Laboratory results: Total testosterone 210 ng/dL (normal: 300-1,000), LH 4.2 mU/mL (normal: 2-12), FSH 3.8 mU/mL (normal: 1-12), Prolactin 110 ng/mL (normal: 5-20), TSH 1.5 µU/mL, Creatinine 3.8 mg/dL (normal: 0.7-1.3), BUN 45 mg/dL. Which of the following is the most likely cause of this patient's hyperprolactinemia?",
"choice_a": "Chronic kidney disease",
"choice_b": "Phenytoin-induced",
"choice_c": "Pituitary stalk effect",
"choice_d": "Prolactinoma",
"choice_e": "Recent seizure",
"correct_answer": "A",
"explanation": "Hyperprolactinemia is common in patients with chronic renal failure. It results from both increased prolactin secretion (likely due to altered dopaminergic tone) and decreased renal clearance of prolactin. Prolactin levels in renal failure are typically <100 ng/mL but can occasionally be higher. (Choice B) Phenytoin only rarely causes hyperprolactinemia; antipsychotics are the more common offenders. (Choice C) Pituitary stalk effect usually causes milder elevations in prolactin. (Choice D) While a prolactinoma is possible, the significant elevation in creatinine provides a clear metabolic explanation. (Choice E) Prolactin is transiently elevated after an acute seizure but does not remain high in a patient with controlled epilepsy. Educational objective: Hyperprolactinemia is common in chronic renal failure due to increased release and decreased clearance of prolactin.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
}, 
{
"id": "ENDO_059",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 45-year-old woman comes to the office due to symptoms of hyperthyroidism. Laboratory evaluation confirms overt thyrotoxicosis with a suppressed TSH and elevated free T4. A radioactive iodine uptake (RAIU) scan shows low uptake (<1%). Serum thyroglobulin level is significantly elevated. Which of the following is the most likely diagnosis?",
"choice_a": "Factitious thyrotoxicosis",
"choice_b": "Graves disease",
"choice_c": "Silent (painless) thyroiditis",
"choice_d": "Struma ovarii",
"choice_e": "Toxic multinodular goiter",
"correct_answer": "C",
"explanation": "Low radioactive iodine uptake (<1%) in the setting of thyrotoxicosis occurs in three main scenarios: exogenous thyroid hormone ingestion (factitious), ectopic production (struma ovarii), or release of preformed hormone due to thyroid inflammation (thyroiditis). An elevated thyroglobulin level indicates that the hormone is being produced or released from the patient's own thyroid gland, which rules out factitious thyrotoxicosis (where thyroglobulin is suppressed). Silent thyroiditis is a classic cause of low-uptake thyrotoxicosis with high thyroglobulin.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_060",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 68-year-old man with type 2 diabetes and hypertension is being evaluated for new-onset proximal muscle weakness. He takes metformin, lisinopril, and recently started high-dose prednisone for a giant cell arteritis flare. On examination, he has 4/5 strength in the hip flexors and shoulder abductors but no muscle tenderness. Deep tendon reflexes are normal. Laboratory results show a normal creatine kinase (CK) and normal ESR. Which of the following is the most likely cause of his weakness?",
"choice_a": "Glucocorticoid-induced myopathy",
"choice_b": "Inflammatory myopathy",
"choice_c": "Polymyalgia rheumatica",
"choice_d": "Statin-induced myopathy",
"choice_e": "Thyroid-associated myopathy",
"correct_answer": "A",
"explanation": "Glucocorticoid-induced myopathy presents as progressive proximal muscle weakness and atrophy without pain or tenderness, specifically following high-dose steroid use. It is characterized by normal CK levels and normal ESR (unless the underlying inflammatory condition is active). Unlike polymyalgia rheumatica, it involves true weakness rather than just pain-limited motion.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf, 3.pdf"
},
{
"id": "ENDO_061",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the physician very concerned about his high triglyceride levels on a recent lipid profile. He has no complaints except gradual weight gain over the past few years. He eats mainly fast food at lunchtime and drinks a few beers while watching television on weekends. The patient does not smoke or use recreational drugs. His father died of a heart attack at age 50. His mother suffers from diabetes mellitus and experienced a minor stroke. Blood pressure is 144/90 mm Hg, pulse is 73/min, and body mass index is 31 kg/m². Physical examination is unremarkable. Fasting laboratory results are as follows: Total cholesterol 240 mg/dL, High-density lipoprotein 40 mg/dL, Triglycerides 456 mg/dL, Hemoglobin A1c 7.2%, Glucose 140 mg/dL. The patient's serum creatinine and liver and thyroid function tests are normal. Repeat fasting triglyceride level is 460 mg/dL. He is instructed about lifestyle changes. Which of the following will provide the greatest benefit in reducing this patient's cardiovascular risk?",
"choice_a": "Fenofibrate",
"choice_b": "Fish oil",
"choice_c": "Glyburide",
"choice_d": "Niacin",
"choice_e": "Rosuvastatin",
"correct_answer": "E",
"explanation": "In patients with mild hypertriglyceridemia (150-500 mg/dL), the decision to initiate lipid-lowering therapy is determined primarily by the overall risk of cardiovascular events. For this patient, who has diabetes and a 10-year ASCVD risk of 15%, statin therapy (rosuvastatin) is the most effective intervention to reduce cardiovascular risk and will also lower triglycerides by 10%-30%. Fibrates or fish oil are primarily indicated for pancreatitis prevention when triglycerides are >1000 mg/dL.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_062",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 32-year-old woman comes to the office due to a 2-month history of amenorrhea. She previously had regular menstrual cycles. She has no other medical problems and takes no medications. Physical examination is normal. Laboratory results: Pregnancy test negative, TSH 1.5 µU/mL, Prolactin 110 ng/mL (normal: 5-25), Creatinine 0.7 mg/dL. Which of the following is the most appropriate next step in management?",
"choice_a": "Initiate cabergoline",
"choice_b": "MRI of the pituitary gland",
"choice_c": "Repeat prolactin level after fasting",
"choice_d": "Repeat prolactin level with serial dilution",
"choice_e": "Visual field testing",
"correct_answer": "B",
"explanation": "Once pregnancy, primary hypothyroidism, and renal failure have been ruled out, the next step in evaluating hyperprolactinemia (especially with levels >100 ng/mL) is an MRI of the pituitary gland to identify a potential adenoma or other structural cause.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_063",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 45-year-old woman is evaluated for symptoms of hyperthyroidism. Laboratory tests show a suppressed TSH and elevated free T4. A radioactive iodine uptake (RAIU) scan shows very low uptake (<1%). Serum thyroglobulin level is undetectable. Which of the following is the most likely diagnosis?",
"choice_a": "Factitious thyrotoxicosis",
"choice_b": "Graves disease",
"choice_c": "Silent (painless) thyroiditis",
"choice_d": "Subacute (de Quervain's) thyroiditis",
"choice_e": "Toxic multinodular goiter",
"correct_answer": "A",
"explanation": "Low radioactive iodine uptake occurs with exogenous thyroid hormone ingestion, ectopic production, or inflammation. A suppressed serum thyroglobulin level specifically differentiates factitious thyrotoxicosis (exogenous intake) from all other causes where thyroid hormone is released from the patient's own gland (which would cause high thyroglobulin).",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_064",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 65-year-old man with type 2 diabetes and stage 4 chronic kidney disease (eGFR 22 mL/min/1.73m²) is evaluated for worsening glycemic control. He is currently taking metformin 500 mg twice daily. His HbA1c has increased from 7.0% to 8.2%. Which of the following is the most appropriate next step in management?",
"choice_a": "Add glyburide",
"choice_b": "Discontinue metformin and start insulin",
"choice_c": "Discontinue metformin and start linagliptin",
"choice_d": "Increase metformin to 1000 mg twice daily",
"choice_e": "Start canagliflozin",
"correct_answer": "C",
"explanation": "Metformin is contraindicated in patients with an eGFR <30 mL/min/1.73m² due to the risk of lactic acidosis. Linagliptin is a DPP-4 inhibitor that is cleared primarily by hepatobiliary excretion and does not require dose adjustment in chronic kidney disease, making it a safe alternative. SGLT2 inhibitors like canagliflozin are generally not initiated if eGFR is <30.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_065",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 30-year-old woman with Graves disease is planning a pregnancy in the next few months. She is currently taking methimazole 10 mg daily and has been euthyroid for 6 months. Which of the following is the best advice regarding her antithyroid medication?",
"choice_a": "Continue methimazole throughout pregnancy",
"choice_b": "Discontinue methimazole and monitor closely",
"choice_c": "Switch to propylthiouracil before attempting to conceive",
"choice_d": "Switch to radioactive iodine ablation now",
"choice_e": "Switch to thyroidectomy now",
"correct_answer": "C",
"explanation": "While methimazole is generally preferred for Graves disease, propylthiouracil (PTU) is recommended in the first trimester of pregnancy due to the potential teratogenic effects of methimazole. Patients planning pregnancy should often switch to PTU prior to conception or during the first trimester.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_066",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 55-year-old woman is found to have a serum calcium of 10.8 mg/dL and a phosphorus of 2.4 mg/dL. Her PTH is 95 pg/mL (normal 10-65). She has no symptoms and a DXA T-score of -1.5 at the hip. A 24-hour urinary calcium is 450 mg. Which of the following is the most appropriate next step?",
"choice_a": "Follow-up in 12 months",
"choice_b": "Neck ultrasound and parathyroidectomy",
"choice_c": "Start alendronate",
"choice_d": "Start cinacalcet",
"choice_e": "Vitamin D supplementation",
"correct_answer": "B",
"explanation": "This patient has primary hyperparathyroidism. Although she is asymptomatic, an indication for parathyroidectomy is a 24-hour urinary calcium excretion >400 mg/day, as this increases the risk of nephrolithiasis.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_067",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 24-year-old man is evaluated for tall stature, sparse facial hair, and small, firm testes. He has bilateral gynecomastia. Laboratory results show a testosterone of 150 ng/dL, LH 25 mU/mL, and FSH 30 mU/mL. Which of the following is the most likely diagnosis?",
"choice_a": "Hereditary hemochromatosis",
"choice_b": "Kallmann syndrome",
"choice_c": "Klinefelter syndrome",
"choice_d": "Pituitary adenoma",
"choice_e": "Sertoli cell-only syndrome",
"correct_answer": "C",
"explanation": "Klinefelter syndrome (47,XXY) is the most common genetic cause of primary (hypergonadotropic) hypogonadism, characterized by tall stature, small firm testes, and elevated gonadotropins (LH/FSH) due to testicular failure.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_068",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 40-year-old woman with a history of Hashimoto thyroiditis is evaluated for fatigue and weight loss. She is currently taking levothyroxine 125 mcg daily. Her TSH is 0.1 µU/mL and free T4 is 2.2 ng/dL (normal 0.8-1.8). She also has hyperpigmentation of her skin creases. Which of the following should be performed next?",
"choice_a": "Cosyntropin stimulation test",
"choice_b": "Decrease levothyroxine dose",
"choice_c": "Increase levothyroxine dose",
"choice_d": "MRI of the pituitary",
"choice_e": "Thyroid ultrasound",
"correct_answer": "A",
"explanation": "The presence of hyperpigmentation in a patient with autoimmune thyroid disease suggests primary adrenal insufficiency (Addison's disease). In patients with coexisting adrenal insufficiency, starting or increasing thyroid hormone can precipitate an adrenal crisis. A cosyntropin stimulation test is required to evaluate adrenal function.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_069",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 58-year-old man with type 2 diabetes takes metformin and glyburide. He is started on clarithromycin for pneumonia. Two days later, he is brought to the ED with confusion and diaphoresis. Fingerstick glucose is 45 mg/dL. Which of the following is the most likely mechanism for his hypoglycemia?",
"choice_a": "Clarithromycin-induced insulin secretion",
"choice_b": "Inhibition of glyburide metabolism by clarithromycin",
"choice_c": "Metformin-induced lactic acidosis",
"choice_d": "Potentiation of glyburide by the infection",
"choice_e": "Reduced carbohydrate intake due to illness",
"correct_answer": "B",
"explanation": "Certain antibiotics (like clarithromycin or TMP-SMX) can potentiate the effects of sulfonylureas like glyburide by inhibiting their metabolism or clearance, leading to unexpected hypoglycemia, especially in elderly patients.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_070",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 35-year-old man with acromegaly is evaluated after a trans-sphenoidal resection. His post-operative IGF-1 remains elevated. MRI shows a residual 6-mm tumor in the cavernous sinus. Which of the following is the best next step in management?",
"choice_a": "Cabergoline",
"choice_b": "Octreotide",
"choice_c": "Pegvisomant",
"choice_d": "Repeat surgery",
"choice_e": "Wait and monitor IGF-1 in 6 months",
"correct_answer": "B",
"explanation": "For patients with persistent acromegaly after surgery, medical therapy with somatostatin analogs (like octreotide or lanreotide) is typically the next step to control GH and IGF-1 levels. Cabergoline may be used if the tumor also secretes prolactin, and pegvisomant is usually reserved for resistant cases.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_071",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 60-year-old woman is found to have a 1.5-cm adrenal nodule on a CT scan performed for abdominal pain. She has no symptoms of hormone excess. Blood pressure is 130/80 mm Hg. Laboratory results: Potassium 4.0 mEq/L, Sodium 140 mEq/L. Which of the following is the most appropriate next step?",
"choice_a": "1-mg overnight dexamethasone suppression test and plasma metanephrines",
"choice_b": "Adrenal venous sampling",
"choice_c": "CT-guided biopsy of the nodule",
"choice_d": "Laparoscopic adrenalectomy",
"choice_e": "Repeat CT in 6 months",
"correct_answer": "A",
"explanation": "All patients with an incidentally discovered adrenal mass (incidentaloma) should undergo biochemical screening for Cushing syndrome (overnight dexamethasone suppression test) and pheochromocytoma (plasma metanephrines), even if asymptomatic. Screening for hyperaldosteronism is added if the patient is hypertensive.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 3.pdf"
},
{
"id": "ENDO_072",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 56-year-old woman comes to the physician for evaluation of a right adrenal mass found 2 weeks ago on an abdominal CT scan performed for renal colic. The lesion is 2 cm in diameter, round, and has low x-ray attenuation (8 Hounsfield units) on non-contrast slices. Her other medical problems include hypertension treated with amlodipine. Family history is unremarkable. Her blood pressure is 144/96 mm Hg, pulse is 66/min, and BMI is 26 kg/m². The remainder of the examination is within normal limits. Laboratory results are as follows: Sodium 144 mEq/L, Potassium 3.8 mEq/L, Bicarbonate 29 mEq/L, Creatinine 1.2 mg/dL, Glucose 100 mg/dL. Which of the following is the most appropriate next step in managing this patient?",
"choice_a": "Add hydrochlorothiazide and follow-up in 4 weeks",
"choice_b": "Aldosterone-to-renin ratio",
"choice_c": "CT-guided fine-needle aspiration",
"choice_d": "Left adrenalectomy",
"choice_e": "Repeat CT scan in 6 months",
"correct_answer": "B",
"explanation": "This patient has an incidentally discovered adrenal mass (incidentaloma). All patients with an adrenal incidentaloma should undergo biochemical evaluation to exclude hormone excess, including a 1-mg overnight dexamethasone suppression test and plasma free metanephrines. In addition, patients with hypertension (like this patient) should be screened for primary hyperaldosteronism using a morning plasma aldosterone-to-renin ratio. The CT characteristics (size <4 cm, <10 Hounsfield units) suggest a benign cortical adenoma, but functional status must be determined first. Fine-needle aspiration (Choice C) is generally not recommended as it cannot differentiate benign from malignant primary adrenal tumors and may precipitate a hypertensive crisis if the mass is a pheochromocytoma.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_073",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 64-year-old man with a 15-year history of type 2 diabetes is admitted to the hospital for management of a foot ulcer and cellulitis. His home medications include metformin and glyburide. On admission, his blood glucose is 280 mg/dL and HbA1c is 9.2%. He is expected to have a regular diet during his stay. Which of the following is the most appropriate management of his diabetes while in the hospital?",
"choice_a": "Continue home metformin and glyburide",
"choice_b": "Continue metformin and start sliding-scale insulin",
"choice_c": "Discontinue home medications and start a basal-bolus insulin regimen",
"choice_d": "Discontinue home medications and start an insulin infusion",
"choice_e": "Start sliding-scale insulin alone",
"correct_answer": "C",
"explanation": "Most hospitalized patients with diabetes require insulin to achieve optimal glycemic control (target 140-180 mg/dL). Metformin is often held due to the risk of lactic acidosis in the setting of potential contrast studies or unstable hemodynamics, and sulfonylureas (glyburide) are held due to high risk of hypoglycemia with erratic hospital nutrition. A basal-bolus regimen (basal insulin plus prandial/bolus insulin with meals, and correctional scale) is the preferred method for non-critically ill patients who are eating. Sliding-scale insulin alone (Choice E) is discouraged as it treats hyperglycemia after it occurs rather than preventing it.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_074",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 45-year-old woman is evaluated for a 1.2-cm nodule in the left lobe of the thyroid that was discovered incidentally on a carotid duplex ultrasound. The patient has no symptoms of thyroid dysfunction. She has no history of neck radiation or family history of thyroid cancer. Physical examination shows a firm, non-tender nodule in the left thyroid lobe; there is no cervical lymphadenopathy. Laboratory results show a serum TSH of 0.2 µU/mL (normal: 0.5-5.0). Which of the following is the most appropriate next step in management?",
"choice_a": "Fine-needle aspiration",
"choice_b": "Repeat TSH in 3 months",
"choice_c": "Serum calcitonin level",
"choice_d": "Thyroid scintigraphy",
"choice_e": "Thyroid ultrasound",
"correct_answer": "D",
"explanation": "The initial evaluation of a thyroid nodule involves measuring serum TSH and performing a thyroid ultrasound. If the TSH is suppressed (low), the next step is thyroid scintigraphy (radionuclide scanning) to evaluate the functional status of the nodule. Hyperfunctioning ('hot') nodules are rarely malignant and generally do not require fine-needle aspiration (FNA). If the nodule is non-functioning ('cold') or indeterminate, FNA may be indicated based on ultrasound characteristics and size.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_075",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the office for follow-up of type 2 diabetes mellitus. He was diagnosed 5 years ago and his current regimen includes metformin and glipizide. His HbA1c has been stable at 7.2%. However, the patient has recently experienced several episodes of shakiness, sweating, and confusion in the late afternoon. He also reports a 4-kg weight gain over the last 6 months. BMI is 32 kg/m². Which of the following is the most appropriate next step in management?",
"choice_a": "Add basal insulin",
"choice_b": "Add sitagliptin",
"choice_c": "Discontinue glipizide and start liraglutide",
"choice_d": "Increase the dose of metformin",
"choice_e": "Replace metformin with pioglitazone",
"correct_answer": "C",
"explanation": "This patient is experiencing symptomatic hypoglycemia and weight gain, which are common side effects of sulfonylureas like glipizide. In an obese patient with type 2 diabetes, GLP-1 receptor agonists (e.g., liraglutide) are preferred as they are associated with significant weight loss and a very low risk of hypoglycemia. Replacing the sulfonylurea with a GLP-1 agonist would address both the hypoglycemia and the weight gain while maintaining glycemic control.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_076",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 30-year-old woman is evaluated for a 1.5-cm thyroid nodule. TSH is normal. Ultrasound shows a solid, hypoechoic nodule with microcalcifications. Fine-needle aspiration is performed and shows follicular cells arranged in a follicular pattern with 'Orphan Annie eye' nuclei and psammoma bodies. Which of the following is the most likely diagnosis?",
"choice_a": "Anaplastic thyroid cancer",
"choice_b": "Follicular thyroid cancer",
"choice_c": "Medullary thyroid cancer",
"choice_d": "Papillary thyroid cancer",
"choice_e": "Thyroid lymphoma",
"correct_answer": "D",
"explanation": "Papillary thyroid cancer is the most common type of thyroid malignancy. Classic cytologic and histologic findings include psammoma bodies and characteristic nuclear features such as large, pale nuclei with central clearing ('Orphan Annie eye' nuclei), nuclear grooves, and intranuclear cytoplasmic inclusions.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_077",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 62-year-old man with a history of medullary thyroid cancer (MTC) undergoes a total thyroidectomy. Genetic testing reveals a germline RET mutation. Which of the following should be performed next in this patient?",
"choice_a": "Check serum calcitonin every 3 months",
"choice_b": "Prophylactic parathyroidectomy",
"choice_c": "Radioactive iodine ablation",
"choice_d": "Screening for pheochromocytoma and hyperparathyroidism",
"choice_e": "Total body bone scan",
"correct_answer": "D",
"explanation": "A germline RET mutation indicates Multiple Endocrine Neoplasia type 2 (MEN2). All patients with MEN2 (types 2A and 2B) are at high risk for developing pheochromocytoma, and those with MEN2A are also at risk for primary hyperparathyroidism. Therefore, screening for these conditions with plasma metanephrines, serum calcium, and PTH is essential.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_078",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 45-year-old woman is evaluated for a 1.2-cm nodule in the left lobe of the thyroid that was discovered incidentally on a carotid duplex ultrasound. The patient has no symptoms of thyroid dysfunction. She has no history of neck radiation or family history of thyroid cancer. Physical examination shows a firm, non-tender nodule in the left thyroid lobe; there is no cervical lymphadenopathy. Laboratory results show a serum TSH of 0.2 µU/mL (normal: 0.5-5.0). Which of the following is the most appropriate next step in management?",
"choice_a": "Fine-needle aspiration",
"choice_b": "Repeat TSH in 3 months",
"choice_c": "Serum calcitonin level",
"choice_d": "Thyroid scintigraphy",
"choice_e": "Thyroid ultrasound",
"correct_answer": "D",
"explanation": "The initial evaluation of a thyroid nodule involves measuring serum TSH and performing a thyroid ultrasound. If the TSH is suppressed (low), the next step is thyroid scintigraphy (radionuclide scanning) to evaluate the functional status of the nodule. Hyperfunctioning ('hot') nodules are rarely malignant and generally do not require fine-needle aspiration (FNA). If the nodule is non-functioning ('cold') or indeterminate, FNA may be indicated based on ultrasound characteristics and size.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_079",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the office for follow-up of type 2 diabetes mellitus. He was diagnosed 5 years ago and his current regimen includes metformin and glipizide. His HbA1c has been stable at 7.2%. However, the patient has recently experienced several episodes of shakiness, sweating, and confusion in the late afternoon. He also reports a 4-kg weight gain over the last 6 months. BMI is 32 kg/m². Which of the following is the most appropriate next step in management?",
"choice_a": "Add basal insulin",
"choice_b": "Add sitagliptin",
"choice_c": "Discontinue glipizide and start liraglutide",
"choice_d": "Increase the dose of metformin",
"choice_e": "Replace metformin with pioglitazone",
"correct_answer": "C",
"explanation": "This patient is experiencing symptomatic hypoglycemia and weight gain, which are common side effects of sulfonylureas like glipizide. In an obese patient with type 2 diabetes, GLP-1 receptor agonists (e.g., liraglutide) are preferred as they are associated with significant weight loss and a very low risk of hypoglycemia. Replacing the sulfonylurea with a GLP-1 agonist would address both the hypoglycemia and the weight gain while maintaining glycemic control.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_080",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 30-year-old woman is evaluated for a 1.5-cm thyroid nodule. TSH is normal. Ultrasound shows a solid, hypoechoic nodule with microcalcifications. Fine-needle aspiration is performed and shows follicular cells arranged in a follicular pattern with 'Orphan Annie eye' nuclei and psammoma bodies. Which of the following is the most likely diagnosis?",
"choice_a": "Anaplastic thyroid cancer",
"choice_b": "Follicular thyroid cancer",
"choice_c": "Medullary thyroid cancer",
"choice_d": "Papillary thyroid cancer",
"choice_e": "Thyroid lymphoma",
"correct_answer": "D",
"explanation": "Papillary thyroid cancer is the most common type of thyroid malignancy. Classic cytologic and histologic findings include psammoma bodies and characteristic nuclear features such as large, pale nuclei with central clearing ('Orphan Annie eye' nuclei), nuclear grooves, and intranuclear cytoplasmic inclusions.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_081",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 62-year-old man with a history of medullary thyroid cancer (MTC) undergoes a total thyroidectomy. Genetic testing reveals a germline RET mutation. Which of the following should be performed next in this patient?",
"choice_a": "Check serum calcitonin every 3 months",
"choice_b": "Prophylactic parathyroidectomy",
"choice_c": "Radioactive iodine ablation",
"choice_d": "Screening for pheochromocytoma and hyperparathyroidism",
"choice_e": "Total body bone scan",
"correct_answer": "D",
"explanation": "A germline RET mutation indicates Multiple Endocrine Neoplasia type 2 (MEN2). All patients with MEN2 (types 2A and 2B) are at high risk for developing pheochromocytoma, and those with MEN2A are also at risk for primary hyperparathyroidism. Therefore, screening for these conditions with plasma metanephrines, serum calcium, and PTH is essential.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 4.pdf"
},
{
"id": "ENDO_082",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 44-year-old man comes to the office for follow-up of type 2 diabetes mellitus. He was diagnosed 5 years ago and his current regimen includes metformin 1,000 mg twice daily. He has a history of hypertension and obesity. His BMI is 34 kg/m². Laboratory results show a hemoglobin A1c of 8.4%. He reports that he has been trying to lose weight through diet and exercise but has not been successful. Which of the following is the most appropriate next step in management?",
"choice_a": "Add basal insulin",
"choice_b": "Add glipizide",
"choice_c": "Add liraglutide",
"choice_d": "Add sitagliptin",
"choice_e": "Increase metformin to 1,500 mg twice daily",
"correct_answer": "C",
"explanation": "This patient has uncontrolled type 2 diabetes (A1c >7.0%) despite metformin therapy. In a patient with obesity (BMI 34 kg/m²) who has been unable to lose weight, the addition of a GLP-1 receptor agonist (eg, liraglutide) is an excellent choice as it provides significant hemoglobin A1c reduction while promoting weight loss with a low risk of hypoglycemia. Metformin is already at its maximal effective dose (2,000 mg daily), and adding a sulfonylurea like glipizide or insulin would likely lead to further weight gain.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf, 4.pdf"
},
{
"id": "ENDO_083",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 56-year-old woman is evaluated for a 2-cm right adrenal mass found incidentally on a CT scan. The mass has a density of 8 Hounsfield units. Her blood pressure is 144/96 mm Hg. Laboratory results show: Sodium 144 mEq/L, Potassium 3.8 mEq/L, Bicarbonate 29 mEq/L, and Glucose 100 mg/dL. In addition to a 1-mg dexamethasone suppression test and plasma metanephrines, which of the following is the most appropriate next step in the biochemical evaluation of this patient?",
"choice_a": "24-hour urinary cortisol",
"choice_b": "Adrenal venous sampling",
"choice_c": "Dehydroepiandrosterone sulfate (DHEAS) level",
"choice_d": "Plasma aldosterone-to-renin ratio",
"choice_e": "Serum testosterone level",
"correct_answer": "D",
"explanation": "All patients with an adrenal incidentaloma require screening for Cushing syndrome and pheochromocytoma. In patients who are also hypertensive, screening for primary hyperaldosteronism with a morning plasma aldosterone-to-renin ratio is also indicated. This patient's borderline high sodium and bicarbonate levels further increase the suspicion for aldosterone excess.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 1.pdf, 4.pdf"
},
{
"id": "ENDO_084",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 64-year-old man with type 2 diabetes and stable chronic kidney disease (eGFR 48 mL/min/1.73 m²) is evaluated for worsening glycemic control. He is currently taking metformin 1,000 mg twice daily. His HbA1c is 10.1% and fasting glucose is 307 mg/dL. He has no osmotic symptoms. Which of the following is the most appropriate next step in management?",
"choice_a": "Add basal insulin",
"choice_b": "Add canagliflozin",
"choice_c": "Add sitagliptin",
"choice_d": "Discontinue metformin and start insulin",
"choice_e": "Increase metformin dose",
"correct_answer": "A",
"explanation": "In patients with type 2 diabetes who are not controlled on metformin and have an A1c ≥10% or blood glucose ≥300 mg/dL, the addition of insulin is recommended to achieve rapid glycemic control. Metformin can be continued as his eGFR is >30 mL/min/1.73 m², but it should be used with caution as the eGFR is between 30 and 45. SGLT2 inhibitors and DPP-4 inhibitors would likely be insufficient to bridge the gap from an A1c of 10.1% to the target.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf, 4.pdf"
},
{
"id": "ENDO_085",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 52-year-old man comes to the office due to progressive erectile dysfunction and loss of libido for the last 8 months. He is unable to obtain an erection and also has malaise and poor energy. The patient has no history of headaches, visual loss, anabolic steroid use, daytime sleepiness, or prior testicular injury. His other medical problems include type 2 diabetes mellitus, hypertension, and hyperlipidemia. Medications include metformin, atorvastatin, and ramipril. The patient is married and has 2 children. Blood pressure is 120/80 mm Hg and pulse is 66/min. BMI is 31 kg/m². The patient has normal secondary sexual characteristics without gynecomastia. Peripheral vision is intact on confrontation testing. The testes are normal in size with a soft consistency. The remainder of the physical examination is normal. Laboratory results are as follows: Glucose 125 mg/dL, Creatinine 1.1 mg/dL, Hemoglobin A1c 7.4%, Testosterone, serum (8:00 AM) 130 ng/dL (normal: 240-950), TSH 0.6 µU/mL. Repeat serum testosterone is 136 ng/dL, with serum FSH of 5 mU/mL, LH of 4 mU/mL, and prolactin of 10 ng/mL. Which of the following is the most appropriate next step in addressing this patient's current condition?",
"choice_a": "Intensify diabetes treatment",
"choice_b": "Measure nocturnal penile tumescence",
"choice_c": "Obtain MRI of the pituitary",
"choice_d": "Perform nerve conduction studies",
"choice_e": "Start testosterone replacement therapy",
"correct_answer": "C",
"explanation": "This patient has hypogonadal symptoms with a low serum testosterone level and low/inappropriately normal FSH and LH levels. This is consistent with hypogonadotropic (central) hypogonadism. Hypogonadism is common in men with type 2 diabetes, especially those age ≥65 or with concurrent obesity. However, younger men with more pronounced declines in serum testosterone (as in this patient) are more likely to have sellar masses or other structural disruptions of the hypothalamic-pituitary axis. These patients should have pituitary imaging, preferably with MRI.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_086",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 23-year-old woman comes to the office due to palpitations, increased frequency of bowel movements, and a 4.5-kg (10-lb) weight loss despite adequate food intake. The patient's symptoms also include redness of the eyes associated with tearing, grittiness, and photophobia, as well as intermittent diplopia when reading or watching television. Medical history is unremarkable; she has never been pregnant. She has smoked half a pack of cigarettes a day for the last 2 years. Blood pressure is 138/66 mm Hg and pulse is 110/min and regular. The thyroid gland shows diffuse symmetrical enlargement without tenderness. A thyroid bruit is audible. Ocular examination shows bilateral proptosis with conjunctival injection and periorbital edema. Laboratory evaluation shows a serum TSH level of 0.005 µU/mL and a free thyroxine level of 4.1 ng/dL (normal: 0.9-2.4). Thyroid scintigraphy shows 24-hour radioactive iodine uptake of 56% (normal: 10%-30%) with a diffuse pattern. The patient is started on a beta blocker and oral prednisone. Which of the following additional interventions should be initiated at this time?",
"choice_a": "Methimazole",
"choice_b": "Propylthiouracil",
"choice_c": "Radioactive iodine",
"choice_d": "Selenium",
"choice_e": "Thyroidectomy",
"correct_answer": "A",
"explanation": "This patient has hyperthyroidism associated with a diffuse goiter and increased radioiodine uptake consistent with Graves disease. She also has moderate Graves ophthalmopathy. In addition to beta blockers and glucocorticoids, she should be started on an antithyroid drug (ATD) to inhibit synthesis of thyroid hormone. Methimazole is usually preferred due to the risk of hepatotoxicity with propylthiouracil. Radioactive iodine (RAI) should be avoided in patients with significant ocular symptoms as it can worsen ophthalmopathy.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_087",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 41-year-old woman comes to the office due to irregular menstrual periods and intermittent milky discharge from both breasts for the past 6 months. During this time, she has also had vaginal dryness and dyspareunia. She takes no medications except for over-the-counter vitamin supplements. Physical examination shows mild expressive galactorrhea from both breasts. Laboratory results are as follows: Prolactin, serum 90 ng/mL, TSH 1.6 µU/mL, T4, serum 7.0 µg/dL. MRI of the brain shows a 7-mm pituitary mass. Which of the following is the patient at an increased risk of developing if her current condition is left untreated?",
"choice_a": "Endometrial cancer",
"choice_b": "Osteoporosis",
"choice_c": "Panhypopituitarism",
"choice_d": "Tricuspid regurgitation",
"choice_e": "Vision loss",
"correct_answer": "B",
"explanation": "This patient has a microprolactinoma (<10 mm). Hyperprolactinemia suppresses gonadotropin secretion and causes hypogonadism in premenopausal women. The resultant low estrogen level can lead to infertility, amenorrhea, and vaginal dryness. Low estrogen levels are also a significant risk factor for rapid bone loss and osteoporosis.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
},
{
"id": "ENDO_088",
"system": "Endocrine, Diabetes Metabolism",
"stem": "A 51-year-old woman comes to the office due to excessive sweating at night. She has had type 2 diabetes mellitus for the past 10 years and takes 34 units of insulin glargine at bedtime and 6 units of insulin lispro before meals 3 times a day. She also eats a bedtime snack daily. Hemoglobin A1c is 6.7%. Fingerstick blood glucose levels show 3:00 AM readings of 60 mg/dL and 54 mg/dL on two of the four days prior to the visit, with fasting morning glucose between 88-101 mg/dL. Which of the following is the most appropriate next step in management of this patient's diabetes mellitus?",
"choice_a": "Decrease the dose of insulin glargine",
"choice_b": "Decrease the dose of pre-dinner insulin lispro",
"choice_c": "Decrease the doses of insulin glargine and pre-dinner insulin lispro",
"choice_d": "Discontinue metformin",
"choice_e": "Increase the amount of carbohydrate in the bedtime snack",
"correct_answer": "A",
"explanation": "This patient has good overall glycemic control but is experiencing early-morning (3:00 AM) hypoglycemia. In patients receiving basal-bolus insulin therapy, the dose of basal insulin (glargine) should be reduced for preprandial and early-morning hypoglycemia. Reducing the glargine dose by 10%-20% should alleviate the nocturnal hypoglycemia while maintaining fasting glucose levels at goal.",
"source": "ABIM - Endocrine, Diabetes Metabolism - 2.pdf"
}
]  