[
  {
    "id": "ENT_001",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 32-year-old man comes to the physician because of facial pain and fever. He developed a \"cold\" one week ago with symptoms consisting of mild malaise, sore throat, clear nasal discharge, and productive cough of small amounts of gray sputum. He felt that he was improving, but now has 1 day of fever, chills, purulent nasal discharge, and facial fullness with pain. His pain is worsened by bending over. He also reports aching of his upper left molars. He is in good health, takes no medications, and has no HIV risk factors. He has no known drug allergies. His temperature is 39.2 C (102.5 F), pulse is 90/min, and respirations are 14/min. He appears uncomfortable. There is pain to light tapping over his left maxillary region. There is swelling of his turbinates and purulent nasal discharge in his left naris. There are no nasal polyps. His pharynx shows no erythema or exudates. Cardiopulmonary examination is within normal limits. Which of the following is the best next step in management?",
    "choice_a": "Amoxicillin-clavulanate",
    "choice_b": "Azithromycin",
    "choice_c": "No antibiotic therapy",
    "choice_d": "Sinus films",
    "choice_e": "Trimethoprim-sulfamethoxazole",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with acute bacterial rhinosinusitis. Most acute sinusitis seen in the primary care setting is viral in origin and is associated with the common cold. There is no evidence that antimicrobial treatment is effective in treating viral sinusitis. However, differentiating between viral and bacterial sinusitis is difficult. Acute bacterial sinusitis should be considered in patients with symptoms > 10 days; severe symptoms with fever > 39 C (102 F), purulent nasal discharge or facial pain > 3 days; or worsening symptoms ≥5 days after an initially improving viral upper respiratory infection (Choice C). Indications for antibiotic therapy for suspected rhinosinusitis • Persistent symptoms lasting more than 10 days • Severe symptoms, high fever ( >39°C or 102°F), purulent nasal discharge or facial pain > 3 days • Worsening symptoms ≥5 days after an initially improving viral upper respiratory infection Current guidelines recommend amoxicillin-clavulanate for 5-7 days to treat acute bacterial sinusitis in non- penicillin allergic patients. Amoxicillin is not the drug of choice due to increasing resistance of respiratory pathogens (e.g., Streptococcus pneumonia and Haemophilus influenza). Macrolides (e.g., azithromycin, clarithromycin), trimethoprim-sulfamethoxazole, and 2nd or 3rd generation cephalosporins are also not recommended as first-line agents due to increasing resistance involving the same respiratory pathogens (Choices B and E). Doxycycline and respiratory quinolones (e.g., levofloxacin, moxifloxacin) are alternatives for penicillin-allergic patients. Quinolones or high-dose amoxicillin-clavulanate (2000 mg/125 mg) is recommended in patients who fail initial therapy. (Choice D) Sinus x-rays are not indicated in acute bacterial sinusitis. CT is preferred over sinus x-rays in patients with acute complicated sinusitis with vision abnormalities (e.g., decreased acuity, diplopia), periorbital edema, severe headache, or altered mental status. CT is also preferred in patients with uncomplicated bacterial sinusitis with persistent or worsening symptoms after antibiotic treatment to evaluate for air-fluid levels, which indicate chronic sinusitis. Educational objective: Acute bacterial sinusitis usually presents with symptoms > 10 days; severe symptoms with fever >39 C (102 F), purulent nasal discharge or facial pain > 3 days; or worsening symptoms ≥5 days after an initially improving viral upper respiratory infection. Amoxicillin-clavulanate for 5-7 days is preferred in non- penicillin-allergic patients. Doxycycline and respiratory quinolones (e.g., levofloxacin, moxifloxacin) are alternatives in penicillin-allergic patients.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_002",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 75-year-old man comes to the physician because of 'a noise in his head.' He describes the noise as a high-pitched ringing which is always present. The sound does not pulsate and does not vary with position. He states that it is interfering with his ability to fall asleep. He denies any changes in balance, falls, or muscle weakness. He denies any problems with hearing or vision. He has a history of hypertension, hyperlipidemia, benign prostatic hyperplasia, and degenerative joint disease of both knees and his right hip. His medications include ibuprofen, lovastatin, and enalapril. He drinks 1-2 alcoholic beverages on the weekends. He states he feels somewhat depressed a couple of days per week. His blood pressure is 130/72 mm Hg and pulse is 78/min. There are no abnormalities of his head, ears, eyes, nose, or throat. There are no carotid or head bruits and cervical spine motion is normal. Cardiovascular examination is unremarkable. Which of the following is the most appropriate next step in managing his tinnitus?",
    "choice_a": "Audiometric testing",
    "choice_b": "Discontinuation of ibuprofen and enalapril",
    "choice_c": "Magnetic resonance angiography",
    "choice_d": "Non-contrast CT scan of the head",
    "choice_e": "Selective serotonin reuptake inhibitor",
    "correct_answer": "A",
    "explanation": "Tinnitus is defined as a sound perception within the head or ears that can be buzzing, ringing, or hissing. Pulsatile tinnitus usually implies a significant underlying vascular pathology, while non-pulsatile tinnitus tends to be non-vascular (causes listed in the above table). Pulsatile tinnitus usually requires a thorough investigation with an ENT consult and brain imaging. Non-pulsatile tinnitus is usually due to dysfunction within the auditory system (cochlear end-organ, cochlear nerve, brainstem, and auditory cortex). Tinnitus is often a sign of sensorineural hearing loss, although most patients do not complain of hearing loss. This patient's tinnitus (high-pitched ringing, non-pulsatile, continuous, not affected by position) suggests an origin within the auditory system. Patients with non-pulsatile tinnitus believed to originate from the auditory pathways require initial audiometric testing to detect asymmetry between the two ears and abnormalities in the middle ear, cochlea, or brainstem. Further work-up and treatment is based upon these findings. (Choice B) Both nonsteroidal anti-inflammatory drugs and angiotensin converting enzyme inhibitors have been linked to tinnitus, but the association is unclear. Pending the results of the audiometric evaluation, a trial of discontinuation of ibuprofen and substitution for enalapril may be indicated. (Choice C) Magnetic resonance angiography would be indicated in patients who present with a vascular origin of the tinnitus such as history of pulsatile, intermittent, or position-dependent tinnitus; or a bruit in the head and neck region. (Choice D) Non-contrast CT helps evaluate for intracranial hemorrhage and many cortical lesions, but contrast head CT is required to evaluate patients with pulsatile tinnitus for tumors such as paraganglioma. This patient has non-pulsatile tinnitus with a benign examination and would not require head CT. (Choice E) Antidepressant therapy is not effective in treating tinnitus. However, this patient may benefit from further evaluation for symptoms of depression and possible anti-depressant therapy afterwards. Educational objective: Tinnitus is a perception of sound inside the ear that can be pulsatile (usually vascular etiology) or non- pulsatile (usually non-vascular etiology). Non-pulsatile tinnitus usually originates in the auditory pathways and is frequently a sign of sensorineural hearing loss (although many patients do not complain about hearing loss) and requires initial audiometry testing.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_003",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 56-year-old man comes to the office due to a 3-week history of hoarseness. The patient is a school teacher and has never had similar symptoms during his 20-year career. He has had no recent upper respiratory illness, cough, shortness of breath, or difficulty swallowing but has been having vague right ear discomfort. The patient takes lisinopril for hypertension and over-the-counter antacids for occasional heartburn. He has smoked a pack of cigarettes daily for 30 years but does not use alcohol or illicit drugs. Blood pressure is 122/72 mm Hg, pulse is 78/min, and BMI is 28 kg/m2. His voice sounds hoarse. On examination, there is no nasal discharge, the tympanic membranes appear normal, and the oropharyngeal mucous membranes are pink with no abnormal lesions. The remainder of the physical examination is normal. Which of the following is the most appropriate next step in management of this patient's symptoms?",
    "choice_a": "Antireflux therapy with proton pump inhibitor",
    "choice_b": "Change in antihypertensive therapy",
    "choice_c": "Complete otolaryngologic evaluation",
    "choice_d": "Smoking cessation and voice therapy",
    "choice_e": "Steam inhalation and voice rest",
    "correct_answer": "C",
    "explanation": "Hoarseness is a type of dysphonia characterized by coarsening of vocal quality, typically due to disorders of the larynx (especially the vibratory edge of the vocal cords). Edema, hemorrhage, laceration, or mass lesions can alter the vibratory capacity of the cords. Most causes of acute hoarseness are benign and apparent based on clinical history (eg, acute upper respiratory infection, vocal strain). Chronic hoarseness may also be benign (eg, gastroesophageal reflux disease, postnasal drip). However, hoarseness lasting >2 weeks that is not explained by an acute upper respiratory illness increases the risk for a malignant etiology and warrants evaluation by an otolaryngologist to consider laryngoscopy. Regardless of duration, patients with a history of tobacco or heavy alcohol use, systemic symptoms (eg, weight loss), stridor, dysphagia, or referred ear pain also require consideration for laryngoscopy. Imaging (CT scan or MRI) may also be indicated to evaluate specific etiologies of hoarseness after laryngoscopy. (Choice A) Proton pump inhibitor therapy is appropriate for patients with hoarseness in the setting of chronic gastroesophageal reflux. However, this patient has risk factors for malignancy that should be excluded first. (Choice B) ACE inhibitors (eg, lisinopril) can cause a chronic, dry cough, which may contribute to hoarseness. However, this patient has not had a cough and his antihypertensive therapy is unlikely to be the cause of his symptoms. (Choices D and E) Voice therapy focuses on behavioral factors associated with hoarseness and may effectively treat some vocal disorders. Vocal rest is useful for hoarseness due to overuse, acute laryngitis, or laryngeal edema or hemorrhage. These interventions could be considered if laryngoscopy establishes a benign etiology. Educational objective: Hoarseness is characterized by coarsening of vocal quality and is typically due to abnormalities in the larynx (eg, edema, hemorrhage, laceration, mass lesions). Most causes of acute hoarseness are benign. However, patients with symptoms lasting >2 weeks or with a history of tobacco or heavy alcohol use, systemic symptoms, stridor, dysphagia, or referred ear pain require referral for consideration of laryngoscopy.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_004",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 42-year-old woman with known HIV infection comes to the physician with left-sided facial swelling and pain. She describes similar episodes over the last 6 months that last several days and then slowly subside. During these episodes, she has difficulty eating and sleeping on her left side. She also complains of occasional dry mouth, heartburn, and nocturnal wheezing. Her CD4 count was 450/μL 2 months ago. Her temperature is 36.7 C (98F), blood pressure is 108/78 mm Hg, pulse is 70/min, and respirations are 16/min. There is a tender, nonerythematous, spongy swelling in the preauricular area extending to the angle of the mandible. Cranial nerve examination is unremarkable. Which of the following is the most likely diagnosis?",
    "choice_a": "Follicular lymphoma",
    "choice_b": "Pleomorphic adenoma",
    "choice_c": "Sialolithiasis",
    "choice_d": "Sjögren's syndrome",
    "choice_e": "Viral sialadenitis",
    "correct_answer": "C",
    "explanation": "This patient's presentation is consistent with parotid gland swelling. Painful unilateral swelling of the parotid gland is usually due to gland obstruction (sialolithiasis) or infection (sialadenitis). Acute sialadenitis usually presents with swelling, pain, erythema, systemic symptoms (eg, fever, chills) and purulent drainage from the affected gland. This patient's absence of erythema and systemic symptoms makes sialolithiasis the more likely diagnosis. Risk factors for parotid stones include dehydration, smoking, trauma, gout, diuretics, and anticholinergic medicines. This patient's dry mouth may indicate decreased hydration leading to stone development or decreased salivary production due to obstruction. Preferred initial management is conservative with sialogogues (eg, lemon drops) to promote salivary secretion, moist heat to the affected area, massaging the gland to \"milk\" the duct, and adequate hydration. Patients with evidence of secondary infection should be started on antibiotics. High-resolution CT is the preferred diagnostic test for persistent disease or suspected complete obstruction. Surgery is reserved for disease refractory to conservative measures. (Choice A) Patients with HIV have an increased risk for lymphoma that may involve the parotid gland and usually presents with painless and focal glandular swelling. This patient's recurrent episodes of painful swelling make this less likely. (Choice B) Pleomorphic adenoma is the most common parotid tumor; patients with HIV have no additional risk for this tumor compared to the general population. As in lymphoma, patients usually present with painless and focal swelling. (Choice D) Sjögren's syndrome typically presents with xerostomia and keratoconjunctivitis sicca. The parotid gland may be involved, but patients usually have symmetrical bilateral painless swelling. (Choice E) Most cases of viral sialadenitis (eg, mumps, HIV infections) present with acute unilateral or bilateral parotid swelling with a prodrome of fever, malaise, headache, and myalgias. This patient's recurrent episodes and absence of systemic symptoms make this less likely. Educational objective: Unilateral painful parotid swelling is usually due to infection or parotid stone obstruction. Risk factors for stones include dehydration, smoking, diuretics, trauma, gout, and anticholinergic medicines. Lack of erythema and fever suggests stone obstruction. Therapy is supportive in nature, but high-resolution CT is the preferred diagnostic test for persistent disease or suspected complete obstruction.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_005",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 45-year-old man comes to the office due to difficulty hearing in the right ear. The patient first noticed that he could not hear in his right ear when he awoke this morning. He has had no ringing in the ear, earache, or drainage, and no recent upper respiratory illness. There is also no associated vertigo, tinnitus, or imbalance. He has a history of seasonal allergy but has had no recent symptoms. The patient takes no medications, drinks alcohol occasionally, and does not use tobacco or illicit drugs. Vital signs are within normal limits. Otoscopic examination shows a normal external auditory canal, and the tympanic membrane is gray with a normal light reflex. The patient is unable to hear a whisper in the right ear. Sound from a tuning fork placed in the middle of the forehead lateralizes to the left ear. The tuning fork is heard better when held in front of either ear compared to when placed on the ipsilateral mastoid. No nystagmus is present. The remainder of the examination is within normal limits. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Audiometry and MRI of the head",
    "choice_b": "Dietary sodium restriction and diuretics",
    "choice_c": "Non-contrast CT scan of the head",
    "choice_d": "Surgical evaluation for stapedectomy",
    "choice_e": "Systemic decongestants and antihistamines",
    "correct_answer": "A",
    "explanation": "This patient has acute unilateral hearing loss. Weber test shows lateralization to the unaffected ear, and Rinne test shows air conduction better than bone conduction in both ears. This is consistent with sensorineural hearing loss (SNHL). In contrast, patients with conductive hearing loss show bone conduction better than air conduction on Rinne test, and sound lateralizes to the affected ear on Weber test because ambient noise dampens sensitivity on the unaffected side. Most patients with acute unilateral SNHL have a benign etiology (eg, viral cochleitis) and recover spontaneously within 3-4 months. However, it can be difficult to determine the cause based on clinical findings alone, and patients with sudden-onset SNHL should be evaluated with audiometry and MRI to exclude more significant disease (eg, vestibular schwannoma). If the evaluation is nondiagnostic, some experts advise empiric therapy with high-dose systemic glucocorticoids and antiviral drugs (eg. valacyclovir). (Choice B) Ménière disease is a common cause of SNHL and is initially managed with sodium restriction (with or without diuretics). However, this patient has no tinnitus or vertigo to suggest Ménière disease and warrants additional evaluation. (Choice C) CT scan has low sensitivity for disorders of the brainstem and cerebellopontine angle and is not recommended for evaluation of sudden SNHL. MRI is the preferred imaging test due to its ability to identify acoustic neuroma, perilymphatic fistula, and multiple sclerosis. (Choice D) Stapedectomy involves removal of the stapes and replacement with a prosthesis. It is primarily performed for otosclerosis and other causes of conductive hearing loss. (Choice E) Decongestants and antihistamines are useful in managing eustachian tube dysfunction due to allergic rhinitis or viral upper respiratory infection. Eustachian tube dysfunction leads to conductive hearing loss, often accompanied by pain, crackling or popping sounds, and middle ear effusion. Educational objective: Most patients with acute unilateral sensorineural hearing loss have a benign etiology and recover spontaneously within 3-4 months. However, it can be difficult to determine the cause based on clinical findings alone, and patients should be evaluated with audiometry and MRI to exclude more significant disease (eg, vestibular schwannoma).",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_006",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 20-year-old woman comes to the physician with pain and itching in her left ear. She has been swimming frequently and first noticed some itching a few days ago. She tried using cotton swabs in the canal and subsequently developed pain with malodorous discharge from that ear. Her hearing is also diminished on that side. The patient has no fever or chills. Her balance and coordination are normal. She does not wear earrings and has no known skin disorders. Vital signs are within normal limits. Examination shows ear pain elicited with movement of her left tragus. There is no warmth or redness around the ear and no pain to percussion of the mastoid area. There is a moderate amount of debris blocking 50% of the auditory canal. Removal of the debris shows an erythematous and edematous external canal. The tympanic membrane appears slightly red but is intact and mobile with a pneumatic otoscope. Which of the following is the most appropriate management for this patient?",
    "choice_a": "Cultures of the debris",
    "choice_b": "Oral ciprofloxacin",
    "choice_c": "Oral linezolid",
    "choice_d": "Referral to otolaryngologist",
    "choice_e": "Topical ciprofloxacin and hydrocortisone",
    "correct_answer": "E",
    "explanation": "This patient has acute otitis externa (OE), likely from swimming. The most common organisms causing OE are Pseudomonas and Staphylococcus species. Initial treatment includes thoroughly cleaning the ear canal to remove cerumen and other debris and nonsteroidal anti-inflammatory drugs for pain control. An otoscope can directly visualize the canal, and a wire loop can gently remove debris and cerumen. Irrigating the ear canal with a 1:1 dilution of 3% hydrogen peroxide is also effective in patients with intact tympanic membranes. Mild OE (pruritus with minimal canal edema) usually improves with combined acidifying agent (eg, acetic acid) to inhibit bacterial growth in the ear canal and topical glucocorticoids to decrease inflammation. Moderate (pain, pruritus, partial canal occlusion) to severe (intense pain, canal occlusion, fever) OE requires combined topical antibiotics (eg, quinolones, polymyxin B, neomycin), antiseptics, and glucocorticoids with possible wick placement. Both ofloxacin and ciprofloxacin have excellent coverage against P aeruginosa and S aureus. Oral antibiotics do not significantly improve uncomplicated OE but are added in immunocompromised patients and for deep-tissue infections beyond the ear canal. These patients are also at risk for malignant OE, with the infection spreading to the skull base, and usually need otolaryngology referral. This patient with moderate OE may first be treated with a topical antibiotic and glucocorticoid (Choices B and C). If she does not improve within 3 days, she requires culture of the ear canal or referral to an otolaryngologist (Choices A and D). Educational objective: Otitis externa is most commonly due to Pseudomonas and Staphylococcus infections. Treatment involves cleaning the ear canal and treating the inflammation and infection with a combination of ototopical steroid and antibiotic. Patients not responding to initial therapy after 3 days require culture of the ear canal or otolaryngology referral.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_007",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 32-year-old woman comes to the office with ear pain. She has seasonal allergies for which she has been taking over-the-counter decongestants. Two days ago, the patient began having throbbing right ear pain that became intense yesterday. The pain is much better today, but she noticed a white discharge on her pillow when she awoke this morning. Otoscopic examination shows a cloudy and red tympanic membrane with an area of perforation. Which of the following is the most likely outcome of this patient's condition?",
    "choice_a": "Complete resolution with oral and topical antibiotics",
    "choice_b": "Complete resolution with topical acetic acid",
    "choice_c": "Extension to the mastoid process",
    "choice_d": "Mild to moderate long-term hearing loss",
    "choice_e": "Need for reconstructive surgery",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with acute otitis media (AOM) complicated by perforation of the tympanic membrane (TM). Although it is more common in children, AOM can occur in adults and is most commonly due to Streptococcus pneumoniae and non-typable Haemophilus influenzae. AOM often presents several days after an upper respiratory infection or worsening seasonal allergy symptoms. Such patients usually have Eustachian tube dysfunction causing middle ear inflammation and fluid retention. Patients with AOM usually develop unilateral ear pain (otalgia), decreased hearing, and possibly fever. Physical examination typically shows an opaque and/or erythematous TM with bulging and poor mobility. Subsequent perforation of the TM then may lead to purulent otorrhea and relief of ear pain. Oral antibiotics (eg, amoxicillin) for AOM usually lead to symptom improvement and resolution of hearing loss. A ruptured TM typically heals completely with a combination of oral and topical antibiotics and prevention of water entry into the ear canal. (Choice B) Topical acetic acid can treat external otitis but is usually avoided in patients with a perforated TM as it can cause further damage. (Choice C) Acute mastoiditis is a possible complication of AOM, but it is more common in children and rare in adults (0.5% of cases). (Choice D) Short-term hearing loss can occur in AOM, but it typically improves with antibiotics and healing of the TM. Chronic OM is more commonly associated with long-term hearing loss. (Choice E) Reconstructive surgery is usually reserved for patients with AOM extending to the bone (eg, refractory mastoiditis). However, this is a rare complication in adults. Educational objective: Rupture of the tympanic membrane in adults with acute otitis media is characterized by purulent otorrhea and relief of the initial ear pain. It usually resolves completely with a combination of oral and topical antibiotics.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_008",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 37-year-old woman comes to the physician because of persistent nasal congestion and runny nose. She states that she developed nasal congestion, a productive cough, and myalgias 4 weeks ago. She has been self-medicating with over-the counter nasal decongestant spray and antitussive liquid for the last 2 weeks, with gradual resolution of her cough and myalgias. However, she has developed recurrent nasal congestion and runny nose that is unresponsive to treatment. Her nasal discharge is clear. She has no associated sneezing, facial pain, or ocular itching. Her overall health is good and she denies similar symptoms in the past. On physical examination, her nasal mucosa appears edematous and red. The remainder of her physical examination is within normal limits. Which of the following is the best next step in management?",
    "choice_a": "Intranasal fluticasone",
    "choice_b": "Ipratropium nasal spray",
    "choice_c": "Nasal endoscopy",
    "choice_d": "Regular nasal saline lavage",
    "choice_e": "X-ray of the sinuses",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with rhinitis medicamentosa (RM), which is most commonly due to overuse of over-the-counter nasal decongestant sprays. The spray's vasoconstrictive effect requires increasing amounts of the drug for symptomatic relief due to tachyphylaxis and leads to rebound vasodilation with swelling and rhinorrhea. Patients then use more nasal decongestant spray to relieve their symptoms, which begins a cycle of congestion with temporary relief followed by worsening congestion as the spray wears off. Patients also get an emotional lift from the spray and eventually become dependent on the drug. The nasal irritation may be worsened by the benzalkonium chloride preservative present in many sprays. Diagnosis is made by history and physical examination showing swollen red nasal mucosa. Treatment involves medication cessation, which may be difficult since patients experience worsening rebound symptoms. Some data suggest that intranasal fluticasone use for a few days helps to alleviate the withdrawal nasal congestion. Some patients require oral steroids for more severe withdrawal symptoms. Rhinitis medicamentosa can be prevented by limiting over-the-counter nasal decongestant spray use to ≤5 days. (Choice B) Ipratropium nasal spray is effective for rhinorrhea caused by allergic and non-allergic rhinitis. However, this patient's lack of sneezing or itchy eyes makes these options less likely. Although ipratropium nasal spray may improve some of the patient's symptoms, discontinuing the over-the-counter spray and initiating therapy with fluticasone would be more effective. (Choice C) Nasal endoscopy is usually indicated to evaluate for obstructive lesions in patients with significant sinusitis who fail conservative therapy. (Choice D) Regular nasal saline lavage is usually effective in chronic rhinosinusitis, which is defined as 12 weeks of sinus congestion refractory to medical therapy. This patient has had only 4 weeks of symptoms and will likely not benefit significantly from nasal saline lavage. (Choice E) Sinus x-ray is usually performed in patients with sinusitis who fail medical therapy. However, this patient's lack of fever or sinus tenderness on palpation makes this diagnosis less likely. Educational objective: Rhinitis medicamentosa usually occurs in patients with chronic use of vasoconstrictor nasal sprays. Symptoms are due to a cycle of rebound exacerbation with worsening nasal congestion and discharge. Treatment involves stopping the decongestant spray and initiating a trial of intranasal steroids (e.g., fluticasone).",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_009",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 47-year-old woman recovering from an upper respiratory infection comes to the office with a 3-day history of ear discomfort. The patient feels that her right ear is \"plugged\" and hears popping sounds in the ear when chewing or yawning. She also reports some pressure and slight pain in the ear. Her temperature is 37.2 C (99F), blood pressure is 134/80 mm Hg, pulse is 84/min, and respirations are 14/min. Neck examination is normal and there is no lymphadenopathy. The left tympanic membrane is normal, but the right one appears mildly retracted. Romberg test and heel-to-toe gait are normal. A tuning fork placed in the middle of the head lateralizes to the right. The remainder of the physical examination is unremarkable. What is the best next step in management of this patient?",
    "choice_a": "Audiometric evaluation",
    "choice_b": "Head CT scan",
    "choice_c": "Nasal endoscopy",
    "choice_d": "Oral decongestants",
    "choice_e": "Oral glucocorticoids",
    "correct_answer": "D",
    "explanation": "This patient, with ear discomfort and associated auditory symptoms in the setting of an acute upper respiratory infection, most likely has eustachian tube dysfunction. The eustachian tube connects the air- filled middle ear to the nasopharynx and equalizes pressure across the tympanic membrane. Functional obstruction (eg, viral upper respiratory infection, allergic rhinitis) or structural blockage (eg, nasopharyngeal tumor) can lead to muffled hearing, crackling or popping sounds, a feeling of pain or pressure, and accumulation of a middle ear effusion. Persistent obstruction can increase the risk of acute otitis media. The diagnosis of eustachian dysfunction is clinical. Otoscopic examination may reveal an erythematous or retracted tympanic membrane and/or effusion. Conductive hearing loss may be appreciated on testing with a tuning fork (eg, Weber test, Rinne test). High-quality evidence on interventions for eustachian dysfunction is scant, and management is directed primarily at the underlying disorder. For symptoms associated with an acute viral infection, a short-term trial of decongestants is often effective. (Choice A) Audiometric evaluation in this patient will confirm conductive hearing loss, but will not affect initial management. Additional evaluation may be needed if there is no response to decongestants. (Choice B) A head CT scan to rule out a nasopharyngeal neoplasm is indicated when unilateral symptoms are present for more than 3 months. (Choice C) Nasal endoscopy may be indicated for cases not responding to decongestants or for recurrent cases. (Choice E) Glucocorticoid nasal sprays and antihistamines are often advised for eustachian dysfunction associated with allergic rhinitis. Oral glucocorticoids have not been studied for eustachian dysfunction in human subjects and are not recommended. Educational objective: Ear fullness, popping sounds, and decreased hearing sometimes can be due to obstruction of the eustachian tube during or following an upper respiratory infection. A short-term trial of decongestants is often effective.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_010",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 76-year-old man comes to the office due to right ear pain. He first experienced mild pain several weeks ago and has also noticed that his pillow is wet in the morning with discharge from the ear. The patient saw another provider 2 weeks ago and was given oral ciprofloxacin but has not had any relief since. He has type 2 diabetes mellitus treated with metformin, sitagliptin, and glyburide. He admits to occasionally skipping his medications and does not regularly check his blood glucose at home. The patient has a 50- pack-year smoking history. His temperature is 36.7 C (98 F), blood pressure is 134/78 mm Hg, and pulse is 90/min. On physical examination, ulceration with exudation is present in the right ear canal, and manipulation of the right pinna evokes mild pain. Laboratory results are as follows: Leukocytes 9,800/mm3, Creatinine, serum 1.2 mg/dL, Blood glucose 155 mg/dL, Erythrocyte sedimentation rate 22 mm/h. CT scan of the base of the skull reveals areas of bony erosion involving the right auditory canal. Cultures of the ear exudate are obtained. Which of the following is the best next step in management of this patient?",
    "choice_a": "Antifungal therapy",
    "choice_b": "Biopsy of the lesion",
    "choice_c": "Intensive insulin therapy",
    "choice_d": "Observation and wait for cultures",
    "choice_e": "Technetium-99m bone scan",
    "correct_answer": "B",
    "explanation": "This patient has pain and ulceration of the external ear with local erosion into the bone. Likely causes include invasive squamous cell cancer (SCCa) and malignant otitis externa (MOE). MOE is an invasive pseudomonal infection that is seen in older patients with uncontrolled diabetes. It is characterized by severe pain and purulent discharge and is unresponsive to topical antimicrobial therapy. MOE may progress to osteomyelitis of the skull and cause cranial nerve palsies. Most cases will respond to oral fluoroquinolone therapy, and intravenous third-generation cephalosporins (with or without an aminoglycoside) can be used in patients with suspected ciprofloxacin resistance or allergy. In contrast to MOE, which presents acutely with moderate to severe pain and a very high erythrocyte sedimentation rate (ESR), SCCa tends to have mild symptoms, a subacute presentation, and a normal to slightly elevated ESR. This patient did not respond to treatment for MOE, and a biopsy is indicated to exclude SCCa. (Choice A) Fungal MOE is an uncommon invasive infection of the ear. It manifests as severe MOE, often in patients who fail antipseudomonal therapy. It is usually seen in immunosuppressed patients, especially those with HIV. (Choice C) Intensive insulin therapy is indicated in type 2 diabetes with significant hyperglycemia that has failed oral medications. This patient has mild hyperglycemia due to medication noncompliance, and intensive insulin therapy is not needed at this time. (Choice D) Cultures for bacteria and fungi may be useful for directing therapy in patients with MOE. However, this patient has features suggesting SCCa, and biopsy need not be delayed for culture results. (Choice E) Technetium-99m bone scan is very sensitive in detecting bone involvement, but it is less sensitive in differentiating MOE from SCCa. Educational objective: Malignant otitis externa presents in older patients with diabetes with severe pain, ear discharge, erosion of the surrounding bones, and a very high erythrocyte sedimentation rate (ESR). Patients with squamous cell cancer of the external ear generally have milder symptoms, a subacute presentation, and a lower ESR. A tissue biopsy is often required to differentiate between these 2 conditions.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_011",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "An 81-year-old woman is brought to the clinic with complaints of constant ringing in her ears over the last several months. She also is having difficulty hearing, especially at social gatherings and while watching television. She has had 2 episodes of near falls during the past year. The patient's other medical problems include hypertension, recurrent urinary tract infections, and osteoarthritis. Her medications include hydrochlorothiazide and acetaminophen. She takes trimethoprim-sulfamethoxazole for urinary tract infections several times a year. Physical examination shows a normal external ear, no signs of cerumen impaction, and pearly gray tympanic membranes bilaterally with a normal light reflex. She is mildly unsteady in Romberg's position with her eyes closed. There are no carotid bruits. She has an abnormal whisper test in both ears. Which of the following is the most likely diagnosis?",
    "choice_a": "Intracranial arterial stenosis",
    "choice_b": "Medication toxicity",
    "choice_c": "Meniere's disease",
    "choice_d": "Otosclerosis",
    "choice_e": "Presbycusis",
    "correct_answer": "E",
    "explanation": "This patient's presentation suggests presbycusis or age-related hearing loss. Presbycusis is a common condition that affects >50% of adults by age 75. Factors affecting onset and severity of presbycusis include low socioeconomic status, exposure to noise and ototoxins, chronic disease (eg, hypertension, diabetes, vascular disease), and smoking. Presbycusis is a form of sensorineural hearing loss caused by inner ear disorders, processing centers in the brain, or the vestibulocochlear nerve. Patients usually present with progressive, symmetrical, high-frequency hearing loss (consonant sounds) over many years. This can be accompanied by bilateral tinnitus, vertigo, and disequilibrium leading to frequent falls. Patients have difficulty hearing in the presence of competing backgrounds (social gatherings, television sounds) but appear to do well on a one-to-one basis. Early detection and treatment are important as hearing loss due to presbycusis can cause isolation and depression. Evaluation includes physical examination to exclude other causes of hearing loss (eg, cerumen impaction or tumors) and the whispered voice test for safe and accurate testing of hearing impairment. The Weber and Rinne tests can help differentiate between conductive and sensorineural hearing loss. An audiogram is needed to confirm diagnosis and guide treatment. Hearing aids are effective in most patients, although some with refractory hearing loss require cochlear implants. (Choice A) Blood supply to the inner ear originates from the vertebrobasilar system. Vertebrobasilar ischemic stroke thus can present with hearing loss due to labyrinthine infarction. However, most patients will have other symptoms such as vertigo that are of sudden onset. This patient's mildly abnormal Romberg test is due to decreased touch and vibration sense seen in association with aging. (Choice B) Ototoxic drugs include aminoglycosides, platinum-containing chemotherapeutic agents, intravenous loop diuretics, and nonsteroidal anti-inflammatory drugs. Hydrochlorothiazide is a thiazide diuretic not typically associated with hearing loss or tinnitus. (Choice C) Meniere disease classically presents with recurrent episodes of vertigo, tinnitus, and sensorineural hearing loss (usually unilateral). Patients also report experiencing ear fullness or pain in the affected ear. (Choice D) Otosclerosis is an inherited disorder caused by abnormal bony growth in the middle ear (footplate of the stapes). It usually results in unilateral conductive hearing loss. Educational objective: Presbycusis is the most common cause of progressive, bilateral, high-frequency hearing loss in elderly patients. Early recognition and treatment are essential to prevent social isolation, depression, and functional disability (falls). The whispered voice test and audiogram can be used for diagnosis. Treatment involves hearing aids and cochlear implants for refractory hearing loss.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_012",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 37-year-old woman comes to the physician complaining of persistent rhinorrhea. Her symptoms peak on arising from sleep and can be accompanied by 8-12 sneezes in rapid sequence. She has occasional postnasal drip. Her symptoms started about 5 years ago and have become progressively worse. There is no seasonal component to her symptoms, and she does not have itchy eyes. She has tried over-the- counter loratadine, which did not help. She has never had sinusitis, asthma, or eczema. The patient does not regularly use aspirin or over-the-counter nonsteroidal anti-inflammatory agents and has never used nasal sprays. She has no pets in the home. She takes amlodipine for hypertension. Her blood pressure is 146/92 mm Hg and pulse 72/min. Her oropharynx is normal, and there are no nasal polyps. The turbinates are pale and boggy. Her chest is clear to auscultation. Which of the following is the most appropriate treatment for her symptoms?",
    "choice_a": "Intranasal anticholinergic agent",
    "choice_b": "Intranasal corticosteroids",
    "choice_c": "Oral decongestant",
    "choice_d": "Oral first-generation antihistamine",
    "choice_e": "Oral leukotriene antagonist",
    "correct_answer": "B",
    "explanation": "This patient has sneezing, nasal congestion starting in her 30s, and no atopic symptoms, findings characteristic of vasomotor rhinitis. Distinguishing features of vasomotor rhinitis include onset in women age 20-45, perennial symptoms, and lack of itchy eyes and nose. Allergic rhinitis usually has a strong seasonal component, is often associated with eye/nasal itching, and has onset before age 20. Regular use of inhaled nasal corticosteroids provides the most consistent relief for vasomotor rhinitis (similar to allergic rhinitis). In more severe cases, a combination of nasal corticosteroids and nasal antihistamine is needed for efficacy. Nasal saline irrigation is recommended prior to use of nasal preparations to cleanse the mucosa so that the steroids will be better absorbed. (Choice A) Intranasal ipratropium is useful when rhinorrhea is the only or predominant symptom and is provoked by smells or other environmental triggers such as cold. While no head-to-head trial results are available, nasal corticosteroids are recommended in guidelines as first-line agents due to better symptom relief. (Choice C) Oral and nasal decongestants should be used with caution in individuals with hypertension. Nasal decongestants should not be used for more than 3 days to avoid rhinitis medicamentosa. (Choice D) Intranasal corticosteroids and intranasal antihistamines are more efficacious than oral anti- histamines for vasomotor rhinitis. (Choice E) Leukotriene antagonists (eg, montelukast) have been shown to have efficacy similar to oral antihistamines in allergic rhinitis. Leukotriene antagonists play a role in allergic rhinitis with asthma but have not been shown to be of benefit in vasomotor rhinitis. Educational objective: Vasomotor rhinitis occurs commonly in women after age 20, with perennial symptoms and lack of atopic symptoms (eg, no nasal or eye itching). Intranasal corticosteroids are the preferred treatment. In severe cases, combined nasal corticosteroids and nasal antihistamines are effective in providing symptom relief.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_013",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 38-year-old woman with a history of hypertension comes to the physician with complaints of left-sided facial pressure, nasal congestion, and rhinorrhea for the past 5 days. She describes the rhinorrhea as yellow with occasional white, nonbloody, and thin discharge. She also notes fullness of the left ear. She has no fevers, chills, cough, wheezing, or muscle pain and has no known sick contacts. Her temperature is 37.0 C (98.6 F), blood pressure is 114/74 mm Hg, pulse is 86/min, and respirations are 14/min. Oxygen saturation is 97% on room air pulse oximetry. Pupils are equal and reactive. There is mild tenderness over the right maxillary sinus. Nasal mucosa is boggy appearing and erythematous bilaterally. Her oropharynx is mildly erythematous without cervical lymphadenopathy. Lungs are clear to auscultation bilaterally. Which of the following is the most appropriate empiric therapy for this patient?",
    "choice_a": "Amoxicillin-clavulanate",
    "choice_b": "Levofloxacin",
    "choice_c": "Oseltamivir",
    "choice_d": "Symptomatic treatment only",
    "choice_e": "Trimethoprim-sulfamethoxazole",
    "correct_answer": "D",
    "explanation": "This patient's presentation of 5 days of yellow rhinorrhea, nasal congestion, and facial pressure is consistent with acute viral rhinosinusitis. Most acute sinusitis in primary care is viral and associated with the common cold. It is important yet difficult to differentiate viral rhinosinusitis (AVR) from acute bacterial rhinosinusitis (ABR) as AVR does not require antimicrobial therapy but ABR does. ABR is more likely in patients with symptoms for >10 days, severe symptoms (eg, fever plus sinus tenderness or facial pain) for ≥3 days, or worsening symptoms ≥5 days after an initially improving viral upper respiratory infection. This patient meets no ABR criteria and can receive supportive care (eg, analgesics, saline irrigation, topical decongestants, and/or topical glucocorticoids). If her symptoms worsen or last > 10 days, she may have ABR and then would require antibiotic treatment. Current guidelines recommend 5-7 days of amoxicillin- clavulanate for ABR in non-penicillin-allergic patients (Choice A). Doxycycline and respiratory quinolones (eg, levofloxacin and moxifloxacin) are alternate agents for penicillin-allergic patients (Choice B). Amoxicillin, trimethoprim-sulfamethoxazole, and second- or third-generation cephalosporins are not recommended due to increased resistance in respiratory pathogens such as Streptococcus pneumoniae, Haemophilus influenzae, and Moraxella catarrhalis (Choice E). (Choice C) Oseltamivir is a neuraminidase inhibitor that treats influenza. Patients typically present with upper respiratory infection symptoms, fever, headache, myalgia, and weakness. This patient's absence of myalgias and weakness make this less likely. In addition, antiviral therapy given after the first 48 hours of symptom onset is unlikely to be of much benefit. Educational objective: Acute rhinosinusitis is usually viral and is routinely treated with supportive care. Acute bacterial rhinosinusitis is more likely in patients with symptoms for > 10 days, severe symptoms (eg, fever plus sinus tenderness or facial pain) for ≥3 days, or worsening symptoms ≥5 days after an initially improving viral upper respiratory infection.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_014",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "An 80-year-old woman comes to the physician accompanied by her daughter, who is concerned because her mother no longer participates in group activities. The patient has lived in an apartment within an assisted-living facility for 12 months. She now no longer attends communal movie nights or bingo games, eats all her meals in her apartment, rarely watches her favorite television shows, and does not call her family and friends. She feels well and has not been depressed or fatigued. She says that she sometimes \"forgets stuff\" but is still able to function independently. She has not fallen in the past year. The patient has osteoporosis, hypertension, osteoarthritis of her hips and knees, diet-controlled type 2 diabetes mellitus, and cataracts. Current medications include hydrochlorothiazide, alendronate, and calcium with vitamin D. Her temperature is 37.0,C (98.6 F), blood pressure is 150/80 mm Hg, pulse is 84/min, and respirations are 16/min BMI is 22 kg/m2 The patient is alert, attentive, pleasant, well-dressed, and well-groomed. Chest and abdominal examinations are unremarkable. There is no muscle weakness, her deep-tendon reflexes are normal, and her gait is steady. She scores 27/30 on a Mini-Mental State Examination. A geriatric depression scale screening test is negative. Laboratory results are as follows: Hematocrit 38%, MCV 84 fL, Platelets 250,000/mm3, Leukocytes 5,000/mm3, Sodium 136 mEq/L, Potassium 3.8 mEq/L, Chloride 94 mEq/L, Bicarbonate 26 mEq/L, Creatinine 0.8 mg/dL, Calcium 9.4 mg/dL, Blood glucose 100 mg/dL, Vitamin B12 400 pg/mL, Folate 5.2 ng/mL, TSH 7.5 μU/mL, T4 7.0 μg/dL. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Hearing evaluation",
    "choice_b": "Home geriatric assessment",
    "choice_c": "Homocysteine and methylmalonic acid levels",
    "choice_d": "Neuropsychologic testing",
    "choice_e": "Thyroid replacement therapy",
    "correct_answer": "A",
    "explanation": "Impairments in vision and hearing are exceptionally common in the elderly. These special senses are sometimes lost so slowly that patients may not be specifically aware of the loss and its impact. If they are aware, many older individuals will not acknowledge that these losses are significantly affecting their lives. Increased social isolation is particularly common when both visual and hearing losses are present. About 40% of individuals age >65 report significant decreases in hearing. When older individuals with and without hearing loss are compared, those with hearing loss report worse general health, less physical activity, less social activity, and decreased quality of life. They can be reluctant to pursue attempts to evaluate and improve their hearing due to concerns about cost, performance, and the perceived stigma of hearing assistance devices. This patient denies feeling depressed or fatigued but has not engaged in activities that rely predominantly on hearing (watching television shows, calling friends and family, participating in social gatherings). resulting in increased social isolation. Hearing assessment would be the best next step in her evaluation. (Choice B) Home geriatric assessment focuses on preventive services through a visiting nurse trained in geriatric care, along with a physical therapist, social worker, psychologist, and appropriate specialty referrals. Although home assessment can reduce further functional decline, this patient shows no physical signs of decline (except for social isolation), already lives in an assisted-living facility, and needs acute intervention to determine the cause of her social isolation. (Choice C) Cobalamin (B12) deficiency is sometimes diagnosed based on elevations in methylmalonic acid and homocysteine levels (particularly if B12 levels are borderline). However, it is unlikely in this patient, who has no anemia, no macrocytosis, a normal B12 level, no gait disturbances, and a normal Mini- Mental State Examination (MMSE). (Choice D) Formal neuropsychologic testing is time-consuming, can be expensive, and is not currently indicated in this patient with no obvious cognitive deficits and a normal performance on MMSE. An MMSE score <24 is generally considered suggestive of delirium or dementia. (Choice E) Subclinical hypothyroidism (TSH elevation despite a normal serum free thyroxine level) is possible given this patient's mildly elevated TSH but it would be unlikely to cause significant cognitive impairment or other overt symptoms. Current consensus guidelines do not recommend routine thyroxine replacement in patients with subclinical hypothyroidism and TSH levels of 4.5-10 uU/mL: and some authorities do not treat patients age >70 with a TSH<8 μU/m because overtreatment with thyroxine can have adverse consequences (eg, cardiac arrhythmias) in the elderly and the upper limit of normal for TSH may increase with age. Educational objective: Hearing loss is a significant and sometimes treatable factor that can contribute to social isolation in the elderly population.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_015",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 24-year-old woman comes to the office due to a painful lesion in her mouth. She has had similar lesions once or twice a year over the last several years that caused significant discomfort with chewing and lasted 6-7 days. She has no associated rashes, joint pains or swelling, or genital lesions. She does not have any significant past medical history and does not use tobacco or alcohol. The patient is HIV-negative. Her mother has rheumatoid arthritis. Physical examination findings are shown in the image below. Complete blood count and comprehensive metabolic panel are within normal limits. Erythrocyte sedimentation rate is 12 mm/hr. Which of the following is the best next step in management of this patient?",
    "choice_a": "Anti-cyclic citrullinated peptide antibodies",
    "choice_b": "Antinuclear antibodies",
    "choice_c": "Colonoscopy",
    "choice_d": "Thyroid function tests",
    "choice_e": "Topical treatment",
    "correct_answer": "E",
    "explanation": "Recurrent aphthous stomatitis (RAS) is subdivided into minor, major, and herpetiform variants. The minor variant (also known as \"canker sores\") is the most common and presents with a few ulcers that are small in diameter (<1 cm). The lesions occur on the non-keratinized portions of the tongue, cheeks, and lips, and heal in 7-10 days without scarring. They typically recur every 1-4 months. Diagnosis of RAS is clinical, and further workup (if any) is aimed at identifying underlying conditions as suggested by the history and examination. On occasion, celiac disease may first present as aphthous ulcers, and so assay for anti-tissue transglutaminase antibodies may be considered. Oral ulcers may also be associated with conditions such as HIV, Crohn disease, and Behçet's syndrome. Topical glucocorticoids are the first-line treatment, but severe RAS that does not respond to steroids can be treated with systemic agents such as colchicine or thalidomide. (Choice A) Methotrexate therapy used in rheumatoid arthritis (RA) is associated with stomatitis, but RA itself is not associated with RAS. (Choice B) In the absence of other systemic symptoms, further evaluation for systemic lupus erythematosus is not indicated. (Choice C) Crohn disease should be considered in patients with recurrent oral ulcerations and other gastrointestinal symptoms such as diarrhea or abdominal pain. However, this patient's normal inflammatory markers and absence of anemia or leukocytosis make Crohn disease less likely. (Choice D) Thyroid disease is not associated with RAS. Educational objective: Minor variant recurrent aphthous stomatitis presents with a few ulcers that are small, occur on the non- keratinized portions of the tongue, cheeks, and lips, and heal in 7-10 days without scarring. They typically recur every 1-4 months. Topical glucocorticoids are the treatment of choice.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_016",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 35-year-old woman comes to the emergency department with fever, chills, and sore throat for the past 4 days. Except for a temperature of 38.3 C (101.0 F), her other vital signs are within normal limits. Examination shows pharyngeal and tonsillar erythema without exudates and bilateral tender cervical lymphadenopathy. The remainder of the examination is normal. Point-of-care testing for group A streptococcus is negative. The patient is diagnosed with viral pharyngitis and prescribed symptomatic therapy. She returns 3 days later due to a persistent fever, sore throat, and progressive dysphagia. Her temperature now is 38.9 C (102.0 F), blood pressure is 118/78 mm Hg, pulse is 90/min, and respirations are 16/min. Physical examination remains unchanged from 3 days ago except that she appears more ill. Point-of-care testing for the Epstein-Barr virus is negative. Which of the following is the most appropriate next step in management?",
    "choice_a": "Epstein-Barr virus serology",
    "choice_b": "Group A streptococcus throat culture",
    "choice_c": "HIV ELISA testing",
    "choice_d": "Lateral neck x-ray",
    "choice_e": "Upper Gl endoscopy",
    "correct_answer": "D",
    "explanation": "This patient presents with symptoms of worsening acute pharyngitis with dysphagia that is concerning for epiglottitis, a rare but potentially life-threatening airway infection. Epiglottitis is a cellulitis of the epiglottis that results from bacteremia and/or direct bacterial invasion from the posterior nasopharynx. The clinical features in adults usually has a slower progression than those seen in children. A lateral neck x-ray can be diagnostic, but should only be ordered in stable patients without impending airway obstruction (e.g., stridor). Abnormal x-ray findings of epiglottitis include a swollen and enlarged epiglottis > 8 mm in adults (the thumbprint sign), loss of vallecular air space, and thickened aryepiglottic folds >7 mm in adults. Diagnosis is confirmed with direct visualization of an erythematous and edematous epiglottis on laryngoscopy, but the pharynx should be examined carefully to avoid causing airway obstruction. The common causative organisms include Hemophilus influenzae, β-hemolytic streptococci, Streptococcus pneumoniae, and Staphylococcus aureus. Combination therapy with ceftriaxone and vancomycin is the preferred empiric antibiotic regimen. (Choice A) Point-of-care testing for EBV, if performed after 5 days of clinical illness, has a sensitivity of around 90%. EBV serology is even more sensitive than rapid point-of-care testing. However, this patient is in a very low risk group for EBV (as she is 35 years old) and the median age is < 21 years for presentation. Furthermore, most adults in the United States have been infected with EBV well before the age of 35 years. (Choice B) Rapid antigen testing for group A streptococcus has a sensitivity between 85-90%. Culture is the gold standard with a sensitivity of > 95%. However, the incidence of group A strep in adults is <10%, so the culture in this patient is unlikely to add to the clinical decision making process. (Choice C and E) Life threatening conditions should be ruled out first. Educational objective: Epiglottitis should be suspected in patients when the severity of sore throat is out of proportion to the findings on oropharyngeal examination. Drooling and stridor are seen in less than 40% of the patients. Odynophagia and dysphagia are much more common (>90%).",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  },
  {
    "id": "ENT_017",
    "system": "Ear, Nose Throat (ENT)",
    "stem": "A 55-year-old woman is brought to the emergency department due to severe dizziness and unsteadiness. Two days ago, she awoke with a spinning sensation accompanied by severe nausea and vomiting and a feeling of pressure in the right ear. The episode lasted an hour. Over the next 48 hours, the patient had similar events while in bed. She had no tinnitus, headache, blurry or double vision, dysphasia, dysarthria, falls, or focal weakness during the episodes. The patient has no history of neck or head trauma. She was evaluated for similar symptoms 2 months ago, and no medication was prescribed. Medical history is notable for type 2 diabetes mellitus, which was diagnosed 15 years ago and is complicated by peripheral neuropathy and gastroparesis. The patient also has hypertension, hypothyroidism, and hyperlipidemia. Family history is notable for stroke and heart disease. Temperature is 37 C (98.6 F), supine blood pressure is 130/85 mm Hg, and supine pulse is 88/min and regular. Weber test shows lateralization to the left ear. Rinne test shows diminished air and bone conduction on the right and normal findings on the left. Sensory examination reveals a length-dependent reduction in pain, temperature, vibratory, and proprioceptive perception in the lower extremities up to the knees and in the upper extremities up to the elbows. Reflexes are absent in the lower extremities and 1+ in the upper extremities, with mute plantar responses. Coordination testing is normal. A bedside Dix-Hallpike maneuver does not elicit nystagmus. Which of the following is most likely to prevent further symptoms in this patient?",
    "choice_a": "Canalith repositioning maneuvers",
    "choice_b": "Low-dose aspirin",
    "choice_c": "Midodrine",
    "choice_d": "Oral methylprednisolone",
    "choice_e": "Salt-restricted diet and diuretics",
    "correct_answer": "E",
    "explanation": "This patient has Ménière disease, a disorder of the inner ear characterized by increased volume and pressure of endolymph (endolymphatic hydrops). The resulting distension of the endolymphatic system damages the vestibular and cochlear components of the inner ear. Ménière disease is characterized by: • Episodic vertigo, typically lasting 20 minutes to several hours • Sensorineural hearing loss, variable in severity but usually progressive • Low-frequency tinnitus and/or a feeling of fullness in the affected ear The diagnosis of Ménière disease is based primarily on clinical findings. Although not all patients have tinnitus, a perception of aural fullness associated with episodic vertigo and sensorineural hearing loss is specific for Ménière disease. Audiometry is helpful for fully characterizing hearing loss and following its course over time. Initial management includes restriction of sodium, caffeine, nicotine, and alcohol. Benzodiazepines, antihistamines, and antiemetics can relieve acute symptoms. Diuretics can be considered if dietary changes are insufficient. (Choice A) Canalith repositioning maneuvers (eg, Epley maneuver) are helpful for treating benign paroxysmal positional vertigo (BPPV), which usually has shorter episodes (seconds to minutes) than Ménière disease. This patient's aural fullness, hearing loss, and negative Dix-Hallpike maneuver make BPPV less likely. (Choice B) Aspirin is indicated for prevention of recurrent transient ischemic attack or stroke, which occasionally causes vertigo but usually presents with additional deficits. This patient has no motor deficits, and the abnormal sensory findings and reflexes are likely due to diabetic neuropathy. (Choice C) Midodrine is a vasopressor used to treat orthostatic hypotension in the setting of dysautonomia. Although this patient does have autonomic diabetic neuropathy, it would not explain her vertigo or hearing loss. (Choice D) Oral glucocorticoids (eg, methylprednisolone) can treat acute vestibular neuritis, which typically follows a viral infection and presents with a single prolonged episode of vertigo and gait instability. Hearing loss may also be present (termed labyrinthitis), but this patient's episodic symptoms are more consistent with Ménière disease. Educational objective: Ménière disease is characterized by episodic vertigo, sensorineural hearing loss, and tinnitus and/or a feeling of fullness in the ear. The diagnosis is based primarily on clinical findings. Initial management includes restriction of sodium, caffeine, nicotine, and alcohol. Diuretics can also be useful.",
    "source": "ABIM - Ear, Nose Throat (ENT) - @USMLEWorldStep3.pdf"
  }
]