[
{
"id": "FREPRO_001",
"system": "Female reproductive system",
"stem": "A 68-year-old woman comes to the office and inquires about screening mammography. The patient has had normal biennial mammographies in the past and reports no breast symptoms. Medical conditions include hypertension, type 2 diabetes mellitus treated with insulin, hypercholesterolemia, end-stage renal disease on hemodialysis, ischemic stroke with residual deficits, and congestive heart failure with an ejection fraction of 15%. The patient has been hospitalized 3 times in the past year due to decompensated heart failure. She has a 50-pack-year smoking history. The patient has no personal or family history of breast or ovarian malignancies. She ambulates using a walker. Which of the following is the most appropriate recommendation regarding breast cancer screening for this patient?",
"choice_a": "Advise no additional routine screening",
"choice_b": "Continue biennial screening mammography",
"choice_c": "Obtain MRI of the breasts",
"choice_d": "Order ultrasonography of the breasts",
"choice_e": "Recommend periodic self- and clinical breast examinations",
"correct_answer": "A",
"explanation": "Overdiagnosis is the detection of a disease that would not become clinically apparent in a patient's lifetime. Patients who are overdiagnosed with a disease face both psychological harm from a new clinical diagnosis and possible physical harm during treatment. Patients with limited life expectancy (such as this patient with end-stage renal disease, symptomatic heart failure, and ischemic stroke) are at risk for overdiagnosis as they are unlikely to live long enough to benefit from the detection of malignancies. Therefore, patients with a life expectancy of <10 years should not undergo routine cancer screening (eg, colonoscopy, mammography). (Choices B, C, D, and E) Multiple modalities for screening are available for breast cancer screening and may be considered in healthy patients with a life expectancy of ≥10 years. Mammography is the best validated screening test for breast cancer and the best test for a healthy patient in this age group. MRI of the breasts is considered for women with a confirmed familial breast cancer syndrome or in whom the sensitivity of standard mammography is impaired (eg, breast implants), but it is more expensive and less validated than mammography. Ultrasonography is used as an adjunct to mammography, not as a standalone test. Breast self-examination is not recommended for any patient population due to high false-positive rates. Educational objective: Patients with limited life expectancy are unlikely to live long enough to benefit from the detection of malignancies and are more likely to experience harm (both physical and psychological) from the diagnosis. Patients with an expected lifespan of <10 years should not be screened for malignancy (eg, breast, colon).",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_002",
"system": "Female reproductive system",
"stem": "An 84-year-old woman comes to the office due to leakage of urine with coughing and sneezing. She also reports increased urinary frequency and a feeling of pelvic pressure but has no dysuria or hematuria. Medical history includes congestive heart failure (last known ejection fraction: 35%), persistent atrial fibrillation, and moderate aortic stenosis. Pelvic examination findings are consistent with pelvic organ prolapse extending to the introitus (stage 2). Urinalysis and urine cultures are normal. Which of the following is the best next step in management of this patient?",
"choice_a": "Colpocleisis",
"choice_b": "Tolterodine",
"choice_c": "Topical estrogen cream",
"choice_d": "Total abdominal hysterectomy",
"choice_e": "Vaginal pessary",
"correct_answer": "E",
"explanation": "This patient has pelvic organ prolapse (POP) and resultant stress urinary incontinence. POP is the descent of the female pelvic organs (eg, bladder, uterus or post-hysterectomy vaginal cuff, rectum) that causes a herniation of the vagina and/or uterus. Risk factors for POP include multiparity, increasing age, obesity, and prior hysterectomy. Patients typically present with a feeling of \"vaginal bulge\" (eg, pelvic pressure) or urinary (eg, retention), bowel (eg, constipation), or sexual dysfunction. Asymptomatic patients do not require treatment. Symptomatic patients can be treated with either conservative treatment (eg, vaginal pessary, pelvic floor muscle exercises) or surgery. Indications for vaginal pessaries include preference for nonsurgical treatment, poor surgical candidate (such as this patient), desire to have children in the future, or recurrent prolapse. Those who fail conservative therapy are typically referred for surgical management. (Choices A and D) This patient's comorbidities make her a poor surgical candidate for colpocleisis or total abdominal hysterectomy. (Choice B) Tolterodine is an anticholinergic used to treat urgency incontinence. However, it is not effective for the treatment of stress incontinence and would not be helpful in this patient. (Choice C) Topical or systemic estrogen therapy is not effective in treating POP. Educational objective: Pelvic organ prolapse can be treated conservatively or surgically depending on patient preference, severity of disease, and comorbidities. Vaginal pessaries and pelvic floor muscle exercises are an effective conservative treatment for most patients.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_003",
"system": "Female reproductive system",
"stem": "A 24-year-old woman comes to the office for an annual examination. Two weeks ago, she was evaluated at an urgent care center for lower abdominal pain and vaginal discharge. Pelvic examination at that time was notable for mucopurulent cervical discharge and cervical friability. Nucleic acid amplification testing (NAAT) was positive for Chlamydia trachomatis. Testing for gonorrheal infection was negative. The patient was treated with azithromycin 1 g orally. Her partner also tested positive for Chlamydia infection and was also treated with azithromycin. Her symptoms resolved over the subsequent 5 days. The patient has had no sexual activity since her last visit and is currently asymptomatic. As part of her annual examination, a Pap test and NAAT for both Chlamydia trachomatis and Neisseria gonorrhoeae are performed. The Pap test is normal and the NAAT is positive for Chlamydia trachomatis. Which of the following is the most likely explanation for this patient's positive test result?",
"choice_a": "False-positive C trachomatis test result",
"choice_b": "Inadequate treatment of cervicitis",
"choice_c": "Infection from a new sexual partner",
"choice_d": "Infection with azithromycin-resistant C trachomatis",
"choice_e": "Tubo-ovarian abscess",
"correct_answer": "A",
"explanation": "This patient and her partner were appropriately treated for chlamydial cervicitis; however, repeat nucleic acid amplification (NAAT) testing was positive for Chlamydia trachomatis 2 weeks after treatment. NAAT is more sensitive and specific than culture methods and is the preferred diagnostic test for chlamydial infection in both symptomatic and asymptomatic patients. However, because NAAT testing can detect both living and dead organisms, false-positive test results are common within 3 weeks of initial treatment. In general, routine \"test of cure\" is not indicated if the chlamydial infection is treated with first-line antibiotics such as azithromycin or doxycycline as resistance to these antibiotics appears to be very low (Choices B and D). Test of cure is indicated for pregnant patients or patients with persistent symptoms but should be performed ≥3 weeks after treatment completion. Despite adequate initial treatment, Chlamydia trachomatis reinfection is common and is typically the result of resumption of unprotected intercourse with an untreated partner. Therefore, for all patients with NAAT- or culture-proven chlamydial infection, retesting is performed 3-6 months after treatment completion to evaluate for possible reinfection. (Choice C) This patient has had no recent sexual activity, and it is unlikely that she would develop an infection from a new sexual partner within 2 weeks of receiving effective treatment. (Choice E) Tubo-ovarian abscess usually presents with acute lower abdominal pain, fever, and chills. Purulent cervical discharge may also be present. This patient's clinical improvement and asymptomatic presentation make this diagnosis unlikely. Educational objective: Nucleic acid amplification testing is the most sensitive and specific test for the diagnosis of Chlamydia trachomatis infection. Retesting within 3 weeks of treatment is not recommended due to a high rate of false-positive results.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_004",
"system": "Female reproductive system",
"stem": "A 42-year-old woman comes to the office for evaluation of amenorrhea for the past 3 months. She previously had relatively regular menses, typically occurring monthly with 4-5 days of moderate bleeding. The patient has had 1 or 2 irregular cycles each year, but usually went no more than 6-8 weeks without a menstrual period. She has had increasing fatigue and a 2.7-kg (6-lb) weight gain over the past few months, but has had no changes in vision or in heat or cold intolerance. She has no chronic medical conditions. The patient had a cesarean delivery with a bilateral tubal ligation 10 years ago. Blood pressure is 130/80 mm Hg and pulse is 78/min. BMI is 23 kg/m². Cardiopulmonary examination is normal. The abdomen is soft and nontender. Pelvic examination reveals a uniformly enlarged, anteverted uterus; there are no adnexal masses. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Adenomyosis",
"choice_b": "Endometrial cancer",
"choice_c": "Hypothyroidism",
"choice_d": "Menopause",
"choice_e": "Pregnancy",
"correct_answer": "E",
"explanation": "Tubal sterilization (eg, bilateral tubal ligation) is considered an effective form of permanent contraception; however, failure rates are as high as 36 per 1,000 procedures. Therefore, regardless of sterilization status, a pregnancy test is performed in all reproductive-age women with secondary amenorrhea (>3 months in previously regular cycles or >6 months in previously irregular cycles). This patient's recent fatigue, weight gain, secondary amenorrhea, and uterine enlargement suggest early pregnancy. (Choice A) Adenomyosis typically presents in women age >40 with an enlarged, symmetrical uterus; however, patients have heavy, painful menses rather than amenorrhea. (Choice B) Endometrial cancer typically presents as abnormal uterine bleeding in premenopausal patients with chronic unopposed estrogen exposure (eg, anovulation, obesity, polycystic ovary syndrome). This patient with a normal BMI had relatively regular menstrual cycles prior to amenorrhea, making this diagnosis unlikely. (Choice C) Patients with hypothyroidism can have fatigue, weight gain, and secondary amenorrhea. However, patients typically have concomitant bradycardia and cold intolerance, which are not seen in this patient. In addition, there is no associated uterine enlargement with hypothyroidism. (Choice D) Menopause is diagnosed in patients without menses ≥12 months, making this diagnosis unlikely. Educational objective: Common signs of early pregnancy include fatigue, weight gain, secondary amenorrhea, and uterine enlargement. A pregnancy test is indicated in all reproductive-age women regardless of sterilization status.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_005",
"system": "Female reproductive system",
"stem": "A 40-year-old woman comes to the office due to increasing pelvic pain and urinary urgency for the last few months. The patient initially had increasing urgency and was voiding every 1-2 hours. She now has increasing pelvic pain and pressure that requires her to void every 30-45 minutes. The patient's pelvic pain is typically relieved with voiding but returns prior to her next void. She has had no hematuria, postcoital bleeding, or urinary leakage. The patient has fibromyalgia and type 2 diabetes mellitus. She had 2 vaginal deliveries in her late 20s. She is sexually active with a male partner and has had a tubal ligation. The patient does not use tobacco, alcohol, or illicit drugs. Vital signs are normal. BMI is 28 kg/m². On pelvic examination, the external genitalia and vagina appear normal and well-supported. The cervix is multiparous and nonfriable, and physiologic discharge is noted throughout the vaginal vault. On bimanual examination, there is tenderness to palpation over the urethra but no cervical motion tenderness. Laboratory results are as follows: Urinalysis: Glucose negative, Leukocyte esterase negative, Nitrites negative, White blood cells 1-2/hpf. Urine culture and pregnancy test are negative. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Cystocele",
"choice_b": "Interstitial cystitis",
"choice_c": "Neurogenic bladder",
"choice_d": "Nongonococcal urethritis",
"choice_e": "Overactive bladder",
"correct_answer": "B",
"explanation": "This patient's urinary urgency and increasing pelvic pain and pressure relieved with voiding are due to interstitial cystitis, or bladder pain syndrome (IC/BPS). Because pain worsens with a full bladder, patients urinate more often (frequency) and at lower bladder volumes (urgency). Although the etiology is poorly understood, patients with IC/BPS likely have bladder pain from urothelial damage and increased pain sensitization, creating an abnormal pain trigger during bladder filling at normal volumes and urethral tenderness with palpation. Urinalysis is typically normal. Treatment of IC/BPS is not curative and, therefore, focuses on patient education, quality of life, and avoidance of triggers. Some oral pharmacotherapies improve symptoms; the most common treatments include amitriptyline and pentosan polysulfate sodium. Amitriptyline, a tricyclic anticholinergic, relieves bladder pain and associated depressive symptoms; however, side effects (eg, dry mouth, orthostatic hypotension) limit its use. Pentosan polysulfate sodium repairs the urothelium, has minimal side effects (eg, mild reversible hair loss), and is approved by the FDA for the treatment of IC/BPS. Bladder instillation therapy (eg, hydrodistension), intradetrusor botulinum toxin, and sacral neuromodulation are reserved for severe or refractory cases. (Choice A) Pelvic organ prolapse (eg, cystocele) creates a bulge sensation and may have associated stress urinary incontinence due to the loss of anterior vaginal wall support. Although vaginal delivery is a risk factor for prolapse, this patient has no evidence of cystocele on examination. (Choice C) Patients with a neurogenic bladder have chronic urinary retention due to peripheral neuropathy (eg, diabetes mellitus); impaired detrusor contractility and decreased sensation of bladder filling cause incomplete bladder emptying. Therefore, patients have constant dribbling from urine overflow with no associated pelvic pain. (Choice D) Nongonococcal urethritis, caused by atypical bacteria (eg, Chlamydia trachomatis, Mycoplasma genitalium), presents with urinary frequency, urethral tenderness, and sterile pyuria (ie, elevated white blood cells on urinalysis and a negative urine culture). However, patients usually have associated cervicitis (eg, postcoital bleeding, cervical motion tenderness) and pain with voiding (ie, dysuria). (Choice E) In patients with overactive bladder, or urgency incontinence, involuntary detrusor contractions cause immediate loss of urine. Although bladder spasms may cause intermittent pain, this patient has no urinary leakage. Educational objective: Interstitial cystitis causes chronic pelvic pain that increases with bladder filling and is relieved with voiding. Urinalysis is typically normal. Treatment includes patient education, avoidance of triggers, and oral pharmacotherapy (eg, amitriptyline, pentosan polysulfate sodium).",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_006",
"system": "Female reproductive system",
"stem": "A 23-year-old woman comes to the office due to excess facial hair that she finds embarrassing. She has had this problem for years and has tried different methods of hair removal, with unsatisfactory results. The patient has no chronic medical conditions and has regular menstrual periods. She is not sexually active and takes no medications. BMI is 29 kg/m². On physical examination, there is coarse, dark hair on her upper lip, chin, midsternum, and buttocks. The rest of the examination is unremarkable. Which of the following is the best next step in management of this patient?",
"choice_a": "Low-estrogen oral contraceptive pills",
"choice_b": "Pelvic ultrasound",
"choice_c": "Serum total testosterone test",
"choice_d": "Spironolactone",
"choice_e": "Thyroid function tests",
"correct_answer": "C",
"explanation": "Nearly 5%-10% of women will develop hirsutism, defined as excess terminal hair growth (dark, coarse hair) in androgen-dependent areas (eg, chin, upper lip, upper abdomen, chest, back). Hirsutism should be differentiated from hypertrichosis, which is increased growth of light unpigmented hair in nonsexual areas that can be due to systemic conditions (eg, hypothyroidism) or medications (eg, phenytoin). Mildly increased facial hair is also seen in certain ethnicities (eg, Hispanic) and can be considered a normal variant. Common causes of hirsutism include polycystic ovary syndrome (PCOS), idiopathic hirsutism, and nonclassic 21-hydroxylase deficiency. PCOS is the most common and is associated with oligomenorrhea, obesity, type 2 diabetes mellitus, and dyslipidemia. All women with hirsutism require a serum total testosterone level to evaluate for an underlying androgen disorder. Additional testing (eg, 17-hydroxyprogesterone) may be required depending on additional clinical features (eg, irregular menses, virilization). Very high testosterone levels (>150 mg/dL) suggest a possible androgen-secreting ovarian tumor and require pelvic ultrasound (Choice B). (Choice A) Patients who do not wish to become pregnant are treated with combination estrogen/progestin oral contraceptive pills, which can reduce androgenic symptoms (eg, hirsutism, acne). Serum testosterone levels are measured first to rule out a more serious cause. (Choice D) Spironolactone is used as second-line therapy for hyperandrogenic symptoms that do not improve with oral contraceptives. (Choice E) Thyroid function tests can diagnose hypo- or hyperthyroidism. This patient has no other findings (eg, fatigue, weight changes) to suggest thyroid disease. Educational objective: Hirsutism is excess terminal hair growth in androgen-dependent areas (eg, chin, upper lip, upper abdomen, chest, back). All women with hirsutism require a serum total testosterone level to evaluate for possible underlying androgen disorders.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_007",
"system": "Female reproductive system",
"stem": "A 35-year-old woman, gravida 1 para 1, who is 8 weeks postpartum comes to the office with multiple painful lumps in her breasts for the past week. She is breastfeeding and is otherwise healthy. Her only medication is a prenatal vitamin. The patient's mother had postmenopausal breast cancer. Vital signs are normal. Physical examination reveals multiple small and tender masses in bilateral breasts; there is no surrounding erythema. Milky discharge is expressed bilaterally. Which of the following is the most likely cause of this patient's symptoms?",
"choice_a": "Galactocele",
"choice_b": "Inflammatory breast cancer",
"choice_c": "Mastitis",
"choice_d": "Normal breast tissue",
"choice_e": "Plugged ducts",
"correct_answer": "E",
"explanation": "Breastfeeding women with plugged milk ducts typically have breast pain and tenderness, palpable masses, and no signs of infection. Poor feeding technique, a decrease in feeding, inadequate emptying, and stasis can lead to breast engorgement (ie, breast tissue distension) and subsequent blockage of milk ducts. Treatment of plugged ducts includes optimizing feeding technique, continued breastfeeding, and symptomatic relief (eg, warm compresses, manual massage, nonsteroidal anti-inflammatory drugs). (Choice A) A galactocele is a large, milk-retaining cyst due to a blocked milk duct. Galactoceles are painless and typically resolve. If the galactocele persists, ultrasound (with or without aspiration) may be used to differentiate it from malignancy. (Choice B) Inflammatory breast cancer is more common in postmenopausal women; however, it presents as mastitis that does not resolve with antibiotics. In addition to a palpable breast mass, patients often have a painful, enlarged, pruritic breast with skin thickening (\"peau d'orange\" appearance). Due to rapid metastasis, axillary lymph nodes are also typically palpable. Patients with suspected inflammatory breast cancer require diagnostic mammography and core needle biopsy. (Choices C and D) During lactation, breast pain can occur due to engorgement of normal breast tissue; however, there are no associated lumps. Lactational mastitis is a complication of engorgement and plugged milk ducts. Patients typically have fever, localized breast pain, and erythema, not a mass. Lactational mastitis requires no imaging. Treatment is symptomatic (eg, nonsteroidal anti-inflammatory drugs, continued breastfeeding) and a course of antibiotics (eg, dicloxacillin, cephalexin) that provides coverage against Staphylococcus aureus. Untreated lactational mastitis can progress to abscess. Educational objective: Plugged milk ducts are localized areas of milk stasis that cause distension of breast tissue, resulting in pain, tender and palpable masses, and no signs of infection in breastfeeding women. Treatment is supportive and includes optimizing breastfeeding.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_008",
"system": "Female reproductive system",
"stem": "A 57-year-old postmenopausal woman comes to the office for an annual health maintenance examination. The patient is feeling well and has no medical concerns. She has depression and hypertension, which are well controlled with her current regimen. Her maternal aunt died from metastatic breast cancer at age 72. Vital signs are normal. BMI is 29 kg/m². Breast examination reveals a nontender, fixed, 3-cm mass in the upper outer quadrant of the left breast. There are no skin changes, nipple discharge, or associated axillary lymphadenopathy. A diagnostic mammogram and breast ultrasound reveal no masses or calcifications. Which of the following is the best next step in management of this patient?",
"choice_a": "BRCA testing",
"choice_b": "Clinical breast examination and repeat imaging in a year",
"choice_c": "Core needle biopsy",
"choice_d": "MRI of the breast",
"choice_e": "Tamoxifen",
"correct_answer": "C",
"explanation": "A palpable breast mass is a common presenting symptom of breast cancer. Breast masses that are firm, immobile, irregularly shaped, and accompanied by lymphadenopathy, nipple discharge, or skin changes are concerning for malignancy. However, history and physical examination are not sufficient to diagnose or exclude malignancy, and further evaluation with imaging is required. In women age ≥30 who have a palpable breast mass, the first step is mammography, followed by possible ultrasound, to characterize the mass and determine the need for biopsy. Patients with a palpable breast mass and benign radiographic features (eg, simple cyst on ultrasound) may not require further workup; those with other abnormal imaging findings require core needle biopsy to exclude malignancy. However, even palpable breast masses can be mammographically and sonographically occult (false negative rate as high as 30%), particularly in patients with dense breasts, and malignancy can be missed. Therefore, patients with palpable breast masses and negative imaging require percutaneous core needle biopsy. (Choice A) BRCA testing is indicated for high-risk patients, including those who have breast cancer at age ≤50 have invasive ovarian or peritoneal cancer, or have ≥1 relatives with breast cancer at age ≤50. This patient does not meet the criteria for BRCA testing. (Choice B) Palpable breast masses can be managed conservatively with a repeat breast examination and imaging after malignancy has been excluded via imaging and biopsy. (Choice D) MRI of the breast is used to evaluate for metastasis in patients with malignancy confirmed on biopsy. It can also be used for screening in high-risk patients (eg, prior chest irradiation, lifetime breast cancer risk ≥20%). (Choice E) Tamoxifen is used as adjuvant endocrine therapy in patients with nonmetastatic, estrogen receptor-positive breast cancer; in the treatment of metastatic breast cancer; and to prevent breast cancer in high-risk women (eg, atypical hyperplasia, BRCA carrier). Educational objective: Women age ≥30 with a palpable breast mass and negative breast imaging (eg, mammogram, ultrasound) require further evaluation with a core needle biopsy to exclude malignancy.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_009",
"system": "Female reproductive system",
"stem": "A 23-year-old woman comes to the office due to thick, yellow vaginal discharge for the past few days. She has had no fever or chills and has not recently changed personal hygiene items or sexual practices. The patient takes oral contraceptives, does not use condoms, and has had the same male partner for the last 3 years. Pap testing last year was normal. On speculum examination, the cervix is erythematous and swollen and bleeds when touched with a cotton applicator. Pelvic examination reveals a small uterus with no cervical motion tenderness and no adnexal tenderness. The rest of the physical examination is within normal limits. Wet mount microscopy shows white blood cells, a few nonmotile bacteria, no clue cells, and no hyphae. Which of the following is the best next step in management of this patient?",
"choice_a": "Cervical histopathology and cytology",
"choice_b": "Empiric azithromycin plus ceftriaxone",
"choice_c": "Empiric azithromycin plus ciprofloxacin",
"choice_d": "Empiric metronidazole",
"choice_e": "Gram stain testing of cervical fluid",
"correct_answer": "B",
"explanation": "This patient has acute cervicitis, likely due to an infectious etiology (eg, Chlamydia trachomatis, Neisseria gonorrhoeae). Untreated cervicitis can cause pelvic inflammatory disease (PID) with sequelae (eg, infertility, ectopic pregnancy, chronic pelvic pain) and in pregnant women may be associated with obstetrical (eg, spontaneous abortion, preterm prelabor rupture of membranes) or neonatal (eg, conjunctivitis) complications. Patients can be asymptomatic (70%) or have purulent vaginal discharge, postcoital or intermenstrual bleeding, dysuria, dyspareunia, or vulvovaginal pruritus. The diagnosis is clinical based on pelvic examination showing purulent endocervical discharge and cervical friability (eg, bleeding due to mild trauma from a cotton swab). Additional examination findings may include cervical motion tenderness, which suggests concomitant PID. Nucleic acid amplification testing (NAAT) is performed to confirm chlamydial or gonorrheal infection; patients also require testing for bacterial vaginosis and trichomoniasis. Current guidelines recommend empiric treatment (without waiting for test results) of the patient and sex partners with azithromycin plus ceftriaxone for chlamydia and gonorrhea. Fluoroquinolones (eg. ciprofloxacin) are avoided due to resistant gonococcus (Choice C). Repeat testing 3-6 months after treatment is recommended, particularly in patients with a high risk of recurrence. (Choice A) Cervical histopathology and cytology are not required to diagnose acute cervicitis. (Choice D) Metronidazole can treat bacterial vaginosis and Trichomonas vaginalis. Bacterial vaginosis usually presents with thin, malodorous vaginal discharge and clue cells (epithelial cells covered in bacteria) on wet mount microscopy. Trichomonas vaginalis can be asymptomatic or present with cervicitis/vaginitis (eg, frothy vaginal discharge, vulvar pruritus, cervical punctate hemorrhages) or urethritis. Wet mount microscopy usually shows motile organisms, but when it is nondiagnostic, NAAT can be used. (Choice E) Cervical Gram stain is not recommended for evaluation of cervicitis due to low sensitivity (nearly 50%) for diagnosing gonorrhea. Educational objective: Acute cervicitis typically presents with purulent cervical discharge and a friable cervix. Management includes nucleic acid amplification testing for chlamydia and gonorrhea as well as empiric treatment with azithromycin plus ceftriaxone.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_010",
"system": "Female reproductive system",
"stem": "A 29-year-old woman comes to the office due to amenorrhea. She has not had a menstrual period since an uncomplicated vaginal delivery 13 months ago. The patient stopped breastfeeding 7 months ago but still has some milky discharge from both breasts. She has no other symptoms. The patient has a 10-year history of hypothyroidism, for which she takes levothyroxine, the dose of which was increased during her pregnancy. On breast examination, bilateral milky discharge is expressed. There are no palpable masses, skin changes, or axillary lymphadenopathy. The remainder of the physical examination is normal. Laboratory results are as follows: Serum creatinine 0.8 mg/dL, FSH 4.2 mIU/mL, LH 3.1 mIU/mL, Prolactin 209 ng/mL, TSH 5.5 μU/mL. Urine pregnancy test is negative. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Breast ultrasound",
"choice_b": "MRI of the head",
"choice_c": "Progestin withdrawal test",
"choice_d": "Reassurance and follow-up in 6-8 weeks",
"choice_e": "Total T4, free T4, and free T3 levels",
"correct_answer": "B",
"explanation": "Prolactin levels naturally increase during pregnancy due to stimulation from high estrogen levels, peak at delivery, and then normalize within 1-2 months after delivery, even with continued breastfeeding. Although prolactin levels increase transiently above basal levels with response to suckling, this response significantly diminishes a few weeks after delivery. This patient is no longer breastfeeding and is not currently taking any medications (eg, antipsychotics) that would explain increased prolactin levels. The most likely cause of this patient's elevated prolactin is a prolactinoma (ie, lactotroph adenoma). Prolactinomas can present with secondary amenorrhea, bilateral milky nipple discharge (ie, galactorrhea), and hypogonadism. A significantly elevated prolactin (>200 ng/mL) level usually indicates a prolactinoma. In any patient who has hyperprolactinemia and is not taking any medication known to increase prolactin levels, an MRI of the head should be performed to screen for a pituitary mass (Choice D). Additional evaluation of prolactinomas includes formal visual field testing due to the potential for the pituitary mass to compress the optic chiasm. Prolactinomas that cause hypogonadism (eg, amenorrhea) or neurologic symptoms (eg, headaches, visual disturbances) secondary to mass effect are treated first-line with dopamine agonists (eg, cabergoline, bromocriptine) and followed with serial MRIs. Surgery (eg, transsphenoidal resection) is reserved for patients who fail medical therapy. (Choice A) Patients with nipple discharge may require breast imaging (eg, ultrasound, mammogram) to evaluate for malignancy. However, breast cancer is associated with unilateral serous or serosanguinous discharge. This patient's markedly elevated prolactin level and bilateral nipple discharge make prolactinoma a more likely diagnosis. (Choice C) A progestin withdrawal test (ie, medroxyprogesterone for 5-10 days) induces menstrual bleeding in patients with amenorrhea if there is sufficient estrogen priming of the endometrium. This patient may or may not bleed following medroxyprogesterone depending on her estrogen status, but this would not address the hyperprolactinemia. (Choice E) Hypothyroidism leads to high thyrotropin-releasing hormone (TRH), which stimulates prolactin release and causes mild hyperprolactinemia. Although this patient's TSH is slightly elevated, mild hypothyroidism does not cause a markedly elevated prolactin level of >200 ng/mL. In addition, serum TSH is the most sensitive test to diagnose hypothyroidism and monitor response to levothyroxine therapy and therefore can be used alone to adjust dosage without checking total T4, free T4, or free T3 levels. Educational objective: Pituitary prolactinomas (ie, lactotroph adenomas) present with galactorrhea, amenorrhea, and hyperprolactinemia. A prolactin level >200 ng/mL usually indicates a prolactinoma. Diagnosis is confirmed via MRI of the head. First-line treatment is with dopamine agonists (eg, cabergoline, bromocriptine).",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_011",
"system": "Female reproductive system",
"stem": "A 63-year-old woman comes to the office due to pain during sexual intercourse. The patient had been abstinent since the death of her husband 10 years ago and attempted intercourse recently with a new partner. Although she uses lubrication, the patient has been unable to have intercourse due to severe pain on penetration. She also had several days of post-coital spotting and mild vaginal pruritus that have resolved. Menopause was at age 57. Since then, the patient occasionally has had small amounts of thin, malodorous vaginal discharge. She does not use scented soaps, deodorants, or douches. She is worried that her inability to have intercourse might interfere with her relationship. The patient has a history of mild hypertension and takes lisinopril. Blood pressure is 138/84 mm Hg and pulse is 82/min. Examination of the external genitalia shows scant pubic hair; pale, thin skin; and recession of the labia minora. The introitus is narrow, small, and barely permits 2 fingers to be inserted; the vaginal mucosa is pale, smooth, dry, and slightly friable. Vaginal pH is 6. Wet mount microscopy shows a few inflammatory cells, no clue cells, and no trichomonads. Which of the following is the best next step in management of this patient?",
"choice_a": "Clobetasol",
"choice_b": "Fluconazole",
"choice_c": "Hormone replacement therapy",
"choice_d": "Metronidazole",
"choice_e": "Vaginal estrogen",
"correct_answer": "E",
"explanation": "This patient has vulvovaginal atrophy, a sequela of hypoestrogenemia most often associated with the postmenopausal state (ie, genitourinary syndrome of menopause) but can also occur during the postpartum period and in women receiving anti-estrogen medications (eg, leuprolide). Patients often have symptoms of dyspareunia, decreased lubrication during intercourse, and vulvovaginal pruritus. Clinical features of vulvovaginal atrophy include loss of pubic hair, resorption and/or fusion of the labia minora, vaginal introitus narrowing, mucosa thinning, and loss of rugation. Changes in cervical mucus result in an increased vaginal pH (≥5), causing a relatively malodorous discharge; however, wet mount microscopy shows only epithelial cells. Treatment includes use of water-based lubricants during intercourse. In patients with moderate to severe vulvovaginal atrophy, treatment is with vaginal estrogen, which is more efficacious than systemic (eg, oral) hormonal therapy in relieving symptoms (Choice C). In addition, vaginal estrogen avoids the risk of thrombosis and endometrial and breast cancers associated with systemic hormonal therapy. (Choice A) Clobetasol is indicated in the management of vulvar lichen sclerosus, which can present with dyspareunia due to loss of vulvar architecture (eg, vaginal introitus narrowing); however, patients also typically present with vulvar pruritus and white vulvar plaques. (Choice B) Fluconazole is indicated for candida vulvovaginitis. This patient has no vulvar pruritus, clumpy white vaginal discharge, or pseudohyphae on microscopy, making this diagnosis unlikely. (Choice D) Metronidazole is indicated for treatment of trichomoniasis or bacterial vaginosis. Trichomonas vaginalis presents with a green, frothy discharge and protozoa on microscopy. Bacterial vaginosis presents with a thin, gray discharge and clue cells on microscopy. Educational objective: Vulvovaginal atrophy (genitourinary syndrome of menopause) typically presents with dyspareunia due to vaginal introitus narrowing. Treatment is with water-based lubricants and vaginal estrogen.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_012",
"system": "Female reproductive system",
"stem": "A 35-year-old woman comes to the office to discuss her risk of ovarian cancer. The patient recently read that women who have sex with women might be at increased risk of ovarian cancer. She has had only female sexual partners. The patient has no appetite changes, abdominal distension, pelvic pain, or abnormal vaginal bleeding. She is nulliparous and has never been on contraception. The patient has no chronic medical conditions and has had no prior surgeries. She takes a daily multivitamin and occasional ibuprofen at the beginning of her menstrual periods. Family history is significant for a maternal aunt with postmenopausal breast cancer. The patient drinks 1 or 2 glasses of wine a night but does not use tobacco or illicit drugs. Vital signs are normal. The lungs are clear to auscultation bilaterally. Cardiac examination reveals a regular rate and rhythm. The abdomen is soft, nontender, and nondistended. Which of the following is the most appropriate ovarian cancer screening guideline for this patient?",
"choice_a": "Annual CA-125 levels",
"choice_b": "Annual transvaginal ultrasounds",
"choice_c": "Biannual pelvic examinations",
"choice_d": "No screening recommended",
"choice_e": "Referral for BRCA testing",
"correct_answer": "D",
"explanation": "Ovarian cancer usually presents with subtle symptoms (eg, bloating, pelvic pressure) but may present acutely (eg, bowel obstruction, abdominal pain). Unfortunately, most cases are diagnosed at an advanced stage and have poor survival rates (25% 5-year survival rate with stage 4). In comparison, survival improves with early stage of disease (>90% 5-year survival with stage 1). Presumptive causes of ovarian cancer include recurrent ovulation and increased gonadotropin levels; therefore, ovulation frequency determines both risk and protective factors (eg, parity, combined hormonal contraception [CHC]). Women who have sex with women (WSW) have some risk factors for ovarian cancer, including lower parity and lower use of CHC (ie, more frequent ovulation). However, they are still considered at average risk for ovarian cancer unless they have Ashkenazi Jewish ancestry, family history of premenopausal or male breast cancer, or BRCA mutation (ie, high risk). In low- or average-risk women, ovarian cancer screening is not recommended. (Choices A and E) Genetic testing should be offered to high-risk women (eg, Ashkenazi Jewish ancestry, family history of premenopausal or male breast cancer) with unknown BRCA1 and BRCA2 status. For those who are BRCA-positive, CA-125 levels are used to screen for ovarian cancer and to monitor ovarian cancer progression and recurrence. However, CA-125 may be elevated in benign conditions (eg, uterine fibroids, endometriosis) and therefore is not specific enough for average-risk patient screening. (Choices B and C) Transvaginal ultrasounds and pelvic examinations are sensitive only for advanced-stage ovarian cancer. Neither has been proved effective at screening for early-stage disease in low- or average-risk women. Educational objective: Women who have sex with women have risk factors for ovarian cancer (eg, low parity, low contraceptive use); however, despite these risk factors, they are still considered to be at average risk. Ovarian cancer screening in low- or average-risk women is not indicated.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_013",
"system": "Female reproductive system",
"stem": "A 53-year-old postmenopausal woman comes to the office for a follow-up visit. The patient recently had surgery for early-stage, estrogen receptor-positive breast cancer diagnosed on screening mammography. She was started on an aromatase inhibitor postoperatively but discontinued the therapy due to intolerable side effects. Today she is starting tamoxifen as an adjuvant endocrine treatment. The patient has no other chronic medical problems. Her mother has type 2 diabetes mellitus and had a minor stroke. Her father died from metastatic colon cancer. Vital signs are within normal limits. BMI is 29 kg/m². This patient is at highest risk for which of the following complications from tamoxifen therapy?",
"choice_a": "Diabetes mellitus",
"choice_b": "Myocardial infarction",
"choice_c": "Osteoporosis",
"choice_d": "Ovarian cancer",
"choice_e": "Venous thrombosis",
"correct_answer": "E",
"explanation": "Tamoxifen, a selective estrogen receptor modulator with mixed agonist/antagonist action, is used as adjuvant endocrine therapy in patients with nonmetastatic, estrogen receptor-positive breast cancer. Tamoxifen is considered first-line therapy in premenopausal women; it can also be used in postmenopausal women who have intolerable side effects (eg, joint pain) from, or contraindications to, aromatase inhibitors. Tamoxifen is associated with a 2- to 3-fold increased rate of venous thromboembolic events, particularly in the first 2 years of use. Therefore, women on tamoxifen are advised to discontinue it several days prior to activities that further increase the risk of venous thromboembolism (eg, surgery, travel). (Choice A) Tamoxifen is not associated with the development of diabetes mellitus. (Choice B) Tamoxifen does not adversely affect the risk for coronary artery disease in women with or without pre-existing disease. (Choice C) In premenopausal women, tamoxifen decreases bone mineral density (likely due to its partial antagonist activity). In contrast, in postmenopausal women, tamoxifen increases bone density (likely due to its partial agonist activity) and decreases the risk of osteoporotic fracture. However, tamoxifen is not recommended for osteoporosis prevention due to its association with endometrial cancer. (Choice D) Limited data suggest that tamoxifen may reduce the risk of ovarian cancer and may be used in patients with recurrent or advanced-stage ovarian cancer. Tamoxifen does increase the risk of uterine cancers (endometrial and uterine sarcoma) in postmenopausal women. Current recommendations include annual examinations. Further screening, such as ultrasound or endometrial biopsy in asymptomatic women, has not been proven beneficial and is not recommended. However, women with symptoms suggesting cancer (eg, abnormal or postmenopausal bleeding) require evaluation with an ultrasound and biopsy. Educational objective: Tamoxifen, an estrogen antagonist in the breast, is used for adjuvant therapy in some patients with estrogen receptor-positive breast cancer. Tamoxifen is associated with an increased risk for venous thromboembolism.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_014",
"system": "Female reproductive system",
"stem": "A 22-year-old Hispanic woman comes to the office for evaluation of amenorrhea and excessive body hair. She reports a weight gain of 5.4 kg (12 lb) over the last 2 years. Menarche was at age 11, and her menstrual cycles are irregular and heavy with <6 cycles a year. The patient previously had menses following a 10-day treatment with medroxyprogesterone acetate. She has no other medical problems and takes no medications. Blood pressure is 144/80 mm Hg and pulse is 70/min. BMI is 32 kg/m². The patient has frontal balding with coarse terminal hair on the face, upper chest, lower abdomen, and back. There are no purple striae. Breast examination shows no galactorrhea, and the thyroid is not enlarged on palpation. Complete blood count, TSH, FSH, prolactin, and serum chemistry tests are normal. Serum total testosterone is 105 ng/dL (normal: 20-60). Urine pregnancy test is negative. Which of the following is the best next step in management of this patient?",
"choice_a": "17-hydroxyprogesterone level",
"choice_b": "Estradiol level",
"choice_c": "Pelvic ultrasound",
"choice_d": "Pituitary MRI",
"choice_e": "Plasma aldosterone to plasma renin activity ratio",
"correct_answer": "A",
"explanation": "This patient has obesity, oligomenorrhea, and hirsutism, which are typically caused by polycystic ovary syndrome (PCOS); however, other causes of hirsutism must be ruled out. Atypical findings or pronounced virilization (eg, frontal balding, voice deepening, clitoromegaly) make other etiologies such as androgen-producing tumors (eg, ovary, adrenal) and nonclassic (late-onset) congenital adrenal hyperplasia (CAH) more likely. In this patient, the most likely diagnosis is nonclassic CAH, a 21-hydroxylase enzyme deficiency. Patients have signs of androgen excess (eg, premature pubarche, acne, accelerated bone age, hirsutism, menstrual irregularities) in late childhood or early adulthood. However, there is usually no cortisol deficiency, unlike in classic early-onset CAH. Nonclassic CAH is more common in Ashkenazi Jewish, Italian, Slavic, and Hispanic patients. Diagnosis of nonclassic CAH is suggested by elevated 17-hydroxyprogesterone basal levels (>200 ng/dL) and confirmed by a significant increase in 17-hydroxyprogesterone (>1,000 ng/dL) after high-dose ACTH (250 µg) administration. (Choice B) Measurement of estradiol is unlikely to be helpful as this patient had withdrawal bleeding with medroxyprogesterone acetate, suggesting no estrogen deficiency. (Choice C) Androgen-secreting ovarian tumors can be diagnosed by pelvic ultrasound; however, such tumors generally present in postmenopausal women, tend to progress quickly, and are unlikely in the absence of a significantly elevated testosterone level (>150 ng/dL). PCOS can be diagnosed based on 2 of 3 criteria (irregular or absent ovulation, hyperandrogenism, polycystic ovaries on ultrasound); therefore, pelvic ultrasound is not required in patients with 2 other criteria for PCOS, particularly as the finding of polycystic ovaries is nonspecific (eg, can also be found in patients with idiopathic hirsutism or with normal ovarian function). This patient does not require an pelvic ultrasound and should undergo further testing for nonclassic CAH. (Choice D) Pituitary MRI is required if laboratory results reveal significant hyperprolactinemia or Cushing syndrome. (Choice E) Primary hyperaldosteronism presents with hypertension and possibly hypokalemia; it does not typically cause hirsutism or menstrual abnormalities. Educational objective: Nonclassic congenital adrenal hyperplasia (CAH) presents with hyperandrogenism and ovulatory dysfunction similar to polycystic ovary syndrome, and has a later onset than classic CAH. Diagnosis is confirmed by elevated 17-hydroxyprogesterone levels that significantly increase after ACTH administration.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_015",
"system": "Female reproductive system",
"stem": "A 28-year-old woman comes to the office due to bilateral breast discomfort that occasionally interferes with physical activity. The pain begins the week prior to menses and subsides on the first day of her menstrual cycle, which occurs every 30 days; her last menstrual period was 3 weeks ago. Two years ago, she was diagnosed with leg vein thrombosis after an ankle fracture and was treated with a direct oral anticoagulant for 3 months. Family history is significant for osteoporosis in her grandmother and aunt. Vital signs are normal. BMI is 26 kg/m². Physical examination reveals bilateral, mildly tender nodularity of the upper lateral breast quadrants. There are no skin changes, palpable lymph node enlargement, or nipple discharge. Which of the following is the best next step in management of this patient?",
"choice_a": "Breast ultrasound",
"choice_b": "Progestin therapy",
"choice_c": "Serum estradiol, FSH, and prolactin levels",
"choice_d": "Supportive bra",
"choice_e": "Tamoxifen therapy",
"correct_answer": "D",
"explanation": "Mastalgia (breast pain) is a common and benign symptom that most women experience due to estrogen and progesterone changes associated with the menstrual cycle. The pain is often cyclic, beginning up to 2 weeks before menses and usually subsiding by the onset of menses; it is typically described as heavy, diffuse, dull, and bilateral. Generalized swelling and mildly tender nodularity may be present, but there are no discrete masses or nipple discharge. Symptomatic relief can be achieved by wearing a properly fitted bra with good breast support that minimizes breast movement. Acetaminophen or nonsteroidal anti-inflammatory drugs (eg, ibuprofen) can also be administered for pain relief. In addition, danazol is currently approved by the Food and Drug Administration for mastalgia; however, it may cause permanent androgenic side effects (eg, hirsutism) and increases the risk of thromboembolism. (Choice A) Imaging with either a breast ultrasound or a mammogram is required in the evaluation of unilateral, noncyclic, or focal breast pain with no associated palpable mass. This patient's bilateral mastalgia and normal clinical breast examination require no further evaluation. (Choice B) Progestins are indicated for secondary amenorrhea, abnormal uterine bleeding, and endometriosis. Breast tenderness is a common side effect of progestin use. (Choice C) A panel of serum estradiol, FSH, and prolactin levels is indicated in the evaluation of secondary amenorrhea. Prolactin levels are ordered in patients with bilateral nipple discharge but are not indicated in breast pain evaluation. (Choice E) Tamoxifen is a selective estrogen receptor modulator that may be used in patients with mastalgia unresponsive to conservative therapy. Tamoxifen is contraindicated in patients with a previous thromboembolism. In addition, tamoxifen has multiple side effects (eg, hot flashes) that limit its usefulness. Educational objective: Mastalgia is a benign breast condition characterized by bilateral breast pain and tenderness that occurs up to 2 weeks prior to menses and wanes with the onset of menses. Symptomatic relief can be achieved by wearing a properly fitted bra that provides adequate breast support.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_016",
"system": "Female reproductive system",
"stem": "An 18-year-old woman comes to the office for evaluation of vaginal discharge that is thin, gray, and malodorous. The patient has had no vulvovaginal pruritus or pelvic pain. She is sexually active with multiple partners and uses oral contraceptives but does not consistently use condoms. Her general health is good. She recently completed a course of antibiotics for uncomplicated cystitis. Review of systems is negative. Vital signs are normal. Speculum examination reveals a gray, adherent, malodorous discharge on the walls of the vaginal vault. The cervix appears normal and there is no cervical motion tenderness. Vaginal pH is 5. Microscopic examination is shown below:  Which of the following is the best therapy for this patient?",
"choice_a": "Ceftriaxone",
"choice_b": "Doxycycline",
"choice_c": "Fluconazole",
"choice_d": "Metronidazole",
"choice_e": "Trimethoprim-sulfamethoxazole",
"correct_answer": "D",
"explanation": "Vaginitis is common, and bacterial vaginosis, trichomoniasis, and candidal vulvovaginitis compose the majority of cases. Bacterial vaginosis is diagnosed when 3 of the 4 following Amsel criteria are present: 1. Thin, gray vaginal discharge 2. Vaginal pH >4.5 3. Amine odor after application of potassium hydroxide (eg, \"whiff\" test) 4. Clue cells (epithelial cells covered in bacteria) on wet mount microscopy. This patient's thin, gray, malodorous discharge and vaginal pH of 5 suggest bacterial vaginosis. Vulvovaginal pruritus and pelvic pain are usually not present. The vaginal epithelium and cervix typically are not inflamed (eg, vaginosis). Identifying clue cells, characteristic epithelial cells diffusely coated with bacteria, on wet mount microscopy of the discharge confirms the diagnosis. Bacterial vaginosis is treated with oral or vaginal metronidazole. Clindamycin is an effective alternate agent. (Choice C) Fluconazole is indicated for the treatment of vulvovaginal candidiasis, which can occur after antibiotic use. However, patients typically have vulvovaginal pruritus; a thick, white, clumpy discharge; and pseudohyphae on wet mount microscopy. Educational objective: Diagnostic criteria for bacterial vaginosis include a thin, gray, malodorous vaginal discharge; a vaginal pH >4.5; an amine odor after the application of potassium hydroxide (eg, \"whiff\" test); and clue cells on wet mount microscopy. Treatment is with metronidazole or clindamycin.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_017",
"system": "Female reproductive system",
"stem": "A 19-year-old woman comes to the office due to infrequent menstrual cycles and excessive body hair. Menarche was at age 11 and her cycles have since been irregular. The patient has <6 menstrual periods per year with very heavy bleeding. Her last menstrual period was 4 months ago. She also reports increased hair growth on her face and trunk. The patient has no other medical conditions and takes no medications. She does not use tobacco, alcohol, or illicit drugs. She is not sexually active. Family history is significant for hypertension and coronary artery disease in her father and hypertension in her mother. There is no family history of diabetes mellitus. Blood pressure is 134/88 mm Hg. BMI is 30 kg/m². Acanthosis is present on the nape of the neck. Significant terminal hair is noted on the face, upper chest, lower abdomen, and lower back. There are pale striae on the abdominal wall. The remainder of the physical examination is within normal limits. Laboratory results are as follows: Glucose, fasting 98 mg/dL, Creatinine 1.1 mg/dL, β-hCG undetectable, Urine free cortisol 24 μg/24 hr, FSH 5 mIU/mL, LH 20 mIU/mL, Dehydroepiandrosterone sulfate 480 μg/dL (normal: 148-408), 17-hydroxyprogesterone 55 ng/dL (normal: 15-250), Testosterone 75 ng/dL (normal: 15-70), Prolactin 8 ng/mL, TSH 2.3 μU/mL. Which of the following is the best next step in management of this patient?",
"choice_a": "Order adrenal CT scan",
"choice_b": "Order pelvic ultrasound",
"choice_c": "Prescribe corticosteroids",
"choice_d": "Prescribe metformin",
"choice_e": "Prescribe oral contraceptives",
"correct_answer": "E",
"explanation": "This patient has polycystic ovary syndrome (PCOS) based on having 2 of the 3 following criteria: • Irregular or absent ovulation (eg, irregular menses) • Clinical (eg, acne, hirsutism) or biochemical (eg, elevated testosterone levels) hyperandrogenism • Polycystic ovaries on ultrasound. Management of PCOS involves improving hirsutism, restoring reproductive function, and managing comorbidities. Oral contraceptive pills (OCPs) are the preferred treatment for oligomenorrhea and hirsutism in patients who do not desire pregnancy. OCPs increase sex hormone-binding protein levels, resulting in decreased free androgen levels; in addition, OCPs reduce circulating LH levels, leading to decreased ovarian androgen production. (Choice A) An adrenal CT scan is indicated in patients with features of an androgen-secreting tumor, such as rapidly progressive hyperandrogenism with marked virilization (eg, clitoromegaly, voice deepening) and significantly elevated circulating androgen levels (dehydroepiandrosterone sulfate [DHEA-S] >700 μg/dL). (Choice D) Metformin is indicated in patients with PCOS who have impaired glucose tolerance or diabetes mellitus. Educational objective: Polycystic ovary syndrome presents with menstrual irregularities and hyperandrogenism and is diagnosed after excluding other mimicking disorders. Oral contraceptive pills and weight loss are first-line therapies.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_018",
"system": "Female reproductive system",
"stem": "A 48-year-old woman comes to the office for a well-woman examination and a discussion about menopausal symptoms. She has experienced unpredictable and progressively worsening episodes of flushing, sweating, and anxiety that interfere with her occupational performance during the day and wake her from sleep at night. The patient has attempted to manage her symptoms by turning on the air conditioner in the winter and dressing in layers. Her menstrual cycles have become irregular, occurring every 28-50 days. The patient had a tubal ligation at age 40, and her postoperative course was complicated by lower extremity deep vein thrombosis. She does not use tobacco and does not have a personal history of breast cancer. Blood pressure is 122/78 mm Hg, pulse is 72/min, and respirations are 17/min. The well-woman physical examination is unremarkable. Which of the following is the most appropriate next step in management to reduce this patient's symptoms?",
"choice_a": "Dopamine reuptake inhibitor",
"choice_b": "Estrogen-progestin transdermal patch",
"choice_c": "Estrogen transdermal patch",
"choice_d": "Phytoestrogen supplement",
"choice_e": "Selective serotonin reuptake inhibitor",
"correct_answer": "E",
"explanation": "Systemic estrogen-based hormone therapy is the most effective treatment for menopausal vasomotor symptoms, such as moderate to severe hot flashes. However, all estrogen-containing regimens can increase the risk of venous thromboembolism and are contraindicated in women, such as this patient, with a history of deep vein thrombosis (Choices B and C). Estrogen is also contraindicated in women with a history of breast cancer, coronary heart disease, or active liver disease and is relatively contraindicated in those who smoke. For patients who cannot or prefer not to take hormonal therapy, alternate options include selective serotonin reuptake inhibitors (eg, paroxetine) and serotonin-norepinephrine reuptake inhibitors (eg, venlafaxine). Hot flashes are mediated in part by serotonergic pathways, so blockade of these pathways provides symptomatic relief. Educational objective: Estrogen-based menopausal hormone therapy is contraindicated in patients with a history of venous thromboembolism, breast cancer, coronary heart disease, or active liver disease. Nonhormonal treatments include selective serotonin reuptake inhibitors, serotonin-norepinephrine reuptake inhibitors, and gabapentin.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_019",
"system": "Female reproductive system",
"stem": "A 56-year-old woman comes to the office due to breast pruritus. The patient reports increasing pruritus around the right areola over the last 3 months that has not resolved with topical emollients. The pruritus is continuous and she is constantly scratching the breast. The patient has now noticed a lesion around the nipple and serosanguinous discharge on her clothing. She has had no change in skin products or detergents. The patient has type 2 diabetes mellitus controlled with metformin. She has had no previous surgeries and has no known allergies. Her last mammogram, 2 years ago, was normal. The patient does not use tobacco, alcohol, or illicit drugs. Vital signs are normal. The right breast has an ulcerative lesion over the right nipple and areola that does not extend to the surrounding tissue; there are no palpable masses or axillary lymph nodes. Serous fluid is expressed from the nipple. Examination of the left breast is unremarkable. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Candida mastitis",
"choice_b": "Contact dermatitis",
"choice_c": "Ductal ectasia",
"choice_d": "Intraductal papilloma",
"choice_e": "Paget disease of the breast",
"correct_answer": "E",
"explanation": "Paget disease of the breast (PDB) is characterized by a unilateral, erythematous, intensely pruritic, ulcerative lesion confined to the nipple and areola. Pain and burning occur prior to development of the lesion, which typically appears first on the nipple and migrates to the areola. There may be an associated serous or serosanguineous discharge. Diagnosis of PDB is by tissue biopsy (eg, wedge, punch). Many patients with PDB have an underlying breast malignancy (eg, intraductal carcinoma, ductal carcinoma in situ). Therefore, all patients with PDB require bilateral mammography. (Choice B) Contact dermatitis typically presents with burning, pruritus, and erythema. Patients typically have recent irritant exposure (eg, change in detergent), and symptoms usually resolve with topical emollients. (Choice D) Intraductal papilloma is a common cause of serosanguinous nipple discharge; however, patients do not typically have associated pruritus or skin changes (eg, erythema, ulcerations). Educational objective: Paget disease of the breast is characterized by a unilateral, erythematous, intensely pruritic, ulcerative lesion of the nipple-areolar complex. Diagnosis is by tissue biopsy. Patients also require diagnostic bilateral mammography, as many have underlying breast malignancy.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_020",
"system": "Female reproductive system",
"stem": "An 18-year-old woman comes to the office due to 6 months of painful menstrual periods. The patient's menstrual period began yesterday, and she has severe lower abdominal pain and cramping that has caused her to stay home from school. She has associated headaches, nausea, fatigue, and dizziness. Acetaminophen has not relieved any of these symptoms. Menarche was at age 13, followed by irregular menstrual periods for the first year. Her menstrual periods are now monthly and consist of 4 days of moderate bleeding. The patient is sexually active with her boyfriend. She has no other medical problems. The patient does not use tobacco, alcohol, or illicit drugs. BMI is 30 kg/m². Pelvic examination and the remainder of the physical examination are within normal limits. Pregnancy test is negative. Which of the following is the best next step in management of this patient?",
"choice_a": "Combination oral contraceptives",
"choice_b": "Diagnostic laparoscopy",
"choice_c": "GnRH agonist",
"choice_d": "Medroxyprogesterone acetate",
"choice_e": "Pelvic ultrasound",
"correct_answer": "A",
"explanation": "Primary dysmenorrhea is painful menses (eg, cramping) due excessive prostaglandin production (eg, inflammation) that interferes with daily activities. In addition to cramping, patients often have associated fatigue, headache, and nausea. Primary dysmenorrhea is a clinical diagnosis based on cyclic pelvic pain (eg, menses) and a normal pelvic examination (eg, no fixed uterus or adnexal mass), suggesting no underlying pathology. These patients can be started on empiric treatment with combination oral contraceptives (OCPs) or nonsteroidal anti-inflammatory drugs (NSAIDs). Patients with continued pain after 3 months of dual therapy (NSAIDs + OCPs) require evaluation with a pelvic ultrasound to assess for secondary causes of pain (eg, adenomyosis) (Choice E). A negative ultrasound is suggestive of endometriosis, which can be confirmed via diagnostic laparoscopy or treated empirically with a GnRH agonist (eg, leuprolide) (Choices B and C). Educational objective: Primary dysmenorrhea is a common cause of cyclic menstrual pelvic pain. Diagnosis is clinical; patients with cyclic pelvic pain and a normal pelvic examination require no further evaluation. Treatment is with nonsteroidal anti-inflammatory drugs and/or combination oral contraceptives.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_021",
"system": "Female reproductive system",
"stem": "A 66-year-old woman comes to the clinic for a routine follow-up visit. The patient immigrated to the United States from Haiti 6 years ago. Medical history includes osteoarthritis of the knees, lumbar spinal stenosis, and hypertension. At age 45, she had a supracervical hysterectomy, leaving an intact cervix. Her last mammogram, several months ago, was normal. The patient is up to date with colonoscopy screening. She received influenza and pneumonia vaccines last year. Her last Pap test a year ago was normal. Human papillomavirus (HPV) testing at that time was negative. The patient also had a normal Pap test and a negative HPV test 6 years ago. Prior to arriving to the United States, her only Pap test was prior to her hysterectomy and was normal. She has a new sexual partner since her last visit. Vital signs and physical examination are within normal limits. Which of the following is the best next step for cervical cancer screening in this patient?",
"choice_a": "HPV DNA test today; if normal, no further cervical cancer screening",
"choice_b": "No further cervical cancer screening indicated",
"choice_c": "Pap test plus HPV DNA test in 3 years; if normal, no further cervical cancer screening",
"choice_d": "Pap test plus HPV DNA test next year; if normal, no further cervical cancer screening",
"choice_e": "Pap test today; if normal, no further cervical cancer screening",
"correct_answer": "B",
"explanation": "Current recommendations for cervical cancer screening include Pap testing alone every 3 years at age 21-65 or Pap plus human papillomavirus (HPV) cotesting every 5 years at age 30-65. Cervical cancer screening can be discontinued in patients age >65 with: • Low risk of cervical cancer • No history of high-grade squamous intraepithelial lesions • No tobacco use, sexually transmitted infection, multiple sexual partners, or immunosuppression • Prior adequate screening (3 consecutive negative Pap tests within the last 10 years, or 2 consecutive negative HPV tests within the last 10 years, the most recent within the last 5 years). Women with a supracervical hysterectomy (ie, intact cervix) have a cervical cancer risk similar to that of women with a uterus. This patient had a supracervical hysterectomy and adequate prior screening (2 consecutive negative HPV tests within the last 10 years) and therefore does not require further cervical cancer screening. (Choice A) Cervical cancer screening with HPV testing alone every 3 years is an alternate screening; it can also be discontinued at age >65. (Choices C, D, and E) A new sexual partner is not an indication for continuing cervical cancer screening in patients age >65. Educational objective: Screening can be discontinued in low-risk women age >65 with prior adequate screening.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_022",
"system": "Female reproductive system",
"stem": "An 84-year-old woman comes to the office for evaluation of bleeding. The patient first noticed small amounts of blood on her underwear 2 weeks ago. She has been wearing pads that require changing once or twice a day with only a small amount of blood accumulating between changes. Her last Pap test at age 64 was normal. A small, hyperplastic rectal polyp was removed at age 80. Vital signs are normal. BMI is 38 kg/m². The speculum is difficult to insert; on examination there is mucosal pallor throughout the vagina with epithelial thinning and dryness. No mass or prolapse is visualized. Fecal occult blood test is negative. Which of the following is the best next step in management of this patient?",
"choice_a": "Colonoscopy",
"choice_b": "Colposcopy",
"choice_c": "Reassurance and follow-up in 1-2 weeks",
"choice_d": "Transvaginal ultrasound",
"choice_e": "Vaginal estrogen therapy",
"correct_answer": "D",
"explanation": "New-onset postmenopausal bleeding (PMB) warrants an evaluation for endometrial cancer. Although endometrial cancer is the etiology in only 5%-10% of cases, it is potentially lethal and should therefore be ruled out early in the diagnostic process. Risk factors for endometrial cancer include age >50, diabetes mellitus, unopposed exogenous estrogen, and excessive endogenous estrogen (eg, obesity, chronic anovulation). An endometrial biopsy or transvaginal ultrasound (TVUS) can be used as the initial test in a patient with PMB. TVUS is a noninvasive method to evaluate the endometrial lining. The likelihood of endometrial cancer in patients with an endometrial stripe of ≤4 mm on ultrasound is ~1%, and no further testing is recommended. However, an endometrial stripe of >4 mm requires further evaluation with an endometrial biopsy. (Choice E) The most common cause of PMB is vaginal atrophy. Although this diagnosis is likely based on this patient's examination findings, evaluation for endometrial cancer should occur before initiating estrogen therapy. Educational objective: Postmenopausal bleeding (PMB) requires assessment with either transvaginal ultrasound or endometrial biopsy to rule out endometrial cancer.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_023",
"system": "Female reproductive system",
"stem": "A 42-year-old woman comes to the office for an annual examination. The patient feels well and has regular menses with no abnormal bleeding. She has a new vaginal discharge but no vulvar pruritus or pelvic pain. The patient is sexually active and has had only women partners. Her current relationship began 6 months ago. She has no chronic medical conditions and takes no medications. Vital signs are normal. BMI is 31 kg/m². There is no vulvar erythema. Microscopic examination of the vaginal discharge reveals the following:  Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Bacterial vaginosis",
"choice_b": "Mycoplasma cervicitis",
"choice_c": "Neisseria gonorrhoeae cervicitis",
"choice_d": "Trichomonas vaginitis",
"choice_e": "Vaginal candidiasis",
"correct_answer": "E",
"explanation": "Vulvovaginal candidiasis (VVC) is common because Candida exists as normal vaginal flora. However, overgrowth creates symptomatic VVC, leading to vaginal discharge, pruritus, dysuria, and dyspareunia. Examination findings include vulvovaginal erythema and clumpy white discharge. Pseudohyphae and budding yeast can be visualized on wet-mount microscopy. Treatment of uncomplicated VVC is a single course of an oral (eg, fluconazole) or topical (eg, miconazole) antifungal agent. (Choice A) Bacterial vaginosis is more common in women who have sex with women. It presents with a thin, malodorous vaginal discharge; a pH of >4.5; an amine odor (whiff test); and clue cells on microscopy. (Choice D) Trichomonas vaginitis presents with vulvovaginal pruritus; a green, frothy vaginal discharge; and motile, flagellated protozoa on microscopy. Educational objective: Vulvovaginal candidiasis is a common cause of vaginal discharge and pruritus. Diagnosis is confirmed by pseudohyphae and budding yeast on microscopy.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_024",
"system": "Female reproductive system",
"stem": "A 50-year-old woman comes to the office due to involuntary leakage of urine. The leakage started a year ago and currently occurs several times a day when the patient coughs, sneezes, laughs, or stands up. She also sometimes has loss of urine during sexual intercourse. The patient awakens to urinate once each night; she has had no dysuria, hematuria, urinary urgency, or fecal incontinence. She has had 2 vaginal deliveries. Her incontinence makes her self-conscious during social interactions and she has stopped participating in exercise classes. Physical examination is within normal limits, except for a BMI of 32 kg/m². Pelvic examination reveals mild uterine prolapse. A cough with a full bladder elicits an immediate release of a small amount of urine. Urinalysis is normal. Post-voiding urinary residual volume is 20 mL. The patient is currently collecting information in a voiding diary regarding fluid intake, voiding frequence, and amount of urine. Which of the following is the best next step in management of this patient?",
"choice_a": "Behavioral changes and pelvic muscle exercises",
"choice_b": "Duloxetine hydrochloride",
"choice_c": "Incontinence pessary",
"choice_d": "Mid-urethral sling procedure",
"choice_e": "Urodynamic studies",
"correct_answer": "A",
"explanation": "This patient has stress urinary incontinence based on involuntary leakage of urine with coughing, sneezing, or exertion. Patients with stress incontinence are initially managed conservatively with lifestyle changes (eg, restricting fluid intake, weight loss, smoking cessation). Pelvic floor muscle training (eg, Kegel exercise) is recommended to strengthen the pelvic floor musculature; this may help with decreasing the frequency and volume of urine loss. Bladder training with frequent, timed voiding can keep urine volumes low and is helpful when combined with pelvic muscle exercises. (Choice C) An incontinence pessary can be considered for patients who fail conservative therapy. (Choice D) Surgery (eg, mid-urethral sling) has the highest cure rate but is invasive and usually reserved for patients who fail conservative management. Educational objective: Patients with stress urinary incontinence should be evaluated for modifiable risk factors. Initial treatment is with behavioral therapy and pelvic floor muscle exercises.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_025",
"system": "Female reproductive system",
"stem": "A 22-year-old woman comes to the office for evaluation of amenorrhea. Her last menstrual period was 5 months ago. Menarche was at age 11. The patient had regular menstrual periods up until 5 years ago when they began occurring every 2-3 months and consisted of 3 days of light bleeding. She feels fatigued and anxious, and has lost 6.8 kg (15 lb) in the past year. She has had no headaches, abnormal hair growth, loss of scalp hair, changes in peripheral vision, or hot flashes. The patient has no chronic medical conditions and takes no medications. She does not use tobacco, alcohol, or illicit drugs. Her mother has hypothyroidism. The patient has been training for a marathon for the last 6 months and runs approximately 40 miles each week. Her diet consists mainly of high-protein bars. She is single and not sexually active. Blood pressure is 106/78 mm Hg and pulse is 73/min. BMI is 19 kg/m². Physical examination is unremarkable. Laboratory results are as follows: β-hCG negative, FSH 4 mIU/mL, Testosterone 30 ng/dL, TSH 0.2 μU/mL, Free T4 1.3 ng/dL, Total T3 66 ng/dL, Prolactin 14 ng/mL. Medroxyprogesterone acetate challenge does not produce uterine withdrawal bleeding. Which of the following is the best next step in management of this patient?",
"choice_a": "Order MRI of the pituitary gland",
"choice_b": "Order ultrasound of the pelvis",
"choice_c": "Order ultrasound of the thyroid",
"choice_d": "Prescribe combination oral contraceptives",
"choice_e": "Recommend decreased exercise and increased caloric intake",
"correct_answer": "E",
"explanation": "This patient has functional hypothalamic amenorrhea (FHA), secondary amenorrhea due to relative caloric deficiency (eg, excessive exercise, weight loss, decreased intake) or stress. In these patients, the lack of hypothalamic function results in a low FSH level. The resultant estrogen deficiency, which causes a thin endometrium, is indicated by the lack of withdrawal bleeding during the medroxyprogesterone acetate challenge. Patients with FHA are at risk for stress fractures and early-onset osteoporosis. First-line treatment is lifestyle changes, including increased caloric intake, decreased exercise, stress reduction, and weight gain. (Choice A) An MRI of the pituitary gland screens for pituitary adenoma, which typically presents with headaches, vision changes, galactorrhea, and elevated prolactin. (Choice D) Combined estrogen/progestin oral contraceptives are second-line treatment for patients unable or unwilling to make lifestyle changes. Educational objective: Functional hypothalamic amenorrhea presents in patients with secondary amenorrhea, low FSH, and low estrogen levels secondary to relative caloric deficiency. First-line treatment is with lifestyle changes, including decreasing exercise and increasing caloric intake.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_026",
"system": "Female reproductive system",
"stem": "A 52-year-old woman comes to the office due to \"feeling hot all the time.\" She reports the sensation of heat starting in her upper body and spreading all over. She has had these symptoms for the past 10 months and is exhausted as they keep her awake most nights. Her last menstrual period was 8 months ago. The patient's other medical problems include hypothyroidism and gastroesophageal reflux disease, and her medications include levothyroxine and omeprazole. A mammogram performed last year was normal. She has had no surgeries; her family history is unremarkable. The patient does not use tobacco, alcohol, or illicit drugs. Physical examination, including pelvic examination, is within normal limits. Laboratory findings, including TSH, are within normal limits. Which of the following is the best therapy to relieve this patient's symptoms?",
"choice_a": "Estrogen",
"choice_b": "Estrogen and progesterone",
"choice_c": "Lifestyle modifications",
"choice_d": "Phytoestrogens",
"choice_e": "Selective serotonin reuptake inhibitor",
"correct_answer": "B",
"explanation": "This patient has symptoms of severe vasomotor instability (hot flashes) due to the menopausal transition. Patients with no history of breast cancer or cardiovascular disease are typically good candidates for hormone replacement therapy (HRT). Patients with an intact uterus (ie, no hysterectomy) are started on a short-term regimen of combined estrogen/progesterone to decrease the risk of endometrial hyperplasia or carcinoma. In contrast, patients with a previous hysterectomy can be prescribed estrogen-only therapy (Choice A). (Choice C) Lifestyle modifications are indicated for mild hot flashes that do not interfere with daily activities. (Choice E) Selective serotonin reuptake inhibitors (SSRIs) are used for patients who cannot take estrogen or who continue to have symptoms after stopping estrogen therapy. Educational objective: Combined estrogen/progesterone is the first-line treatment for postmenopausal women with moderate-to-severe vasomotor symptoms who have an intact uterus and no history of breast cancer or cardiovascular disease.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_027",
"system": "Female reproductive system",
"stem": "A 61-year-old postmenopausal woman comes to the office due to leakage of urine. The patient reports increased urinary frequency and voids 1 or 2 times per hour. She often awakens at night with an immediate need to void and occasionally does not make it to the bathroom in time. The patient has mild intermittent asthma controlled with an albuterol inhaler. Her other medications include low-dose aspirin and a multivitamin. She had 2 cesarean deliveries, the last of which was complicated by a venous thromboembolism after delivery. Vital signs are normal. BMI is 27 kg/m². Pelvic examination reveals a thin, atrophic vagina. Cough stress test is negative and postvoid residual volume is 65 mL. Urinalysis and urine culture are normal. Which of the following is the best next step in management of this patient?",
"choice_a": "Bladder training with timed voids",
"choice_b": "Midurethral sling procedure",
"choice_c": "Pessary placement",
"choice_d": "Transdermal estrogen patch",
"choice_e": "Urodynamic testing",
"correct_answer": "A",
"explanation": "Urgency incontinence presents with the frequent, sudden need to urinate followed by immediate loss of urine. This is due to increased detrusor contractility (overactive bladder). Bladder training involves a voiding diary and timed voiding, followed by a slow increase in intervals between voids to minimize leaking. Behavioral therapy helps retrain the bladder by minimizing involuntary detrusor contractions. Antimuscarinics (eg, oxybutynin) or beta-3 agonists (eg, mirabegron) are used if urgency symptoms persist despite conservative therapy. (Choices B and C) Stress urinary incontinence presents with leakage with Valsalva and a positive cough stress test; it is treated with pelvic floor exercises, pessary, or midurethral sling. (Choice D) A transdermal estrogen patch provides vasomotor symptom relief but can worsen urinary incontinence. The patient's prior thromboembolism contraindicates systemic estrogen use. Educational objective: Lifestyle modifications and behavioral therapy (eg, bladder training) are first-line treatments for urgency incontinence.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_028",
"system": "Female reproductive system",
"stem": "A 26-year-old woman comes to the office for a follow-up visit. The patient was first seen 4 months ago for irregular menstrual periods and hirsutism. Laboratory results at that time showed mildly elevated levels of serum testosterone and LH but normal levels of FSH, prolactin, salivary cortisol, TSH, and 17-hydroxyprogesterone. Serum chemistry profile was normal. Based on symptoms and laboratory results, she was diagnosed with polycystic ovary syndrome (PCOS) and started on oral contraceptives. After the initial visit, she began a low-carbohydrate diet and exercise, which led to significant weight loss. Her menstrual cycles are now regular, every 28 days. In addition, her hirsutism has markedly improved. She is sexually active and does not desire pregnancy. BMI is 27 kg/m². The patient has moderate terminal hair growth on the face, chest, lower abdomen, and lower back. Which of the following is the best next step in management of this patient?",
"choice_a": "Add metformin",
"choice_b": "Add spironolactone",
"choice_c": "Continue current therapy",
"choice_d": "Order pelvic ultrasound",
"choice_e": "Switch to a progestin-releasing intrauterine device",
"correct_answer": "C",
"explanation": "Oral contraceptives (OCs) are first-line treatment for managing menstrual irregularities and hirsutism in patients with PCOS. The estrogen component of OCs decreases free testosterone levels and suppresses LH secretion. Women with PCOS may require up to 6 months of therapy before a significant decrease in terminal hair is seen. In this patient, additional therapy is not required as she already has had a marked decrease in hirsutism with OCs. (Choice B) An anti-androgen (eg, spironolactone) is added if there is an inadequate cosmetic response after 6 months of OC therapy. (Choice D) Pelvic ultrasound is not needed as the PCOS diagnosis has been made based on hyperandrogenism and ovulatory dysfunction (2 of 3 diagnostic criteria). Educational objective: Oral contraceptives are first-line therapy for hirsutism in PCOS. Spironolactone is added if there is an inadequate response after 6 months.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_029",
"system": "Female reproductive system",
"stem": "A 49-year-old woman, gravida 1 para 1, comes to the office due to leakage of urine. The patient first noticed intermittent loss of urine a few years ago. The leakage has progressively worsened and now she is constantly leaking a small amount of urine. The patient soaks through a thin incontinence pad 2 or 3 times a day. She has no dysuria, hematuria, or urge to void. The patient has type 1 diabetes mellitus managed with an insulin pump. Her last hemoglobin A1c was 10.4%. At age 30 she had an operative vaginal delivery. Pelvic examination reveals leakage of urine that increases with Valsalva. Postvoid residual volume is increased. There is decreased sensation to light touch and pinprick involving the perineum and both feet. Laboratory results: Urinalysis shows trace protein and blood; urine culture is negative. Which of the following is the best next step in management of this patient?",
"choice_a": "Intermittent self-catheterization",
"choice_b": "Pelvic floor muscle exercises",
"choice_c": "Placement of midurethral sling",
"choice_d": "Placement of suprapubic catheter",
"choice_e": "Tolterodine therapy",
"correct_answer": "A",
"explanation": "This patient has overflow incontinence, characterized by constant, involuntary dribbling and incomplete emptying. This is due to persistent urinary retention caused by poor detrusor function from diabetic neuropathy. Chronic urinary retention increases the risk for urinary tract infection and renal damage; therefore, patients require intermittent self-catheterization. Additional treatment includes cholinergic agonists (eg, bethanechol) and optimization of hemoglobin A1c. (Choices B and C) Pelvic floor muscle exercises and midurethral slings are used for stress urinary incontinence, but stress incontinence is not associated with an elevated postvoid residual volume. (Choice E) Tolterodine is used for urgency incontinence, which involves a sudden need to urinate followed by immediate loss. Educational objective: Overflow incontinence presents with continuous leakage of urine secondary to urinary retention caused by underactive detrusor function (eg, diabetes mellitus) or outflow obstruction. Treatment focuses on cholinergic agonists and intermittent self-catheterization.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_030",
"system": "Female reproductive system",
"stem": "A 19-year-old woman comes to the office due to increasing vaginal discharge. The discharge began 6 months ago when she started taking a combined estrogen/progestin contraceptive pill. Since then, she has had multiple episodes of thin discharge accompanied occasionally by mild vulvar irritation. The discharge improves with probiotics and douches but then recurs after a week. She recently became sexually active and has had 2 lifetime partners. Vital signs are normal. Pelvic examination reveals a thin, slightly malodorous, clear, yellow discharge throughout the vaginal vault. There is no discharge from the cervical os and no cervical friability. Bimanual examination demonstrates no cervical motion tenderness. Wet mount microscopy shows numerous epithelial cells and occasional polymorphonuclear leukocytes, and the pH of the discharge is 4.2. Urine pregnancy test is negative. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Acute cervicitis",
"choice_b": "Bacterial vaginosis",
"choice_c": "Candidal vulvovaginitis",
"choice_d": "Physiologic leukorrhea",
"choice_e": "Trichomoniasis",
"correct_answer": "D",
"explanation": "Physiologic leukorrhea occurs due to elevated estrogen levels and results in episodic, thin vaginal discharge. In patients taking combined oral contraceptives, this occurs while taking the active pills (high estrogen) and resolves during placebo pills. Pelvic examination is unremarkable, vaginal pH is normal (4-4.5), and microscopy shows only vaginal epithelial cells. (Choice B) Bacterial vaginosis presents with thin, gray discharge, pH >4.5, and clue cells. (Choice C) Candidal vulvovaginitis typically presents with vulvar pruritus, white discharge, and hyphae/pseudohyphae on microscopy. (Choice E) Trichomoniasis presents with green, frothy discharge and protozoa. Educational objective: Physiologic leukorrhea occurs due to elevated estrogen levels associated with combination hormonal contraceptive use. It does not require treatment.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_031",
"system": "Female reproductive system",
"stem": "A 53-year-old woman, gravida 1 para 1, comes to the office for a routine gynecologic examination. Menopause was at age 50. Medical problems include obesity and type 2 diabetes mellitus. The patient is sexually active with a new partner of 6 months. She has a 30-pack-year smoking history. Pelvic examination reveals no abnormalities. A Pap test is performed and the cervical cytology report specifies that there are \"atypical squamous cells of undetermined significance\" (ASCUS). Which of the following is the best next step in management of this patient?",
"choice_a": "Colposcopy",
"choice_b": "Diagnostic excisional procedure",
"choice_c": "Endocervical curettage",
"choice_d": "Human papillomavirus testing",
"choice_e": "Repeat cervical cytology in 3 years",
"correct_answer": "D",
"explanation": "ASCUS is the most common abnormal Pap test result. To determine whether these atypical cells indicate an increased risk for cervical cancer, human papillomavirus (HPV) testing is performed. Patients age >25 with ASCUS and a negative HPV test can be followed with cotesting in 3 years. Patients with ASCUS and positive HPV testing require further evaluation with colposcopy (Choice A). (Choice B) A diagnostic excisional procedure (eg, LEEP) is indicated for high-grade lesions or grade 2/3 CIN on biopsy. Educational objective: Patients with Pap test results showing ASCUS require HPV co-testing to determine the risk of malignancy.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_032",
"system": "Female reproductive system",
"stem": "A 22-year-old woman comes to the office due to dysuria and urinary frequency. She has had no fever, chills, nausea, or vomiting. In the last 8 months, the patient has had 2 urinary tract infections (UTIs) that began shortly after intercourse, despite immediate postcoital voiding. The first infection was complicated by pyelonephritis that responded to oral antibiotics. She takes oral contraceptives. Vital signs are normal. There is mild suprapubic tenderness but no costovertebral angle tenderness. Urinalysis: Leukocyte esterase trace, Nitrites positive, Bacteria moderate, WBC 20-30/hpf. In addition to oral antibiotics for the current infection, which of the following is the best next step in management of this patient?",
"choice_a": "Change in contraception to diaphragm plus spermicide",
"choice_b": "Cranberry supplementation",
"choice_c": "Excretory urography and cystoscopy",
"choice_d": "Postcoital antibiotic prophylaxis",
"choice_e": "Renal ultrasound",
"correct_answer": "D",
"explanation": "This patient has recurrent UTIs (≥2 in 6 months or ≥3 in 1 year). Behavioral strategies include early postcoital voiding and avoidance of spermicides and diaphragms (Choice A actually increases risk). The most effective strategy for recurrent UTI prevention is with either daily or postcoital antibiotic prophylaxis. Postcoital prophylaxis is preferred in women with UTIs temporally related to intercourse. (Choice E) Renal ultrasound is indicated for complicated UTIs, recurrent pyelonephritis, or concern for structural anomalies. Educational objective: Postcoital or daily prophylactic antibiotics are recommended in patients with recurrent UTIs.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_033",
"system": "Female reproductive system",
"stem": "Which of the following patients would require a Pap test as part of an annual health maintenance examination?",
"choice_a": "19-year-old who has never had a Pap or human papillomavirus (HPV) test and has had >3 sexual partners",
"choice_b": "38-year-old woman who has had normal Pap and negative HPV tests, the most recent of which was 4 years ago",
"choice_c": "45-year-old woman who has had normal Pap tests without HPV tests, the most recent of which was 3 years ago",
"choice_d": "55-year-old who has had normal Pap tests, the most recent of which was prior to a total hysterectomy for a uterine leiomyoma 9 years ago",
"choice_e": "72-year-old who has had normal Pap tests, the most recent of which was 7 years ago",
"correct_answer": "C",
"explanation": "Current screening guidelines include initiation of cervical cancer screening at age 21 irrespective of sexual activity (Choice A is incorrect as screening starts at 21). Guidelines include: • Pap testing every 3 years for women age 21-65 OR • Pap and HPV co-testing every 5 years for women age 30-65. A 45-year-old who had a normal Pap test 3 years ago without HPV testing is due for another Pap test now. (Choice B) A patient with normal cotesting 4 years ago is not due until 5 years have passed. (Choice D) Pap testing is not indicated after a total hysterectomy for benign conditions. (Choice E) Screening can be discontinued at age ≥65 in patients who have had adequate prior negative screening. Educational objective: Routine cervical cancer screening starts at age 21. Recommended strategies are Pap tests every 3 years (21-65) or Pap plus HPV tests every 5 years (30-65).",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_034",
"system": "Female reproductive system",
"stem": "A 25-year-old woman comes to the office following a recent diagnosis of HIV. She recently underwent cervical conization for high-grade lesions. The patient received a dose of the human papillomavirus (HPV) vaccine at age 15, but did not complete the series. She has an intrauterine device for contraception. Vital signs are normal. Urine pregnancy test is negative. Which of the following is a contraindication to administration of HPV vaccination in this patient?",
"choice_a": "Age",
"choice_b": "HIV status",
"choice_c": "No contraindication",
"choice_d": "Previous incomplete vaccination",
"choice_e": "Prior abnormal Pap test",
"correct_answer": "C",
"explanation": "HPV vaccination is indicated for women age 11-26. HPV vaccines are prophylactic and most effective if administered prior to sexual activity. The main contraindication is a previous allergic reaction to the vaccine; it is not recommended during pregnancy. (Choice B) HPV vaccination is safe and recommended for HIV-positive patients. (Choice D) Previous incomplete vaccination is not a contraindication; the series can be resumed without restarting. (Choice E) Prior abnormal Pap test does not preclude vaccination as it offers protection against other HPV strains. Educational objective: The HPV vaccination series is indicated for women age 11-26 regardless of HIV status, prior incomplete vaccination, or prior abnormal Pap tests.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_035",
"system": "Female reproductive system",
"stem": "A 29-year-old woman comes to the office due to amenorrhea. Prior to initiation of oral contraceptives 7 years ago, she had regular menses. She stopped taking oral contraceptives 8 months ago but has yet to have a period. She has pain during intercourse and episodes of anxiety and flushing. Medications include levothyroxine for primary hypothyroidism. Her only surgery was a suction curettage at age 17. Vital signs are normal. BMI is 30 kg/m². The thyroid gland is diffusely enlarged and firm. Urine pregnancy test is negative. Laboratory evaluation: Normal prolactin and TSH. FSH is 66 mIU/mL and serum estradiol is low. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Endometrial scarring",
"choice_b": "Functional hypothalamic amenorrhea",
"choice_c": "Pituitary adenoma",
"choice_d": "Polycystic ovary syndrome",
"choice_e": "Primary ovarian insufficiency",
"correct_answer": "E",
"explanation": "Primary ovarian insufficiency (POI) is ovarian failure in women age <40. Patients typically present with irregular or absent menses and hypoestrogenic symptoms (eg, hot flashes). POI is characterized by an elevated FSH level in the postmenopausal range. Etiologies include autoimmune disorders (eg, autoimmune oophoritis), which is likely in this patient with hypothyroidism. (Choice B) Functional hypothalamic amenorrhea is characterized by low FSH and low estrogen. (Choice D) PCOS is characterized by normal FSH. Educational objective: Primary ovarian insufficiency is loss of ovarian function in women age <40, resulting in elevated FSH and low estradiol levels.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_036",
"system": "Female reproductive system",
"stem": "A 24-year-old woman comes to the office for emergency contraception. The patient had unprotected intercourse 2 nights ago after a condom broke. Her last menstrual period was 2 weeks ago. On speculum examination, there is a mucopurulent discharge at the cervical os. The uterus is small and mobile; there are no adnexal masses or tenderness. Urine pregnancy test is negative. Which of the following is the best next step in management of this patient?",
"choice_a": "Combination oral contraceptives",
"choice_b": "Copper-containing intrauterine device",
"choice_c": "Etonogestrel subcutaneous implant",
"choice_d": "Levonorgestrel-only pill",
"choice_e": "Methotrexate injection",
"correct_answer": "D",
"explanation": "The most effective emergency contraceptive is a copper-containing intrauterine device (IUD), which can be placed up to 120 hours after intercourse. However, the copper-containing IUD is contraindicated in patients with acute cervicitis (mucopurulent discharge) due to the risk of pelvic inflammatory disease (Choice B). Therefore, oral levonorgestrel (Plan B) is the best option due to its high efficacy, ease of use, and lack of contraindication in cervicitis. (Choice C) The etonogestrel implant has a slow onset of action and is not for emergency use. Educational objective: First-line emergency contraception options include the copper-containing IUD and oral levonorgestrel.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_037",
"system": "Female reproductive system",
"stem": "A 49-year-old woman comes to the office due to vulvar lesions. The patient first noticed 2 small flat lesions several months ago that have since increased to 10-15 lesions. She is sexually active and has had 10 lifetime partners. Genital lesions are nonfriable, fungating, and nontender with no associated inguinal lymphadenopathy. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Condyloma acuminata",
"choice_b": "Condyloma lata",
"choice_c": "Lichen planus",
"choice_d": "Melanoma",
"choice_e": "Seborrheic keratosis",
"correct_answer": "A",
"explanation": "This patient has condyloma acuminata, caused by human papillomavirus (HPV) types 6 and 11. They classically appear as nonfriable, nontender, fungating lesions with no associated lymphadenopathy. (Choice B) Condyloma lata is a manifestation of secondary syphilis characterized by flat pink or gray velvety papules. (Choice E) Seborrheic keratosis typically has a velvety surface with a \"stuck-on\" appearance. Educational objective: Condyloma acuminata appear as multiple nonfriable, fungating lesions due to low-oncogenic-risk HPV.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
},
{
"id": "FREPRO_038",
"system": "Female reproductive system",
"stem": "A 58-year-old woman comes to the office due to leakage of urine. She has had increased urinary frequency, often voiding 1 or 2 times every hour. She has difficulty initiating urination and voids a small volume. She switched from sertraline to amitriptyline 4 months ago. Abdominal examination reveals a lower abdominal mass. Pelvic examination reveals continuous leakage of urine from the urethra. Postvoid residual volume is 500 mL. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Interstitial cystitis",
"choice_b": "Overflow incontinence",
"choice_c": "Urethral diverticulum",
"choice_d": "Urgency incontinence",
"choice_e": "Vesicovaginal fistula",
"correct_answer": "B",
"explanation": "Amitriptyline is a tricyclic antidepressant (TCA) with antimuscarinic effects, including urinary retention. This leads to overflow incontinence, which is characterized by continuous urinary leakage, a palpable lower abdominal mass (full bladder), and an elevated postvoid residual. (Choice D) Urgency incontinence does not cause urinary retention. (Choice E) Vesicovaginal fistula causes continuous leakage, but patients have a normal postvoid residual volume because the bladder continually empties. Educational objective: Overflow incontinence is caused by underactive detrusor function or outlet obstruction. Anticholinergic medications (eg, amitriptyline) relax the detrusor muscle, causing urinary retention and a large postvoid residual volume.",
"source": "ABIM - Female Reproductive System Breast - @USMLEWorldStep3.pdf"
}
]