[
  {
    "id": "GI_001",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 65-year-old man is evaluated for a 3-month history of malaise and abdominal distension with increasing abdominal girth. He has also had progressive shortness of breath and generalized weakness. Past medical problems include hypertension, hypercholesterolemia, type 2 diabetes mellitus, heart failure, and hepatitis C. The patient also has a history of prostate cancer, which was treated with radical prostatectomy and radiation therapy a year ago. He drinks 1 or 2 cans of beer a day and has smoked a pack of cigarettes daily for 20 years. He admits to using injection drugs in the past. Vital signs are within normal limits. Chest examination reveals basilar crackles in the lungs and a grade 2 systolic murmur along the left sternal border. The abdomen is nontender and distended with ascites. There is no rebound tenderness or rigidity. The liver edge is palpable 2 cm below the right costal margin and mild splenomegaly is present. There is 2+ bilateral lower extremity pitting edema. Laboratory results are as follows: Complete blood count: Leukocytes 9,000/mm3, Hemoglobin 10.8 g/dL, Platelets 160,000/mm3. Serum chemistry: Sodium 130 mEq/L, Potassium 4.8 mEq/L, Blood urea nitrogen 20 mg/dL, Creatinine 1.7 mg/dL. Liver function studies: Albumin 3.7 g/dL, Total bilirubin 2.3 mg/dL, Alkaline phosphatase 170 U/L, Aspartate aminotransferase 87 U/L, Alanine aminotransferase 74 U/L. Urinalysis: Protein 2+, Cells none, Casts occasional hyaline casts. Ascitic fluid analysis: Leukocytes 350/mm3, Neutrophils 20%, Lymphocytes 80%, Total protein 3.3 g/dL, Albumin 2.0 g/dL. Which of the following is the most likely cause of this patient's ascites?",
    "choice_a": "Cirrhosis",
    "choice_b": "Heart failure",
    "choice_c": "Nephrotic syndrome",
    "choice_d": "Peritoneal carcinomatosis",
    "choice_e": "Tuberculous peritonitis",
    "correct_answer": "B",
    "explanation": "Evaluation of the etiology of ascitic fluid should proceed in a stepwise fashion. In this patient: • Ascitic fluid leukocytes and neutrophils argue against infection (eg, bacterial peritonitis) or a significant inflammatory process (eg, malignancy, pancreatitis). • Serum-to-ascites albumin gradient (SAAG) ≥1.1 g/dL (1.7 g/dL in this patient) is indicative of portal hypertension, occurring in conditions including cirrhosis, heart failure, and Budd-Chiari syndrome (hepatic vein thrombosis). • Ascitic fluid total protein ≥2.5 g/dL makes an underlying low-protein state such as cirrhosis (decreased protein production) or nephrotic syndrome (increased urinary protein excretion) less likely. This patient with SAAG ≥1.1 g/dL and ascitic fluid total protein ≥2.5 g/dL has known heart failure and no evidence to suggest acute Budd-Chiari syndrome (eg, right upper quadrant pain, history of thrombophilia); therefore, decompensated heart failure is the most likely cause of ascites. (Choice A) Although cirrhosis (eg, due to hepatitis C virus) is the most common cause of ascites, it is a low-protein state; the SAAG is usually elevated due to portal hypertension, but the ascites total protein is usually low (<2.5 g/dL). (Choice C) Nephrotic syndrome is a low-protein state that does not cause portal hypertension. Therefore, ascites due to nephrotic syndrome typically has low total protein and low SAAG (<1.1 g/dL). This patient's proteinuria is most likely due to hypertensive or diabetic nephropathy in the absence of nephrotic syndrome. (Choices D and E) Peritoneal carcinomatosis and tuberculous peritonitis typically cause a high-protein ascites similar to heart failure. The SAAG is typically low, unlike in this patient. Portal hypertension can sometimes develop, resulting in a high SAAG. However, ascites due to heart failure is more likely in this patient with known history and evidence of current de-compensation (eg, lower extremity edema, congestive hepatopathy).",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_002",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 76-year-old woman comes to the physician for routine follow-up. She complains of frequent right knee pain and swelling that is relieved by daily naproxen. She was offered knee replacement surgery for her severe osteoarthritis, but she refused. She was diagnosed with stable angina five years ago and has not undergone any coronary intervention. She denies chest pain with mild exertion, but admits to occasional chest discomfort with moderate exertion. Her other medical problems include atrial fibrillation, hypertension, hyperlipidemia, and diet-controlled type 2 diabetes mellitus. Her current medications include warfarin with target INR 2-3, low-dose aspirin, metoprolol, enalapril, and rosuvastatin. She is an ex-smoker with a 35 pack-year smoking history. Her blood pressure is 130/69 mm Hg and pulse is 80/min and irregular. Her BMI is 42 kg/m2. A 2/6 mid-systolic murmur is heard at the left sternal border. Her lungs are clear. The right knee is mildly swollen and tender. Laboratory results are as follows: Creatinine 0.8 mg/dL, High density lipoprotein 35 mg/dL, Low density lipoprotein 65 mg/dL, Triglycerides 122 mg/dL, Hemoglobin A1c 7.2%. Which of the following additional medications would most likely benefit the patient?",
    "choice_a": "Clopidogrel",
    "choice_b": "Gemfibrozil",
    "choice_c": "Glyburide",
    "choice_d": "Lansoprazole",
    "choice_e": "Niacin",
    "correct_answer": "D",
    "explanation": "Non-steroidal anti-inflammatory drugs (NSAIDs) cause significant morbidity and mortality due to gastrointestinal (GI) toxicity, particularly in elderly patients. This patient has multiple risk factors for NSAID-associated GI toxicity. Current guidelines recommend switching high or moderate risk patients to a selective COX-2 inhibitor or combining NSAIDs with a PPI or misoprostol. Lansoprazole is approved in the U.S. for prevention of NSAID-induced ulcers. Additionally, patients should take the lowest possible dose of NSAIDs. This high risk patient should be placed on prophylaxis, since she will likely require long-term NSAIDs for osteoarthritis. (Choice A) The patient is on therapeutic doses of warfarin (goal INR 2-3) plus aspirin without embolic phenomena from atrial fibrillation. Adding clopidogrel would not reduce her embolization risk and it could significantly increase her bleeding risk. (Choice B) The patient's LDL cholesterol is below the recommended goal of <70 mg/dL with the use of a statin alone. Adding a fibrate would not benefit the patient and would increase the risk of statin myopathy. (Choice C) Elderly diabetics with multiple comorbidities have a recommended target HbA1c of 7.0-7.9%, rather than the commonly used goal of <7.0% in younger patients. A HbA1c <7.0% can increase the risk of hypoglycemic events in elderly patients, which further increases the risk of adverse cardiac events and cognitive impairment. Giving this patient glyburide would decrease her HbA1c of 7.2% and increase hypoglycemia risk. (Choice E) Niacin raises HDL but it has a higher side effect profile and lower cardiac benefit in a 76-year-old patient with optimal LDL and stable medical conditions.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_003",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 58-year-old woman comes to the office due to progressive fatigue over the last 2 years. She has also experienced generalized pruritus, for which she has used different lotions over the past year, but she has had no chest pain, abdominal pain, diarrhea, or weight loss. The patient takes lansoprazole for acid reflux, atorvastatin for hypercholesterolemia, and fosinopril for hypertension. She received a blood transfusion following a motor vehicle collision several years ago. The patient has no history of illicit drug use. She was adopted and her biological history is unknown. Temperature is 36.7 C (98 F), blood pressure is 144/89 mm Hg, and pulse is 78/min. BMI is 27 kg/m2. The patient appears healthy and well tanned although she denies sun exposure. There is no scleral icterus. Cardiac and pulmonary examinations are within normal limits. There is mild hepatomegaly. Laboratory results are as follows: Complete blood count: Hematocrit 36%, Leukocytes 4,100/mm3, Neutrophils 60%, Eosinophils 3%, Lymphocytes 35%, Monocytes 2%. Serum chemistry: Creatinine 0.8 mg/dL, Calcium 9.4 mg/dL, Glucose 100 mg/dL. Liver function studies: Total protein 8.0 g/dL, Albumin 3.4 g/dL, Total bilirubin 2.3 mg/dL, Direct bilirubin 1.9 mg/dL, Alkaline phosphatase 370 U/L, Gamma-glutamyl transferase (GGT) 140 U/L (normal: 11-45), Aspartate aminotransferase (SGOT) 77 U/L, Alanine aminotransferase (SGPT) 64 U/L. Which of the following is most likely in this patient?",
    "choice_a": "Elevated antimitochondrial antibody titer",
    "choice_b": "Elevated ferritin level",
    "choice_c": "Heavy alcohol intake history",
    "choice_d": "Positive hepatitis C serology",
    "choice_e": "Resolution of symptoms with statin discontinuation",
    "correct_answer": "A",
    "explanation": "This patient has fatigue, pruritus, and a cholestatic pattern on liver function tests (elevation of alkaline phosphatase and gamma-glutamyl transferase disproportionate to elevations in transaminases). In a young or middle-aged woman, this is consistent with primary biliary cholangitis (PBC; previously known as primary biliary cirrhosis). PBC is a progressive autoimmune disease that leads to fibrosis and destruction of the intrahepatic bile ducts. It is most common in women age 30-65. Over 50% of patients are asymptomatic at diagnosis and detected from typical biochemical abnormalities on liver function tests done for other purposes. Among symptomatic patients, fatigue and generalized pruritus (which may be worse at night) predominate. Marked hyperlipidemia may also be present, leading to formation of xanthomas and xanthelasmas. Also, patients often have additional autoimmune disorders (eg, CREST syndrome, type 1 diabetes mellitus, rheumatoid arthritis). Antimitochondrial antibodies (AMA) are highly sensitive and specific for PBC, and are diagnostic in the setting of cholestasis. Liver biopsy is indicated if AMA are negative or for staging purposes, but is not required for diagnosis in patients with biochemical and clinical evidence of PBC. (Choices B, C, D, and E) Patients with PBC often have hyperpigmentation due to abnormal melanin deposition. This may lead to mistaken suspicion for hereditary hemochromatosis. However, hemochromatosis is characterized by a hepatocellular injury pattern (predominant elevations in transaminases) rather than a cholestatic pattern. Other disorders characterized by a hepatocellular rather than cholestatic pattern include alcoholic liver disease, viral hepatitis (eg, hepatitis C), and statin-induced liver injury.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_004",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 38-year-old woman comes to the office due to constipation for the last 3-4 months. She has not had previous problems with bowel movements; however, she now spends 20-25 minutes having a bowel movement once every 3-4 days. The patient reports excessive straining; hard, pebble-like stools; incomplete evacuation; and intermittent digital disimpaction. She also has abdominal discomfort, bloating, and increased flatulence; all are relieved with bowel movements. Her appetite is good and her weight is stable. The patient's other medical problems include anxiety disorder, vitiligo, migraine headaches, and fibromyalgia. She uses ibuprofen occasionally and takes no other medications. She underwent cognitive-behavioral therapy for anxiety and panic attacks approximately 3 years ago. The patient does not use tobacco, alcohol, or illicit drugs. Her diet consists mainly of hamburgers, pizza, and fried foods. Family history is negative for colon cancer. Vital signs are normal. Physical examination shows no abnormalities. Laboratory results are as follows: Complete blood count: Leukocytes 7,400/mm3, Hemoglobin 11.6 g/dL, Hematocrit 36%, Mean corpuscular volume 102 fL, Platelets 280,000/mm3. Serum chemistry: Sodium 133 mEq/L, Potassium 4 mEq/L, Chloride 100 mEq/L, Calcium 9 mg/dL, Blood urea nitrogen 12 mg/dL, Creatinine 0.8 mg/dL, Glucose 100 mg/dL. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Check serum TSH",
    "choice_b": "Perform anorectal manometry",
    "choice_c": "Perform colonoscopy",
    "choice_d": "Recommend fiber, fluids, and exercise",
    "choice_e": "Repeat cognitive-behavioral therapy",
    "correct_answer": "A",
    "explanation": "Chronic constipation is defined as >3 months of symptoms, including a combination of <3 bowel movements per week and >25% of bowel movements requiring straining (ie, lumpy and hard stools, sensation of incomplete evacuation, requirement of digital evacuation). Poor dietary habits or adverse medication effects are often responsible, but patients with alarm features (eg, prominent, unexplained change in bowel habits) should be evaluated for other secondary causes (eg, malignancy, hypothyroidism). This patient's mild hyponatremia and history of autoimmune disease (vitiligo) raise suspicion for hypothyroidism; macrocytic anemia is present in approximately 10% of hypothyroidism cases due to concomitant pernicious anemia. All patients with chronic constipation should undergo initial evaluation with detailed history, physical examination, and basic laboratory testing (eg, complete blood count, serum glucose, serum creatinine, electrolytes). Those with alarm features should undergo further evaluation, including additional laboratory testing (eg, TSH, serum calcium), abdominal imaging, and/or colonoscopy, as suggested by the history. In patients with no alarm features and an unremarkable initial laboratory evaluation, a therapeutic trial of medication adjustment and/or dietary fiber intake and lifestyle modification is appropriate before additional testing is performed (Choice D). (Choice B) Anorectal manometry assesses anal sphincter and pelvic floor function to assist in identifying neurologic causes of chronic constipation (eg, pelvic floor dyssynergia, Hirschsprung disease). This and other motility testing is typically reserved for patients who fail a trial of diet and lifestyle modification. (Choice C) Colonoscopy is indicated in patients with unexplained chronic constipation who have alarm features and have not recently undergone colonoscopy screening. However, TSH testing is less invasive and more clinically appropriate in this patient and should be performed first. (Choice E) Cognitive-behavioral therapy may have a role in management of patients with severe irritable bowel syndrome symptoms and psychiatric comorbidity. However, common secondary causes should be excluded before employing psychological treatments.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_005",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 35-year-old man comes to the office due to bloating, excessive flatus, and loose stools since an episode of food poisoning several months ago. The patient had been on a cruise ship when he developed nausea, vomiting, and diarrhea. Several other patrons developed similar symptoms that resolved with supportive care only. The patient's current symptoms began 1-2 weeks after returning home and usually occur in the morning shortly after breakfast. His usual breakfast consists of coffee with whole milk and cereal or oatmeal. Soon after eating, he develops bloating followed by crampy abdominal pain and loose stools. The symptoms occasionally recur after dinner. Medical history is insignificant. The patient drinks 1 or 2 beers on weekends and does not use tobacco or illicit drugs. He reports no other recent travel outside the country or unusual food exposures. Vital signs are normal. The abdomen is soft and nontender. Bowel sounds are present with loud borborygmi. There is no hepatomegaly or splenomegaly. Stool occult blood testing is negative. Complete blood count, serum chemistries, TSH, erythrocyte sedimentation rate, and HIV serology are within normal limits. Which of the following is the best next step in management of this patient?",
    "choice_a": "Collect stool sample for microscopic analysis",
    "choice_b": "Order 72-hour fecal fat collection",
    "choice_c": "Prescribe a 3- to 5-day course of empiric ciprofloxacin",
    "choice_d": "Recommend a trial of dietary lactose avoidance",
    "choice_e": "Suggest a diet low in fermentable oligo-, di-, and monosaccharides and polyols",
    "correct_answer": "D",
    "explanation": "This patient most likely has secondary lactose intolerance, which can develop after acute infection or inflammation (eg, viral gastroenteritis, Crohn disease flare-up). Lactose intolerance is characterized by crampy abdominal pain, bloating, increased flatulence, and diarrhea, which occur after ingestion of lactose-containing products. Frequently, the only examination finding is increased borborygmi (bowel sounds). Stool examination may reveal an elevated osmotic gap (>125 mOsm/kg) and decreased pH (<6). Secondary lactose intolerance occurs due to inflammatory destruction of the terminal villi and subsequent loss of the lactase enzyme. Recovery of enzyme activity can occur, though it may take several months after the inflammatory insult ceases and healing begins. Management involves maintaining a lactose-restricted diet, enzyme replacement, and vitamin D and calcium supplementation. (Choice A) Stool microscopy is an important consideration in patients with acute-onset diarrhea, though it has a limited role in the evaluation of chronic diarrhea in high-income settings. One important consideration is giardiasis, which can result in secondary lactose intolerance; however, this patient has a convincing history for recent viral gastroenteritis and he lacks risk factors (eg, camping) and other key symptoms of chronic giardiasis (eg, weight loss, steatorrhea, malaise, fatigue). (Choice B) Fat malabsorption typically presents with pale, voluminous steatorrhea. Abdominal pain and increased flatulence are not common. (Choice C) Although empiric antibiotics may be considered for the treatment of acute diarrhea in certain circumstances (eg, severe symptoms), they do not have a major role in the management of undifferentiated chronic diarrhea. (Choice E) Irritable bowel syndrome, which may be treated by a diet low in fermentable oligo-, di-, and monosaccharides and polyols, also presents with chronic abdominal pain and diarrhea. However, patients typically do not relate symptoms of diarrhea to particular meals (eg, breakfast) and the abdominal pain is frequently related to defecation.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_006",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 78-year-old woman is brought to the office from a nursing home for evaluation of urinary and fecal incontinence. She has longstanding, episodic urinary incontinence but started to also have fecal incontinence over the last week. The stool is described as loose and moderate in volume. The patient has chronic constipation treated with a stable dose of laxatives, but these were discontinued at the onset of fecal incontinence. Her other medical problems include moderate dementia, hypertension, type 2 diabetes mellitus, osteoporosis, and well-controlled congestive heart failure. The patient is in a wheelchair for about 4 hours daily, but otherwise remains in bed. No new medications have been added recently. Vital signs are stable and unchanged from baseline. The abdomen is soft and nontender with distant but normoactive bowel sounds. Which of the following is the most likely mechanism of fecal incontinence in this patient?",
    "choice_a": "Autonomic neuropathy",
    "choice_b": "Decreased rectal compliance",
    "choice_c": "Overflow of stool",
    "choice_d": "Rectal prolapse",
    "choice_e": "Sphincter weakness",
    "correct_answer": "C",
    "explanation": "This elderly patient with a history of dementia, relative immobility, and chronic constipation is likely experiencing overflow fecal incontinence due to fecal impaction. Fecal impaction is common in the elderly and is associated with impaired mental function, immobility, inadequate fluid/dietary fiber intake, decreased sensation of stool in the vault, and chronic constipation. Impacted stool can apply pressure to the bladder and contribute to urinary incontinence. Fecal overflow incontinence occurs when loose or liquid stool flows around the impaction in the rectum. Evaluation of fecal incontinence begins with a perineal inspection and digital rectal examination. Patients with fecal impaction should undergo manual disimpaction and be placed on a chronic bowel regimen to prevent recurrence. (Choices A and E) Diabetic autonomic neuropathy can cause weakness of the anal sphincter and lead to fecal incontinence. Other causes of anal sphincter weakness include trauma (eg, operative vaginal delivery, anal surgery), spinal cord injury, and atrophy (eg, age-related, infiltration with systemic sclerosis). Although this patient has diabetes, diabetic autonomic neuropathy more commonly affects the upper gastrointestinal tract (eg, gastroparesis). When fecal incontinence does occur in autonomic neuropathy, it is typically associated with chronic, painless, watery diarrhea and the inability to retain stool in the rectum, rather than chronic constipation. (Choice B) Decreased rectal compliance results in the reduced ability to store fecal matter, leading to an increase in stool frequency, urgency, and fecal incontinence. However, it is most common in patients with a history of ulcerative or radiation proctitis. This patient's lack of prior diarrhea or history of radiation makes this unlikely. (Choice D) Rectal prolapse is associated with chronic constipation but usually presents with an anal mass, abdominal pain, blood and mucus in the stool, and a sensation of incomplete rectal emptying, which are not seen in this patient.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_007",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 54-year-old man comes to the physician for follow-up after routine screening colonoscopy. Two 6-mm sessile polyps were found in the sigmoid colon and were removed by cold biopsy. Histopathologic examination of the polyps revealed tubular adenomas with low-grade dysplasia. The patient's other medical problems include hypertension, reflux disease, osteoarthritis, and migraine headaches. His father was diagnosed with colon cancer at age 68. There is no other family history of malignancy. Physical examination shows no abnormalities. Which of the following studies is the best surveillance recommendation for this patient?",
    "choice_a": "Colonoscopy in 10 years",
    "choice_b": "Colonoscopy in 5 years",
    "choice_c": "Colonoscopy in 3 years",
    "choice_d": "Colonoscopy in 1 year",
    "choice_e": "CT colonography in 5 years",
    "correct_answer": "B",
    "explanation": "Colon polyps are usually classified as neoplastic or non-neoplastic. They may be further categorized based on endoscopic features into sessile, pedunculated, or flat polyps. Patients with neoplastic polyps (eg, serrated, hamartomatous, or adenomatous) are at higher risk of colorectal cancer and require increased periodic surveillance. The interval of surveillance is based on the number, size, and pathologic characteristics of the polyps (Table). This patient has 2 small tubular adenomas and thus requires repeat colonoscopy in 5 years. (Choice A) Non-neoplastic polyps (eg, hyperplastic) require routine screening at 10-year intervals. (Choice C) Patients with 3-10 adenomas, any adenomas > 1 cm, or with high-grade dysplasia or villous features should have a repeat colonoscopy in 3 years. (Choice D) Patients with more than 10 adenomas should have a repeat colonoscopy in 1-2 years. (Choice E) Flexible sigmoidoscopy, double-contrast barium enema, and CT colonography are accepted methods for screening of colorectal cancer in average-risk individuals when performed every 5 years. However, they should not be used in moderate-to-high-risk individuals such as this patient.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_008",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 32-year-old man is evaluated for a 3-month history of abdominal discomfort and diarrhea. He has had 3- 4 loose stools per day and abdominal cramping that is relieved by bowel movements. The patient has also had blood in the stool during the past week. He has had no fevers or night sweats. Four months ago, the patient was diagnosed with Clostridium difficile colitis after taking antibiotics for a sore throat and was prescribed oral vancomycin. He has no other chronic medical conditions and takes no medications. He does not use tobacco, alcohol, or illicit drugs. Temperature is 37.2 C (99 F), blood pressure is 112/76 mm Hg, and pulse is 88/min. The abdomen is soft with mild tenderness in the periumbilical and left lower-quadrant areas. There is no rebound tenderness or rigidity. Rectal examination shows guaiac-positive stool. Laboratory results are as follows: Hemoglobin 11.9 g/dL, Platelets 480,000/mm3, Leukocytes 11,400/mm3, Stool PCR test for Clostridium difficile toxin negative. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Colonoscopy with biopsy",
    "choice_b": "Duodenal aspiration",
    "choice_c": "Oral rifaximin",
    "choice_d": "Oral vancomycin",
    "choice_e": "Selective anaerobic culture",
    "correct_answer": "A",
    "explanation": "This patient with chronic abdominal pain, diarrhea, and guaiac-positive stool likely has inflammatory bowel disease (IBD). Most cases of IBD are diagnosed in individuals age 15-40. Patients with mild disease typically have <4 bowel movements/day that can be bloody and are associated with mild abdominal pain and tenesmus. Severe disease is characterized by frequent bloody stools, nausea/vomiting, systemic toxicity (eg, fatigue, fever), and rapid weight loss. Colonoscopy with biopsy is indicated for diagnosis, with examination of the terminal ileum (ileocolonoscopy) if ileocolonic Crohn disease is suspected (eg, right lower-quadrant pain, fistulas/perianal disease). Caution should be taken in patients with fulminant colitis due to the risk of perforation. IBD and Clostridium difficile infection (CDI) may have similar presenting features, and patients with IBD have a high prevalence of C difficile colonization, likely due to colonic inflammation and alterations of the enteric microbiome. CDI may also be responsible for approximately 5% of IBD relapses; therefore, patients with known IBD who develop disease flares should undergo screening for CDI. However, this patient's negative stool PCR assay and near-normal leukocyte count make recurrent CDI unlikely. (Choice B) Duodenal or jejunal aspirate or biopsy may be indicated in patients with small intestine bacterial overgrowth (SIBO) if noninvasive tests are equivocal. SIBO typically presents with malabsorption (eg, diarrhea, bloating, flatulence) in patients with risk factors (eg, blind intestinal loops, pancreatic insufficiency). Bleeding is unexpected. (Choices C, D, and E) A prolonged taper of oral vancomycin can be used to treat recurrent CDI, and rifaxamin is sometimes used as an adjunct therapy in those with multiple recurrences. Selective anaerobic stool culture for C difficile has limited clinical utility as it is time-consuming and cannot differentiate toxin- versus non-toxin-forming strains. The negative stool PCR assay and near-normal leukocyte count make CDI recurrence unlikely in this patient.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_009",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 40-year-old woman comes to the office for follow-up after a recent upper gastrointestinal endoscopy. She initially had a 3-month history of diarrhea and weight loss. The patient's tissue transglutaminase antibody (IgA) assay was positive, and small-bowel biopsy performed during the endoscopy confirmed the diagnosis of celiac disease. Since the endoscopy, she has been following a strict gluten-free diet and has experienced significant improvement in symptoms. The patient's medical history is unremarkable and she has had normal menstrual periods. Her only medication is a daily multivitamin, and she does not use tobacco, alcohol, or illicit drugs. Vital signs and physical examination are normal. Laboratory results show a hemoglobin level of 11.4 mg/dL (increased from 10.2 mg/dL 4 weeks ago). Which of the following additional tests is indicated at this time?",
    "choice_a": "Bone densitometry",
    "choice_b": "Echocardiogram",
    "choice_c": "No additional testing",
    "choice_d": "Repeat IgA tissue transglutaminase antibody level",
    "choice_e": "Repeat upper gastrointestinal endoscopy",
    "correct_answer": "A",
    "explanation": "Bone loss is very common in patients with celiac disease, largely due to malabsorption of vitamin D and resultant secondary hyperparathyroidism. Bone disease may present as asymptomatic osteopenia/osteoporosis or as osteomalacia with bone pain, muscle weakness, and impaired ambulation. Laboratory evaluation commonly shows low serum 25-hydroxyvitamin D and elevated parathyroid hormone levels. Alkaline phosphatase may be elevated, and hypocalcemia and hypophosphatemia may be observed in severe cases. In light of the increased risk of bone loss in patients with celiac disease, bone density measurement by DXA should be performed at the time of diagnosis, regardless of age or menopausal status (Choice C). Patients with bone disease should receive calcium and vitamin D supplementation. Bone density often improves with a gluten-free diet, and usually recovers more rapidly in the axial (eg, lumbar spine) than in the appendicular skeleton. (Choice B) Celiac disease is associated with a modestly increased risk of nonischemic dilated cardiomyopathy. Case reports suggest that myocardial function may recover completely with gluten restriction. However, cardiomyopathy due to celiac disease is rare, and screening echocardiography is not required in asymptomatic patients. (Choice D and E) Serum IgA tissue transglutaminase antibody (or deamidated gliadin antibody) levels can be used to assess the response of celiac disease to a gluten-free diet but may take 3-12 months to return to normal. Some experts also advise repeat upper endoscopy with biopsy to assess response, but this is typically done after 4-6 months of dietary modification or when a patient fails to improve as expected.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_010",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 55-year-old man comes to the physician with bloody diarrhea. He was hospitalized 2 weeks ago to receive chemotherapy for acute myeloid leukemia. He developed fever, bloody diarrhea, and right lower-quadrant abdominal pain 10 days after the first cycle. The pain has gradually worsened. His temperature is 38.7 C (101.6 F), blood pressure is 122/70 mm Hg, and pulse is 98/min. The abdomen is soft. There is marked tenderness, most notably in the right lower quadrant. There is no rigidity. His recently passed bowel movement shows liquid stool with maroon-colored blood. Laboratory results are as follows: Complete blood count: Hemoglobin 8.2 g/dL, Hematocrit 26%, Platelets 70,000/µL, Leukocytes 1,000/µL, Neutrophils 25%, Eosinophils 3%, Lymphocytes 30%, Monocytes 20%, Blasts 22%. Liver function studies: Bilirubin Total 3.3 mg/dL, Direct 1.0 mg/dL, Alkaline phosphatase 220 U/L, Aspartate aminotransferase (SGOT) 187 U/L, Alanine aminotransferase (SGPT) 199 U/L. Coagulation studies: Prothrombin time 12 sec, International Normalized Ratio 0.8. A contrast-enhanced computed tomography (CT) scan of the abdomen shows diffuse thickening of the colon with mucosal thumbprinting that is worse on the right side. There is no fluid collection or free air in the abdomen. Blood cultures, stool cultures, and stool for Clostridium difficile toxin assay have been sent. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Consult surgery for laparotomy",
    "choice_b": "Perform colonoscopy with biopsies",
    "choice_c": "Start cefepime plus metronidazole",
    "choice_d": "Start granulocyte colony-stimulating factor",
    "choice_e": "Start oral vancomycin and intravenous ganciclovir",
    "correct_answer": "C",
    "explanation": "This patient's presentation is most consistent with typhlitis (typhlon is Greek for cecum), also called neutropenic enterocolitis, a life-threatening infection common in patients with hematologic malignancies (eg, leukemia) who become neutropenic after chemotherapy. Typhlitis is due to intestinal mucosal injury (eg, from cytotoxic drugs), profound neutropenia (absolute count <500/mm3) and inability of the host to prevent microorganism invasion. Polymicrobial infection is often present. Patients typically present 10-14 days after chemotherapy with fever, right lower-quadrant abdominal pain, nausea with or without vomiting, and watery or bloody diarrhea. Peritoneal signs usually indicate perforation. Diagnosis is confirmed by abdominal CT scan showing a fluid-filled and distended cecum with a thickened wall, intramural air or edema, and mucosal thumbprinting. Patients should have stool assays for Clostridium difficile toxin as pseudomembranous colitis from C difficile can have a similar presentation. In addition, stool and blood cultures should be obtained. The mortality rate can be as high as 45%, so prompt diagnosis is essential. Patients with uncomplicated typhlitis (ie, no perforation, peritonitis, or severe gastrointestinal bleeding) are treated with broad-spectrum antibiotics (eg, cefepime or ceftazidime plus metronidazole), bowel rest, and supportive care (eg, transfusions and intravenous fluids). Empiric therapy for C difficile should be used until the infection is ruled out. Antifungal therapy should be added if fever persists >72 hours. Surgery is reserved for complicated typhlitis and uncomplicated patients who deteriorate clinically with conservative management (Choice A). (Choice B) Colonoscopy is usually contraindicated in neutropenic and thrombocytopenic patients as air insufflation can cause perforation. However, patients with suspected pseudomembranous colitis and negative stool studies may sometimes require a sigmoidoscopy to help confirm diagnosis. This patient should first await the results of stool studies and be treated with conservative management. (Choice D) Granulocyte colony-stimulating factor (G-CSF) can be used as an adjunct to bowel rest and antibiotics to help healing of bowel lesions and contain infection. However, G-CSF does not significantly affect the prognosis or mortality. (Choice E) Oral vancomycin can be used empirically for possible C difficile infection, but ganciclovir is not indicated.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_011",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 44-year-old woman comes to the office due to fatigue. Medical history is notable for hypertension, obesity, and hypothyroidism; current medications include hydrochlorothiazide, amlodipine, and levothyroxine. The patient does not use tobacco but drinks 1 or 2 glasses of wine on weekends. She stopped using recreational drugs approximately 10 years ago. Examination shows multiple skin xanthelasmas, a few scattered hyperpigmented spots, and tenderness in the right upper quadrant of the abdomen. The liver is palpable 3 cm below the costal margin and mild splenomegaly is present. Laboratory results are as follows: Complete blood count: Hemoglobin 12.4 g/dL, Hematocrit 36%, Platelets 120,000/mm3, Leukocytes 6,900/mm3. Liver function studies: Albumin 3.1 g/dL, Bilirubin Total 1.8 mg/dL, Direct 1.0 mg/dL, Alkaline phosphatase 420 U/L, Aspartate aminotransferase (SGOT) 37 U/L, Alanine aminotransferase (SGPT) 24 U/L. Autoimmune antibodies: Antinuclear antibody 1:120 (normal: ≤1:40), Anti-mitochondrial antibody 1:280 (normal: ≤1:40). Hepatitis panel: Hepatitis B surface antibody positive, Hepatitis B core antibody (IgG) positive, Hepatitis C virus antibody negative. Which of the following is this patient at the highest risk of developing?",
    "choice_a": "Aplastic anemia",
    "choice_b": "Cryoglobulinemia",
    "choice_c": "Osteoporosis",
    "choice_d": "Polyarteritis nodosa",
    "choice_e": "Severe atherosclerosis",
    "correct_answer": "C",
    "explanation": "This patient's presentation is consistent with primary biliary cholangitis (PBC, formerly primary biliary cirrhosis). PBC is due to autoimmune destruction of intralobular bile ducts and predominantly affects women age 30-65. Patients with PBC typically have a cholestatic injury pattern on liver biomarkers (disproportionate elevation in alkaline phosphatase and bilirubin compared to transaminases), and anti-mitochondrial antibodies are positive in ~95% of cases. Antinuclear antibodies are present in approximately 70% of patients and correlate with a poor prognosis. The diagnosis can be confirmed with liver biopsy. Up to 50% of patients develop metabolic bone disease, which may manifest as osteoporosis and/or osteomalacia. The cause of osteoporosis in PBC is unknown but is thought to be due to cholestasis leading to an accumulation of substances that inhibit bony turnover. Additionally, the disease predominately affects middle aged female patients who are already at risk for osteoporosis. Patients may have malabsorption of fat-soluble vitamins, but those with PBC-related osteoporosis usually have normal vitamin D levels. Nevertheless, patients with PBC should receive routine supplementation with calcium and vitamin D in addition to regular bone density screening. (Choices A and D) This patient has evidence of prior hepatitis B infection and recovery, with positive hepatitis B surface and core antibodies. Aplastic anemia may rarely occur in hepatitis B, but it is not usually a complication of PBC (this patient's mild thrombocytopenia is most likely due to portal hypertension). Polyarteritis nodosa is a possible complication of chronic hepatitis B but not PBC. (Choice B) Cryoglobulinemia is typically associated with hepatitis C, but it is not usually seen with PBC. This patient has a negative hepatitis C antibody screen. (Choice E) Patients with PBC can develop significant hypercholesterolemia (sometimes >1,000 mg/dL), which leads to xanthelasmata and xanthomas. However, these patients are not at increased risk for coronary artery disease, possibly due to marked elevation of HDL but only mildly elevated LDL and VLDL.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_012",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 22-year-old man comes to the physician after an episode of bloody stool 3 weeks earlier. He has had similar episodes in the past with no intervention, but the last time he went to the emergency department. After initial evaluation and laboratory workup, he was discharged with outpatient follow-up. The patient has no other medical problems and takes no medications. He was adopted at a young age. He smokes 1 pack of cigarettes a day but does not use alcohol or illicit drugs. Physical examination shows multiple brown spots on the lips and buccal mucosa. The abdominal examination is unremarkable. Rectal examination reveals brown stool with no hemorrhoids or perianal lesions. Which of the following conditions is this patient at the highest risk of developing?",
    "choice_a": "Chronic pancreatitis",
    "choice_b": "Intestinal cancer",
    "choice_c": "Liver cirrhosis",
    "choice_d": "Perirectal fistulas",
    "choice_e": "Polycystic kidneys",
    "correct_answer": "B",
    "explanation": "This patient with mucocutaneous pigmentation (melanin spots) and history of bloody stools likely has Peutz-Jeghers syndrome (PJS). PJS is a rare autosomal dominant disorder with multiple hamartomatous gastrointestinal tract polyps and pigmented mucocutaneous papules. It has no racial predilection and occurs with equal frequency in men and women. Skin lesions are present in 95% of patients at birth and manifest as flat, gray-to-brown spots measuring about 1-5 mm that are usually located on the lips, perioral area, buccal mucosa, hands, and feet. They can be differentiated from freckles, which are not present at birth and do not occur on the buccal mucosa. These pigmented lesions are benign and malignant transformation is very rare. Gastrointestinal polyps range in size (0.1-5 cm), number (1-20), and type (eg, sessile and pedunculated). They are found in the small intestine, colon, stomach, and rectum. Patients usually present at age 10-30 years with symptoms such as obstruction (intussusception or occlusion of the lumen by a polyp), abdominal pain, or rectal bleeding. Risk of malignancy is increased in patients with PJS for both gastrointestinal (eg, colorectal, stomach, small bowel, and pancreas) and non-gastrointestinal (eg, lung, testicular, breast, and ovary) cancers. Aggressive surveillance for these cancers is recommended. (Choices A, C, D, and E) Patients with PJS are not at increased risk of developing chronic pancreatitis, liver cirrhosis, perirectal fistulas, or polycystic kidneys. Perirectal fistulas are most common in patients with Crohn's disease, radiation proctitis, and lymphogranuloma venereum.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_013",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 48-year-old man comes to the office to discuss weight loss. For the past 6 months, he and his wife have been following a low-fat diet and exercising regularly. However, the patient has not achieved satisfactory weight loss. Medical history is unremarkable, but family history is notable for cardiovascular disease in both parents. The patient quit smoking 13 years ago and has a 10-pack-year history; he drinks alcohol only on social occasions. Blood pressure is 133/86 mm Hg and pulse is 78/min. BMI is 29 kg/m2. The patient appears moderately overweight but comfortable. Physical examination is otherwise normal. Laboratory results show fasting blood glucose 105 mg/dL, total cholesterol 210 mg/dL, HDL cholesterol 40 mg/dL, and triglycerides 185 mg/dL. The patient indicates that he and his wife intend to start a very low-carbohydrate diet. Compared to his current program, which of the following is this patient most likely to experience after changing his diet?",
    "choice_a": "Greater long-term weight loss",
    "choice_b": "Higher cardiovascular mortality",
    "choice_c": "Higher incidence of gastrointestinal symptoms",
    "choice_d": "Increased fasting glucose",
    "choice_e": "Less reduction in blood pressure",
    "correct_answer": "C",
    "explanation": "Numerous weight loss diets have been promoted, including low-fat, low-carbohydrate, balanced low-calorie, and Mediterranean-style (high intake of monounsaturated fats, vegetables, and grains; low intake of red meat). Studies on the relative effectiveness of various weight loss diets have not shown clear superiority of one over another. Successful weight loss likely depends more on patient factors (eg, total caloric intake, long-term adherence, concurrent exercise) than on the specific dietary plan. Low-carbohydrate diets can produce rapid initial weight loss. They are more effective for weight loss in the short term than low-fat diets, although this is likely due to mobilization of glycogen stores and fluid losses rather than fat loss. Long-term studies have not found greater sustained weight loss compared with low-fat diets at 1 year (Choice A). Low-carbohydrate diets that emphasize mono- and polyunsaturated fat sources (eg, fish, poultry, legumes) have been associated in observational studies with reduced cardiovascular and all-cause mortality (Choice B). However, low-carbohydrate diets are associated with increased incidence of unpleasant gastrointestinal effects (eg, bloating, diarrhea, constipation), headache, and reduced exercise tolerance. (Choices D and E) Both low-fat and low-carbohydrate diets are associated with a reduction in fasting glucose and blood pressure, and comparative studies have not noted a clinically significant difference between the 2 strategies in these measures.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_014",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 34-year-old woman comes to the office for an annual preventive visit. She feels well, has no chronic medical conditions, and takes no medications. The patient does not use alcohol but has smoked a pack of cigarettes a day for the last 15 years. She occasionally used intranasal cocaine and intravenous drugs while in college 14 years ago. She is sexually active with a long-time partner and has never been incarcerated. Family history is negative for heart disease and cancer. Vital signs and physical examination are normal. HIV test was negative 3 years ago, and Pap test was normal 2 years ago. Which of the following is the most appropriate screening test for this patient?",
    "choice_a": "Anti-hepatitis C antibody",
    "choice_b": "Chest x-ray",
    "choice_c": "Cholesterol panel",
    "choice_d": "Herpes simplex virus serology",
    "choice_e": "Nucleic acid amplification test for chlamydia and gonorrhea",
    "correct_answer": "A",
    "explanation": "Hepatitis C virus (HCV) has a long presymptomatic phase that can last decades. Untreated infection increases the risk for cirrhosis and hepatocellular carcinoma, but effective treatment can lower the risk of complications. HCV is therefore an ideal candidate for an organized screening program. The US Preventive Services Task Force recommends one-time screening for HCV in individuals at increased risk. Major risk factors include: • Current or past injection or intranasal drug use (as in this patient) • Blood transfusion before 1992 • Long-term hemodialysis • Being born to an HCV-infected mother • Incarceration • Unregulated tattoos • Percutaneous exposure (eg, occupational needlestick injury). The prevalence of HCV is also elevated in individuals born between 1945 and 1965 (baby boomers) and screening is recommended. Although the prevalence is increased in individuals who engage in high-risk sexual behavior (eg, multiple partners, unprotected sex), the transmission rate via sexual activity is low, and this excess risk may be attributable to other known risk factors. (Choice B) Screening for lung cancer with low-dose CT scan is recommended for patients age 55-80 who have a ≥30-pack-year smoking history and who are currently smoking or have quit within the last 15 years. Screening with chest x-ray has low sensitivity and is not recommended. (Choice C) Although the treatment of hyperlipidemia lowers the risk of coronary events, recommendations for screening are hampered by lack of prospective trials. Screening may be reasonable for patients with diabetes or hypertension, men age ≥35, and women age ≥45 who have additional cardiovascular risk. Screening in younger women likely has minimal benefit. (Choice D) Herpes simplex virus has a high prevalence but does not have a long asymptomatic phase in most patients. In addition, antiviral medication is not curative and does not alter the course of the disease. Furthermore, serologic screening has low specificity. Screening is not recommended for any patient groups. (Choice E) Screening for gonorrhea and chlamydia is recommended for sexually active women age <24 and older women at increased risk (eg, new or multiple sex partners, exchanging sex for money or drugs). This patient is at average risk, and screening is not indicated.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_015",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 35-year-old man comes to the office to discuss colorectal cancer screening. His father was diagnosed with colon cancer at age 55 and underwent hemicolectomy at that time. The patient has no symptoms and is feeling well. He is quite active and runs 3 miles a day. The patient has not experienced weight loss, change in bowel habits, or rectal bleeding. He does not use tobacco or illicit drugs but drinks 1 or 2 cans of beer on weekends. There is no other family history of colon polyps or malignancy. Physical examination is unremarkable. Which of the following is the most appropriate recommendation for this patient regarding screening for colorectal cancer?",
    "choice_a": "Colonoscopy at age 40",
    "choice_b": "Colonoscopy at age 45",
    "choice_c": "Colonoscopy at age 50",
    "choice_d": "CT colonography at age 50",
    "choice_e": "Flexible sigmoidoscopy at age 45",
    "correct_answer": "A",
    "explanation": "For patients at average risk, screening for colorectal cancer should begin at age 50. Preferred options include colonoscopy every 10 years or fecal immunochemical test (FIT) yearly. Acceptable alternate strategies include CT colonography every 5 years, FIT-DNA testing every 3 years, or flexible sigmoidoscopy every 5-10 years. However, this patient is at increased risk due to a history of colorectal cancer in a first-degree relative at age <60. Current recommendations advise that such patients receive screening colonoscopy every 5 years beginning at age 40 (or 10 years prior to the age of diagnosis of colon cancer in the family, whichever comes first) (Choices B and C). For patients who do not wish to undergo colonoscopy, FIT may be an acceptable second-line option. (Choice D) Recent studies have found that CT colonography is effective for screening in high-risk patients, but it has lower sensitivity than colonoscopy. It is not currently recommended for routine use in high-risk patients. (Choice E) Flexible sigmoidoscopy does not visualize the proximal colon and is not recommended for high-risk patients.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_016",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 53-year-old woman comes to the physician complaining of lower-extremity numbness over the last several months. Her numbness is worse at night and causes her to stumble a lot, but she has not had any major falls. She has become more irritable and may have had some memory loss recently. The patient has no muscle weakness, language difficulties, or vision problems. Her bowel movements are predominantly loose. Her medical problems include a roux-en-Y gastric bypass surgery 3 years ago, hypertension, chronic back pain, and diet-controlled diabetes mellitus after successful weight loss. The patient's medications include lisinopril, amlodipine, chlorthalidone, and a multivitamin. She works as an administrative assistant and has no work-related problems. Her vital signs are within normal limits. Body mass index is 29 kg/m2. Examination shows decreased sensation to light touch in her feet and lower legs. She also has loss of vibration and proprioception in her feet bilaterally. Strength, tone, and bulk are within normal limits. Gait is narrow based and steady. The remainder of the examination is within normal limits. Which of the following is the most likely cause of her symptoms?",
    "choice_a": "Diabetic neuropathy",
    "choice_b": "Drug-induced neuropathy",
    "choice_c": "Vitamin A deficiency",
    "choice_d": "Vitamin B12 deficiency",
    "choice_e": "Zinc deficiency",
    "correct_answer": "D",
    "explanation": "Roux-en-Y gastric bypass (RYGB) does not usually affect macronutrient absorption but can affect micronutrient absorption, as shown in the Table. RYGB patients have increased risk for deficiency of calcium, iron, vitamin B12, fat-soluble vitamins (A, D, E, and K), thiamine, and folate. Inadequate calcium and vitamin D intake, combined with the decreased absorption, can lead to secondary hyperparathyroidism, osteopenia, and metabolic bone disease. With RYGB, the majority of the stomach is bypassed, leading to possible vitamin B12 deficiency as the ingested vitamin does not pass through this intrinsic factor-producing setting. Patients commonly present with cognitive deficits and peripheral neuropathy, as seen in this patient. Daily oral B12 supplementation may help reverse the neuropathy. Intravenous or intramuscular B12 may be required in patients who do not improve on oral B12. Monitoring of serum B12 and other micronutrients should be done at 3 months, 6 months, and annually after RYGB. (Choice A) Diabetic neuropathy is unlikely to cause memory problems. (Choice B) Drug-induced peripheral neuropathy is common with chemotherapy drugs, amiodarone, and other medications. This patient is not taking any medications that commonly cause peripheral neuropathy. (Choice C) Vitamin A deficiency has been associated with night/complete blindness, poor bone growth, dermatologic issues, and immune deficiencies, which are not seen in this patient. (Choice E) Zinc deficiency may present with abdominal pain, anorexia, depression, compromised wound healing, and immune dysfunction.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_017",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 77-year-old man is brought to the office by his daughter because of weight loss and poor appetite. The patient denies having any problems and states that his daughter worries unnecessarily. The daughter agrees that she has become overly concerned about her father's health since his stroke three months ago. According to her, he has lost 10-15 pounds since then and sometimes takes a long time to finish his meals. He also suffers from coughing spells during his meals which usually lasts a couple of minutes. She has not noticed any other symptoms except for some slurred speech. His medical history is significant for an ischemic stroke, hypertension, diabetes mellitus, arthritis, and depression. He had a recent hospitalization for pneumonia 1 month ago. He is currently taking atenolol, baby aspirin, insulin, and trazodone. He intermittently takes over-the-counter naproxen. His dentist started him on an unknown antibiotic 5 days ago. He has a 20-pack-year smoking history, but quit smoking 30 years ago. He stopped drinking alcohol after the stroke, but otherwise says he has enjoyed a glass of wine everyday of his life. Physical examination shows a thin-built elderly man. His blood pressure is 152/72mmHg, pulse is 55/min, and BMI is 19 kg/m2. He has some halitosis, decaying molars bilaterally, and dry oral mucosa. Minimal crackles are heard at the right lung base. There is trace peripheral edema on both lower extremities. Which of the following is the best next step in evaluating this patient?",
    "choice_a": "Order a CT scan of the neck and chest",
    "choice_b": "Order a modified barium swallow",
    "choice_c": "Refer to nutritionist for dietary adjustments",
    "choice_d": "Schedule for outpatient upper GI endoscopy",
    "choice_e": "Stop naproxen and the antibiotic and prescribe omeprazole",
    "correct_answer": "B",
    "explanation": "In this elderly patient with a history of stroke, recent pneumonia, and symptoms of coughing spells after liquid intake, concern for oropharyngeal dysphagia is high. Oropharyngeal dysphagia is caused by disrupted neuromuscular coordination required for deglutition and is commonly seen in stroke patients. The main symptoms of oropharyngeal dysphagia are: coughing/choking spells, nasal regurgitation, prolonged swallowing effort, or difficulty in initiation of swallows with a feeling of obstruction at the level of the neck. Oropharyngeal dysphagia is best diagnosed/assessed by a modified barium swallow (MBS) or videofluoroscopy performed in the presence of an expert speech pathologist and radiologist. It is important to diagnose it early as failure to do so can lead to aspiration pneumonia, which carries a high morbidity and mortality. This patient has already had an episode of pneumonia, thus making it even more important to diagnose and treat oropharyngeal dysfunction. (Choice A) Various mechanical factors (e.g., osteophytes, Zenker's diverticulum, etc.) could cause oropharyngeal dysphagia. In the presence of a classic history, the next step would be to confirm oropharyngeal dysfunction before working up the etiology. Additionally, these mechanical factors may be discovered on the MBS itself and would not require a CT of the neck/chest. (Choice C) Dietary adjustments may be required, but confirmation of the diagnosis and assessment of the aspiration risk is essential to determine the needed consistency of a modified diet (e.g., thick, mechanically soft, puree diet, etc.) as well as the route of administration (e.g., oral, PEG tube, etc.). (Choice D) Endoscopy is good tool to assess esophageal abnormalities, but it would not help with oropharyngeal dysphagia. (Choice E) Pill-esophagitis is possible given the patient's new-onset chest pain, but stopping the antibiotic without confirming its role in causation would not be recommended. Furthermore, this does not explain the high aspiration risk.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_018",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 52-year-old woman comes to the office due to abdominal discomfort and bloating accompanied by watery diarrhea for the past 6 months. The patient has lost 9 kg (20 lb) during this period. Review of systems reveals gastroesophageal reflux symptoms and color changes in her fingers consistent with Raynaud's phenomenon, which has been present for 2 years. The patient has no other past medical history, and her only medication is over-the-counter omeprazole as needed. She drinks 2 or 3 glasses of wine on weekends and does not smoke. Vital signs are within normal limits. BMI is 20 kg/m2. There are patchy areas of skin thickening on the patient's chest, upper back, forearms, and legs. Skin over the fingers appears tight with a tapering appearance of the fingertips. Heart and lung sounds are normal. Abdominal examination shows diffuse, mild tenderness with no guarding or rebound tenderness. There is no hepatosplenomegaly, and bowel sounds are normal. Joint examination shows no abnormalities. Laboratory studies are as follows: Hemoglobin 10.0 g/dL, Mean corpuscular volume 102 fL, Serum creatinine 0.6 mg/dL, Antinuclear antibody positive, Anti-Scl-70 (topoisomerase I) antibody positive. Stool studies are negative for pathogenic bacteria, ova, and parasites. Colonoscopy reveals scattered diverticulosis, and random biopsies reveal no abnormalities. Which of the following would be most helpful to relieve this patient's gastrointestinal symptoms?",
    "choice_a": "Antibiotic therapy",
    "choice_b": "Calcium channel blocker",
    "choice_c": "Pancreatic enzyme supplements",
    "choice_d": "Prokinetic agents",
    "choice_e": "Systemic glucocorticoids",
    "correct_answer": "A",
    "explanation": "This patient has systemic sclerosis (SSc) with Raynaud's phenomenon, gastroesophageal reflux, and a positive anti-Scl-70 antibody assay. In SSc, collagen deposition and smooth muscle atrophy in the gastrointestinal tract cause reduced peristalsis and intestinal dilation. This allows for colonization of the small intestine by large numbers of colonic bacteria, leading to small intestinal bacterial overgrowth (SIBO) in up to 30% of SSc patients. Common symptoms include bloating, discomfort, and diarrhea. Later, as fat malabsorption ensues, the patient may develop steatorrhea, weight loss, and nutritional deficiencies. Laboratory studies commonly show macrocytic anemia due to vitamin B12 deficiency. SIBO is diagnosed with a positive carbohydrate breath test or a jejunal aspirate culture showing high bacterial concentrations. Many patients have symptomatic improvement following 14 days of antibiotics; rifaximin is most commonly used, but other regimens are also effective. However, up to 45% of patients develop recurrent symptoms and may require repeated or prolonged therapy with multiple antibiotic regimens. (Choice B) Nifedipine is effective for the treatment of Raynaud's phenomenon in SSc. However, it may aggravate acid reflux symptoms and will not address the bacterial overgrowth. (Choice C) SIBO can develop in patients with chronic pancreatitis as the absence of proteolytic enzymes allows for bacterial overgrowth. However, chronic pancreatitis typically develops over a period of years, and patients experience multiple episodes of severe abdominal pain, often associated with excess alcohol use. In addition, even in patients with pancreatic insufficiency complicated by SIBO, pancreatic enzymes alone (ie, without antibiotics) are unlikely to reduce bacterial burden. (Choice D) Prokinetic agents (eg, metoclopramide, erythromycin) are useful in the management of gastroparesis in SSc but are not as effective in treating bacterial overgrowth and malabsorption. They can be added in patients who do not respond to antibiotics and have documented dysmotility. (Choice E) Low-dose glucocorticoids are sometimes used as adjunctive therapy with immunosuppressive agents for SSc-associated interstitial lung disease. However, some studies have shown a strong association between glucocorticoid use and SIBO; the use of glucocorticoids should be avoided if possible.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_019",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 62-year-old man comes to the physician complaining of dysphagia for both solids and liquids for the past 3 months. He also reports a bad taste in his mouth and frequent regurgitation. He has lost 10 pounds (4.5 Kg) in the last 2 months. His past medical history is significant for hypertension, chronic low back pain, and diverticulitis. There is no family history of malignancy. He has a 20-pack-year smoking history and drinks 2-3 beers daily. The patient's blood pressure is 142/78 mm Hg and pulse is 92/min. His BMI is 25 kg/m2. Physical examination shows poor dentition and halitosis. The remainder of the examination is within normal limits. His barium swallow is shown in this exhibit [image shown of 'bird-beak' narrowing]. Which of the following is the best next step in management of this patient?",
    "choice_a": "Order CT scan of the chest",
    "choice_b": "Perform esophageal manometry",
    "choice_c": "Perform upper GI endoscopy",
    "choice_d": "Schedule for pneumatic dilatation",
    "choice_e": "Start high-dose proton-pump inhibitor",
    "correct_answer": "C",
    "explanation": "This patient's presentation with dysphagia, regurgitation, and mild weight loss, and barium swallow findings (classic \"bird-beak\" appearance in the terminal esophagus) suggest achalasia. However, he is elderly (> 60 years) and had a rather acute onset of dysphagia (< 6 months). Pseudoachalasia from tumor at the gastroesophageal junction should be suspected. Barium swallow study is preferred to screen for achalasia and usually shows a dilated esophagus with bird-beak narrowing at the terminal and aperistalsis during fluoroscopy. Manometry can confirm the diagnosis and shows elevated lower esophageal sphincter (LES) pressure and incomplete relaxation as well as aperistalsis. However, manometry cannot differentiate between primary idiopathic achalasia and pseudoachalasia. As a result, endoscopy is recommended prior to manometry in all suspected cases of pseudoachalasia to rule out malignancy (Choice B). Endoscopy may show a dilated esophagus with residual food debris, possible inflammation or ulceration, and Candida infection from esophageal stasis. The LES may not open spontaneously, but the scope can be advanced into the stomach with gentle pressure. However, in cases of neoplasm or strictures, it is not possible to advance the scope into the stomach. Achalasia treatment consists of medical therapy (eg, nitrates and calcium channel blockers) or botulinum toxin injection for patients at poor operative risk. Patients who are generally healthy and can tolerate surgery can undergo pneumatic dilatation or surgical myotomy (Choice D). (Choice A) CT scan of the chest may show tumor at the gastroesophageal junction, but endoscopy will still be required to obtain tissue diagnosis and should be performed next in this patient. (Choice E) Starting the patient on a proton-pump inhibitor may reduce some symptoms of reflux but will not solve the problem of dysphagia or regurgitation caused by achalasia.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_020",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 46-year-old man comes to the physician because of recurrent abdominal discomfort. He describes episodes of moderate, dull, epigastric pain lasting 2-3 days that have occurred 1-2 times/month over the last 2 years. He also describes occasional nausea but denies any vomiting, diarrhea, black stools, blood in the stool, abdominal distention, or weight loss. He takes ibuprofen for chronic low back pain. He drinks 8-10 beers over the weekends and frequently throughout the week. His vital signs are within normal limits and his BMI is 28 kg/m2. Physical examination is unremarkable. Fasting blood glucose is 127 mg/dL. Abdominal x-ray shows focal calcifications anterior to the spine over the epigastric area. Upper GI endoscopy reveals a normal esophagus, gastric varices in the fundus of the stomach, and a normal duodenum. Which of the following is the most likely diagnosis?",
    "choice_a": "Alcoholic liver cirrhosis",
    "choice_b": "Gastroparesis",
    "choice_c": "Helicobacter pylori infection",
    "choice_d": "Non-ulcer dyspepsia",
    "choice_e": "Splenic vein thrombosis",
    "correct_answer": "E",
    "explanation": "This patient's presentation is consistent with chronic pancreatitis due to excessive alcohol intake. Abdominal x-rays typically show calcifications in the area of the pancreas. The splenic vein runs along the posterior surface of the pancreas, where chronic pancreatic inflammation can lead to thrombosis. Splenic vein thrombosis leads to gastric varices near the gastric fundus only; esophageal varices are not seen. Variceal hemorrhage is the most common symptom of splenic vein thrombosis and splenectomy is usually curative. (Choice A) Cirrhosis causes scarring in the liver that leads to increased sinusoidal vascular pressures and portal hypertension. These patients typically present with esophageal varices, diffuse gastric varices (not just gastric fundus), and rectal varices (hemorrhoids). (Choice B) Gastroparesis is usually a complication of diabetes (rather than chronic pancreatitis) and causes delayed gastric emptying. Patients typically present with nausea/vomiting and bloating, and endoscopy will not show varices. (Choice C) Helicobacter pylori is a common cause of ulcer disease and may be associated with dyspepsia. This patient's use of alcohol and NSAIDs increases his risk of peptic ulcer disease, but his endoscopy showing varices make this less likely. (Choice D) Non-ulcer dyspepsia is usually diagnosed after excluding other etiologies (e.g., peptic ulcer disease, GERD, and malignancy). However, this patient's abnormal endoscopy showing varices makes this unlikely.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_021",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 63-year-old man comes to the physician with a 4-week history of rectal pain and occasional rectal bleeding. He initially thought he had hemorrhoids and applied over-the-counter creams without significant relief. He had prostate cancer treated with external beam radiation therapy 1 year earlier. The patient is an ex-smoker with a 30-pack-year history but does not use alcohol or illicit drugs. He lives with his girlfriend of 10 years. His blood pressure is 128/68 mm Hg, pulse is 76/min, and respirations are 14/min. Cardiopulmonary examination is normal. The abdomen is soft and nontender to palpation. Rectal examination reveals guaiac-positive brown stool. Laboratory results are as follows: Hematocrit 33%, Mean corpuscular volume 79 fL, Platelets 260,000/µL, Leukocytes 7,500/µL. Sigmoidoscopy shows rectal mucosal pallor with friability and several telangiectasias. Which of the following is the most likely cause of this patient's condition?",
    "choice_a": "Androgen deprivation",
    "choice_b": "Collagenous colitis",
    "choice_c": "Human papillomavirus infection",
    "choice_d": "Inflammatory bowel disease",
    "choice_e": "Radiation injury",
    "correct_answer": "E",
    "explanation": "This patient with a history of prostate cancer and radiation therapy likely has radiation proctitis. Radiation injury most commonly affects the rectosigmoid colon and occurs following treatment of lower gastrointestinal (eg, anus, rectum) or genitourinary (eg, cervix, prostate) malignancies. Prostate cancer treatment is the most common reason for radiation injury to the rectum due to the higher doses used compared with other malignancies. Both acute and chronic radiation injuries can occur and differ in time from radiation and type of symptoms. Acute radiation proctitis occurs during or within 6 weeks of radiation therapy. Symptoms include diarrhea, tenesmus, and, rarely, bleeding. They usually resolve once radiation is stopped but can continue for up to 1 year after treatment discontinuation. Chronic radiation proctitis occurs much later, often 9-12 months (sometimes longer) after radiation therapy. It is caused by intestinal epithelial atrophy and fibrosis accompanied by mucosal ischemia, often leading to stricture formation and bleeding. Clinical features of chronic radiation proctitis include diarrhea, fecal obstruction, bleeding, tenesmus, and fecal incontinence. Injury to the genitourinary tract or small bowel can lead to complications such as fistula formation, small bowel obstruction, and cystitis. There is also an increased risk of secondary malignancy (eg, colorectal cancer) in patients exposed to radiation. Diagnosis can be confirmed with sigmoidoscopy or colonoscopy, which may reveal large, continuous areas of mucosal pallor with friability and telangiectasias. Rectal biopsies, if needed, should be performed judiciously due to the risk of fistula formation. Treatment of acute radiation proctitis includes butyrate enemas to promote rapid healing. Mild bleeding due to chronic radiation proctitis does not require treatment. Other therapies for chronic radiation proctitis depend on the severity of symptoms and include sucralfate enemas, stool softeners, endoscopic therapy, and surgery for patients with intractable symptoms (eg, bleeding, pain). (Choice A) Androgen deprivation therapy is used for metastatic prostate cancer. It has many side effects, including fatigue, sexual dysfunction, osteoporosis and fractures, hot flashes, anemia, gynecomastia, and an increased risk of cardiovascular disease and diabetes. However, proctitis is not a side effect of androgen deprivation therapy. (Choice B) Collagenous colitis results in chronic, intermittent, watery diarrhea without bleeding and is accompanied by fecal urgency. Colonoscopy reveals normal colon, but biopsy shows inflammation (colitis) without mucosal ulcerations. (Choice C) Human papillomavirus infection is highly associated with anal squamous cell carcinoma. Condyloma acuminata predisposes individuals to anogenital cancers and is usually evident on visual inspection of the genitourinary area. (Choice D) Ulcerative colitis and radiation proctitis may appear similar on colonoscopy (irregular, friable, and erythematous mucosa with ulceration). However, radiation proctitis is the most likely diagnosis in patients with a history of radiation treatment. Similarly, Crohn's disease usually has a cobblestoning pattern and discontinuous lesions that differentiate it from radiation proctitis. The rectum is not always involved in Crohn's disease.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_022",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 32-year-old man comes to the office due to malaise and fatigue over the last 3 months. The patient also reports mild generalized abdominal discomfort and nausea. He has lost approximately 2.3 kg (5 lb) in the last month. The patient has had no fever, vomiting, diarrhea, back pain, or urinary symptoms. He has no medical issues and takes no medication. The patient is a lifetime nonsmoker. Family history is notable for liver cancer in his father. Physical examination shows right upper quadrant tenderness. The liver edge is soft and palpable 2 cm below the right costal margin. Rectal examination shows no abnormalities, and a stool occult blood test is negative. Laboratory results are as follows: Hemoglobin 10.4 g/dL, Mean corpuscular volume 88 µm3, Blood urea nitrogen 10 mg/dL, Creatinine 0.8 mg/dL, Albumin 3.8 g/dL, Bilirubin Total 3.3 mg/dL, Direct 2.7 mg/dL, Alkaline phosphatase 520 U/L, Aspartate aminotransferase (SGOT) 72 U/L, Alanine aminotransferase (SGPT) 64 U/L. A hepatitis panel shows immunity against the hepatitis B virus. Ultrasonography shows no gallstones and no common bile duct dilation. Liver biopsy reveals intrahepatic ductal obliteration with moderate lymphocytic infiltration and periductal \"onion skin\" fibrosis. Which of the following is the best next step in management of this patient?",
    "choice_a": "Colonoscopy",
    "choice_b": "Cyclosporine",
    "choice_c": "Glucocorticoids",
    "choice_d": "Serum tumor markers",
    "choice_e": "Ursodeoxycholic acid",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with cholestasis due to primary sclerosing cholangitis (PSC), which is associated with underlying inflammatory bowel disease (IBD) (usually ulcerative colitis) in nearly 90% of patients. PSC is a chronic progressive disorder of unknown etiology with inflammation, fibrosis, and stricturing, most commonly of medium and large biliary ducts. Patients are usually asymptomatic but can present with fatigue, pruritus, and a cholestatic pattern of elevations in liver function tests. Continued bile duct destruction leads to end-stage liver disease and portal hypertension. Ultrasound is usually nondiagnostic; a cholangiogram (either endoscopic or magnetic resonance) may show multifocal narrowing and dilation of both intrahepatic and extrahepatic bile ducts. Liver biopsy is helpful for disease staging and prognosis, and can reveal intrahepatic ductal obliteration with moderate lymphocytic infiltration and periductal \"onion skin\" fibrosis. PSC patients with IBD are at significantly increased risk of colorectal cancer. Current guidelines recommend colonoscopy with full biopsies in newly diagnosed patients with PSC regardless of the presence of other symptoms. Patients found to have IBD require yearly follow-up with colonoscopy; those with PSC but without IBD should have colonoscopy every 5 years. Liver transplantation is the preferred treatment for PSC as medical therapy (eg, cyclosporine) does not appear to slow progression of the disease (Choice B). (Choice C) Although glucocorticoids are an important treatment for IgG4-related cholangitis, they have not been shown to improve survival in PSC and can worsen bone loss. (Choice D) Patients with PSC are also at increased risk for cholangiocarcinoma; some authorities have advocated for annual monitoring of cancer antigen 19-9 levels for screening. However, the evidence in support of this practice is not conclusive. (Choice E) Ursodeoxycholic acid is a mainstay of treatment for primary biliary cholangitis (PBC), which can present similarly to PSC. However, PBC usually affects women (90% of cases), and biopsy shows mononuclear cell-mediated destruction and/or periductal granulomatous inflammation of intrahepatic bile ducts. Ursodeoxycholic acid does not have a clear role in management of PSC.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_023",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 42-year-old man comes to the office because of heartburn. He has had these symptoms for the past 3 months. He states that symptoms occur almost daily and he has experienced nocturnal awakening because of regurgitation at least twice weekly. This has caused him daytime fatigue and poor concentration at work. He also complains of dry cough and wheezing. He denies any difficulty swallowing, nausea, vomiting, or weight loss. He has tried over-the-counter antacids with no significant relief. His other medical problems include hypertension and mild intermittent asthma. He does not use tobacco, alcohol, or drugs. His father suffered from colon cancer at the age of 68 and his mother died of breast cancer at the age of 72. His medications include hydrochlorothiazide and lisinopril. He uses albuterol as needed for shortness of breath. He has no known drug allergies. His blood pressure is 138/89 mm Hg and pulse is 87/min. His BMI is 30 kg/m2. Physical examination is unremarkable. Laboratory results are as follows: Hemoglobin 14.4 g/dL, Platelets 180,000 cells/µL, Potassium 3.8 mEq/L, Creatinine 0.8 mg/dL, Total Bilirubin 1.0 mg/dL, Aspartate aminotransferase 37 U/L, Alanine aminotransferase 24 U/L, Alkaline phosphatase 70 U/L. Which of the following is the most appropriate next step in management?",
    "choice_a": "Barium swallow",
    "choice_b": "Daily metoclopramide",
    "choice_c": "Daily proton pump inhibitor",
    "choice_d": "Pulmonary function testing",
    "choice_e": "Upper GI endoscopy",
    "correct_answer": "C",
    "explanation": "This patient presents with new-onset symptoms of gastroesophageal reflux disease (GERD), including some extra-esophageal symptoms (dry cough and wheezing). Patients with GERD typically present with retrosternal burning pain but can also have acid regurgitation, belching, nausea, dry cough (especially at night), and a feeling of a lump in the throat with swallowing. Current guidelines recommend empiric treatment with a proton pump inhibitor (e.g. omeprazole) and lifestyle changes in most patients. Patients who fail empiric treatment require further evaluation with endoscopy. However, patients with alarm symptoms require more immediate evaluation with endoscopy. This patient does not have alarm symptoms but does have typical GERD symptoms and can be initially treated with a proton pump inhibitor. (Choice A) Barium swallow has low sensitivity for mild GERD and is usually not indicated for the evaluation of uncomplicated GERD. Barium swallow is more sensitive and specific to diagnose strictures in evaluating patients with dysphagia. (Choice B) Metoclopramide increases gastric motility but is currently not recommended as monotherapy or adjunctive therapy for GERD due to possible side effect of tardive dyskinesia. (Choice D) The respiratory symptoms of dry cough and wheezing occurred at the same time as the reflux symptoms and therefore, are most likely related. Pulmonary function testing is unnecessary and would be unlikely to yield any additional information at this time. (Choice E) There are currently no alarm symptoms requiring an urgent endoscopy. Also, EGD for Barrett's screening in reflux disease is usually done after a few years of symptoms (5 years or more) when the disease has been present long enough to cause mucosal changes. It will be premature at this time to look for Barrett's.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_024",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 37-year-old man comes to the clinic complaining of rectal problems. He has had a constant urge to defecate for the past 2-3 days. When he does have a bowel movement, it is a small volume that contains purulent material sometimes streaked with blood. He has no fever but feels tired with generalized malaise. He recently had unprotected anal-receptive sex with a new male partner. He is in otherwise general good health and takes no medications. He has no history of similar illness. His vital signs are within normal limits. Cardiopulmonary and abdominal examinations are also within normal limits. There are no lesions visible in the perianal area. There is no inguinal lymphadenopathy. Which of the following is the most likely cause of his symptoms?",
    "choice_a": "Campylobacter jejuni",
    "choice_b": "Crohn's disease",
    "choice_c": "Herpes simplex virus",
    "choice_d": "Human papilloma virus",
    "choice_e": "Neisseria gonorrhoeae",
    "correct_answer": "E",
    "explanation": "This patient's presentation of tenesmus, purulent discharge, and small-volume stools containing blood is consistent with proctitis. Proctitis has multiple causes, including ulcerative colitis, radiation treatment, and infections. Given this patient's history, a sexually transmitted infection is most likely. Neisseria gonorrhoeae is the most common cause of sexually transmitted proctitis in individuals with history of anal-receptive intercourse. Patients with rectal symptoms should undergo anoscopy or sigmoidoscopy with mucosal biopsies. Purulent discharge should be cultured and sent for Gram stain, Tzanck prep and culture for herpes simplex virus, and PCR for Chlamydia trachomatis. In addition, patients should have serum RPR and HIV. Treatment is based on results of the investigation. (Choice A) Bacteria that can cause inflammation of the gastrointestinal tract include Campylobacter, Salmonella, Shigella, and some strains of Escherichia coli. However, these organisms do not commonly cause proctitis. (Choice B) Crohn's disease involving the large bowel usually spares the rectum. Proctitis is more commonly associated with ulcerative colitis, which is less likely given this patient's recent sexual history. (Choice C) Herpes simplex virus can be sexually transmitted to the perianal and rectal areas but usually presents with perianal vesicles. (Choice D) Human papilloma virus infection is associated with warts and anal cancer but does not cause proctitis.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_025",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 53-year-old woman comes to the hospital with right upper-quadrant abdominal discomfort and fatigue for the last 8 weeks. She also complains of jaundice and generalized joint pain. She has no nausea or vomiting. Her past medical history is significant for hypothyroidism for which she takes levothyroxine. Family history includes hypertension and ulcerative colitis. The patient lives in Florida and has not traveled recently. She does not use tobacco, alcohol, or illicit drugs. Her blood pressure is 166/90 mm Hg, pulse is 96/min, and respirations are 14/min. Physical examination shows pale skin and scleral icterus. Cardiopulmonary examination is within normal limits. There is tenderness to palpation in the right upper quadrant. The liver edge is palpable 3 cm below the costal margin. There is no ascites, splenomegaly, or lower-extremity edema. Laboratory results are as follows: Complete blood count: Hemoglobin 10.4 g/dL, Mean corpuscular volume 82 fL, Platelets 440,000/µL, Leukocyte count 15,000/µL. Serum chemistry: Sodium 136 mEq/L, Potassium 3.4 mEq/L, Blood urea nitrogen 20 mg/dL, Creatinine 1.2 mg/dL. Liver function studies: Albumin 3.1 g/dL, Total bilirubin 3.3 mg/dL, Direct bilirubin 2.6 mg/dL, Alkaline phosphatase 290 U/L, Aspartate aminotransferase (SGOT) 976 U/L, Alanine aminotransferase (SGPT) 1,134 U/L. Coagulation studies: International Normalized Ratio (INR) 1.4, Activated partial thromboplastin time 23 sec. Endocrine: Thyroid-stimulating hormone 1.4 µU/mL. Viral hepatitis antibody panel and HIV testing are negative. Right upper-quadrant ultrasound shows hepatomegaly with normal liver echo texture and no gallstones. The common bile duct measures 6 mm. Which of the following is the best initial test for this patient?",
    "choice_a": "Alpha-1 antitrypsin levels",
    "choice_b": "Anti-neutrophil cytoplasmic antibody",
    "choice_c": "Anti-smooth muscle antibody",
    "choice_d": "Anti-tissue transglutaminase antibodies",
    "choice_e": "Hepatitis C viral RNA assay",
    "correct_answer": "C",
    "explanation": "This patient's clinical presentation suggests autoimmune hepatitis, a chronic hepatitis due to autoantibodies against hepatocytes. It is more common in women and usually presents at age 40-50 years. Patients may be asymptomatic, symptomatic with debilitating nonspecific symptoms (eg, fatigue, abdominal pain, itching, arthralgias), or present with acute liver failure. Patients may have coexisting autoimmune disorders such as type 1 diabetes mellitus, thyroiditis, celiac sprue, or ulcerative colitis. Diagnosis is based on clinical presentation, serologic markers, and exclusion of other forms of chronic liver disease. Autoantibodies associated with autoimmune hepatitis include the following: Anti-nuclear antibody (ANA), Anti-smooth muscle antibody (ASMA), Anti-liver/kidney microsomal antibody (LKM-1), Liver cytosol antibody (LC-1). Patients can also have elevated serum globulin concentration (most often immunoglobulin G) and false-positive hepatitis C viral antibody tests (confirmed by negative hepatitis C virus RNA). Serum aminotransferases are usually significantly more elevated than bilirubin or alkaline phosphatase. (Choice A) Patients with alpha-1 antitrypsin deficiency usually present in the first 2 decades of life with liver disease (eg, chronic hepatitis, cirrhosis, hepatocellular carcinoma) and possible skin disease (eg, panniculitis). After the second decade of life, pulmonary symptoms predominate and include early-onset emphysema. (Choice B) Granulomatosis with polyangiitis (Wegener's) presents with sinopulmonary disease, renal disease, and systemic symptoms (eg, cutaneous and ocular manifestations). Diagnosis is confirmed by positive cytoplasmic antineutrophil cytoplasmic antibodies, anti-proteinase-3 antibodies, and/or tissue biopsy showing vasculitis. (Choice D) Atypical celiac disease may present with minor gastrointestinal symptoms, iron deficiency anemia, osteoporosis, arthritis, elevated serum aminotransferases, neurologic symptoms, or infertility. However, serum aminotransferases are usually not this elevated, and jaundice is usually not present. (Choice E) This patient's viral hepatitis antibody panel is negative and hepatitis C viral RNA assay is therefore not required. Patients with autoimmune hepatitis may have false-positive hepatitis C viral antibody tests due to elevated IgG levels. In these patients, hepatitis C viral RNA assay can be helpful in excluding false-positive hepatitis C antibody testing.",
    "source": "ABIM - Gastrointestinal Nutrition - 1.pdf"
  },
  {
    "id": "GI_026",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 37-year-old man comes to the office due to dysphagia and pain on swallowing over the past week. He has had frequent episodes of heartburn in the past that were relieved by antacids in the past, but they have not provided relief this time. The patient has a history of intravenous drug abuse and is currently enrolled in an outpatient methadone program. His other medical problems include hepatitis C and HIV infection (last CD4 count was 80 cells/mm³), for which he has had poor medical follow-up. The patient has a 15- pack-year smoking history and drinks 1 or 2 cans of beer daily. Blood pressure is 112/67 mm Hg and pulse is 98/min. BMI is 19 kg/m². Examination shows white plaques on the tongue and soft palate; bilateral, bright-red erythematous fissures are present at the angles of the mouth. The patient has 2 firm, mobile, nontender lymph nodes on the left side of his neck. The remainder of the physical examination is unremarkable. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Barium swallow",
    "choice_b": "CT scan of the chest",
    "choice_c": "Nystatin swish and swallow",
    "choice_d": "Oral fluconazole",
    "choice_e": "Upper gastrointestinal endoscopy",
    "correct_answer": "D",
    "explanation": "This patient with HIV/AIDS with white plaques on his tongue and angular cheilitis has evidence of oral thrush. Odynophagia and thrush in an immunosuppressed patient raise the concern for candidal esophagitis. Candida is the most common cause of esophagitis in patients with HIV, particularly those with a CD4 count <100 cells/mm³ or those noncompliant with antiretroviral therapy. Patients typically experience dysphagia and mild to moderate odynophagia (in contrast to the severe pain seen with cytomegalovirus or herpes simplex virus esophagitis) and often have concurrent oral thrush. However, the absence of thrush cannot rule out candidal esophagitis; one study found that 18% of patients with candidal esophagitis did not have evidence of oropharyngeal thrush. Empiric treatment with 14-21 days of fluconazole is appropriate for patients with thrush and symptoms consistent with candidal esophagitis. Systemic therapy is required; topical therapy (eg, nystatin swish and swallow), which can be considered in patients without HIV who have candidal esophagitis, should never be used to treat candidal esophagitis in patients with HIV due to very high rates of treatment failure (Choice C). If symptoms fail to improve within 72 hours or are atypical (eg, severe pain with no thrush), an esophagogastroduodenoscopy with biopsies and culture should be performed to rule out other causes (Choice E). (Choice A) Barium swallow is often performed in the evaluation of dysphagia but is less useful in odynophagia as it cannot evaluate mucosal details (eg, esophagitis) or obtain biopsies. (Choice B) Extrinsic compression by lymphadenopathy can also cause dysphagia and would be noted on CT scan; however, odynophagia is uncommon. Modest, nontender lymphadenopathy is quite common in advanced HIV.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_027",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 65-year-old man on chronic peritoneal dialysis (PD) for two years complains of 1 day of diffuse abdominal pain. He has not noticed any changes in his catheter exit site, changes in bowel movements, fever, or chills. His temperature is 37.2 C (99.0 F), blood pressure is 140/90 mm Hg, and pulse is 90/min. Bowel sounds are normal. There is mild, diffuse abdominal tenderness without definite rebound tenderness. The catheter exit site looks normal. Analysis of peritoneal fluid reveals a white blood cell count of 110 cells/µL. Gram stain of the peritoneal fluid is negative. Laboratory results are as follows: Hematocrit 32%, Leukocyte count 7,900 cells/µL, Potassium 4.4 mEq/L, Bicarbonate 22 mEq/L, Creatinine 5.2 mg/dL, Glucose 120 mg/dL. Which of the following would be the most appropriate next step in management?",
    "choice_a": "Abdominal CT scan",
    "choice_b": "Colonoscopy",
    "choice_c": "Dialysis catheter removal",
    "choice_d": "Intraperitoneal vancomycin and cefepime",
    "choice_e": "Intravenous aminoglycoside and cefazolin",
    "correct_answer": "D",
    "explanation": "This patient's presentation is concerning for PD-related peritonitis, most commonly due to touch- contamination from skin bacteria or catheter-related infection. Patients usually present with abdominal pain, low grade fever (in up to 50% of patients), and nausea. Examination typically reveals abdominal tenderness, sometimes with cloudy abdominal fluid and rebound tenderness. Diagnosis is highly suggested by peritoneal fluid showing > 100 WBCs. However, fluid with >50% neutrophils strongly favors PD-related peritonitis regardless of the absolute fluid WBC count. Gram stain is usually negative and diagnosis is confirmed by positive peritoneal fluid cultures (80-95% of cases). Although Gram-positive skin bacteria is the most common cause of PD peritonitis, patients should be treated empirically for both Gram-positive and Gram-negative organisms. Current guidelines recommend intraperitoneal vancomycin and a 3rd or 4th generation cephalosporin (e.g., cefepime) or an aminoglycoside. Intraperitoneal antibiotics appear to be more efficacious than intravenous antibiotics (Choice E). (Choice A) Abdominal CT scan is indicated in patients with suspected secondary peritonitis due to enteric pathology (e.g., appendicitis, incarcerated hernia, ruptured diverticula). However, secondary peritonitis tends to present with more systemic symptoms (e.g., fever, chills, hypotension, significant leukocytosis), which are usually not present in PD-related peritonitis. If a CT scan is performed, it is important to recall that PD patients can have asymptomatic free peritoneal air from the PD catheter. (Choice B) Colonoscopy is not usually indicated in PD peritonitis. (Choice C) Catheter removal is considered only for tunnel infections or refractory intraperitoneal infections. However, this patient's normal appearing catheter site makes this less likely.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_028",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 23-year-old woman with a 4-year history of ileo-colonic Crohn's disease comes to the physician complaining of gas and a feculent vaginal discharge for the past 2 weeks. She has no fever, chills, abdominal pain, nausea, or vomiting. She has been treated with azathioprine for her Crohn's disease without any recent flares. Her medications include vitamin D and vitamin B12 supplements. Her blood pressure is 100/60 mm Hg, pulse is 72/min, and respirations are 14/min. Examination shows a soft and nontender abdomen without hepatosplenomegaly. Rectal examination is within normal limits. Pelvic examination is unremarkable. Laboratory results are as follows: Hemoglobin 10.0 g/dL, Mean corpuscular volume 80 fL, Platelets 280,000/µL, Leukocytes 6,700/µL. Serum chemistry: Sodium 134 mEq/L, Potassium 3.4 mEq/L, Chloride 110 mEq/L, Bicarbonate 20 mEq/L, Blood urea nitrogen 6 mg/dL, Creatinine 0.9 mg/dL, Glucose 84 mg/dL. Erythrocyte sedimentation rate 40 mm/h. Magnetic resonance imaging of the pelvis shows a fistulous tract from the rectum through the vaginal wall with surrounding wall edema. Which of the following is the most appropriate next step in management?",
    "choice_a": "Infliximab",
    "choice_b": "Mesalamine",
    "choice_c": "Observation",
    "choice_d": "Prednisone",
    "choice_e": "Surgery",
    "correct_answer": "A",
    "explanation": "Approximately 20%-30% of patients with Crohn's disease develop anorectal fistulas. About half of these patients present with perianal fistula at the time of diagnosis. Rectovaginal fistulas usually present with vaginal fecal discharge, increased vaginal gas, or severe malodorous discharge. Patients with asymptomatic fistulas do not require therapy as the majority remain asymptomatic or heal spontaneously. Rectovaginal fistulas not related to inflammatory bowel disease (IBD) are treated only with surgery. IBD-related fistulas are first treated medically and repaired surgically only if medical therapy fails. Patients with mild symptoms can be treated with oral antibiotics (metronidazole plus ciprofloxacin). However, the treatment often requires a prolonged period (6-12 months) with gradual tapering due to the risk of relapse. Moderate to severe symptoms usually require immunomodulator therapy (eg, anti-TNF inhibitors, thiopurines, or tacrolimus). Anti-TNF inhibitors (eg, infliximab and adalimumab) have the best evidence for both short-term healing and long-term management of rectovaginal closure. Thiopurines and azathioprine/6-mercatopurine are also effective in some patients. Calcineurin inhibitors (eg, cyclosporine and tacrolimus) are effective but reserved as last-line therapy due to significant toxicity and side effects. Surgery is usually reserved for patients who fail medical therapy or develop recurrent fistulas requiring long-term closure (Choice E). (Choices B and D) Prednisone and 5-ASA compounds (eg, mesalamine) are effective for many other gastrointestinal symptoms of IBD but are not as effective for treating rectovaginal fistulas. In addition, this patient has no other active symptoms of Crohn's disease.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_029",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 72-year-old woman with moderate dementia is brought to the physician by her son for weight loss and poor appetite over the last 4-5 months. She eats small amounts and often refuses to eat due to abdominal cramping and back pain after meals. She has no vomiting but does have constipation. The patient has lost 7 kg (15 lb) during this period. Computed tomography scan of the abdomen 1 month ago showed no masses. Her past medical history is also significant for coronary artery disease requiring bypass graft 10 years ago, congestive heart failure, lacunar stroke, and hypertension. Her medications include metoprolol, lisinopril, aspirin, simvastatin, and donepezil. She is an ex-smoker with a 40-pack-year history. She needs assistance with most activities of daily living. The patient's blood pressure is 114/62 mm Hg, pulse is 68/min, and respirations are 14/min. She appears well groomed and answers questions appropriately. Cardiac examination shows a right carotid bruit. Lungs are clear to auscultation bilaterally. The abdomen is soft with mild diffuse tenderness to palpation. Rectal examination shows guaiac-negative brown stool. There is trace bilateral pedal edema. The remainder of the examination is within normal limits. Laboratory results are as follows: Hematocrit 32%, Mean corpuscular volume 79 fL, Platelets 260,000/µL, Leukocyte count 8,200/µL, Blood urea nitrogen 14 mg/dL, Creatinine 0.8 mg/dL, Albumin 2.5 g/dL. Upper gastrointestinal endoscopy and colonoscopy show mild esophagitis and sigmoid diverticulosis. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Aggressive diuresis to reduce bowel wall edema",
    "choice_b": "Capsule endoscopy for small-bowel evaluation",
    "choice_c": "Magnetic resonance angiography of the abdomen",
    "choice_d": "Megestrol and nutritional supplements",
    "choice_e": "Mirtazapine and nutritional supplements",
    "correct_answer": "C",
    "explanation": "This patient's presentation suggests chronic mesenteric ischemia, which is usually caused by systemic atherosclerotic disease leading to episodic or constant intestinal hypoperfusion. Patients typically present with weight loss and postprandial epigastric pain (may radiate to the back) that is usually worse in the first hour after eating. Large or fatty meals increase the pain, which often subsides within 2 hours. Patients develop fear of eating (sitophobia) due to the pain. Chronic mesenteric ischemia can progress and result in acute mesenteric ischemia. Angiography is the gold standard for diagnosis, but noninvasive imaging (computed tomography scan, magnetic resonance angiography, or duplex ultrasonography) is preferred initially. Imaging may reveal high-grade stenoses in multiple mesenteric vessels. Treatment includes surgical reconstruction or percutaneous transluminal angioplasty with or without stent placement. (Choice A) Patients with chronic heart failure have autonomic disturbances (increased sympathetic and decreased parasympathetic activity) and/or tissue hypoperfusion, which lead to decreased gastrointestinal motility. Bowel wall edema can also cause malabsorption and protein loss. Although this patient has congestive heart failure, she does not seem to be in a volume-overloaded state. Her symptoms are more suggestive of mesenteric ischemia. (Choice B) Capsule endoscopy can identify small-bowel mucosal abnormalities. Chronic mesenteric ischemia usually does not produce mucosal abnormalities. Small-bowel malignancy is uncommon and is unlikely to cause this patient's presentation. (Choices D & E) Depression may cause poor appetite and weight loss. However, this patient's vascular risk factors combined with postprandial abdominal pain are more concerning for mesenteric ischemia. Mirtazapine (antidepressant with appetite stimulant properties) or megestrol (appetite stimulant) can be added once mesenteric ischemia has been ruled out.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_030",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 62-year-old man comes to the emergency department due to a 3-day history of worsening diarrhea and abdominal pain. The patient has had 3-4 watery stools a day with no blood or mucus. The pain is mild, located in the lower abdominal quadrants, and partially relieved with bowel movements. He has had no fever, nausea, or vomiting. The patient had similar symptoms 6 weeks ago after antibiotic treatment for pneumonia. He was found to have Clostridium difficile infection and was treated with oral vancomycin. The patient had been feeling well after finishing the 10-day treatment until the symptoms recurred. Other medical issues include hypertension, type 2 diabetes mellitus, hyperlipidemia, and depression. Temperature is 37.2 C (99 F), blood pressure is 110/80 mm Hg, and pulse is 88/min. The abdomen is soft with mild tenderness in the periumbilical and left lower quadrant. There is no rebound tenderness or rigidity. Laboratory results are as follows: Hemoglobin 11.4 g/dL, Hematocrit 34%, Platelets 280,000/mm³, Leukocytes 14,000/mm³, Blood urea nitrogen 10 mg/dL, Creatinine 0.8 mg/dL, Albumin 3.1 g/dL. Stool PCR for C difficile is positive. Which of the following is the best therapy for this patient?",
    "choice_a": "Intravenous metronidazole plus oral vancomycin",
    "choice_b": "Oral metronidazole",
    "choice_c": "Oral vancomycin followed by rifaximin",
    "choice_d": "Oral vancomycin with slow taper",
    "choice_e": "Probiotic therapy",
    "correct_answer": "D",
    "explanation": "This patient most likely has recurrent Clostridium difficile infection (CDI). Recurrence is due to germination of persistent spores from the initial infection and not from drug resistance. Management of the initial recurrence of CDI is typically a prolonged course of oral vancomycin given in a pulsed (QID dosing for 10-14 days) and tapered regimen over a course of 2-8 weeks. Alternately, a 10-day course of fidaxomicin can be administered if vancomycin was used to treat the initial infection. (Choices A and B) Intravenous metronidazole should be added to high-dose oral vancomycin in patients with fulminant infection (eg, shock, ileus, megacolon). Recent guidelines recommend against oral metronidazole for primary or recurrent CDI. Primary CDI should be treated with oral vancomycin or fidaxomicin. (Choice C) Oral vancomycin followed by rifaxamin can be used for further recurrences but is not recommended for the first CDI recurrence. (Choice E) Probiotics are not indicated for prevention or treatment of primary CDI in most patients. They can be considered for recurrent non-severe disease as an adjunct, provided the patient has no significant underlying immunosuppression (risk of invasive disease).",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_031",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 36-year-old man comes to the physician with daily epigastric pain for past 3 months. He has no vomiting, diarrhea, or weight loss. He has suffered from painful ulcers in his mouth once a year since he was a teenager. His only medications are a daily multivitamin and occasional ibuprofen for headaches. He does not use tobacco, alcohol, or illicit drugs. The patient emigrated from Taiwan 3 years ago. There is no family history of gastrointestinal malignancy or inflammatory bowel disease. Examination is remarkable for mild epigastric tenderness. Stool is positive for occult blood. His hemoglobin is 12.9 g/dL. Stool Helicobacter pylori antigen testing is positive. An upper endoscopy reveals no esophageal lesions and a solitary 1.4-cm ulcer with well demarcated edges in the antrum of the stomach. Which of the following is the best next step in managing this patient?",
    "choice_a": "Endoscopic multiple biopsies of the ulcer",
    "choice_b": "Lansoprazole, discontinuation of ibuprofen, and repeat endoscopy in 6 months",
    "choice_c": "Ranitidine and discontinuation of ibuprofen",
    "choice_d": "Serum anti-transglutaminase antibodies",
    "choice_e": "Serum gastrin level",
    "correct_answer": "A",
    "explanation": "This patient presents with symptoms of peptic ulcer disease likely from Helicobacter pylori infection, a common cause of gastric and duodenal ulcers. Peptic ulcer disease is also strongly associated with gastric cancers (40%) and primarily gastric mucosa-associated lymphoid tissue lymphomas. H pylori infection also can lead to chronic gastritis and intestinal metaplasia and is more common in individuals from East Asia and certain parts of Latin America. Thus, obtaining multiple biopsies for histology is generally recommended. Eradication of H pylori (triple-based therapy) also appears to reduce the risk of gastric cancer in certain high-risk individuals. Endoscopy may be repeated in 6 weeks after completion of therapy if the ulcer biopsy was inadequate or in patients at high risk for malignancy (Table). (Choices B and C) This patient will benefit from a proton-pump inhibitor or H2-receptor antagonist as well as discontinuation of ibuprofen. However, the ulcer should be biopsied now to rule out metaplasia or dysplasia. Repeat endoscopy may be indicated if ulcer biopsies are not adequate. (Choice D) This patient has no symptoms of celiac disease (eg, unexplained anemia, weight loss, diarrhea, nutritional deficiencies) and does not need serum anti-transglutaminase antibodies. (Choice E) Patients with gastrinoma (Zollinger-Ellison syndrome) usually have multiple, recurrent ulcers and diarrhea. Fasting serum gastrin levels and secretin stimulation tests are used for diagnosis. However, this patient has a solitary ulcer with a low likelihood of gastrinoma.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_032",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 65-year-old woman with a known history of Crohn's disease comes to the physician to receive the influenza and pneumonia vaccines. She has never received these vaccines in the past. She has no current complaints. She denies abdominal pain, diarrhea, vomiting, and weight loss. Her other medical problems include hypertension and osteoarthritis. Her surgical history includes hysterectomy for fibroids, partial small bowel resection, and cholecystectomy. Her last colonoscopy was 9 months ago, which showed mild inflammation. She quit smoking 2 years ago and has 30 pack-year smoking history. Her medications include hydrochlorothiazide, omeprazole, naproxen, sulfasalazine, azathioprine, and infliximab. Which of the following is the most appropriate course of action?",
    "choice_a": "Both intramuscular influenza and pneumococcal vaccines",
    "choice_b": "Intramuscular influenza vaccine only",
    "choice_c": "Intramuscular pneumococcal vaccine only",
    "choice_d": "Intranasal influenza vaccine only",
    "choice_e": "Stop azathioprine and infliximab for 3 months before vaccination",
    "correct_answer": "A",
    "explanation": "Patients with inflammatory bowel disease (IBD) taking immunosuppressive medications such as anti-TNF agents (infliximab) and antimetabolites (azathioprine) should receive the standard adult vaccinations. However, live vaccines (e.g., intranasal influenza) should not be given with anti-TNF therapy (Choice D). In addition, vaccines ideally should be given before starting anti-TNF therapy. Patients with hepatitis B risk factors should also receive the hepatitis B vaccine. (Choices B and C) This patient qualifies for both vaccines and should receive both the intramuscular influenza and pneumococcal vaccines. (Choice E) Patients requiring live vaccines (e.g., varicella, zoster, etc.) should hold their immunosuppressants for 2-3 months before vaccination. However, this patient can be vaccinated with the inactivated influenza vaccine instead of the intranasal form.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_033",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 32-year-old man comes to the office due to burning pain in his chest and severe midsternal pain on swallowing over the past week. The symptoms have become so severe that he cannot swallow any food or fluids. The patient has also felt warm for the past 2 days but has had no dyspnea, cough, abdominal pain, diarrhea, or urinary symptoms. He has a history of intravenous drug abuse and a recent episode of community-acquired pneumonia. The patient also has chronic HIV infection (last CD4 count was 90 cells/mm³) but has had poor medical follow-up. He has smoked a pack of cigarettes daily for 15 years and drinks 1 or 2 cans of beer daily. Temperature is 38 C (100.4 F), blood pressure is 112/67 mm Hg, pulse is 98/min, and respirations are 16/min. Oxygen saturation is 97% on room air. BMI is 19 kg/m². The patient is in distress due to pain. Examination shows no oral lesions. The chest is clear to auscultation. No murmurs are noted. The remainder of the physical examination is unremarkable. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Barium swallow",
    "choice_b": "Clotrimazole troches",
    "choice_c": "Oral fluconazole",
    "choice_d": "Proton pump inhibitor",
    "choice_e": "Upper gastrointestinal endoscopy",
    "correct_answer": "E",
    "explanation": "This patient with HIV/AIDS haş odynophagia, raising concern for infectious esophagitis, particularly given his CD4 count <100 cells/mm³ and noncompliance with antiretroviral therapy. Candida albicans, the most common cause of infectious esophagitis in immunosuppressed patients, typically presents with moderate odynophagia, dysphagia, and concurrent oral thrush. Patients with these classic features may be given an empiric trial of systemic antifungals (eg, oral fluconazole). However, the presence of severe odynophagia without evidence of thrush favors ulcerative esophagitis; retrosternal pain and fevers can also occur, as seen in this patient. Ulcerative esophagitis is commonly due to viral infections. Herpes simplex virus esophagitis, which often occurs with concurrent herpetic outbreaks elsewhere (eg, herpes labialis), can lead to bleeding and tracheoesophageal fistula formation. Cytomegalovirus esophagitis often occurs with concurrent retinitis, which can lead to blindness. As a result, severe odynophagia, fevers, and the absence of classic candidal esophagitis symptoms should prompt endoscopy with biopsy and culture rather than a trial of empiric fluconazole to ensure correct diagnosis (Choice C). Endoscopy would also help identify the 18% of cases of Candida esophagitis not associated with thrush as well as exclude malignancy as the cause of this patient's presentation. (Choice A) Barium swallow is useful in the evaluation of dysphagia but is less useful in evaluation of odynophagia in immunosuppressed patients as it has low sensitivity for mucosal lesions and cannot be used to obtain culture or tissue specimens. (Choice B) Clotrimazole troches (lozenges) are used for uncomplicated thrush but have a high failure rate for esophagitis. If this patient is found to have Candida esophagitis, systemic antifungals are required. (Choice D) Proton pump inhibitors do not help candidal/viral esophagitis. Given the high incidence of opportunistic infections in patients with advanced HIV, endoscopy (rather than an empiric proton pump inhibitor trial) should be performed.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_034",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 25-year-old man comes to the physician for evaluation of abnormal liver tests. Blood work performed for graduate school enrollment revealed elevated bilirubin levels. He has no complaints and feels well. He reports that he had a history of jaundice and hepatitis at the age of 5. He took azithromycin for an upper respiratory infection approximately 2 months ago. He has no other medical problems. He does not smoke or drink alcohol, and he denies any recreational drug use. Physical examination is unremarkable. Laboratory results are as follows: Hemoglobin 14.4 g/dL, Mean corpuscular volume 95 fL, Reticulocytes 1.0%, Platelets 240,000 cells/µL, Leukocyte count 6,900 cells/µL. Serum chemistry: Blood urea nitrogen 8 mg/dL, Creatinine 0.8 mg/dL. Liver function studies: Albumin 4.0 g/dL, Total Bilirubin 2.9 mg/dL, Direct Bilirubin 0.7 mg/dL, Alkaline phosphatase 70 U/L, Aspartate aminotransferase (SGOT) 12 U/L, Alanine aminotransferase (SGPT) 24 U/L. Prothrombin time 8 sec, Lactate dehydrogenase (serum) 70 U/L. Hepatitis panel: Hepatitis B surface antibody (HBsAb) positive, Hepatitis B surface antigen (HBsAg) negative, Hepatitis C virus antibody negative, Hepatitis A virus IgM antibody negative, Hepatitis A virus IgG antibody positive. Which of the following is the best next step in management for this patient?",
    "choice_a": "Antinuclear antibodies",
    "choice_b": "CT scan of the abdomen with contrast",
    "choice_c": "Daily low-dose phenobarbital",
    "choice_d": "Genetic testing",
    "choice_e": "Repeat liver function tests in 6-12 months",
    "correct_answer": "E",
    "explanation": "This patient's isolated unconjugated hyperbilirubinemia is most likely due to Gilbert's syndrome. Gilbert's syndrome results in decreased production (<30% of normal) of UDP-glucuronyl transferases, deficiency of which leads to decreased glucuronidation of bilirubin and unconjugated hyperbilirubinemia. Patients typically are asymptomatic or may present with nonspecific symptoms (e.g., fatigue) and icterus on examination. The bilirubin levels are usually < 3-4 g/dL, but they can significantly increase with fasting for 24 to 48 hours, hemolysis, febrile illness, or medication use (e.g., nicotinic acid). Diagnosis is suggested by unconjugated hyperbilirubinemia with otherwise normal laboratory results (e.g., CBC, liver function tests, and hemolysis tests) and confirmed with repeat testing in 6-12 months that shows continued isolated unconjugated hyperbilirubinemia. Genetic testing for the UGT1A1 gene mutation is usually reserved for patients with an unclear diagnosis (Choice D). Gilbert's syndrome requires no further testing or specific therapy. This patient's normal liver enzymes and hepatic function rule out pre- and post-hepatic causes. The normal reticulocyte count and LDH do not suggest hemolysis. Given his immunity to hepatitis A (positive IgG HAV antibodies), Gilbert's syndrome is the most likely diagnosis by exclusion. (Choice A) Antinuclear antibodies can evaluate for SLE or autoimmune hepatitis, but this patient's normal liver function tests (except for bilirubin) and lack of symptoms make these unlikely. (Choice B) CT scan of the abdomen can help evaluate cholestatic disease or possible hepatic parenchymal lesions. However, this patient's otherwise normal liver function tests (except for bilirubin) make these scenarios unlikely. (Choice C) Phenobarbital is a hepatic enzyme inducer that can increase glucuronidase activity and decrease bilirubin levels. However, patients do not routinely need hepatic inducers (e.g.. phenobarbital) since Gilbert's syndrome is a benign disease.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_035",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 71-year-old woman comes to the physician for constipation. She has had 1-2 bowel movements a week associated with straining and the sensation of incomplete evacuation for the past 5 years. She has no rectal bleeding, abdominal pain, weight loss, pain with defecation, change in stool caliber, or diarrhea. The patient has increased her exercise and fluid intake without improvement in symptoms. She had a colonoscopy 3 years ago in which only 1 small hyperplastic polyp was found. Her past medical history includes hypertension, for which she takes chlorthalidone. Vital signs are normal and her body mass index is 29 kg/m². Physical examination and rectal examination, which shows normal sphincter tone and no palpable masses, are unremarkable. Laboratory tests, including electrolytes, renal function, and thyroid studies, are within normal limits. A radio marker study is performed and demonstrates delayed motility in the proximal colon. Which of the following is the best next step in management of this patient?",
    "choice_a": "Bulk-forming laxative",
    "choice_b": "Colonic secretagogue",
    "choice_c": "Osmotic laxative",
    "choice_d": "Repeat colonoscopy",
    "choice_e": "Sodium phosphate enemas",
    "correct_answer": "A",
    "explanation": "This patient's history is most consistent with slow transit constipation, confirmed by a radio marker study showing prolonged transit time through the colon. Chronic constipation is a common disorder in adults and increases in prevalence with age. Treatment includes the discontinuation of common offending medications (calcium channel blockers, anticholinergics, opioids, nonsteroidal anti-inflammatory drugs), increasing dietary fiber/fluids, and engaging in daily exercise. If nonpharmacologic therapies fail, addition of a bulking agent, such as methylcellulose or psyllium, is recommended. These agents are effective in increasing the frequency and softening the consistency of stool with very few side effects. Additional diagnostic evaluations, including colonoscopy (Choice D), should be considered for those with the following: 1. Alarm features (gross or occult bleeding, acute onset of constipation or mechanical obstruction, unexplained weight loss, change in caliber of stool). 2. Symptoms refractory to medical management. 3. Features of pelvic floor dysfunction (ie, inability to expel stool due to lack of relaxation of pelvic floor muscles). (Choice B) Colonic secretagogues, such as lubiprostone and linaclotide, act by stimulating intestinal fluid secretion and decreasing colonic transit times. These agents are more commonly used in irritable bowel syndrome constipation-type (IBS-c) and are used in severe chronic constipation only after failure of other therapies. In addition to constipation, symptoms suggesting IBS-c include recurrent abdominal pain, distension, intermittent loose stools, and passage of mucus. (Choice C) Osmotic laxatives (polyethylene glycol) are also effective in slow transit constipation, but excessive use of these agents may result in volume overload and electrolyte abnormalities (hypokalemia). The current guidelines therefore recommend a trial of supplemental fiber as first-line therapy. (Choice E) Enemas are recommended for those at risk of fecal impaction from severe, refractory constipation. Sodium phosphate enemas are generally avoided in older adults due to potential complications including volume depletion, hypotension, and acute phosphate nephropathy. Tap water would be preferred if it becomes necessary to use an enema in this patient.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_036",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 46-year-old woman comes to the office due to fatigue and generalized itching over the last 6 months. She has no energy to accomplish her daily goals and sometimes feels depressed. The patient takes pregabalin for fibromyalgia and diphenhydramine as needed for itching. She does not use tobacco, alcohol, or illicit drugs. Family history is notable for type 2 diabetes in her father and Graves disease in her mother. Blood pressure is 100/60 mm Hg, pulse is 74/min, and respirations are 14/min. There are no rashes. The abdomen is nontender with the liver edge palpable 4 fingerbreadths below the right costal margin. There is no splenomegaly. Laboratory results are as follows: Hematocrit 36%, Mean corpuscular volume 84 µm³, Platelets 260,000/mm³, Leukocytes 6,600/mm³. Liver function studies: Albumin 3.7 g/dL, Total bilirubin 2.2 mg/dL, Direct bilirubin 1.6 mg/dL, Alkaline phosphatase 730 U/L, Aspartate aminotransferase (SGOT) 48 U/L, Alanine aminotransferase (SGPT) 54 U/L. TSH 2.5 µL/L, 25-hydroxyvitamin D 8 ng/mL (normal: >20). This patient would benefit most from which of the following?",
    "choice_a": "Colchicine",
    "choice_b": "Etanercept",
    "choice_c": "High-dose prednisone",
    "choice_d": "Methotrexate",
    "choice_e": "Ursodeoxycholic acid",
    "correct_answer": "E",
    "explanation": "This patient has pruritus and fatigue with hepatomegaly. This cholestatic pattern on hepatic markers (predominant elevation in alkaline phosphatase and bilirubin) is most consistent with primary biliary cholangitis (PBC, previously known as primary biliary cirrhosis). PBC is due to autoimmune destruction of the intralobular bile ducts and predominantly affects women (~95%). Patients may be asymptomatic at the time of diagnosis, but additional manifestations may include right upper quadrant discomfort, severe fatigue, abnormal skin pigmentation, and severe hypercholesterolemia. Disrupted bile secretory mechanisms can lead to malabsorption of fat-soluble vitamins (A, D, E, and K). Antimitochondrial antibodies are very sensitive (~95%) for PBC, and antinuclear antibodies are present in most patients as well. Untreated PBC can lead to cirrhosis, but treatment with ursodeoxycholic acid (UDCA) improves symptoms and biomarkers (eg, alkaline phosphatase, cholesterol), slows development of end-stage liver disease, and increases survival. UDCA is most beneficial in the earlier stages of PBC, but all patients should be treated. Antimitochondrial antibodies titers do not correlate with response to treatment, but hepatic function markers should be monitored every 3-6 months during treatment. (Choices A and D) Colchicine and methotrexate have been used for PBC, but there are conflicting data regarding benefit. These drugs are used primarily as second-line treatment for patients with progressive disease on UDCA. (Choice B) Etanercept is a tumor necrosis factor inhibitor used to treat diseases such as rheumatoid arthritis, psoriatic arthritis, and ankylosing spondylitis. It may have some benefit in patients with concurrent rheumatoid arthritis but has not been adequately studied; it is not first-line therapy for PBC. (Choice C) Prednisone may treat autoimmune hepatitis but has limited to no efficacy in PBC. In addition, it can increase the risk of osteoporosis.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_037",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 52-year-old man comes to the physician with generalized weakness and abdominal distention. He has had these symptoms for the past 5 months and says that his abdominal girth has gradually increased. He has no other complaints. His other medical problems include hepatitis C-induced cirrhosis and depression. The patient has a 24-pack-year history of cigarette smoking and drinks vodka daily. He admits to using intravenous drugs in the past. His vital signs are within normal limits, but he has gained 6.8 kg (15 lb) since his last visit 6 months ago. Examination reveals a distended and nontender abdomen with fluid wave and shifting dullness. There is no rebound tenderness or rigidity. His cardiopulmonary examination is unremarkable. Skin examination shows a few spider nevi. He has 2+ pitting pedal edema to the mid-shin bilaterally. Laboratory results are as follows: Serum chemistry: Sodium 131 mEq/L, Potassium 3.3 mEq/L, Chloride 110 mEq/L, Blood urea nitrogen 14 mg/dL, Creatinine 1.0 mg/dL. Liver function studies: Albumin 2.2 g/dL, Total bilirubin 5.3 mg/dL, Direct bilirubin 3.2 mg/dL, Alkaline phosphatase 170 U/L, Aspartate aminotransferase (SGOT) 112 U/L, Alanine aminotransferase (SGPT) 99 U/L. Coagulation studies: Prothrombin time 20 sec, International normalized ratio 1.8. Alpha-fetoprotein 12 ng/mL. Abdominal ultrasound confirms the presence of a moderate amount of ascites, no focal liver masses, and moderate splenomegaly. A diagnostic paracentesis shows polymorphonuclear count of 88/mm³, total protein of 1.4 g/dL, and albumin of 0.9 g/dL. Which of the following is the best next step in management of this patient?",
    "choice_a": "High-dose furosemide and low-dose spironolactone",
    "choice_b": "High-dose spironolactone and low-dose furosemide",
    "choice_c": "Refer for liver transplant evaluation",
    "choice_d": "Strict fluid restriction and angiotensin-converting enzyme inhibitor",
    "choice_e": "Therapeutic paracentesis followed by fluid restriction",
    "correct_answer": "B",
    "explanation": "This patient presents with ascites, a frequent complication of cirrhosis. Initial management of ascites includes ruling out infection with fluid analysis (PMN≥ 250 cells/mm³) and calculating the serum ascites albumin gradient (SAAG), which is serum albumin minus ascitic albumin. Patients with high-gradient SAAG ( 1.1 g/dL) have ascites due to portal hypertension and should be managed initially with complete alcohol abstinence and a 2-g/day sodium diet. Patients without symptom improvement and serum sodium > 120 mEq/L require combination oral high- dose spironolactone and low-dose furosemide to reduce fluid retention and avoid hyperkalemia (Choice A). Diuretics are titrated until symptoms improve. Spironolactone is used as a single agent in patients with profound hypokalemia. Intravenous furosemide should be avoided due to the risk of acute prerenal azotemia, which could be confused with hepatorenal syndrome. Patients with refractory ascites require large-volume paracentesis, midodrine, transjugular intrahepatic portosystemic stent-shunt (TIPS), or liver transplant depending on response. (Choice C) Referral for liver transplant evaluation should be considered at every visit. Referral requires patient abstinence from alcohol and drugs for about 6 months and enrollment in an alcohol rehabilitation program. However, this patient is actively drinking and thus cannot be referred for transplant. (Choice D) Fluid restriction can help patients with serum sodium < 120 mEq/L. NSAIDs, angiotensin- converting enzyme inhibitors, and angiotensin II receptor blockers should be avoided in cirrhotics as they can reduce glomerular filtration rate and precipitate renal failure. (Choice E) Therapeutic paracentesis is usually indicated to reduce intra-abdominal pressure in symptomatic patients (eg, shortness of breath, abdominal pain, and early satiety). It is also used to treat some patients with ascites refractory to initial diuretic therapy.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_038",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 26-year-old man comes to the office with a 4-week history of malaise, abdominal pain, and diarrhea. Two days ago, he noticed streaks of blood in his stool. The patient has not traveled recently and has not eaten anything out of the ordinary. He has no prior medical problems. The patient occasionally drinks alcohol but does not use tobacco or illicit drugs. His father was diagnosed with colon cancer at age 55 and died of metastatic disease 5 years later. Temperature is 38 C (100.4 F). Abdominal examination reveals tenderness in the periumbilical area and left lower quadrant with no guarding or rebound tenderness. Bowel sounds are increased. Rectal examination shows no hemorrhoids or fissures, but blood-streaked stool is present in the rectal vault. Stool cultures and testing for infections, including Clostridium difficile, are negative. Colonoscopy shows edematous, friable mucosa; multiple ulcerations; and exudates involving the entire colon. Biopsies reveal mononuclear cell infiltrates, cryptitis, and crypt abscesses. Medical therapy is started. A follow-up colonoscopy 8 weeks later shows minimal mucosal edema but is otherwise unremarkable. Which of the following is the best recommendation regarding colorectal cancer screening in this patient?",
    "choice_a": "Annual colonoscopy beginning now",
    "choice_b": "Colonoscopy at age 40 and then every 5 years",
    "choice_c": "Colonoscopy at age 50 and then every 10 years",
    "choice_d": "Colonoscopy in 8 years and then every 1-3 years",
    "choice_e": "Colonoscopy in 12 years and then every 1-3 years",
    "correct_answer": "D",
    "explanation": "This patient most likely has ulcerative colitis with moderate symptoms. Infectious causes of diarrhea must be ruled out prior to a diagnosis of inflammatory bowel disease (IBD). Endoscopy and biopsy findings of ulcerative colitis include rectal involvement, friable mucosa, exudates, crypt abscesses, glandular atrophy, and continuous colonic involvement. Individuals with IBD are at increased risk for developing colorectal cancer. Patients with ulcerative colitis involving the entire colon (pancolitis, as with this patient) or those with Crohn disease with colonic involvement should have a surveillance colonoscopy 8-10 years post diagnosis. If ulcerative colitis is limited to the left colon, colonoscopy is recommended starting 12-15 years post diagnosis (Choice E). Biopsies are taken to assess for colonic dysplasia. Once surveillance colonoscopy is initiated, it is generally repeated every 1-3 years. (Choice A) Annual surveillance colonoscopy is indicated for genetic colorectal cancer syndromes and for IBD once screening colonoscopy has been initiated. (Choice B) Patients with a first-degree relative with colorectal cancer of adenomatous polyps diagnosed at age <60 or ≥2 first-degree relatives diagnosed at any age should begin surveillance colonoscopies at age 40 or 10 years younger than the earliest diagnosis (whichever is earlier). Interval screening is then repeated every 5 years. (Choice C) Screening colonoscopy for the average-risk patient should begin at age 50 and continue every 10 years thereafter. Most physicians stop screening for colorectal cancer at age 75.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_039",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 56-year-old man comes to the office due to 2 months of upper abdominal discomfort, bloating, and anorexia. Over this period, the patient has had no nausea, vomiting, or black/tarry stools but has lost 8 kg (17.6 lb). He has a history of hypertension and gout. The patient is an active smoker with a 45 pack-year history and drinks alcohol occasionally. He traveled to Mexico 3 months ago for vacation. Temperature is 37.2 C (99 F), blood pressure is 120/70 mm Hg, pulse is 86/min, and respirations are 12/min. BMI is 29 kg/m². Scleral icterus is present. The abdomen is soft and nondistended. There is mild right upper quadrant discomfort on deep palpation. The liver edge is palpable 3 cm below the right costal margin. Stool testing for occult blood is negative. The remainder of the physical examination shows no abnormalities. Laboratory results are as follows: Serum chemistry: Creatinine 1 mg/dL. Complete blood count: Hemoglobin 12.1 g/dL, Mean corpuscular volume 95 µm³, Platelets 122,000/mm³. Liver function studies: Total Bilirubin 7.3 mg/dL, Direct Bilirubin 5.9 mg/dL, Alkaline phosphatase 524 U/L, Aspartate aminotransferase (SGOT) 44 U/L, Alanine aminotransferase (SGPT) 52 U/L. Abdominal ultrasound shows dilated intrahepatic and extrahepatic bile ducts. The gallbladder is enlarged but no gallstones are visualized. Which of the following is the best next step in management of this patient?",
    "choice_a": "Anti-mitochondrial antibodies",
    "choice_b": "CT scan of the abdomen",
    "choice_c": "Endoscopic retrograde cholangiopancreatography",
    "choice_d": "MR cholangiopancreatography",
    "choice_e": "Serology for viral hepatitis",
    "correct_answer": "B",
    "explanation": "This patient's presentation is most consistent with extrahepatic biliary obstruction. The differential diagnosis includes choledocholithiasis, stricture, pancreatic pathology, and malignancy of the biliary tree. Diagnostic evaluation usually begins with transabdominal ultrasound. However, this test may miss pancreatic lesions due to overlying bowel gas, small lesion size (<3 cm), or lack of skill of the operator. Given the high pretest probability of cancer in this patient (weight loss, anorexia, jaundice, smoking history), the best next step is a helical abdominal CT scan to evaluate for pancreatic malignancy. If CT scan reveals a pancreatic mass, histological diagnosis is then generally made with endoscopic ultrasound- guided fine-needle aspiration. (Choice A) Primary biliary cholangitis is also associated with elevated alkaline phosphatase and cholestatic jaundice but is not typically associated with extrahepatic biliary duct dilation or gallbladder enlargement. Liver biopsy shows inflammation confined to the portal and periportal areas, bridging fibrosis, and/or cirrhosis. (Choices C and D) Both endoscopic retrograde cholangiopancreatography (ERCP) and MR cholangiopancreatography can be used to evaluate the pancreatobiliary tree; ERCP has the added benefit of being able to provide a therapeutic intervention (eg, stent placement). These tests are superior to abdominal CT scan when choledocholithiasis is suspected. However, patients who require imaging of the pancreas for suspected cancer (as in this patient with heavy tobacco use, weight loss, abdominal pain, jaundice, and no gallstones on ultrasound) should first undergo abdominal CT scan as it is lower cost, less invasive, associated with fewer complications, and can provide staging information. If CT shows pancreatic cancer causing biliary obstruction, ERCP with stenting is sometimes used for palliation or as a bridge to surgery. (Choice E) Viral hepatitis typically causes elevation of both AST and ALT without dilated intrahepatic or extrahepatic bile ducts. Although this patient went to Mexico recently, the relatively normal AST and ALT makes this diagnosis less likely.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_040",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 54-year-old man is evaluated for worsening upper abdominal discomfort and heartburn. For the last 5 years, his occasional midepigastric pain after meals and at night was relieved by over-the-counter ranitidine. Over the last 6 months, the patient's symptoms have occurred almost daily and are not relieved by ranitidine. He has had no dysphagia, odynophagia, hematemesis, melena, or weight loss. He has a 40- pack-year smoking history. Vital signs are within normal limits. BMI is 29 kg/m². The abdomen is soft and nontender. Stool occult blood testing is negative. Upper gastrointestinal endoscopy shows moderate esophagitis with red, velvety mucosa extending from the gastroesophageal junction into the distal esophagus. There is a moderate hiatal hernia but no erythema or ulcers in the stomach or duodenum. Biopsy shows Barrett esophagus with high-grade dysplasia. In addition to daily proton pump inhibitor therapy, which of the following is the best next step in management of this patient?",
    "choice_a": "Empiric Helicobacter pylori treatment",
    "choice_b": "Endoscopic ablation therapy",
    "choice_c": "Endoscopy surveillance in 6-12 months",
    "choice_d": "Referral for surgical fundoplication",
    "choice_e": "Repeat endoscopy in 3-5 years",
    "correct_answer": "B",
    "explanation": "Barrett esophagus is replacement in the esophagus of normal stratified squamous epithelium with metaplastic columnar epithelium; the condition predisposes to the development of esophageal adenocarcinoma, especially in men. Consequently, men with a history of chronic gastroesophageal reflux disease (>5 years) or frequent reflux symptoms (eg, heartburn) and ≥2 risk factors (eg, obesity, tobacco use) should be considered for endoscopic screening. Columnar epithelium on endoscopy is usually salmon-colored with a velvety texture; squamous epithelium has a pale and glossy appearance. Following initial endoscopy, patients without macroscopic evidence of Barrett esophagus can undergo routine surveillance endoscopy in 3-5 years (Choice E). Those with evidence of Barrett esophagus need further histologic evaluation for dysplasia and should receive a daily proton pump inhibitor to decrease symptoms, heal esophagitis, and possibly decrease the progression to cancer. Histologically confirmed low-grade dysplasia can be managed by endoscopic eradication therapy (eg, ablation, mucosal resection) or surveillance endoscopy every 6-12 months (Choice C). Confirmed high- grade dysplasia should be managed with endoscopic eradication therapy or esophagectomy; endoscopic eradication is less invasive and is preferred in most patients. (Choice A) Helicobacter pylori infection has not been associated with Barrett esophagus and should not be empirically treated without evidence of infection. (Choice D) Surgical fundoplication is considered in patients who have persistent gastroesophageal reflux disease symptoms despite maximal medical therapy (ie, twice-daily proton pump inhibitor). It is not indicated in the management of Barrett esophagus.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_041",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 54-year-old man comes to the physician for follow-up. He had a recent screening colonoscopy that showed 6 sessile polyps of 4-6 mm in the rectum. All were removed by cold biopsy. Histopathologic examination showed hyperplastic polyps with no dysplasia. His other medical problems include hypertension, reflux disease, osteoarthritis, and migraine headaches. His father was diagnosed with colon cancer at age 72. There is no other family history of malignancy. Physical examination shows no abnormalities. Which of the following studies is the most appropriate follow-up for this patient?",
    "choice_a": "Colonoscopy in 10 years",
    "choice_b": "Colonoscopy in 5 years",
    "choice_c": "Colonoscopy in 3 years",
    "choice_d": "Colonoscopy in 1 to 2 years",
    "choice_e": "Screen for hyperplastic polyposis syndrome",
    "correct_answer": "A",
    "explanation": "Hyperplastic polyps are the most common type of non-neoplastic polyps found on a screening colonoscopy. Patients with small, distal (to sigmoid colon) hyperplastic polyps are considered to have normal colonoscopies and are at no increased risk of colorectal cancer. In addition, having one first-degree relative with colon cancer diagnosed at age >60 (as opposed to at a younger age) does not increase a patient's personal risk of colon cancer. Therefore, this patient needs screening for average risk guidelines. He should have repeat colonoscopy in 10 years. (Choice B) Patients with 1 or 2 small (< 1 cm) tubular adenomas should have repeat colonoscopy in 5 years. (Choice C) Patients with 3-10 adenomas, any adenomas >1 cm, or with high-grade dysplasia or villous features should have a repeat colonoscopy in 3 years. (Choice D) Colonoscopy in 1-2 years is recommended for patients with >10 adenomas. (Choice E) Hyperplastic polyposis syndrome (HPS) requires specific criteria such as 5 or more proximal hyperplastic polyps (at least 2 >1 cm) or >30 polyps throughout the colon. This patient has only 6 distal polyps and does not meet the criteria.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_042",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 52-year-old woman is evaluated for a 1-year history of diarrhea. The patient describes \"runs\" of watery diarrhea that last several weeks before subsiding but then reappear. She has been taking over-the-counter loperamide and bismuth subsalicylate, which provide only transient symptom relief. The patient has also experienced a 5-kg (11-lb) weight loss over the past year but has had no fever, abdominal pain, or rectal bleeding. Medical history is notable for hypertension and depression treated with ramipril and fluoxetine, respectively. She is an ex-smoker with a 12-pack-year history and does not drink alcohol. Vital signs are normal. Examination reveals mild, generalized abdominal tenderness with no guarding or rebound tenderness. Bowel sounds are normal. Test for stool occult blood is negative. Blood cell counts, serum chemistry studies, and TSH levels are within normal limits. HIV and stool tests for infection are negative. IgA anti-tissue transglutaminase antibodies are negative with normal IgA levels. Colonoscopy reveals grossly normal terminal ileal and colonic mucosa. Random biopsies show a lymphocyte-predominant mononuclear infiltrate with few neutrophils and eosinophils in the lamina propria. Crypt architecture is preserved, but focal cryptitis is present. Which of the following is most appropriate next step in management of this patient's illness?",
    "choice_a": "Amitriptyline",
    "choice_b": "Gluten-free diet",
    "choice_c": "Hydrocortisone suppository",
    "choice_d": "Mesalamine enema",
    "choice_e": "Oral budesonide",
    "correct_answer": "E",
    "explanation": "This patient has microscopic colitis (MC), which disproportionately affects middle-aged women and presents with chronic watery, nonbloody diarrhea. The colon appears grossly normal by colonoscopy, but biopsy reveals mononuclear lymphocytic infiltrates in the lamina propria. Initial treatment includes antidiarrheal agents and withdrawal of possible triggering medications (e.g., NSAIDs, PPIs). Oral budesonide may be added for active disease or persistent symptoms. (Choice A) Tricyclic antidepressants are used for irritable bowel syndrome, which would not typically cause weight loss or biopsy abnormalities. (Choice B) A gluten-free diet is for celiac disease, which is ruled out here by negative serology. (Choices C and D) Hydrocortisone and mesalamine are used in ulcerative colitis, which presents with bloody diarrhea and gross mucosal changes.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_043",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 33-year-old man comes to the office for a routine follow-up visit. He was recently treated for esophageal achalasia with a pneumatic dilation. He reports a significant improvement in symptoms of dysphagia and nocturnal regurgitation. His past medical history is also significant for borderline hypertension and an anxiety disorder. He is an ex-smoker with a 5 pack-year smoking history. His mother suffered from Sjogren's disease and lymphoma. His medications include omeprazole and clonazepam. His blood pressure is 135/85 mmHg and his pulse is 67/min. His BMI is 30 kg/m². His physical examination is otherwise unremarkable. Over the next 10 years, the patient is at the highest risk for which of the following?",
    "choice_a": "Fibrosing mediastinitis",
    "choice_b": "Non-Hodgkin's lymphoma",
    "choice_c": "Pyloric stenosis",
    "choice_d": "Squamous cell carcinoma",
    "choice_e": "Zenker's diverticulum",
    "correct_answer": "D",
    "explanation": "Achalasia involves decreased peristalsis of the distal esophagus with failed relaxation of the lower esophageal sphincter. It confers an increased risk for esophageal cancer, specifically squamous cell carcinoma. Stasis and fermentation cause mucosal inflammation and dysplasia, leading to malignancy. (Choice A) Fibrosing mediastinitis is caused by long-standing mediastinal inflammation (e.g., tuberculosis) or radiation, not achalasia. (Choice B) While lymphoma can cause pseudoachalasia, achalasia itself does not increase lymphoma risk. (Choice C) Achalasia affects the LES; pyloric stenosis is usually congenital or secondary to mass lesions/ulcers at the stomach outlet. (Choice E) Zenker's diverticulum occurs in the upper esophagus due to cricopharyngeal dysfunction.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_044",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 33-year-old man comes to the office due to persistent anal pain. Two months ago, the patient experienced severe anal pain associated with bowel movements. Evaluation revealed an anal fissure and external hemorrhoids for which he was treated with stool softeners and topical nitroglycerine. His symptoms have persisted despite adherence with the medical therapy and high-fiber diet. He reports no history of anal trauma or anal intercourse. Vital signs are within normal limits. Rectal examination is painful and reveals a posterior midline anal fissure, large skin tag, and external hemorrhoids with no thrombosis. The remainder of the physical examination shows no abnormalities. Blood cell counts and serum chemistry studies are within normal limits. Which of the following is the most appropriate next step in management of this patient's disorder?",
    "choice_a": "Anal ulcer biopsy to rule out malignancy",
    "choice_b": "Colonoscopy to rule out Crohn disease",
    "choice_c": "Rapid plasma reagin test for syphilis",
    "choice_d": "Rubber band ligation of the hemorrhoids",
    "choice_e": "Serologic tests for celiac disease",
    "correct_answer": "B",
    "explanation": "This patient has a persistent anal fissure despite optimal medical therapy. While most fissures are in the posterior midline, further evaluation is indicated for those failing to respond after 8 weeks of therapy. Crohn disease is a common cause of atypical or nonhealing anal fissures. Therefore, patients with persistent fissures require a colonoscopy and small-bowel imaging to rule out Crohn disease. (Choice A) Malignancy is unlikely given the short 2-month duration and typical location. (Choice C) Primary syphilis chancre is typically painless. (Choice D) Rubber band ligation is for internal hemorrhoids refractory to conservative management, not for fissures. (Choice E) Celiac disease typically presents with iron-deficiency anemia and malabsorption, not isolated anal pain.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_045",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 29-year-old previously healthy man comes to the physician with malaise, rash, and joint pain with swelling for the last week. He has no energy and can hardly get out of bed. He has no abdominal pain, vomiting, or genital lesions. The patient reports several new sexual partners over the last year and says that he had a negative HIV test 2 months ago. He smokes marijuana but does not use tobacco, alcohol, or other illicit drugs. His temperature is 38.2° C (100.7° F), blood pressure is 122/68 mm Hg, and pulse is 89/min. Several small, mobile lymph nodes are palpated in the submandibular region. There is no pharyngeal erythema. There is diffuse swelling, warmth, and pain with active motion in the elbow, knee, and ankle joints. The abdomen is soft and mildly tender in the epigastrium. There is no hepatosplenomegaly. Multiple urticarial skin lesions with excoriation are seen on the upper and lower extremities. There are no oral or genital lesions. Laboratory results are as follows: Hemoglobin 13.2 g/dL, Creatinine 0.8 mg/dL, Albumin 3.9 g/dL, Total bilirubin 1.1 mg/dL, Alkaline phosphatase 60 U/L, Aspartate aminotransferase (SGOT) 298 U/L, Alanine aminotransferase (SGPT) 355 U/L. Which of the following would be most helpful in establishing a diagnosis in this patient?",
    "choice_a": "Anti dsDNA antibodies",
    "choice_b": "Lyme disease serology",
    "choice_c": "Monospot test",
    "choice_d": "Serum hepatitis B surface antigen testing",
    "choice_e": "Urethral swab",
    "correct_answer": "D",
    "explanation": "The clinical presentation suggests a serum sickness-like reaction associated with acute hepatitis B viral (HBV) infection. This reaction includes fever, rash (pruritic and urticarial), and symmetric polyarthritis. It is due to the accumulation of immune complexes during the pre-icteric phase of HBV. Diagnosis is confirmed by the presence of hepatitis B surface antigen (HBsAg). (Choice A) Lupus can present with similar symptoms but urticarial lesions are rare. (Choice B) Lyme disease presents with erythema migrans, not urticaria, and serology is not helpful in the acute phase. (Choice C) Mononucleosis presents with sore throat and splenomegaly. (Choice E) Disseminated gonococcal infection presents with purulent arthritis or a triad of tenosynovitis, dermatitis (painless pustules), and polyarthralgias, which is inconsistent with this patient's presentation.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_046",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 24-year-old man is brought to the physician for a follow-up appointment. He initially presented 4 weeks ago with an acute episode of psychosis and personality changes, and he was prescribed low dose risperidone. He subsequently developed tremor and gait abnormalities. The patient's father died from liver failure at age 40. He has two siblings who are alive and healthy. The patient drinks 2-3 beers daily and has smoked two packs of cigarettes per day for the last five years. His vital signs are within normal limits. The patient's BMI is 23 kg/m². Lungs are clear to auscultation. Examination reveals a nontender abdomen. The liver is palpable 3 cm below the right costal margin. A bilateral resting tremor is noted in his hands. Laboratory studies from 4 weeks ago: Total Bilirubin 2.0 mg/dL, Alkaline phosphatase 160 U/L, Aspartate aminotransferase (SGOT) 116 U/L, Alanine aminotransferase (SGPT) 96 U/L. Hepatitis B and C panels are negative. Toxicology screen is negative. Which of the following is the most appropriate next step in management?",
    "choice_a": "Anti-smooth muscle antibodies",
    "choice_b": "Eye slit lamp examination",
    "choice_c": "Iron studies",
    "choice_d": "Lumbar puncture",
    "choice_e": "Serum alpha-1 antitrypsin levels",
    "correct_answer": "B",
    "explanation": "The combination of liver abnormalities, family history of early liver disease, and neuropsychiatric symptoms (psychosis, tremor, gait abnormalities) in a young patient suggests Wilson disease (hepatolenticular degeneration). Wilson disease causes copper accumulation in the liver and brain. Kayser-Fleischer rings (copper deposition in the eye) are present in over 90% of patients with neurological symptoms. Therefore, a slit lamp examination is a critical diagnostic step. (Choice A) Anti-smooth muscle antibodies are for autoimmune hepatitis, which is unlikely given the neurologic features. (Choice C) Hemochromatosis involves liver disease but neurologic symptoms are rare. (Choice D) Lumbar puncture is for meningitis/encephalitis; the patient lacks fever or altered mentation. (Choice E) Alpha-1 antitrypsin deficiency primarily causes liver and lung disease (emphysema) without these neurologic findings.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_047",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 34-year-old woman comes to the physician for nausea, vomiting, and early satiety over the last 2 weeks. The vomiting occurs mostly after eating, even though she consumes small portions. She underwent Roux- en-Y gastric bypass surgery for morbid obesity 3 months ago. Her post-operative course was uncomplicated. Prior to the surgery, she had acid reflux disease, type 2 diabetes mellitus, hypertension, and hyperlipidemia. The patient has lost 15.9 kg (35 lb) since the surgery. She currently takes omeprazole, a daily multivitamin, and calcium, iron, and vitamin B12 supplements. Vital signs are within normal limits. Physical examination shows well-healed surgical scars on the abdomen but is otherwise unremarkable. Laboratory results: Hematocrit 34%, MCV 81 fL, Platelets 220,000/µL, Leukocytes 7,500/µL, BUN 21 mg/dL, Creatinine 1.0 mg/dL. Which of the following is the most likely diagnosis?",
    "choice_a": "Bulimia nervosa",
    "choice_b": "Eosinophilic esophagitis",
    "choice_c": "Gastroparesis",
    "choice_d": "Schatzki ring",
    "choice_e": "Stomal stenosis",
    "correct_answer": "E",
    "explanation": "The clinical presentation suggests outlet obstruction from stomal stenosis, a common complication of Roux-en-Y gastric bypass (RYGB). Stomal stenosis at the gastro-jejunal anastomosis typically presents 3-6 months after surgery with nausea, vomiting, and early satiety. Diagnosis is made with endoscopy. (Choice A) Bulimia nervosa involves binge eating followed by compensatory behaviors and is not an expected post-surgical complication. (Choice B) Eosinophilic esophagitis causes food impaction and is associated with allergic disorders. (Choice C) Gastroparesis presents with chronic bloating and fullness, often in long-standing diabetics, but the acute onset 3 months after RYGB favors stenosis. (Choice D) Schatzki rings cause solid food dysphagia but not typically vomiting or early satiety.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_048",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 43-year-old woman with no significant medical history comes to the physician with episodic rectal pain for the past 8 months. About once a month she has severe rectal pain that lasts for minutes and resolves without intervention. She has no fever, diarrhea, anal trauma, rectal bleeding, or weight loss. She has 1 formed bowel movement every 3 days without any straining and does not associate the pain with bowel movements. She takes no medications. Vital signs and physical examination (including rectal and pelvic) are normal. Laboratory results are normal. Colonoscopy is notable for small internal hemorrhoids and mild diverticulosis. Which of the following is the most likely cause of this patient's symptoms?",
    "choice_a": "Endometriosis",
    "choice_b": "Fibromyalgia",
    "choice_c": "Irritable bowel syndrome",
    "choice_d": "Proctalgia fugax",
    "choice_e": "Somatization disorder",
    "correct_answer": "D",
    "explanation": "The presentation suggests proctalgia fugax, a functional disorder characterized by recurrent, severe rectal pain lasting seconds to minutes with no pain between episodes. Diagnosis requires the exclusion of other causes. Normal physical exam and colonoscopy support this. (Choice A) Endometriosis presents with chronic pelvic pain, dysmenorrhea, and bowel/bladder symptoms. (Choice B) Fibromyalgia presents with widespread soft-tissue tenderness and fatigue. (Choice C) Irritable bowel syndrome involves chronic abdominal pain and altered bowel habits, often relieved by defecation. (Choice E) Somatization involves a history of many unexplained physical symptoms and often psychiatric comorbidity.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_049",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 58-year-old man comes to the office due to progressive generalized weakness, leg swelling, and abdominal distension for the past several months. The patient also notes that his previously small umbilical hernia has recently enlarged, and he would like it repaired. He has no abdominal pain, hematemesis, or melena. His other medical conditions include type 2 diabetes mellitus, hypercholesterolemia, hypertension, obesity, and nonalcoholic steatohepatitis. He does not use tobacco, alcohol, or illicit drugs. Blood pressure is 102/76 mm Hg. Examination shows moderate ascites and 2+ bilateral lower extremity pitting edema. Laboratory results show thrombocytopenia (Platelets 90,000/mm³), Albumin 2.8 g/dL, Total bilirubin 2.7 mg/dL, and INR 1.6. Ultrasonography shows moderate ascites, splenomegaly, and a shrunken liver. Ascitic fluid analysis: leukocyte count 440/mm³ with 20% neutrophils, protein 1.8 g/dL, and albumin 1.2 g/dL. In addition to dietary salt restriction and diuretic therapy, which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Fluoroquinolone prophylactic therapy",
    "choice_b": "Nonselective beta blocker therapy",
    "choice_c": "Referral for surgical hernia repair",
    "choice_d": "Triple-phase CT scan of the abdomen",
    "choice_e": "Upper gastrointestinal endoscopy",
    "correct_answer": "E",
    "explanation": "This patient has decompensated cirrhosis (ascites, thrombocytopenia, shrunken liver). Current guidelines recommend a screening upper endoscopy (EGD) at the time of diagnosis of cirrhosis to document the presence of esophageal varices and assess bleeding risk. (Choice A) Spontaneous bacterial peritonitis (SBP) prophylaxis is not indicated here; the patient doesn't meet the protein/renal criteria or have a current GI bleed. (Choice B) Beta blockers are not recommended before an EGD has documented varices. (Choice C) Hernia repair should be deferred until ascites is medically controlled. (Choice D) HCC screening is done with ultrasound every 6 months; CT is not recommended for screening.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_050",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 41-year-old man comes to the office for follow-up after a recent upper gastrointestinal endoscopy and small-bowel biopsy for suspected celiac disease. He initially presented 6 weeks ago with diarrhea and weight loss. The patient has followed a gluten-free diet since then and has noticed significant improvement in his bowel symptoms. He has no other medical problems. Laboratory results today show hemoglobin of 12.8 g/dL (up from 11.0 g/dL) and consistent small-bowel biopsy results. Which of the following additional interventions is needed at this time?",
    "choice_a": "Colonoscopy",
    "choice_b": "Helicobacter pylori screening",
    "choice_c": "Hepatitis A vaccination",
    "choice_d": "Herpes zoster vaccination",
    "choice_e": "Pneumococcal vaccination",
    "correct_answer": "E",
    "explanation": "Celiac disease is associated with hyposplenism. Therefore, pneumococcal vaccination is recommended at the time of diagnosis, regardless of patient age. (Choice A) Colonoscopy is not part of the standard workup for celiac disease and it does not increase colorectal cancer risk. (Choice B) H. pylori can cause duodenal changes, but the patient's gluten responsiveness confirms celiac disease. (Choices C and D) Risk for Hepatitis A and Shingles is not increased in celiac disease; vaccination follows general population guidelines.",
    "source": "ABIM - Gastrointestinal Nutrition - @USMLEWorldStep3(1)(1).pdf"
  },
  {
    "id": "GI_051",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 62-year-old man comes to the physician with complaints of vague abdominal discomfort. He has a history of liver cirrhosis due to hepatitis C infection and prior heavy alcohol use. He failed hepatitis C treatment 6 years ago. The patient has no vomiting, weight loss, rectal bleeding, or dark stools. He is an ex-smoker with a 35-pack-year history. His blood pressure is 102/65 mm Hg and pulse is 90/min. Lungs are clear on auscultation. The abdomen is nontender with presence of a small fluid wave. There is trace bilateral lower-extremity edema. Laboratory results are as follows: Hemoglobin 10.5 g/dL, Platelets 80,000/µL, Creatinine 0.8 mg/dL, Albumin 3.0 g/dL, Total bilirubin 1.0 mg/dL, Aspartate aminotransferase (SGOT) 45 U/L, Alanine aminotransferase (SGPT) 72 U/L, International Normalized Ratio 1.3, Alpha-fetoprotein 200 ng/mL (normal, 0-20 ng/mL). Which of the following is the best next step in management of this patient?",
    "choice_a": "Abdominal ultrasound",
    "choice_b": "Carcinoembryonic antigen level",
    "choice_c": "CT scan of the abdomen",
    "choice_d": "Liver biopsy",
    "choice_e": "Repeat alpha-fetoprotein in 3 months",
    "correct_answer": "C",
    "explanation": "This patient with cirrhosis has a significantly elevated alpha-fetoprotein (AFP) level (200 ng/mL), which is highly suspicious for hepatocellular carcinoma (HCC). While ultrasound is used for screening every 6 months in cirrhotics, an AFP >20 ng/mL or a suspicious nodule requires a more definitive imaging study. A triple-phase contrast-enhanced CT scan or MRI of the abdomen is the best next step to diagnose HCC. These studies show characteristic arterial enhancement and 'washout' in the venous phase. (Choice A) Ultrasound is a screening tool; since the AFP is already markedly elevated, more sensitive imaging (CT/MRI) is needed. (Choice B) Carcinoembryonic antigen (CEA) is a marker for colorectal cancer, not HCC. (Choice D) Liver biopsy is often not required if imaging is diagnostic and carries a risk of needle-track seeding. (Choice E) Waiting 3 months is inappropriate given the high risk of malignancy.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_052",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 54-year-old man comes to the physician for a 4-week history of fatigue and exertional dyspnea. He also notes occasional dark stools. He has a history of hypertension and osteoarthritis. He takes lisinopril and intermittently uses naproxen. He does not use tobacco or alcohol. Physical examination shows pale conjunctivae. The abdomen is soft and nontender. Rectal examination shows brown stool that is positive for occult blood. Laboratory results show: Hemoglobin 9.2 g/dL, Mean corpuscular volume 74 fL, Platelets 350,000/µL. An upper endoscopy reveals a small hiatal hernia and mild gastritis but no evidence of active bleeding or ulcers. Colonoscopy shows few diverticula in the sigmoid colon but is otherwise normal. Biopsy of the distal duodenum is negative for celiac disease. Which of the following is the most appropriate next step in management?",
    "choice_a": "Capsule endoscopy",
    "choice_b": "Labeled erythrocyte scintigraphy",
    "choice_c": "Serum anti-tissue transglutaminase antibody",
    "choice_d": "Small-bowel enteroclysis",
    "choice_e": "Upper gastrointestinal series with small-bowel follow-through",
    "correct_answer": "A",
    "explanation": "Patients with iron deficiency anemia and positive stool occult blood require evaluation of both the upper and lower gastrointestinal tracts to avoid missing synchronous lesions. If both upper endoscopy and colonoscopy are negative, the source is considered obscure gastrointestinal bleeding. The most appropriate next step for identifying a source in the small bowel is wireless capsule endoscopy. (Choice B) Labeled erythrocyte (radionuclide) scans require active, relatively rapid bleeding (0.1-0.5 mL/min) and are poor for slow occult loss. (Choice C) While celiac disease causes iron deficiency, the duodenal biopsy was already negative. (Choice D) Enteroclysis has a lower diagnostic yield than capsule endoscopy. (Choice E) Small-bowel follow-through has low sensitivity for the mucosal lesions (e.g., angiodysplasias) that often cause obscure bleeding.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_053",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 62-year-old man comes to the physician with complaints of vague abdominal discomfort. He has a history of liver cirrhosis due to hepatitis C infection and prior heavy alcohol use. He failed hepatitis C treatment 6 years ago. The patient has no vomiting, weight loss, rectal bleeding, or dark stools. He is an ex-smoker with a 35-pack-year history. His blood pressure is 102/65 mm Hg and pulse is 90/min. Lungs are clear on auscultation. The abdomen is nontender with presence of a small fluid wave. There is trace bilateral lower-extremity edema. Laboratory results show Hemoglobin 10.5 g/dL, Platelets 80,000/μL, Creatinine 0.8 mg/dL, Albumin 3.0 g/dL, Total bilirubin 1.0 mg/dL, AST 45 U/L, ALT 72 U/L, INR 1.3, and Alpha-fetoprotein 200 ng/mL. Abdominal ultrasound shows a nodular, cirrhotic liver and a 2-cm dominant nodule with poorly defined borders in the right lower lobe. There is mild splenomegaly. What is the best next step in management of this patient?",
    "choice_a": "Order MRI of liver",
    "choice_b": "Order percutaneous biopsy of dominant liver nodule",
    "choice_c": "Sorafenib therapy",
    "choice_d": "Surgical resection of dominant liver nodule",
    "choice_e": "Ultrasound follow-up in 2-3 months",
    "correct_answer": "A",
    "explanation": "This patient with known cirrhosis has abdominal pain, elevated alpha-fetoprotein (AFP), and a 2-cm mass found on ultrasound. He needs an MRI of the liver as it has better sensitivity and specificity than CT scan or ultrasound in differentiating malignant nodules from the regenerative nodules associated with cirrhosis. Routine surveillance for HCC in high-risk patients is done with abdominal ultrasound every 6 months. Early detection of HCC (tumors < 2 cm) offers the advantage of several treatment options. Percutaneous biopsy is associated with bleeding and tumor seeding and is recommended only when initial imaging does not provide a clear diagnosis. Surgical resection requires anatomic delineation best achieved with multiphase CT or MRI. Ultrasound follow-up in 3 months is only for lesions < 1 cm.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_054",
    "system": "Gastrointestinal Nutrition",
    "stem": "An asymptomatic 52-year-old man is evaluated for a nonobstructing mass in his left colon (32 cm from the anorectal verge) found on routine screening colonoscopy. There were no other lesions. The mass was biopsied and diagnosed as grade II colon adenocarcinoma. His other medical problems include hypertension. The patient is a former smoker. CT scan of the chest, abdomen, and pelvis shows a 2.5-cm left colonic lesion that appears to invade the serosa and an enlarged 1.5-cm adjacent lymph node. Two 1.5-cm masses with irregular borders are seen within the right lobe of the liver close to, but not abutting, the capsule. There are no other imaging abnormalities. Which of the following is the most appropriate course of action in management of this patient?",
    "choice_a": "Biopsy of the liver lesion",
    "choice_b": "Chemotherapy and hospice assessment",
    "choice_c": "Chemotherapy followed by surgical assessment",
    "choice_d": "Hemicolectomy and resection of liver masses followed by chemotherapy",
    "choice_e": "Hemicolectomy and resection of liver masses only",
    "correct_answer": "D",
    "explanation": "Approximately 20% of patients with colorectal cancer have metastatic disease at diagnosis. Most cases are incurable, but patients with liver-isolated colorectal cancer can sometimes be cured with surgical resection. Surgery can generally proceed if <70% of the liver is involved and there is no evidence of hepatic artery, major bile duct, main portal vein, or celiac/para-aortic lymph node disease. Subsequent chemotherapy should then be offered to maximize cure rates. This patient with 2 liver lesions in a single lobe and no other significant comorbidities is a good candidate for concurrent resection followed by chemotherapy. Chemotherapy followed by surgical assessment is used for those who do not initially qualify for concurrent resection due to tumor invasiveness.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_055",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 62-year-old man is being evaluated for a 6-month history of occasional epigastric pain that is relieved by eating. The patient has tried over-the-counter antacids and ranitidine with some relief. He has had no dysphagia, weight loss, black stools, or blood in the stool. The patient immigrated to the United States from China at age 12. He had a normal screening colonoscopy 2 years ago. BMI is 24 kg/m2. The abdomen is soft and nontender. Rectal examination reveals guaiac-negative stool. Which of the following is the most appropriate management for this patient?",
    "choice_a": "Abdominal ultrasonography",
    "choice_b": "Barium swallow study",
    "choice_c": "Helicobacter pylori stool antigen testing",
    "choice_d": "Proton pump inhibitor for 6 weeks",
    "choice_e": "Upper gastrointestinal endoscopy",
    "correct_answer": "E",
    "explanation": "This patient has dyspepsia. Because of an increased incidence of upper gastrointestinal malignancy, patients age ≥60 with new-onset dyspepsia should undergo upper gastrointestinal endoscopy. Patients age <60 with alarm features (eg, family history of gastric cancer, unintended weight loss, dysphagia, gastrointestinal bleeding) should also be assessed for the need for endoscopy. Patients age <60 in whom endoscopy is not initially indicated should be tested for H. pylori or undergo a trial of a PPI if testing is negative. Abdominal ultrasonography is not routinely recommended for dyspepsia. Barium swallow is not sensitive for serious causes of dyspepsia.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_056",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 58-year-old woman comes to the office due to diarrhea over the past 6 months. Every day, the patient has 3 or 4 watery bowel movements that sometimes awaken her at night. She has fecal urgency and mild abdominal discomfort relieved after bowel movements. Medications include regular use of naproxen and loratadine. Stool studies for occult blood, leukocytes, ova and parasites, and C. difficile are negative. Colonoscopy is grossly normal, but random mucosal biopsies reveal an abnormally thickened subepithelial collagen band. Which of the following is the most appropriate next step in management?",
    "choice_a": "Daily mesalamine",
    "choice_b": "Psychological assessment",
    "choice_c": "Stoppage of naproxen",
    "choice_d": "Trial of gluten-free diet",
    "choice_e": "Trial of lactose-free diet",
    "correct_answer": "C",
    "explanation": "This woman has microscopic colitis, specifically collagenous colitis (characterized by a thickened subepithelial collagen band). Microscopic colitis most commonly affects middle-aged women and is often triggered by medications (eg, NSAIDs like naproxen, PPIs, SSRIs) and smoking. It presents with chronic watery, nonbloody diarrhea. Diagnosis is made with colonoscopy and biopsy as the mucosa appears grossly normal. Initial treatment is smoking cessation and stoppage of possible triggering medications. Antidiarrheal agents and oral budesonide may be used for active disease or persistent symptoms. Mesalamine has not been shown to be beneficial in collagenous colitis.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_057",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 35-year-old woman comes to the office due to postprandial fullness, early satiety, and epigastric pain for the past 6 months. She has had no blood in the stool and has not lost weight. Two months ago, she tried omeprazole for 2 weeks with minimal improvement. Medical history includes generalized anxiety disorder. Her mother was diagnosed with colon cancer at age 62. Physical examination is normal except for mild epigastric tenderness. Laboratory results including hemoglobin and fecal occult blood are normal. Which of the following is the best next step in management?",
    "choice_a": "CT scan of the abdomen",
    "choice_b": "Empiric treatment for Helicobacter pylori",
    "choice_c": "Proton pump inhibitor trial for 6 weeks",
    "choice_d": "Stool antigen assay for H pylori",
    "choice_e": "Upper gastrointestinal endoscopy",
    "correct_answer": "D",
    "explanation": "This patient has dyspepsia without NSAID use or symptoms of GERD. In patients age <60 without alarm features, noninvasive testing for H. pylori is warranted to avoid unnecessary endoscopy. Tests for active infection include the urea breath test or stool antigen testing. PPIs can decrease the sensitivity of these tests and should ideally be withheld for 2 weeks prior to testing. If H. pylori testing is negative, a trial of acid suppression (PPI) should be pursued. Endoscopy is indicated for patients age ≥60 or those with alarm features (eg, significant weight loss, anemia).",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_058",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 45-year-old woman comes to the physician with postprandial epigastric discomfort. She had no relief from lansoprazole. Laboratory results show Hemoglobin 12.4 g/dL, Platelets 120,000/μL, Serum gastrin 1,100 pg/mL (normal 0-110), and Gastric pH 6.0. Upper gastrointestinal endoscopy shows flattened rugae in the gastric body and fundus, and normal duodenum. Biopsy from the fundus shows intestinal metaplasia with presence of goblet cells. Which of the following is the most likely diagnosis?",
    "choice_a": "Barrett's esophagus",
    "choice_b": "Chronic atrophic gastritis",
    "choice_c": "Crohn's disease",
    "choice_d": "Ménétrier's disease",
    "choice_e": "Zollinger-Ellison syndrome",
    "correct_answer": "B",
    "explanation": "The presentation and findings suggest metaplastic (chronic) atrophic gastritis (MAG). MAG can be autoimmune (AMAG) or environmental (EMAG). AMAG is associated with other autoimmune conditions, increases the risk of gastric carcinoid tumors and adenocarcinoma, and often presents with hypochlorhydria leading to elevated serum gastrin levels. Serum gastrin >1000 pg/mL can also be seen in Zollinger-Ellison syndrome, but ZES is characterized by a very acidic gastric pH (< 5.0). Ménétrier's disease presents with enlarged gastric folds, not flattened rugae. Barrett's esophagus involves the esophagus, which was normal here.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_059",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 43-year-old woman with type 1 diabetes complicated by nephropathy and neuropathy comes for nausea, vomiting, and early satiety. She is afraid to eat due to postprandial bloating. Examination reveals a distended abdomen with an obvious succussion splash. Laboratory results show Creatinine 1.4 mg/dL and Glucose 180 mg/dL. Urinalysis shows 2+ protein and glucose. Which of the following is the most appropriate next step in management?",
    "choice_a": "Intensify insulin regimen and re-evaluate in 4-6 weeks",
    "choice_b": "Order abdominal ultrasound",
    "choice_c": "Perform upper endoscopy",
    "choice_d": "Schedule scintigraphic gastric-emptying study",
    "choice_e": "Start metoclopramide therapy",
    "correct_answer": "C",
    "explanation": "The patient's symptoms and succussion splash are consistent with impaired gastric emptying, which could be due to gastroparesis or gastric outlet obstruction (GOO). Although she likely has diabetic gastroparesis, the definition of gastroparesis requires excluding mechanical obstruction. Therefore, the first step is upper endoscopy to rule out mechanical or mucosal etiologies of GOO. Once obstruction is excluded, a scintigraphic gastric-emptying study is used to confirm delayed emptying. Metoclopramide treats confirmed gastroparesis but should not be started empirically due to side effects. Ultrasound is not sensitive for gastric obstruction.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_060",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 38-year-old woman returns 6 weeks after completing triple-drug therapy for H. pylori for a duodenal ulcer. She reports improvement but still feels bloated. She is taking daily esomeprazole. Urea breath test is positive. Which of the following is the best next step in management?",
    "choice_a": "Administer quadruple therapy for H pylori",
    "choice_b": "No further intervention is required",
    "choice_c": "Perform H pylori serology test",
    "choice_d": "Repeat esophagogastroduodenoscopy",
    "choice_e": "Stop esomeprazole and repeat urea breath test",
    "correct_answer": "A",
    "explanation": "Up to 20% of patients fail standard triple therapy for H. pylori. Testing for eradication is recommended for persistent symptoms or H. pylori-associated ulcers. PPIs can decrease the sensitivity of urea breath tests, but a positive result while on a PPI is highly suggestive of active infection and treatment failure. Patients who fail initial treatment require an alternate regimen, typically quadruple therapy (PPI + bismuth + metronidazole + tetracycline). Serology cannot distinguish between active and past infection. Repeat endoscopy is not necessary if the breath test is already positive.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_061",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 55-year-old man returns for follow-up 4 weeks after an episode of acute alcoholic pancreatitis. He feels well and has a good appetite but reports mild fullness in the abdomen. Epigastric tenderness is present. Laboratory results show Lipase 1154 U/L. Which of the following is the most likely diagnosis?",
    "choice_a": "Chronic pancreatitis",
    "choice_b": "Pancreatic cancer",
    "choice_c": "Pancreatic pseudocyst",
    "choice_d": "Peptic ulcer disease",
    "choice_e": "Recurrent acute pancreatitis",
    "correct_answer": "C",
    "explanation": "Persistently elevated lipase and abdominal fullness following a resolved attack of acute pancreatitis suggest a pancreatic pseudocyst. These typically occur 4-6 weeks after the initial episode. Diagnosis is confirmed by CT scan showing a fluid-filled mass adjacent to the pancreas. Most pseudocysts resolve spontaneously. Lipase returns to normal within 8-14 days in uncomplicated pancreatitis; persistent elevation indicates complications. Chronic pancreatitis typically presents with pancreatic insufficiency and normal or mildly elevated lipase. Acute pancreatitis presents with severe pain and vomiting, which are absent here.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_062",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 36-year-old man with celiac disease reports 3 months of fatigue, low-grade fevers, abdominal pain, and diarrhea. He has had poor dietary compliance in the past year. Temperature is 38.3 C. Rectal examination shows dark stools positive for blood. Laboratory results show Hemoglobin 9.4 g/dL, Albumin 3.1 g/dL, and ESR 87 mm/h. Which of the following is the most likely cause of his symptoms?",
    "choice_a": "Clostridium perfringens infection",
    "choice_b": "Dietary noncompliance",
    "choice_c": "Intestinal lymphoma",
    "choice_d": "Pancreatic insufficiency",
    "choice_e": "Refractory celiac sprue",
    "correct_answer": "C",
    "explanation": "The presentation of fever, abdominal pain, melena, and diarrhea in a patient with celiac disease—especially with poor dietary compliance—is concerning for enteropathy-associated T cell lymphoma (EATL). EATL is a rare, aggressive lymphoma presenting with B symptoms (fever, weight loss) and GI bleeding. Dietary noncompliance is common for symptom recurrence but usually does not cause persistent fever or significant GI bleeding. Refractory sprue is defined by persistent pathological changes despite a strict diet for 12 months but also does not typically explain fever or melena. Pancreatic insufficiency does not cause fever or bloody stools.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_063",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 32-year-old woman with vitiligo, hypothyroidism, and iron deficiency anemia is evaluated for abnormal liver tests. She has mild fatigue. Laboratory results show Hemoglobin 10.2 g/dL, Albumin 3.2 g/dL, AST 78 U/L, and ALT 100 U/L. Hepatitis serologies are negative. Which of the following is the most likely diagnosis?",
    "choice_a": "Celiac disease",
    "choice_b": "Hereditary hemochromatosis",
    "choice_c": "Lymphocytic colitis",
    "choice_d": "Occult alcohol abuse",
    "choice_e": "Primary biliary cholangitis",
    "correct_answer": "A",
    "explanation": "Celiac disease is a chronic malabsorptive disorder frequently associated with other autoimmune diseases (eg, hypothyroidism, vitiligo). It can present with extraintestinal manifestations like unexplained iron deficiency anemia and elevated aminotransferases, even without classic GI symptoms. Hemochromatosis is unlikely in a premenopausal woman with microcytic anemia. Chronic alcoholic liver injury typically has an AST/ALT ratio > 2:1 and macrocytic anemia. Primary biliary cholangitis usually presents with a predominant elevation in alkaline phosphatase rather than transaminases.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_064",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 35-year-old woman with a history of Roux-en-Y gastric bypass 3 years ago reports 2 months of abdominal bloating, flatulence, and watery diarrhea. Laboratory results show Hemoglobin 11 g/dL and MCV 103 um3. C-reactive protein is normal. Stool testing is negative for occult blood. Which of the following is the most likely cause?",
    "choice_a": "Celiac disease",
    "choice_b": "Inflammatory bowel disease",
    "choice_c": "Irritable bowel syndrome",
    "choice_d": "Microscopic colitis",
    "choice_e": "Small-bowel bacterial overgrowth",
    "correct_answer": "E",
    "explanation": "Small intestinal bacterial overgrowth (SIBO) is a common complication of gastric bypass surgery due to the formation of a blind loop. It presents with bloating, flatulence, and diarrhea. Severe cases cause malabsorption leading to nutritional deficiencies; macrocytic anemia from vitamin B12 deficiency is a common finding. Celiac disease typically causes microcytic anemia from iron deficiency. IBD usually involves elevated inflammatory markers (CRP) and hematochezia. Irritable bowel syndrome does not cause anemia or nutritional deficiencies. Microscopic colitis typically presents in older patients with watery diarrhea rather than bloating and flatulence.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_065",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 49-year-old woman with a lower esophageal ring (Schatzki ring) found on barium esophagogram undergoes endoscopic dilation with complete relief. Which of the following complications is she most likely to develop over the next 5 years?",
    "choice_a": "Asthma/atopic symptoms",
    "choice_b": "Esophageal dysmotility",
    "choice_c": "Gastric ulcers",
    "choice_d": "Iron deficiency",
    "choice_e": "Recurrent rings",
    "correct_answer": "E",
    "explanation": "Schatzki rings account for many cases of solid food dysphagia. While endoscopic dilation provides initial relief, recurrence is extremely common. More than 70%-80% of patients develop recurrence within 5 years. Patients with recurrent symptoms are treated with repeated dilation and acid suppression. Eosinophilic esophagitis is associated with atopic symptoms, but isolated Schatzki rings are not. Esophageal dysmotility is not a typical complication of rings. There is no direct causal link between Schatzki rings and gastric ulcers or iron deficiency.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_066",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 45-year-old man with a BMI of 30 kg/m2 has mildly elevated liver tests (AST 107 U/L, ALT 112 U/L). He consumes 1-2 beers during the week and occasionally more on weekends. Hepatitis B and C serologies have not been checked. Repeat testing shows similar results. What is the most appropriate next step in management?",
    "choice_a": "Advise 10% weight loss and repeat testing",
    "choice_b": "Check viral hepatitis serology",
    "choice_c": "Order a liver biopsy",
    "choice_d": "Recommend alcohol abstinence; repeat testing in 3 months",
    "choice_e": "Screen for celiac disease",
    "correct_answer": "B",
    "explanation": "The most common causes of modest aminotransferase elevations are hepatic steatosis (NAFLD or alcohol-related), medications, viral hepatitis, and hemochromatosis. Although NAFLD is likely given his BMI, it is a diagnosis of exclusion. Other common causes, especially viral hepatitis and hemochromatosis, must be ruled out first. Testing for nonhepatic causes like celiac disease is done only after hepatic causes are excluded. Liver biopsy is reserved for cases where noninvasive testing is inconclusive. The patient's alcohol intake is not considered excessive for his gender.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_067",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 41-year-old woman with metabolic syndrome (diabetes, hypertension, hyperlipidemia, obesity) has mild abdominal discomfort and hepatomegaly. Liver tests show AST 112 U/L, ALT 124 U/L, and Ferritin 440 ng/mL with 40% transferrin saturation. Hepatitis B and C tests are negative. Which of the following is the most likely mechanism of hepatomegaly?",
    "choice_a": "Autoimmune hepatic injury",
    "choice_b": "Hepatic iron overload",
    "choice_c": "Increased central venous pressure",
    "choice_d": "Increased insulin resistance",
    "choice_e": "Toxin-induced liver injury",
    "correct_answer": "D",
    "explanation": "The patient has nonalcoholic fatty liver disease (NAFLD), likely driven by insulin resistance associated with metabolic syndrome. Insulin resistance leads to increased lipid synthesis and decreased lipolysis, causing hepatic steatosis. NAFLD typically has an AST/ALT ratio < 1. Iron studies can be abnormal due to chronic inflammation, but they do not reach the levels seen in hereditary hemochromatosis (eg, Ferritin > 1000). Autoimmune hepatitis usually causes much higher transaminase elevations. Cardiac cirrhosis is unlikely without elevated jugular venous pressure. Toxin-induced injury also typically causes more marked elevations.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_068",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 63-year-old man returns 4 weeks after an episode of acute diverticulitis. He is currently asymptomatic but has chronic constipation. A colonoscopy 6 years ago was normal. His father had colon cancer at age 65. Which of the following is the best next step in management?",
    "choice_a": "Arrange for colonoscopy",
    "choice_b": "Arrange for repeat computed tomography scan of the abdomen",
    "choice_c": "Avoid nuts, seeds, and corn",
    "choice_d": "Encourage high-volume fluid intake",
    "choice_e": "Refer for surgical evaluation",
    "correct_answer": "A",
    "explanation": "Colonoscopy is recommended 2-6 weeks after recovery from acute diverticulitis to evaluate for underlying malignancy (as atypical colon cancer can present similarly) and assess disease severity. Repeat CT is not as sensitive as colonoscopy for ruling out neoplasia. There is no evidence that avoiding nuts or seeds reduces recurrence; in fact, consumption may be inversely associated with risk. A high-fiber diet (not just fluid intake) is suggested to reduce recurrence. Surgery is indicated for complicated or recurrent diverticulitis, not after a single uncomplicated episode.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_069",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 47-year-old woman has fatigue, pruritus, and arthralgias. Liver tests show AST 580 U/L and ALT 520 U/L. Serologies show positive ANA (1:320) and ASMA (1:160). Hepatitis C RNA is negative. Which of the following is the most appropriate pharmacotherapy?",
    "choice_a": "Calcineurin inhibitor",
    "choice_b": "Direct-acting anti-hepatitis C therapy",
    "choice_c": "Exogenous bile acid supplement",
    "choice_d": "Glucocorticoid",
    "choice_e": "Nucleotide analogue targeting hepatitis B virus",
    "correct_answer": "D",
    "explanation": "The presentation and autoantibodies (ANA, ASMA) are consistent with autoimmune hepatitis (AH). Current guidelines recommend treatment with glucocorticoids (prednisone), often combined with azathioprine, for patients with significantly elevated transaminases or incapacitating symptoms. Calcineurin inhibitors are used for refractory cases. Negative HCV RNA rules out active hepatitis C. Ursodeoxycholic acid (exogenous bile acid) treats primary biliary cholangitis, which typically presents with elevated alkaline phosphatase rather than high transaminases. The patient has immunity to hepatitis B, so nucleotide analogues are not indicated.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_070",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 37-year-old man with ulcerative colitis involving the rectum to the mid-descending colon has improved on prednisone. He currently has 3 nonbloody bowel movements daily but stool is guaiac positive. Which of the following is the most appropriate next step?",
    "choice_a": "Continue steroids",
    "choice_b": "Taper steroids off and observe",
    "choice_c": "Taper steroids off and start infliximab",
    "choice_d": "Taper steroids off and start mesalamine",
    "choice_e": "Taper steroids off and start Saccharomyces boulardii",
    "correct_answer": "D",
    "explanation": "Corticosteroids are effective for inducing initial remission in UC but should not be used for maintenance therapy due to long-term risks. The first-line therapy for maintaining remission in mild-to-moderate UC is 5-aminosalicylate drugs like mesalamine. Tapering steroids without initiating maintenance therapy carries a high risk of flare in patients with disease more extensive than isolated proctitis. Infliximab and other advanced therapies are reserved for moderate-to-severe or steroid-dependent disease. Probiotics alone are not effective for maintaining remission.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_071",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 66-year-old man has watery diarrhea for 2 days while taking amoxicillin/clavulanate. He has no fever or abdominal pain. C. difficile PCR is negative. Which of the following is the best next step in management?",
    "choice_a": "Check stool ova and parasites",
    "choice_b": "Proceed with sigmoidoscopy",
    "choice_c": "Repeat Clostridium difficile toxin test",
    "choice_d": "Stop antibiotic and observe clinically",
    "choice_e": "Stop antibiotic and start oral vancomycin",
    "correct_answer": "D",
    "explanation": "The patient likely has antibiotic-associated diarrhea (AAD), which is common with amoxicillin-clavulanate. AAD is typically non-inflammatory and resolves once the antibiotic is stopped. Diagnostic evaluation (like stool studies) is reserved for severe illness (fever, bloody diarrhea, duration > 1 week). Negative C. difficile PCR in an elderly patient without systemic symptoms makes CDI unlikely; repeating the sensitive PCR test is not recommended. Sigmoidoscopy is not required for AAD. Oral vancomycin is not indicated given the negative PCR result.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_072",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 35-year-old man has heartburn refractory to once-daily lansoprazole taken before breakfast. He has no alarm features (weight loss, bleeding). Which of the following is the most appropriate next step?",
    "choice_a": "Advise esophageal pH and impedance testing",
    "choice_b": "Change lansoprazole timing from morning to evening",
    "choice_c": "Increase lansoprazole to 2 times per day",
    "choice_d": "Perform upper gastrointestinal endoscopy",
    "choice_e": "Test and treat for Helicobacter pylori",
    "correct_answer": "C",
    "explanation": "Patients with GERD refractory to once-daily PPI therapy should first maximize therapy to twice-daily PPI. Endoscopy is indicated before increasing the dose only if alarm features are present; otherwise, it is reserved for failure of 4-8 weeks of twice-daily therapy. pH monitoring and impedance testing are also considered after failure of twice-daily therapy. PPIs achieve optimal suppression when taken 30 minutes before a meal after a long fast (breakfast); moving the dose to evening may worsen symptoms. H. pylori testing is for dyspepsia, not standard GERD management.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_073",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 40-year-old woman with morbid obesity (BMI 36), diabetes, and hyperlipidemia has mildly elevated transaminases (AST 110, ALT 126). Ultrasound shows a hyperechoic, enlarged liver and gallstones. Which of the following would most likely improve her liver condition?",
    "choice_a": "Abstinence from alcohol",
    "choice_b": "Iron chelation therapy",
    "choice_c": "Thyroid hormone replacement",
    "choice_d": "Ursodeoxycholic acid",
    "choice_e": "Weight loss",
    "correct_answer": "E",
    "explanation": "The patient has nonalcoholic fatty liver disease (NAFLD) associated with metabolic syndrome. Treatment involves aggressive lifestyle changes, including gradual weight reduction and exercise. Her alcohol intake (1-2 beers/weekend) is not excessive. Iron chelation is for hemochromatosis, which is unlikely in a premenopausal woman. She has subclinical hypothyroidism (elevated TSH, normal T4), which typically does not cause symptoms or liver abnormalities. Ursodeoxycholic acid treats primary biliary cholangitis, which would cause markedly elevated alkaline phosphatase and pruritus.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_074",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 22-year-old man with Crohn's disease has 4-5 loose bowel movements a day following an ileal resection. He has no fever or abdominal tenderness. Inflammatory markers are normal. Which of the following is most likely to improve his symptoms?",
    "choice_a": "Cholestyramine",
    "choice_b": "Lactose-free diet",
    "choice_c": "Mesalamine",
    "choice_d": "Prednisone",
    "choice_e": "Probiotics",
    "correct_answer": "A",
    "explanation": "Ileal resection leads to bile salt malabsorption, which causes secretory diarrhea as bile acids enter the colon and stimulate secretion. Cholestyramine treats this by binding the bile acids. Normal inflammatory markers and the absence of pain/fever make a Crohn's flare (requiring mesalamine or prednisone) less likely. While resections increase the risk of lactose intolerance, his symptoms are more classic for bile salt malabsorption. Probiotics are helpful for conditions like pouchitis or UC but not specifically for bile salt malabsorption.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_075",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 19-year-old student reports 8-10 watery bowel movements daily, including at night. She has a low BMI (17). Stool analysis shows an osmolality of 330 mOsm/kg, stool sodium 78 mEq/L, and stool potassium 22 mEq/L. Duodenal biopsies are normal. Which of the following is the most likely diagnosis?",
    "choice_a": "Collagenous colitis",
    "choice_b": "Crohn's disease",
    "choice_c": "Hyperthyroidism",
    "choice_d": "Magnesium salt consumption",
    "choice_e": "VIPoma",
    "correct_answer": "D",
    "explanation": "The patient has osmotic diarrhea, calculated by an osmotic gap > 75 mOsm/kg [330 - 2*(78+22) = 130]. This is most likely due to factitious diarrhea from laxative abuse (magnesium salt consumption), a condition common in high-achieving women with low BMI. Secretory diarrheas (Collagenous colitis, Crohn's, VIPoma) cause a low osmotic gap (< 50). VIPoma is a rare pancreatic tumor. Hyperthyroidism typically increases stool frequency but doesn't cause a large osmotic gap. Normal duodenal biopsies and the absence of fecal leukocytes rule out celiac and typical Crohn's.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_076",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 64-year-old man has malaise and microcytic anemia (Hb 8.8, MCV 70). Digital rectal examination is positive for occult blood. Upper endoscopy (hiatal hernia, normal biopsies) and colonoscopy (diverticula, otherwise unremarkable) identify no bleeding source. Which of the following is the most appropriate next step?",
    "choice_a": "Meckel's scan",
    "choice_b": "Radiolabeled red blood cell scan",
    "choice_c": "Serum tissue transglutaminase antibodies",
    "choice_d": "Small bowel enteroclysis",
    "choice_e": "Wireless capsule endoscopy",
    "correct_answer": "E",
    "explanation": "The patient has occult GI bleeding (iron deficiency anemia + positive occult blood). When both upper endoscopy and colonoscopy are negative, the next step is evaluation of the small bowel using wireless capsule endoscopy. Meckel's diverticulum is rare in adults over 40. Radiolabeled scans require rapid, overt bleeding to be effective. Celiac disease (TTG antibodies) causes anemia via malabsorption, not usually occult blood loss, and his duodenal biopsy was already normal. Small bowel enteroclysis has a much lower diagnostic yield than capsule endoscopy.",
    "source": "ABIM - Gastrointestinal Nutrition -3.pdf"
  },
  {
    "id": "GI_077",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 65-year-old man comes to the clinic for follow-up after a screening colonoscopy. The examination was limited by poor bowel preparation, but no large polyps or tumors were seen. His colonoscopy at age 60 showed a small tubular adenoma that was removed. He has no abdominal pain, blood in the stool, weight loss, or change in bowel pattern. His other medical problems include hypertension, gout, and osteoarthritis. The patient does not use tobacco, alcohol, or illicit drugs. He has no family history of colon cancer. Physical examination shows no abnormalities. Which of the following is the most appropriate recommendation regarding colon cancer screening in this patient?",
    "choice_a": "Colonoscopy in 5 years",
    "choice_b": "Colonoscopy in 10 years",
    "choice_c": "Colonoscopy within a year",
    "choice_d": "CT colonography now",
    "choice_e": "Fecal immunochemical test now",
    "correct_answer": "C",
    "explanation": "Adequate bowel preparation is essential for a high-quality colonoscopy to ensure that no clinically significant polyps or tumors are missed. Current guidelines recommend that if a screening colonoscopy is limited by poor bowel preparation such that polyps >5 mm cannot be excluded, the procedure should be repeated within a year. This applies even if no large lesions were seen. (Choice A and B) Because the initial preparation was inadequate, the standard 5- or 10-year intervals are not appropriate. (Choice D and E) CT colonography and fecal immunochemical tests (FIT) are alternate screening methods but are not indicated when a follow-up colonoscopy is required due to poor visualization from inadequate preparation.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_078",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 28-year-old woman is evaluated for a 5-day history of severe abdominal pain and distention. The pain started suddenly in the right upper quadrant and has since become diffuse. She has also noticed yellowing of her eyes and skin over the last 2 days. The patient has no other medical problems and takes no medications except for an oral contraceptive pill which she started 6 months ago. Vital signs show a temperature of 37.8 C (100 F), blood pressure of 110/70 mm Hg, and pulse of 98/min. Examination shows scleral icterus and a markedly distended, tender abdomen with shifting dullness and a fluid wave. The liver edge is palpable 4 cm below the right costal margin and is very tender. Laboratory results show: Total bilirubin 4.2 mg/dL, Alkaline phosphatase 190 U/L, AST 140 U/L, ALT 132 U/L. Ultrasound with Doppler flow shows absence of flow in the hepatic veins and a large amount of ascites. Which of the following is the most likely diagnosis?",
    "choice_a": "Acetaminophen overdose",
    "choice_b": "Budd-Chiari syndrome",
    "choice_c": "Decompensated cirrhosis",
    "choice_d": "Peritoneal carcinomatosis",
    "choice_e": "Primary biliary cirrhosis",
    "correct_answer": "B",
    "explanation": "Budd-Chiari syndrome (BCS) is caused by the obstruction of hepatic venous outflow, most commonly due to thrombosis. It should be suspected in young women presenting with rapid-onset abdominal pain, hepatomegaly, and ascites, especially in the setting of hypercoagulable states like oral contraceptive use. Diagnosis is confirmed by Doppler ultrasound showing lack of flow in the hepatic veins. (Choice A) Acetaminophen overdose causes markedly higher transaminases (>3000) and more rapid injury. (Choice C) While cirrhosis causes ascites, the acute presentation and lack of flow on Doppler favor BCS. (Choice D) Peritoneal carcinomatosis usually involves significant weight loss and different fluid analysis findings. (Choice E) Primary biliary cirrhosis (now cholangitis) presents with fatigue, pruritus, and markedly elevated alkaline phosphatase.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_079",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 34-year-old woman comes to the office with dizzy spells. The patient had uncomplicated Roux-en-Y gastric bypass surgery 6 weeks ago. She has abdominal pain, nausea, diarrhea, and lightheadedness with palpitations 15-20 minutes after meals. Her symptoms are occasionally accompanied by profuse sweating. The patient has lost 3.6 kg (8 lb) since the surgery. She had type 2 diabetes mellitus before the operation. Her current medications include multivitamins and iron supplements. Temperature is 36.7 C (98 F), blood pressure is 112/70 mm Hg, and pulse is 78/min. Physical examination is notable for an overweight woman in no acute distress. The abdomen shows well-healed surgical scars but is otherwise unremarkable. Laboratory results show Hemoglobin 11.8 g/dL, MCV 80 um3, Potassium 3.4 mEq/L, BUN 16 mg/dL, and Creatinine 0.9 mg/dL. Which of the following is the most likely diagnosis?",
    "choice_a": "Dumping syndrome",
    "choice_b": "Hypoglycemia",
    "choice_c": "Internal hernia",
    "choice_d": "Short bowel syndrome",
    "choice_e": "Stomal stenosis",
    "correct_answer": "A",
    "explanation": "This patient likely has dumping syndrome, which occurs in up to 50% of patients after Roux-en-Y gastric bypass (RYGB) surgery. Early dumping syndrome occurs 15-30 minutes after meals due to rapid emptying of hypertonic gastric contents into the small intestine, leading to fluid shifts and GI/vasomotor symptoms (abdominal pain, diarrhea, nausea, hypotension, tachycardia). Late dumping syndrome occurs 2-3 hours after eating due to reactive hypoglycemia. Initial management for both includes eating small, frequent meals and replacing simple sugars with complex carbohydrates. Internal hernia usually presents with bowel obstruction. Short bowel syndrome occurs after massive resection and causes malabsorptive diarrhea. Stomal stenosis typically presents with nausea, vomiting, and dysphagia.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_080",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 61-year-old man comes to the emergency department with abdominal pain for the past 2 days. He has lower abdominal discomfort and generalized malaise but no nausea, vomiting, back pain, or urinary symptoms. He has never had a colonoscopy. His father was diagnosed with colon cancer at age 65. His temperature is 37.8 C (100 F), blood pressure is 122/70 mm Hg, and pulse is 92/min. There is moderate tenderness in the left lower quadrant without rebound tenderness. Laboratory results show WBC count 13,000/mm3 and ESR 40 mm/hr. Computed tomography of the abdomen with contrast shows sigmoid wall thickening and increased density of the pericolic fat. Which of the following is the best management for this patient?",
    "choice_a": "Hospitalization, intravenous antibiotics, and laparoscopic surgery",
    "choice_b": "Hospitalization, intravenous antibiotics, and repeat computed tomography scan in 2 days",
    "choice_c": "Hospitalization, intravenous antibiotics, and sigmoidoscopy",
    "choice_d": "Oral antibiotics with outpatient follow-up instructions",
    "choice_e": "Peripherally inserted central line, intravenous antibiotics, and outpatient follow-up",
    "correct_answer": "D",
    "explanation": "This patient's presentation is consistent with acute uncomplicated diverticulitis. Uncomplicated diverticulitis can be managed with outpatient oral antibiotics (eg, ciprofloxacin + metronidazole or amoxicillin-clavulanate), bowel rest with gradual transition to fluid intake, and close follow-up. Hospitalization for IV antibiotics is indicated for patients with high fever, significant leukocytosis, immunosuppression, or inability to tolerate oral intake. Complicated diverticulitis (abscess, perforation, obstruction) requires IV therapy and possible CT-guided drainage. Sigmoidoscopy or colonoscopy should be performed 2-6 weeks after recovery to exclude malignancy but is not indicated in the acute phase.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_081",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 39-year-old man with a history of chronic constipation comes to the physician with severe anal pain for the past 2 months. Bowel movements worsen the pain, and there is also persistent pain without stool passage. He reports a small amount of blood on the toilet paper. Family history is notable for IBS in his mother and sister. Rectal examination is limited due to significant pain on insertion and a tight anal sphincter. Colonoscopy under sedation is notable for internal hemorrhoids, mild diverticulosis, and a posterior anal fissure. In addition to dietary modification and stool softeners, which of the following is the most appropriate next step in management?",
    "choice_a": "Hydrocortisone cream",
    "choice_b": "Lateral sphincterectomy",
    "choice_c": "Nitroglycerin cream",
    "choice_d": "Oral metronidazole",
    "choice_e": "Rubber band ligation of hemorrhoids",
    "correct_answer": "C",
    "explanation": "The patient has an anal fissure, which classically presents with tearing pain during bowel movements and bright red blood on the toilet paper. Most fissures occur in the posterior anal midline. Initial treatment includes high-fiber diet, stool softeners, and sitz baths. Topical nitroglycerin or calcium channel blockers (eg, nifedipine) improve blood flow to the area to promote healing and are preferred for acute fissures. Botulinum toxin injection is used for refractory cases. Lateral sphincterotomy is reserved for chronic fissures that fail medical therapy. Hydrocortisone is not first-line for fissures. Metronidazole is for perianal fistulas in Crohn's disease. Band ligation is for refractory internal hemorrhoids, but the patient's pain is coming from the fissure.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_082",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 46-year-old woman with obesity, ulcerative colitis, hypertension, and GERD is evaluated for asymptomatic lab abnormalities. Her last UC flare was 5 years ago. Medications include mesalamine, omeprazole, and lisinopril. Laboratory results show Total bilirubin 1.3 mg/dL, Alkaline phosphatase 320 U/L, AST 12 U/L, ALT 24 U/L, Gamma-glutamyl transferase 130 U/L (normal: 0-30), and Albumin 4.0 g/dL. Which of the following would be the most helpful for establishing the diagnosis in this patient?",
    "choice_a": "Bone scan",
    "choice_b": "Cholangiography",
    "choice_c": "CT scan of the abdomen with contrast",
    "choice_d": "Liver biopsy",
    "choice_e": "Mesalamine discontinuation",
    "correct_answer": "B",
    "explanation": "This patient with ulcerative colitis has a cholestatic injury pattern (elevated alkaline phosphatase and GGT), which is highly suggestive of primary sclerosing cholangitis (PSC). Over 90% of patients with PSC have underlying UC. Diagnosis is made with cholangiography (MRCP or ERCP) showing multifocal stricturing and dilation of the bile ducts ('beads on a string'). Liver biopsy is rarely diagnostic and usually not required. Bone scan would be helpful if the ALP elevation was of bone origin, but the elevated GGT confirms a hepatic source. CT scan is less sensitive than MRCP for PSC. Although mesalamine can rarely cause liver injury, PSC is far more likely given the association with UC.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_083",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 57-year-old man with a 40-year history of diabetes treated with insulin reports a 6-month history of persistent watery diarrhea that sometimes awakens him from sleep. He also has fecal incontinence, bloating, and flatulence but no weight loss. Examination shows decreased sensation and absent ankle reflexes in both feet. Laboratory results, including stool culture, HIV antibody, TSH, and HgbA1c (7.7%), are unremarkable. Colonoscopy with biopsies and upper endoscopy with biopsies are normal. Which of the following is most likely contributing to this patient's condition?",
    "choice_a": "Bacterial overgrowth",
    "choice_b": "Celiac disease",
    "choice_c": "Diarrhea-predominant irritable bowel syndrome",
    "choice_d": "Microscopic colitis",
    "choice_e": "Pancreatic insufficiency",
    "correct_answer": "A",
    "explanation": "This patient has symptoms consistent with diabetic diarrhea, which is often due to autonomic neuropathy leading to intestinal dysmotility. This dysmotility frequently leads to small intestinal bacterial overgrowth (SIBO), which contributes to the watery diarrhea, bloating, and flatulence. SIBO can be confirmed with a carbohydrate breath test and treated with antibiotics (eg, rifaximin). Celiac disease and microscopic colitis are associated with diabetes but are ruled out by the normal biopsies. IBS is unlikely due to the presence of nocturnal diarrhea. Pancreatic insufficiency leads to steatorrhea rather than watery stools.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_084",
    "system": "Gastrointestinal Nutrition",
    "stem": "An 83-year-old woman has lost 10 lbs over the past year. She lives alone, has dentures that fit well, and states she has a good appetite. She no longer drives and needs help with home maintenance. She denies GI symptoms or mood changes. Medical history includes type 2 diabetes and osteoporosis. Physical exam and MMSE (26/30) are normal. Labs show normal HgbA1c (7.2%), TSH, and negative stool occult blood. Which of the following is most likely to establish the cause of this patient's weight loss?",
    "choice_a": "Chronic infection work-up",
    "choice_b": "Detailed social history",
    "choice_c": "Geriatric depression scale",
    "choice_d": "Malabsorption work-up",
    "choice_e": "Occult malignancy screening",
    "correct_answer": "B",
    "explanation": "Involuntary weight loss in the elderly is often due to social causes, such as difficulty in obtaining or preparing food. This patient no longer drives and may have difficulty shopping. A detailed social history is the most appropriate next step to evaluate for these factors. While depression and malignancy are common causes, her reported good appetite and mood make them less likely initially. Malabsorption and infection work-ups are lower yield in the absence of suggestive symptoms or lab abnormalities.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_085",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 24-year-old man reports a 2-week history of pale, voluminous, foul-smelling, watery diarrhea and a 5-lb weight loss. He also has bloating and flatulence. He is an avid hiker but denies recent travel. Vital signs and abdominal exam are normal. Laboratory results show Hemoglobin 14.1 g/dL, Platelets 165,000/uL, and Creatinine 0.9 mg/dL. Which of the following is the most appropriate next step in management?",
    "choice_a": "Absolute eosinophil count",
    "choice_b": "Colonoscopy with biopsies",
    "choice_c": "Fecal fat quantification",
    "choice_d": "Stool microscopy",
    "choice_e": "Tissue transglutaminase IgA antibody",
    "correct_answer": "D",
    "explanation": "The patient's presentation of hiker's diarrhea with steatorrhea (pale, foul stools) and bloating is highly suggestive of Giardiasis. Giardia lamblia is the most common infectious cause of malabsorption. Diagnosis is typically made via stool microscopy for trophozoites and cysts or stool immunoassay. Metronidazole is the treatment of choice. Eosinophil count is for eosinophilic gastroenteritis. Colonoscopy and celiac testing (tTG) are indicated if infectious studies are negative. Fecal fat confirms malabsorption but doesn't identify the cause.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_086",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 72-year-old man reports 6 months of transient oropharyngeal dysphagia, where food feels stuck in his throat. His wife notes he sounds 'gurgly' and has bad breath. He has lost 10 lbs since a recent hospitalization for pneumonia. History includes hypertension and GERD. Exam shows scattered wheezes at the lung base. Which of the following is the most appropriate next step in management?",
    "choice_a": "Barium swallow",
    "choice_b": "Computed tomography of neck and chest",
    "choice_c": "Esophageal manometry",
    "choice_d": "Esophagogastroduodenoscopy",
    "choice_e": "Impedance testing",
    "correct_answer": "A",
    "explanation": "The presentation of oropharyngeal dysphagia, halitosis, 'gurgly' voice, and recurrent pneumonia is classic for Zenker's diverticulum (ZD). ZD is a pharyngeal pouch that traps food and secretions. Barium swallow is the preferred diagnostic test. EGD is risky due to the potential for the scope to blindly perforate the diverticulum. CT is not needed for diagnosis. Manometry may show the underlying motility defect but is not diagnostic for ZD. Impedance testing evaluates acid reflux, which is not the primary issue here.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_087",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 42-year-old woman from the Philippines reports 4 months of intermittent dull epigastric pain that starts when she skips a meal. She also has bloating. Medical history includes type 2 diabetes. Ultrasound shows several gallstones 3-4 mm in diameter. Laboratory results, including HgbA1c (7.5%), are unremarkable. Which of the following is the best next step in management?",
    "choice_a": "Anti-tissue transglutaminase antibody testing",
    "choice_b": "Cholescintigraphy (HIDA scan)",
    "choice_c": "Gastric emptying study",
    "choice_d": "Helicobacter pylori testing",
    "choice_e": "Laparoscopic cholecystectomy",
    "correct_answer": "D",
    "explanation": "The patient has symptoms of dyspepsia (epigastric discomfort, bloating). Pain that occurs on an empty stomach suggests peptic ulcer disease, for which H. pylori is the most common cause. In patients <60 without alarm features, H. pylori testing (stool antigen or urea breath test) is the first step. Although she has gallstones, her symptoms are not typical for biliary colic (which usually occurs after fatty meals). Asymptomatic gallstones are common and do not require cholecystectomy. Gastroparesis (gastric emptying study) typically occurs after eating and in long-standing diabetics with complications.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_088",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 34-year-old woman reports a year of abdominal pain, bloating, and bowel habits fluctuating between constipation and diarrhea. She often awakens at night with abdominal cramps followed by diarrhea. She has no weight loss or blood in the stool. Laboratory results show Hemoglobin 11.7 g/dL (MCV 82) and Potassium 3.4 mEq/L. Which of the following is the most appropriate next step in management?",
    "choice_a": "Further diagnostic testing",
    "choice_b": "Low-dose tricyclic antidepressant",
    "choice_c": "Lubiprostone",
    "choice_d": "Reassurance and frequent office visits",
    "choice_e": "Rifaximin",
    "correct_answer": "A",
    "explanation": "While the patient has symptoms suggestive of irritable bowel syndrome (IBS), she also has 'warning signs' that mandate further evaluation: nocturnal diarrhea and laboratory abnormalities (anemia and hypokalemia). These findings suggest an organic cause rather than functional IBS. Further testing, including colonoscopy and potentially imaging, is required. Reassurance, antidepressants, lubiprostone (for IBS-C), or rifaximin (for IBS-D) would be appropriate only after other etiologies have been ruled out. Celiac disease can also mimic IBS and should be considered.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_089",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 35-year-old woman with a history of iron-deficiency anemia reports 6 months of diarrhea (several loose stools/day), bloating, and abdominal discomfort after meals. Fecal occult blood is negative. Hgb is 9.6 mg/dL (MCV 71). Anti-tissue transglutaminase antibody is positive. Which of the following is the most appropriate next step in management?",
    "choice_a": "Antigliadin antibody testing",
    "choice_b": "Endoscopy with duodenal biopsy",
    "choice_c": "Gluten-free diet with close follow-up for symptom resolution",
    "choice_d": "Human leukocyte antigen testing",
    "choice_e": "Total IgA level testing",
    "correct_answer": "B",
    "explanation": "Positive anti-tTG antibodies and symptoms of malabsorption (diarrhea, iron-deficiency anemia) are highly suggestive of celiac disease. The diagnosis must be established with a small bowel biopsy (duodenal biopsy) showing intraepithelial lymphocytes and villous atrophy. A gluten-free diet should not be started until after the biopsy, as it can normalize the mucosa and lead to false-negative results. Antigliadin antibodies are no longer recommended due to low specificity. HLA testing is reserved for discordant results. IgA level testing is indicated only if serology is negative but clinical suspicion remains high.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_090",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 31-year-old woman with autoimmune hypothyroidism reports fatigue, cold intolerance, bloating, and 'brain fog.' Despite escalating doses of levothyroxine (200 mcg/day), her TSH remains elevated at 20 mU/L. She is compliant and takes the medication 1 hour before breakfast. Labs show Hgb 9.4 g/dL (MCV 66) and elevated transaminases (AST 62, ALT 74). Which of the following is the most appropriate diagnostic study?",
    "choice_a": "IgA anti-tissue transglutaminase antibodies",
    "choice_b": "Serum IgE level",
    "choice_c": "Serum T3 level",
    "choice_d": "Thyroid peroxidase antibodies",
    "choice_e": "Thyrotropin receptor antibodies",
    "correct_answer": "A",
    "explanation": "The failure of levothyroxine to normalize TSH despite high doses and good compliance suggests malabsorption. Celiac disease has an increased incidence in patients with autoimmune hypothyroidism and can lead to impaired absorption of thyroid hormone and iron (explaining her microcytic anemia). It can also cause elevated transaminases. Screening with anti-tTG antibodies is the most appropriate next step. TPO antibodies are associated with Hashimoto's but don't explain malabsorption. T3 levels and IgE are not useful in this context. Thyrotropin receptor antibodies are for Graves disease.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_091",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 79-year-old man with cardiomyopathy (EF 40%) reports fatigue and muscle cramps. Medications include carvedilol, lisinopril, furosemide, and lansoprazole for dyspepsia. Neuromuscular exam shows 5/5 strength and mildly increased reflexes. Laboratory results show Potassium 3.6 mEq/L, Calcium 9.4 mg/dL, and Albumin 4.1 g/dL. Which of the following is the best next step in evaluation?",
    "choice_a": "Arterial Doppler study",
    "choice_b": "Magnesium level",
    "choice_c": "Parathyroid hormone level",
    "choice_d": "Serum creatine kinase level",
    "choice_e": "Serum iron and ferritin levels",
    "correct_answer": "B",
    "explanation": "Chronic use of proton pump inhibitors (PPIs) like lansoprazole can impair intestinal magnesium absorption, causing hypomagnesemia. The risk is significantly higher when PPIs are combined with diuretics (eg, furosemide). Symptoms include fatigue, weakness, and neuromuscular hyperexcitability (muscle cramps, hyperreflexia). Magnesium levels should be checked. Arterial Doppler is for claudication. PTH is for calcium disorders, but his calcium is normal. CK is for myositis, which would cause weakness and decreased reflexes. Iron deficiency can cause restless legs but not muscle cramps and hyperreflexia.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_092",
    "system": "Gastrointestinal Nutrition",
    "stem": "An 80-year-old man with acute cholecystitis (distended, thick-walled gallbladder, stones, pericholecystic fluid) is deteriorating on IV fluids and piperacillin-tazobactam. He has increasing pain, confusion, fever (38.9 C), and hypotension (90/45). Medical history includes idiopathic pulmonary fibrosis requiring 4-5 L/min oxygen and a prior stroke. Labs show WBC 21,000/mm3. Which of the following is the most appropriate additional intervention?",
    "choice_a": "Addition of vancomycin and metronidazole",
    "choice_b": "Endoscopic retrograde cholangiopancreatography",
    "choice_c": "Laparoscopic cholecystectomy",
    "choice_d": "Percutaneous cholecystostomy",
    "choice_e": "Ursodeoxycholic acid therapy",
    "correct_answer": "D",
    "explanation": "While early laparoscopic cholecystectomy is preferred for most patients with cholecystitis, this elderly patient is at very high surgical risk due to severe pulmonary disease and recent clinical deterioration (sepsis/hypotension). For high-risk surgical candidates who fail to improve with conservative management, percutaneous cholecystostomy (gallbladder drainage) is the most appropriate intervention. He is already on appropriate broad-spectrum antibiotics. ERCP is for choledocholithiasis or cholangitis, but his CBD and bilirubin are normal. Ursodeoxycholic acid is for long-term stone dissolution, not acute cholecystitis.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_093",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 52-year-old man presents with melena and coffee-ground emesis. Endoscopy shows a 2-cm duodenal ulcer with a visible vessel. Endoscopic treatment is successful and he is started on an IV PPI. Gastric biopsies are negative for H. pylori. He has no history of NSAID use. Which of the following is the most appropriate next step regarding H. pylori evaluation?",
    "choice_a": "Empiric anti-H pylori therapy",
    "choice_b": "No additional testing or treatment",
    "choice_c": "Outpatient urea breath testing",
    "choice_d": "Repeat endoscopy and biopsy now",
    "choice_e": "Repeat endoscopy in 4 to 6 weeks",
    "correct_answer": "C",
    "explanation": "All patients with peptic ulcers should be evaluated for H. pylori. However, endoscopic biopsies can yield false-negative results in the setting of active GI bleeding or PPI use. Therefore, a negative biopsy during an acute bleed must be confirmed by a second test (eg, urea breath test or stool antigen) performed after the patient has been off PPI therapy for 1-2 weeks. Empiric therapy without confirmation is not recommended in low-prevalence areas. Repeat endoscopy is routinely done for gastric ulcers to rule out malignancy but is not necessary for duodenal ulcers unless symptoms persist.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_094",
    "system": "Gastrointestinal Nutrition",
    "stem": "An 82-year-old woman with atrial fibrillation and hypertension on aspirin has large bloody bowel movements. Upper endoscopy and colonoscopy show no source of bleeding. While in the ED, she has another bloody stool with dizziness. Which of the following is the most likely additional finding on chest examination?",
    "choice_a": "Ejection-type mid-systolic murmur",
    "choice_b": "Holosystolic murmur",
    "choice_c": "Late diastolic decrescendo murmur",
    "choice_d": "Low-pitched mid-diastolic rumble",
    "choice_e": "Pericardial knock",
    "correct_answer": "A",
    "explanation": "The patient has lower GI bleeding with negative initial endoscopy/colonoscopy, suggesting a source like angiodysplasia (AVM). Angiodysplasia is strongly associated with aortic stenosis (Heyde's syndrome) and end-stage renal disease. Aortic stenosis causes acquired von Willebrand disease due to destruction of vWF multimers through the stenotic valve, leading to bleeding from previously occult AVMs. An ejection-type mid-systolic murmur is the classic finding of aortic stenosis. Holosystolic murmurs (MR/TR), diastolic murmurs (AR/MS), and pericardial knocks are not associated with Heyde's syndrome.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_095",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 78-year-old man with diabetes, CAD, and AF presents with 2 days of epigastric pain and new confusion. He is lethargic and febrile (38 C). Abdominal exam shows tenderness in the epigastrium and RUQ. Labs show WBC 11,000 (12% bands) and normal bilirubin/ALP. ECG shows AF. Ultrasound shows small gallstones without wall thickening; CBD is normal. Which of the following is the best next step in management?",
    "choice_a": "Cholecystostomy",
    "choice_b": "Cholescintigraphy",
    "choice_c": "CT angiography of the abdomen",
    "choice_d": "Direct current cardioversion",
    "choice_e": "Transesophageal echocardiogram",
    "correct_answer": "C",
    "explanation": "Severe abdominal pain (often out of proportion to exam) in a patient with risk factors for embolism (untreated atrial fibrillation) is highly suggestive of acute mesenteric ischemia. Fever and confusion suggest progressing ischemia/infarction. CT or MR angiography is the preferred diagnostic test in stable patients. While he has gallstones, the absence of gallbladder wall thickening or CBD dilation makes cholecystitis/cholangitis less likely. DC cardioversion is for hemodynamically unstable AF or AF with chest pain; doing it in AF of unknown duration increases embolic risk. TEE identifies a source of embolism but doesn't diagnose the current abdominal emergency.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_096",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 66-year-old man presents with abdominal pain and nausea 1 day after a screening colonoscopy with polypectomy. He is febrile (38.1 C). Abdominal exam shows tenderness in the periumbilical and LLQ without rebound. WBC is 12,300/mm3. Upright abdominal radiographs show no free air. Which of the following is the best next step in management?",
    "choice_a": "Obtain CT scan of the abdomen with water-soluble contrast",
    "choice_b": "Order noncontrast CT scan of the abdomen",
    "choice_c": "Perform flexible sigmoidoscopy",
    "choice_d": "Prescribe oral antibiotics and follow-up in 2 days",
    "choice_e": "Provide reassurance for discomfort from procedural air insufflation",
    "correct_answer": "A",
    "explanation": "Fever and abdominal pain following a colonoscopy are highly concerning for colonic perforation. While initial upright X-rays are the first step, they can miss up to 25-50% of perforations (especially retroperitoneal ones). CT scan with water-soluble contrast (eg, Gastrografin) is more sensitive for detecting subtle extraluminal air or leaks. Management requires IV broad-spectrum antibiotics and surgical consultation. Sigmoidoscopy is contraindicated as air insufflation would worsen the leak. Reassurance or oral antibiotics are inappropriate given the risk of peritonitis.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_097",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 45-year-old man presents with coffee-ground emesis. He has a 6-month history of abdominal pain, heartburn, and explosive diarrhea that failed to respond to dietary changes. Endoscopy shows multiple ulcers in the duodenal bulb and a 1.2-cm ulcer in the proximal jejunum. Which of the following is most likely to establish the diagnosis?",
    "choice_a": "Jejunal ulcer biopsy",
    "choice_b": "Response to triple therapy",
    "choice_c": "Serum 5-hydroxyindoleacetic acid level",
    "choice_d": "Serum gastrin level",
    "choice_e": "Serum tryptase level",
    "correct_answer": "D",
    "explanation": "Multiple ulcers, especially those in atypical locations (eg, jejunum), combined with chronic diarrhea, are classic for gastrinoma (Zollinger-Ellison syndrome). Excess gastrin causes massive acid hypersecretion. The initial diagnostic step is checking a serum gastrin level (typically >1000 pg/mL) and confirming with a gastric pH ≤ 4. Jejunal ulcers are due to acid, not tumor invasion, so biopsy is low yield. Triple therapy is for H. pylori, which usually causes solitary proximal ulcers. 5-HIAA is for carcinoid syndrome (flushing/diarrhea without ulcers). Tryptase is for mastocytosis (allergic-like symptoms).",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_098",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 22-year-old man with a history of asthma and allergies presents with 3 hours of dysphagia after eating steak. He is drooling and speaking in broken sentences. Emergent endoscopy is planned. Which of the following would be the most likely endoscopic finding in addition to a food bolus?",
    "choice_a": "Abnormal peristaltic waves and a hiatal hernia",
    "choice_b": "Grossly dilated esophagus with distal tapering",
    "choice_c": "Large irregular mass in the lower esophagus",
    "choice_d": "Multiple esophageal rings and furrows",
    "choice_e": "Smooth tight stricture in the upper esophagus",
    "correct_answer": "D",
    "explanation": "Acute food bolus impaction in a young patient with a history of atopy (asthma, allergies) is highly suggestive of eosinophilic esophagitis (EoE). EoE is an immune-mediated inflammation of the esophagus. Classic endoscopic findings include concentric rings ('trachealization'), longitudinal furrows, and white exudates (eosinophilic abscesses). Diagnosis is confirmed by biopsy showing >15 eosinophils/hpf. Dilated esophagus with tapering is for achalasia. Masses are for malignancy. Smooth strictures are typically peptic (from GERD) or traumatic.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_099",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 43-year-old man with a long history of alcohol abuse presents with acute jaundice, fever (38.3 C), anorexia, and RUQ pain. Abdominal exam shows distention and shifting dullness. Labs show AST 282 U/L, ALT 134 U/L, Bilirubin 6.3 mg/dL, and Ferritin 1090 ng/mL. Which of the following is the most likely diagnosis?",
    "choice_a": "Acute cholecystitis",
    "choice_b": "Alcoholic hepatitis",
    "choice_c": "Hemochromatosis",
    "choice_d": "Hepatic abscess",
    "choice_e": "Tylenol (acetaminophen) toxicity",
    "correct_answer": "B",
    "explanation": "Alcoholic hepatitis (AH) typically presents with acute jaundice, fever, and RUQ pain in a patient with chronic heavy alcohol use. A classic laboratory finding is an AST:ALT ratio ≥ 2 with both values usually < 300 U/L. Ferritin is often elevated as an acute phase reactant. Cholecystitis doesn't typically cause jaundice unless complicated by cholangitis. Hemochromatosis presents with much higher transferrin saturation and doesn't explain the acute fever/AST:ALT ratio. Tylenol toxicity causes much higher transaminases (>500 or 1000).",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_100",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 64-year-old man presents with sudden epigastric pain and vomiting after heavy alcohol intake. He is febrile (38 C) and in moderate distress. Exam shows decreased breath sounds at the left base with dullness to percussion. Chest x-ray reveals pneumomediastinum and a moderate-sized left pleural effusion. Which of the following is the best next step in management?",
    "choice_a": "Abdominal ultrasound",
    "choice_b": "Chest tube placement",
    "choice_c": "Contrast esophagography",
    "choice_d": "Esophagogastroduodenoscopy",
    "choice_e": "Serum amylase and lipase",
    "correct_answer": "C",
    "explanation": "Forceful vomiting followed by severe chest/epigastric pain and pneumomediastinum or pleural effusion (usually left-sided) is diagnostic of Boerhaave syndrome (spontaneous esophageal rupture). This is a surgical emergency. Diagnosis is confirmed with contrast esophagography using a water-soluble agent (Gastrografin). EGD is risky as air insufflation can worsen the perforation. Amylase/lipase evaluate pancreatitis, which wouldn't cause pneumomediastinum. Chest tube treats the effusion but doesn't diagnose the underlying rupture.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_101",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 40-year-old man with no history of liver disease presents with 2 episodes of coffee-ground emesis. He has been taking ibuprofen for 2 weeks. Supine BP is 120/80; standing BP is 118/76. Hemoglobin is 11.0 g/dL. Urgent endoscopy is planned. Which of the following values for hemoglobin represents the optimal threshold for initiating blood transfusion in this patient?",
    "choice_a": "<11 g/dL",
    "choice_b": "<10 g/dL",
    "choice_c": "<9 g/dL",
    "choice_d": "<8 g/dL",
    "choice_e": "<7 g/dL",
    "correct_answer": "E",
    "explanation": "In hemodynamically stable patients with acute upper GI bleeding and no significant comorbidities (eg, unstable CAD), a restrictive transfusion strategy (threshold hemoglobin < 7 g/dL) is associated with better outcomes, including lower mortality and fewer rebleeding episodes, compared to a liberal strategy (< 9 g/dL). Patients with active ischemia or massive ongoing hemorrhage may require a higher threshold. This young patient is stable with no comorbidities, so < 7 g/dL is the correct threshold.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_102",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 36-year-old woman presents with 5 days of worsening abdominal pain and distention. She takes oral contraceptives. Exam shows tender hepatomegaly (4 cm below margin), shifting dullness, and trace edema. Bilirubin is 3.2 mg/dL and ALP is 320 U/L. Paracentesis fluid analysis shows a SAAG > 1.1 g/dL. Doppler ultrasound shows decreased flow in the hepatic veins. Which of the following is the most likely diagnosis?",
    "choice_a": "Acetaminophen overdose",
    "choice_b": "Acute hepatitis B",
    "choice_c": "Hepatic vein thrombosis",
    "choice_d": "Peritoneal carcinomatosis",
    "choice_e": "Primary biliary cirrhosis",
    "correct_answer": "C",
    "explanation": "Budd-Chiari syndrome (hepatic vein thrombosis) classically presents in young women (often with OCP use or other hypercoagulable states) with the triad of abdominal pain, hepatomegaly, and ascites. Doppler ultrasound showing occlusion or reduced flow in the hepatic veins is the preferred initial test. SAAG > 1.1 indicates portal hypertension. Tylenol toxicity causes much higher transaminases and more rapid failure. Peritoneal carcinomatosis causes a low SAAG (< 1.1) and is usually seen with malignancy/weight loss. Primary biliary cirrhosis (cholangitis) is a chronic disease presenting with fatigue/pruritus.",
    "source": "ABIM - Gastrointestinal Nutrition - 4.pdf"
  },
  {
    "id": "GI_103",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 38-year-old woman comes to the physician with the complaint of severe abdominal pain for 8 hours. The pain is crampy and periumbilical and occurs every 4 to 5 minutes. It is not improved with positional changes, and there is no radiation to the back. She has vomited 3 times since the pain began. Her last bowel movement was 18 hours ago. She denies any reflux symptoms, hematemesis, melena, or hematochezia. The patient's medical problems include depression, fibromyalgia, and hypothyroidism. Her surgical history includes appendectomy for a ruptured appendix 20 years ago, tonsillectomy, and breast lumpectomy. She does not use tobacco, alcohol, or illicit drugs. Her temperature is 37.3 C (99.1 F), blood pressure is 110/80 mm Hg, pulse is 92/min, and respirations are 16/min. The abdomen is tender in the periumbilical area. There is no significant abdominal distension, rebound tenderness, or rigidity. Rectal examination shows an empty rectal vault, and test for occult blood is negative. Laboratory results are as follows: Hemoglobin 12.8 g/dL, Hematocrit 37%, Platelets 245,000/µL, Leukocytes 12,000/µL. Serum chemistry: Sodium 136 mEq/L, Potassium 4.0 mEq/L, Chloride 102 mEq/L, Bicarbonate 24 mEq/L, Blood urea nitrogen 18 mg/dL, Creatinine 1.0 mg/dL, Glucose 140 mg/dL. Liver function studies: Albumin 3.4 g/dL, Amylase 621 U/L, Lipase 152 U/L, Aspartate aminotransferase (SGOT) 23 U/L, Alanine aminotransferase (SGPT) 32 U/L, Alkaline phosphatase 130 U/L. Urine pregnancy test is negative. Which of the following is the most appropriate next step in this patient's management?",
    "choice_a": "Contrast-enhanced abdominal CT",
    "choice_b": "NPO and repeat physical examinations",
    "choice_c": "Pain management consult",
    "choice_d": "Plain upright chest and abdominal radiographs",
    "choice_e": "Small-bowel follow-through series",
    "correct_answer": "D",
    "explanation": "This patient presents with crampy periumbilical abdominal pain associated with vomiting. The likely diagnosis given the history of abdominal surgery is proximal small-bowel obstruction (SBO). Plain upright chest x-ray and upright and supine abdominal films are preferred to diagnose SBO, and most patients do not need further imaging. Abdominal films usually show multiple air-fluid levels with distended small-bowel loops. Abdominal CT with oral and IV contrast is the preferred next step if plain films are not diagnostic of SBO (Choice A). Small-bowel series are inferior to CT scan in detecting SBO etiology, ischemia, or closed-loop obstructions and are done only if CT is nondiagnostic (Choice E). Nonoperative SBO management includes NPO, fluid resuscitation, and serial abdominal examinations (Choice B).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_104",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 57-year-old woman comes to the emergency department due to black stools and 2 episodes of hematemesis over the last 24 hours. Her other medical problems include hypertension, type 2 diabetes mellitus, hypercholesterolemia, and migraine headaches. Current medications include metformin, glyburide, simvastatin, ramipril, and low-dose aspirin. The patient has also been taking naproxen for frequent headaches over the last week. She has smoked a pack of cigarettes per day for 20 years and drinks 1 or 2 cans of beer daily. Temperature is 36.7 C (98.1 F), blood pressure is 122/70 mm Hg, pulse is 96/min, and respirations are 16/min. Examination reveals a soft abdomen that is mildly tender over the epigastrium. There is no rebound tenderness or rigidity. Laboratory results are as follows: Hemoglobin 9.2 g/dL, Platelets 280,000/mm3, Leukocytes 9,300/mm3, Sodium 136 mEq/L, Potassium 4.4 mEq/L, Chloride 102 mEq/L, Bicarbonate 20 mEq/L, Blood urea nitrogen 26 mg/dL, Creatinine 0.8 mg/dL, Glucose 120 mg/dL. After initial fluid resuscitation, the patient undergoes upper gastrointestinal endoscopy in the emergency department; it reveals a 1.5-cm ulcer in the gastric antrum. There is no active bleeding and the ulcer is covered with an adherent clot. Endoscopic hemostatic therapy is performed. Which of the following is the most appropriate course of action for this patient?",
    "choice_a": "Advise the patient to stop naproxen; discharge on oral lansoprazole with close follow-up",
    "choice_b": "Admit the patient, order a regular diet, and observe overnight",
    "choice_c": "Admit the patient to the intensive care unit for octreotide infusion",
    "choice_d": "Admit the patient to the regular medical ward and order a clear liquid diet",
    "choice_e": "Order a blood transfusion and schedule follow-up endoscopy in 24-48 hours",
    "correct_answer": "D",
    "explanation": "Peptic ulcers with high-risk features (eg, adherent clot) typically require endoscopic treatment and monitoring for 72 hours due to the risk of rebleeding. Following endoscopy, they should be kept in the hospital, placed on a clear liquid diet for 2 days, and continued on high-dose intravenous PPI for 3 days. Routine \"second-look\" endoscopy is not beneficial unless there is rebleeding (Choice E). Octreotide is not recommended for routine nonvariceal bleeding (Choice C). Low-risk ulcers can be managed with early discharge (Choices A and B).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_105",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 68-year-old woman is brought to the emergency department due to worsening diarrhea and abdominal pain. The patient has had watery diarrhea every 3-4 hours for the past 2 days, and today she also had mild nausea but has been tolerating oral fluids. The patient was discharged from the hospital 10 days ago after treatment for an Escherichia coli urinary tract infection. Other medical conditions include hypertension, type 2 diabetes mellitus, hyperlipidemia, and chronic kidney disease. Temperature is 39.3 C (102.7 F), blood pressure is 90/60 mm Hg, and pulse is 120/min. On examination, the patient appears lethargic. There is moderate abdominal distension and diffuse tenderness but no rebound tenderness or rigidity. Laboratory results are as follows: Leukocytes 24,500/mm3, Serum creatinine 2.8 mg/dL (baseline: 1.7 mg/dL), Plasma lactic acid 4.2 mEq/L. CT scan of the abdomen reveals an 8-cm dilation of the ascending and transverse colon with mucosal thickening. Stool samples for analysis are obtained. In addition to IV fluids, which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "High-dose oral vancomycin, IV metronidazole, and urgent surgical evaluation",
    "choice_b": "High-dose oral vancomycin, rectal tube, and admission to the intensive care unit",
    "choice_c": "IV corticosteroids, oral vancomycin, and serial abdominal radiographs",
    "choice_d": "IV metronidazole, oral fidaxomicin, and monitoring in the intensive care unit",
    "choice_e": "Vancomycin enema, IV metronidazole, and serial examinations",
    "correct_answer": "A",
    "explanation": "This patient has fulminant Clostridium difficile infection, defined by hypotension, shock, ileus, or toxic megacolon (8-cm dilation). Management includes high-dose oral vancomycin and intravenous metronidazole. Signs of toxic megacolon require immediate surgical evaluation due to the risk of perforation. Fidaxomicin is not indicated for fulminant disease (Choice D). Corticosteroids are for inflammatory bowel disease, not C. difficile (Choice C). Rectal tubes are not routinely recommended (Choice B).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_106",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 49-year-old woman comes to the emergency department with acute-onset hematemesis. She has vomited blood 3 times over the past 3 hours and feels weak and light-headed. She has a history of alcoholic cirrhosis with grade 1 esophageal varices, depression, and prior opiate abuse that is now in remission. The patient takes sertraline, methadone, a multivitamin, folate, and thiamine daily. She does not use tobacco or illicit drugs but drinks 10 ounces of vodka every night. Temperature is 37.2 C (99 F), blood pressure is 90/50 mm Hg, pulse is 104/min, and respirations are 20/min. The patient appears anxious and uncomfortable. Her abdomen is distended and a fluid wave is present. There is mild asterixis. Rectal examination reveals guaiac-positive brown stools. Skin examination is notable for multiple telangiectasias and palmar erythema. Laboratory results are as follows: Hemoglobin 9.4 g/dL, Platelets 67,000/mm3, Leukocytes 11,500/mm3, INR 1.6. Intravenous fluids and octreotide are started, and urgent esophagogastroduodenoscopy is planned. Which of the following is the best next step in management of this patient?",
    "choice_a": "Abdominal ultrasound",
    "choice_b": "Antibiotics",
    "choice_c": "Lactulose",
    "choice_d": "Packed red blood cell transfusion",
    "choice_e": "Platelet transfusion",
    "correct_answer": "B",
    "explanation": "Treatment for active variceal bleeding includes hemodynamic resuscitation, intravenous octreotide, prophylactic antibiotics, and endoscopic therapy. A 7-day course of prophylactic antibiotics (eg, ceftriaxone) decreases infection risk and mortality in these patients. Transfusion is recommended for hemoglobin <7-8 g/dL; overtransfusion can worsen portal hypertension (Choice D). Platelet transfusion is indicated if <50,000/mm3 (Choice E). Lactulose is for hepatic encephalopathy but not acute bleeding (Choice C). Ultrasound is for nonemergent HCC screening (Choice A).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_107",
    "system": "Gastrointestinal Nutrition",
    "stem": "An 18-year-old man comes to the emergency department due to retrosternal chest pain and pain with swallowing. The patient has a burning pain that began abruptly the previous morning and then gradually worsened. He has been limiting himself to soft foods as the pain is much worse with swallowing solids. The patient has a history of tension headaches that have become more frequent lately, which he attributes to long hours of studying for exams. His only medication is ibuprofen as needed for headaches, and he has no drug allergies. The patient's mother has Crohn disease. He drinks alcohol socially, smokes a half pack of cigarettes daily, and does not use illicit drugs. The patient is sexually active and uses condoms inconsistently. Temperature is 36.7 C (98.1 F), blood pressure is 118/76 mm Hg, pulse is 88/min, and respirations are 14/min. There are no oropharyngeal lesions or palpable lymphadenopathy. The lung auscultation and cardiac examination are normal. The abdomen is soft without rebound or guarding. Which of the following is the most appropriate next step in management of this patient's symptoms?",
    "choice_a": "Obtain barium esophagram",
    "choice_b": "Perform HIV testing",
    "choice_c": "Prescribe swallowed fluticasone spray",
    "choice_d": "Recommend ibuprofen discontinuation",
    "choice_e": "Schedule upper gastrointestinal endoscopy",
    "correct_answer": "D",
    "explanation": "Acute substernal chest pain and odynophagia associated with ibuprofen use likely indicate medication-induced esophagitis (MIE). Common offending drugs include NSAIDs, bisphosphonates, and tetracyclines. Management is discontinuation of the offending drug. Upper endoscopy is reserved for severe/atypical symptoms or symptoms persisting 1 week after withdrawal (Choice E). Barium esophagram has limited value in MIE (Choice A). HIV-associated Candida esophagitis usually presents with oral thrush (Choice B). Eosinophilic esophagitis presents with dysphagia and is treated with fluticasone (Choice C).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_108",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 22-year-old man is brought to the emergency department by paramedics after his mother found him lying on the bathroom floor with an empty bottle of bleach lying next to him. He is lethargic, but complains of severe pain and a burning sensation in his throat. His other medical problems include major depression and post-traumatic stress disorder. His medications include nortriptyline and fluoxetine. Temperature is 37.2 C (99.0 F), blood pressure is 90/60 mm Hg, pulse is 104/min, and respirations are 22/min. Examination shows severe pharyngeal erythema/exudates. His abdomen is soft and tender with decreased bowel sounds. Chest and abdominal x-rays showed no evidence of free air or pleural effusions. Which of the following would be the most appropriate next step in management?",
    "choice_a": "Barium swallow",
    "choice_b": "Intravenous glucocorticoids",
    "choice_c": "Nasogastric lavage with cold saline",
    "choice_d": "Oral weak acid solution",
    "choice_e": "Upper GI endoscopy",
    "correct_answer": "E",
    "explanation": "In caustic (alkali) ingestion, after achieving initial stabilization, early endoscopy within 24 hours is recommended to grade the severity of esophageal injury. Nasogastric tubes should be avoided as they can induce perforation (Choice C). Weak acids generate heat and cause further damage (Choice D). Barium swallow evaluates chronic strictures but has no role in acute management (Choice A). Steroids are not recommended as they do not prevent strictures and increase infection risk (Choice B).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_109",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 72-year-old man with end-stage renal disease comes to the emergency department due to abdominal pain for the past 6 hours. The pain started in the lower left abdomen at the end of the hemodialysis session. The patient noticed bright red blood in the bowel movement 30 minutes ago. Medical problems include hypertension, type 2 diabetes mellitus, and hyperlipidemia. Temperature is 37.4 C (99.3 F), blood pressure is 110/80 mm Hg, pulse is 88/min. Abdominal examination shows tenderness in the left lower quadrant with decreased bowel sounds. Rectal examination reveals stool mixed with bright red blood. Leukocytes 11,000/mm3, Hemoglobin 9.9 g/dL. Which of the following is the best next step in management of this patient?",
    "choice_a": "Bowel preparation followed by colonoscopy",
    "choice_b": "Contrast-enhanced CT scan of the abdomen and pelvis",
    "choice_c": "MR angiography of the abdomen with gadolinium",
    "choice_d": "Stool culture and Clostridium difficile PCR",
    "choice_e": "Upper gastrointestinal endoscopy",
    "correct_answer": "B",
    "explanation": "Acute-onset abdominal pain and hematochezia (especially after hemodialysis) suggest colonic ischemia. CT scan with IV contrast is the preferred initial diagnostic study to rule out extensive bowel damage. Diagnosis is subsequently confirmed with colonoscopy (Choice A). MR angiography is not useful for nonocclusive ischemia, and gadolinium is contraindicated in renal impairment (Choice C). C. difficile rarely presents with frank hematochezia (Choice D). Upper endoscopy is not indicated without symptoms of upper GI bleeding (Choice E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_110",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 20-year-old woman comes to the emergency department complaining of nausea and vomiting. She awoke that morning with the sudden onset of nausea and vomiting. She vomited about 10 times and became concerned when she noticed blood in the vomitus. The patient has no dysphagia or odynophagia. Her other medical problems include a history of menorrhagia and bulimia. She takes naproxen daily for chronic low back pain. Her blood pressure is 109/60 mm Hg, pulse is 106/min. Examination shows dry mucous membranes. The abdomen is soft and nontender. Laboratory results: Hemoglobin 10.0 g/dL, MCV 78 fL, Platelets 260,000/µL, INR 1.3. Test for stool occult blood is negative. Which of the following is the most appropriate next step in management?",
    "choice_a": "Angiographic arterial embolization",
    "choice_b": "Barium swallow",
    "choice_c": "Esophagogastroduodenoscopy",
    "choice_d": "Fresh frozen plasma",
    "choice_e": "Intravenous octreotide",
    "correct_answer": "C",
    "explanation": "Hematemesis after forceful retching suggests a Mallory-Weiss (MW) tear. EGD is preferred for diagnosis and to differentiate from other causes of esophagitis. Most bleeding is self-limited, but active bleeding may require endoscopic therapy. Arterial embolization is for refractory cases (Choice A). Barium swallow identifies motility disorders but not MW tears (Choice B). Octreotide is for variceal bleeding, not MW tears (Choice E). FFP is not needed for an INR of 1.3 (Choice D).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_111",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 57-year-old man with known liver cirrhosis comes to the physician because of progressive shortness of breath and fatigue. He now becomes short of breath even at rest, particularly in the morning when getting out of bed. He was diagnosed with liver cirrhosis three years ago. His temperature is 36.7 C (98 F), pulse is 94/min. Pulse oximetry shows 88% saturation on room air while sitting. After resting supine for 15 min, his oxygen saturation is 93% on room air. Breath sounds are mildly decreased at the right base. He has a few spider nevi on his chest and slight bluish discoloration of his toes and digits. Platelet count is 50,000 cells/µL, serum creatinine is 1.4 mg/dL. Chest x-ray shows a small right-sided pleural effusion but is otherwise unremarkable. Which of the following is most likely to diagnose the cause of this patient's shortness of breath?",
    "choice_a": "AFP level and liver ultrasound",
    "choice_b": "Contrast echocardiography",
    "choice_c": "CT scan of the chest",
    "choice_d": "Right heart catheterization",
    "choice_e": "Ventilation-perfusion scan",
    "correct_answer": "B",
    "explanation": "Orthodeoxia (drop in saturation when upright) and platypnea (dyspnea when upright) are specific for hepatopulmonary syndrome (HPS) in the setting of cirrhosis. HPS involves a triad of liver disease, hypoxemia, and intrapulmonary vascular dilatations (IPVDs). Contrast-enhanced echocardiography (\"bubble study\") is the best method to demonstrate IPVDs and confirm the diagnosis. Right heart catheterization diagnoses portopulmonary hypertension, which does not cause platypnea (Choice D). CT and V/Q scans are less sensitive/specific (Choices C and E). AFP/ultrasound screen for HCC (Choice A).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_112",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 68-year-old man is brought to the emergency department with hypoxemic respiratory failure associated with pneumonia. His trachea is intubated and mechanical ventilation is initiated. History includes stable angina, severe COPD, and peptic ulcer disease. Which of the following is most likely to decrease the risk of stress ulcers associated with gastrointestinal bleeding in this patient?",
    "choice_a": "Avoidance of vasopressors",
    "choice_b": "Broad-spectrum antibiotics",
    "choice_c": "Corticosteroid use",
    "choice_d": "Enteral feeding",
    "choice_e": "Platelet transfusion",
    "correct_answer": "D",
    "explanation": "Early enteral feeding alone has been shown to reduce the incidence of stress ulcers in critically ill patients. Risk factors for stress ulcers include mechanical ventilation >48 hours and coagulopathy. Prophylaxis with PPIs or H2 blockers is also recommended for high-risk patients but increases pneumonia/C. difficile risk. Corticosteroids actually increase the risk of stress ulcers (Choice C). Vasopressors, antibiotics, and platelets do not prevent stress ulcers (Choices A, B, and E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_113",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 54-year-old man with alcohol abuse and homelessness is brought to the ED after a seizure. He has a 30-pack-year smoking history. Pulse is 112/min, BMI is 17 kg/m2. Dentition is poor, gums are swollen with bleeding. Scattered petechiae are seen on all extremities. Laboratory results: Hemoglobin 11.0 g/dL, Platelets 105,000/mm3, MCV 98 µm3. Serum free phenytoin level is low. Which of the following best explains this patient's findings?",
    "choice_a": "Leukocytoclastic vasculitis",
    "choice_b": "Platelet dysfunction",
    "choice_c": "Side effect of phenytoin",
    "choice_d": "Vitamin C deficiency",
    "choice_e": "von Willebrand factor deficiency",
    "correct_answer": "D",
    "explanation": "Gingival bleeding/hypertrophy and petechiae in a patient with alcohol abuse and malnutrition suggest scurvy (Vitamin C deficiency). Vitamin C is crucial for collagen synthesis; deficiency leads to immature connective tissue and cutaneous/gingival findings. Phenytoin can cause gingival hypertrophy but not typically petechiae (Choice C). Platelet dysfunction and vWD do not cause gingival hypertrophy (Choices B and E). Leukocytoclastic vasculitis does not involve gum symptoms (Choice A).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_114",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 44-year-old construction worker comes to the ED with nausea and fatigue. He strained his back 7 days ago and took over-the-counter painkillers. He drinks alcohol daily and admits to intravenous heroin use. BP is 94/50 mm Hg, pulse is 112/min. There is mild scleral icterus and right upper-quadrant tenderness. AST 3578 U/L, ALT 4235 U/L, Bilirubin 3.2 mg/dL, INR 1.7. Which of the following is the most appropriate cause of this patient's current condition?",
    "choice_a": "Alcoholic hepatitis",
    "choice_b": "Bacteremia with liver abscess",
    "choice_c": "Hepatitis C infection",
    "choice_d": "Medication toxicity",
    "choice_e": "Pulmonary hypertension",
    "correct_answer": "D",
    "explanation": "Markedly elevated transaminases (>1000-3000 U/L) in the setting of acute liver injury suggest acetaminophen toxicity, especially given the history of painkiller use and chronic alcohol consumption (a risk factor). In alcoholic hepatitis, transaminases are typically <300-500 U/L with an AST:ALT ratio >2 (Choice A). Acute Hepatitis C rarely causes hepatic failure (Choice C). Liver abscess and pulmonary hypertension do not cause elevations in the thousands (Choices B and E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_115",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 63-year-old man with diabetes is hospitalized for sepsis and respiratory failure. He spent 3 days in the ICU on mechanical ventilation but is now extubated and has resumed eating. Current medications include vancomycin, heparin, insulin, and omeprazole. Laboratory values: Hemoglobin 12.2 mg/dL, Creatinine 1.4 mg/dL, Albumin 2.5 mg/dL. Which of the following should be strongly considered when transferring this patient to the medical floor?",
    "choice_a": "Discontinuing omeprazole",
    "choice_b": "Starting an albumin infusion",
    "choice_c": "Starting oral diabetic medications",
    "choice_d": "Switching from intravenous vancomycin to oral rifampin",
    "choice_e": "Switching from pharmacologic to mechanical thromboprophylaxis",
    "correct_answer": "A",
    "explanation": "Stress ulcer prophylaxis (eg, omeprazole) should be discontinued once a patient leaves the ICU and no longer has an indication (eg, off mechanical ventilation) to avoid adverse effects like nosocomial pneumonia and C. difficile. Hypoalbuminemia alone is not an indication for albumin infusion (Choice B). Oral rifampin alone is inappropriate due to resistance (Choice D). Pharmacologic thromboprophylaxis is preferred in patients not at high risk for bleeding (Choice E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_116",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 78-year-old man is evaluated for gallstones after being admitted for urinary retention. Abdominal ultrasonography revealed 2 large gallstones with no wall thickening or ductal dilation. The patient has atypical symptoms (bloating, nausea) but no biliary colic or jaundice. Liver function tests and lipase are normal. Which of the following is the best next step in management of this patient's gallstones?",
    "choice_a": "Begin ursodeoxycholic acid therapy",
    "choice_b": "Obtain MR cholangiography",
    "choice_c": "Offer cholecystectomy",
    "choice_d": "Perform hepatobiliary cholescintigraphy (HIDA scan)",
    "choice_e": "Provide reassurance with no further intervention",
    "correct_answer": "E",
    "explanation": "Asymptomatic gallstones are common and do not require intervention. This patient lacks typical biliary colic symptoms (eg, RUQ pain, fever, jaundice); atypical symptoms (bloating) should prompt evaluation for other causes like the bladder obstruction. Cholecystectomy is for symptomatic stones (Choice C). HIDA scan is for inconclusive ultrasound in suspected cholecystitis (Choice D). MRCP is for suspected ductal stones/obstruction (Choice B). UDCA is for poor surgical candidates with typical symptoms (Choice A).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_117",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 72-year-old man with stage IV lung cancer and opioid-induced constipation is evaluated for refractory constipation. He is on a fentanyl patch and morphine. Other medications include fiber, senna-docusate, and lactulose. Examination shows a soft, nontender abdomen. Which of the following is the most appropriate next step in managing this patient's constipation?",
    "choice_a": "Add methylnaltrexone therapy",
    "choice_b": "Administer mineral oil enema",
    "choice_c": "Change morphine to hydromorphone",
    "choice_d": "Discontinue fentanyl patch",
    "choice_e": "Start misoprostol therapy",
    "correct_answer": "A",
    "explanation": "Opioid-induced constipation refractory to first-line measures (fiber, senna-docusate, osmotic laxatives) often responds to methylnaltrexone, a peripherally acting opioid antagonist. Mineral oil enemas are for acute fecal impaction (Choice B). Switching opioids or stopping the patch (which controls cancer pain) is unlikely to provide benefit or is inappropriate (Choices C and D). Misoprostol has limited data for this condition (Choice E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_118",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 79-year-old nursing home resident with advanced dementia and multiple comorbidities is admitted for abdominal distension and vomiting. He takes hydrocodone. X-ray and CT show colonic dilation (11.3 cm) without mechanical obstruction. Electrolytes show Potassium 2.9, Magnesium 1.2. Which of the following is the best initial management for this patient?",
    "choice_a": "Intravenous metoclopramide",
    "choice_b": "Intravenous neostigmine",
    "choice_c": "Percutaneous tube cecostomy",
    "choice_d": "Serial abdominal examinations",
    "choice_e": "Subcutaneous methylnaltrexone",
    "correct_answer": "D",
    "explanation": "Acute colonic pseudo-obstruction (Ogilvie syndrome) is initially managed supportively with NPO, decompression, and serial examinations to monitor for perforation. Underlying causes (eg, electrolyte imbalance, narcotics) should be addressed. Neostigmine is for patients failing 24-48 hours of conservative therapy but is contraindicated in recent MI or beta-blocker use (Choice B). Cecostomy is for failure of neostigmine (Choice C). Metoclopramide is not first-line (Choice A). Methylnaltrexone is not first-line and may increase perforation risk (Choice E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_119",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 30-year-old woman with ulcerative colitis has 8-10 bloody bowel movements/day, weight loss, and tachycardia. ESR is 67 mm/h, Albumin 3.1. Abdominal x-ray shows no colonic dilation. Stool C. difficile is negative. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Anti-tumor necrosis factor therapy",
    "choice_b": "Colonoscopy with biopsy",
    "choice_c": "CT scan of the abdomen and pelvis",
    "choice_d": "Empiric antibiotics until culture results are available",
    "choice_e": "Systemic glucocorticoids",
    "correct_answer": "E",
    "explanation": "Severe ulcerative colitis flare (>6 bloody stools/day, tachycardia, elevated inflammatory markers) is treated initially with systemic glucocorticoids and high-dose 5-ASA compounds. Treatment should not be withheld while awaiting stool studies due to the risk of toxic megacolon. TNF inhibitors are for steroid-refractory cases (Choice A). Colonoscopy is avoided due to perforation risk (Choice B). Antibiotics are for systemic toxicity or peritonitis (Choice D). CT is not needed if x-rays are normal (Choice C).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_120",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 68-year-old woman with pneumonia is evaluated for new-onset jaundice 4 days after admission. She takes azithromycin and ceftriaxone. Labs show Total Bilirubin 3.6, Direct 2.4, ALP 376, AST 101, ALT 124. Ultrasound shows a normal liver and no biliary obstruction. Which of the following is the best next step in management of this patient?",
    "choice_a": "Acetaminophen level",
    "choice_b": "Change antibiotics",
    "choice_c": "Cholescintigraphy (HIDA scan)",
    "choice_d": "Liver biopsy",
    "choice_e": "MR cholangiopancreatography",
    "correct_answer": "B",
    "explanation": "A cholestatic pattern (elevated ALP/Direct bilirubin) without biliary obstruction on ultrasound suggests intrahepatic cholestasis, often due to drug toxicity (DILI) from antibiotics like azithromycin or ceftriaxone. Removal of the offending agent is the primary management. Acetaminophen causes a hepatocellular pattern (thousands in transaminases) (Choice A). HIDA scan is for acute cholecystitis (Choice C). Biopsy is for unexplained persistent abnormalities (Choice D). MRCP is if PSC is suspected (Choice E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_121",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 38-year-old man with severe necrotizing pancreatitis in the ICU develops persistent fever. CT shows 40% pancreatic necrosis and retroperitoneal fluid collections. Urinalysis and blood cultures are negative. Which of the following is the best next step in managing this patient?",
    "choice_a": "Ceftriaxone and vancomycin",
    "choice_b": "Endoscopic retrograde cholangiopancreatography",
    "choice_c": "Open necrosectomy",
    "choice_d": "Parenteral nutrition",
    "choice_e": "Percutaneous CT-guided aspiration",
    "correct_answer": "E",
    "explanation": "Infected necrosis should be suspected in necrotizing pancreatitis patients who do not improve after a week. CT-guided fine-needle aspiration (FNA) with Gram stain and culture is used to direct antimicrobial therapy. Alternatively, empiric carbapenems or quinolones + metronidazole (better pancreatic penetration than ceftriaxone/vancomycin) can be started (Choice A). Surgical debridement is for those failing antibiotics (Choice C). ERCP is for concurrent cholangitis (Choice B). Enteral nutrition is preferred over parenteral (Choice D).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_122",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 55-year-old man with cirrhosis presents with lethargy and asterixis. He takes propranolol and diuretics. He has no fever or abdominal pain. CT head and urinalysis are unremarkable. Laboratory results: Sodium 130, Platelets 72,000, INR 2.4. Which of the following is the most appropriate next step in management?",
    "choice_a": "Perform lumbar puncture",
    "choice_b": "Start oral rifaximin",
    "choice_c": "Pass nasogastric tube and perform gastric lavage",
    "choice_d": "Perform upper Gl endoscopy",
    "choice_e": "Perform diagnostic paracentesis",
    "correct_answer": "E",
    "explanation": "The primary goal in hepatic encephalopathy (HE) is identifying a precipitating cause. If no cause is evident, patients with ascites should undergo diagnostic paracentesis to rule out spontaneous bacterial peritonitis (SBP), even without fever or pain. First-line therapy for HE is lactulose; rifaximin is added for those failing to improve after 48 hours (Choice B). Lumbar puncture is not needed for HE/asterixis (Choice A). GI bleed is unlikely with negative occult blood (Choices C and D).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_123",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 52-year-old man has a T3 rectal adenocarcinoma (invading through muscularis propria) 10 cm from the anal verge. Imaging shows no lymph node involvement or metastasis. Which of the following is the most appropriate treatment for this patient?",
    "choice_a": "Chemoradiation followed by surgery and chemotherapy",
    "choice_b": "Surgery followed by chemotherapy",
    "choice_c": "Surgery followed by radiation",
    "choice_d": "Surgery only",
    "correct_answer": "A",
    "explanation": "The standard of care for locally advanced (T3/T4) rectal cancer is neoadjuvant (preoperative) concurrent chemoradiotherapy followed by surgical resection and then postoperative chemotherapy. Neoadjuvant therapy allows for down-staging and improved rates of sphincter preservation. Postoperative chemotherapy alone (Choice B) or radiation alone (Choice C) is less effective for local control and cure rates in advanced rectal cancer.",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_124",
    "system": "Gastrointestinal Nutrition",
    "stem": "An 88-year-old woman with advanced dementia and a history of aspiration pneumonia is losing weight. Her daughter asks about nutritional support. Which of the following statements would best address the daughter's concerns?",
    "choice_a": "Percutaneous gastrostomy (PEG) tube placement prevents aspiration and recurrent pneumonia",
    "choice_b": "PEG tube placement does not seem to prolong life in patients with advanced dementia",
    "choice_c": "PEG tube placement offers an advantage in managing and preventing pressure ulcers in patients with advanced dementia",
    "choice_d": "A high-calorie liquid diet with avoidance of solid foods would improve her nutritional status and may prevent aspiration",
    "choice_e": "Appetite stimulants would address her weight loss issue",
    "correct_answer": "B",
    "explanation": "Feeding tubes (PEG) have not been shown to prolong life, improve functional status, provide comfort, or prevent aspiration pneumonia and pressure ulcers in patients with advanced dementia. In fact, they may increase the risk of aspiration and infection (Choices A and C). Hand-feeding and aspiration precautions are encouraged instead. Thin liquids are easily aspirated (Choice D). There is little evidence that appetite stimulants (Choice E) help in severe dementia.",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_125",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 44-year-old woman has upper abdominal pain, nausea, and jaundice. Labs: Bilirubin 3.0, Direct 1.9, ALP 306, Lipase 1292. ALT 218. CT shows pancreatic enlargement and inflammation. Multiple gallstones are seen, and the common bile duct (CBD) is dilated to 12 mm. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Continue current management and observe closely",
    "choice_b": "CT-guided percutaneous pancreatic aspiration",
    "choice_c": "Endoscopic retrograde cholangiopancreatography",
    "choice_d": "Hepatobiliary iminodiacetic acid (HIDA) scan",
    "choice_e": "Surgical evaluation for cholecystectomy",
    "correct_answer": "C",
    "explanation": "This patient has gallstone pancreatitis complicated by CBD obstruction (dilated CBD, elevated lipase, ALT >150) and likely acute cholangitis (Charcot triad: fever, pain, jaundice). Urgent ERCP (<24 hours) is indicated to remove the impacted stone and reduce disease severity. Supportive care (Choice A) is for mild pancreatitis. Pancreatic aspiration is for late-stage infected necrosis (Choice B). HIDA scan is for suspected cholecystitis with equivocal ultrasound (Choice D). Cholecystectomy should be performed after recovery (Choice E).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_126",
    "system": "Gastrointestinal Nutrition",
    "stem": "A 24-year-old African American man vacationing at high altitude develops sharp left upper quadrant pain and left shoulder pain. Chest x-ray shows blunting of the left costophrenic angle. He has no prior medical history. Which of the following studies would best reveal the underlying cause of this patient's condition?",
    "choice_a": "Duplex ultrasound of legs",
    "choice_b": "Hemoglobin electrophoresis",
    "choice_c": "Serum antiphospholipid antibodies",
    "choice_d": "Serum lipase levels",
    "choice_e": "Transthoracic echocardiogram",
    "correct_answer": "B",
    "explanation": "Acute left upper quadrant pain and a sympathetic pleural effusion (blunting of costophrenic angle) in a patient at high altitude suggest splenic infarction due to sickle cell trait (Hb AS). Diagnosis is confirmed by hemoglobin electrophoresis. Sickle cell trait patients are usually asymptomatic but can develop splenic infarcts under hypoxic conditions. DVT/PE (Choice A), antiphospholipid syndrome (Choice C), and cardiac emboli (Choice E) are less likely given the demographic and setting. Acute pancreatitis would cause elevated lipase but is less likely without risk factors (Choice D).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  },
  {
    "id": "GI_127",
    "system": "Gastrointestinal Nutrition",
    "stem": "An 83-year-old man from an assisted living facility has abdominal pain and distension. X-ray shows a large air-filled sigmoid colon extending to the RUQ with absence of air in the rectum. He has no fever or signs of peritonitis. Lactic acid is 2.2 mg/dL. Which of the following is the best next step in managing this patient?",
    "choice_a": "Flexible sigmoidoscopy",
    "choice_b": "Nasogastric suction and broad-spectrum antibiotics",
    "choice_c": "Oral lactulose",
    "choice_d": "Sodium phosphate enema",
    "choice_e": "Surgery",
    "correct_answer": "A",
    "explanation": "The clinical and x-ray findings (large air-filled sigmoid, no rectal air) are diagnostic of sigmoid volvulus. In patients without gangrene or perforation (no fever/sepsis), flexible sigmoidoscopy is indicated to untwist the volvulus and decompress the bowel. Surgery is reserved for cases with perforation, gangrene, or recurrence (Choice E). Barium enema (sodium phosphate enema) can be used for diagnosis if uncertain (Choice D). NG suction is for small-bowel obstruction (Choice B). Laxatives are not therapeutic for mechanical volvulus (Choice C).",
    "source": "ABIM - Gastrointestinal Nutrition -5.pdf"
  }
]