[
  {
    "id": "MREPRO_001",
    "system": "male reproductive system",
    "stem": "A 70-year-old man seeks advice regarding testosterone replacement therapy. The patient recently married a younger woman and has been reading reports in the news media regarding the therapy's potential benefits. He has diminished sexual desire and moderate erectile dysfunction that responds to sildenafil. The patient rarely has a morning erection. His ability to perform endurance exercise at a high level is significantly lower than it was 10 years ago. Other medical problems include hypertension, type 2 diabetes mellitus, benign prostatic hyperplasia (American Urological Association score of 10), and hyperlipidemia. There is no family history of prostate cancer. Blood pressure is 134/88 mm Hg and pulse is 84/min. BMI is 30 kg/m2. Neck circumference is 20 in (51 cm). Cardiovascular, pulmonary, abdominal, and extremity examinations are normal. The testes appear normal for age. Digital rectal examination shows a symmetrical prostate that is mildly enlarged. Laboratory results are as follows: Hematocrit 54%, Total cholesterol 240 mg/dL, HDL 44 mg/dL, LDL 150 mg/dL, Hemoglobin A1c 7.2%, Testosterone, serum 280 ng/dL (normal 300-1,000), PSA 3.5 ng/mL. Which of the following is the best advice regarding testosterone replacement for this patient?",
    "choice_a": "FSH and LH levels should be obtained",
    "choice_b": "Further evaluation for prostate cancer is necessary before initiating testosterone therapy",
    "choice_c": "Testosterone replacement therapy is appropriate with a slow dose up-titration",
    "choice_d": "Testosterone replacement therapy would likely improve his erectile dysfunction",
    "choice_e": "The potential risks of testosterone replacement likely outweigh the benefits",
    "correct_answer": "E",
    "explanation": "Testosterone replacement therapy (TRT) should be considered only in men with clinically significant androgen deficiency (eg, low libido, erectile dysfunction, loss of body hair, gynecomastia, decreased bone density, testicular atrophy) and an unequivocally low morning serum testosterone level (eg, <200-300 ng/dL, depending on the reference). Nonspecific symptoms (eg, fatigue, weakness, weight changes) do not usually respond to TRT and do not warrant testing or treatment in most cases. Testosterone levels show significant variability; if the initial testosterone level is low, it should be confirmed on repeat testing. In addition, providers should consider measuring free testosterone levels, as variations in the levels of sex hormone-binding globulin, which may be decreased in certain conditions (eg, obesity, diabetes), can cause misleading total testosterone results. Contraindications to TRT include breast or prostate cancer, polycythemia, severe lower urinary tract symptoms (ie, American Urological Association score >19), unstable heart failure, PSA >4 ng/mL (>3 ng/mL in high-risk patients), and untreated obstructive sleep apnea (OSA). This patient has an elevated hematocrit, hypertension, obesity, and a large neck circumference, which together suggest possible OSA. TRT can worsen OSA and exacerbate erythrocytosis, with a possible increased risk of venous thromboembolism. The patient also has multiple risk factors for cardiovascular disease, and some evidence suggests that TRT may increase this risk. As a result, the risks likely outweigh the benefits of TRT in this patient (Choice C). In addition, TRT is indicated for specific disorders of gonadal function (eg, chemotherapy-induced hypogonadism), but TRT for age-related declines in serum testosterone is considered an off-label use. (Choice A) FSH and LH help to distinguish primary (elevated LH and FSH) from secondary (low or normal FSH and LH) hypogonadism. However, this patient's mildly low testosterone level should be confirmed on repeat testing prior to further evaluation. (Choice B) A PSA level and digital prostate examination are recommended to screen for prostate cancer prior to initiation of TRT in men age >50 (or age >40 with a family history of prostate cancer). This patient's PSA is normal for his age; additional testing is not needed at this time (Choice D) Although erectile dysfunction is a significant symptom in men with hypogonadism, TRT has shown inconsistent benefits in the treatment of erectile dysfunction in older men. Phosphodiesterase inhibitors (eg, sildenafil) are more likely to be effective. Educational objective: Testosterone replacement therapy should be considered only in men with clinically significant androgen deficiency (eg, low libido, erectile dysfunction, loss of body hair, gynecomastia, decreased bone density, testicular atrophy) and an unequivocally low morning serum testosterone level confirmed on repeat testing. Careful pretreatment evaluation is recommended to identify patients with a favorable risk:benefit ratio. References • Testosterone therapy in men with androgen deficiency syndromes: an Endocrine Society clinical practice guideline.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_002",
    "system": "male reproductive system",
    "stem": "A 64-year-old man seeks treatment for erectile dysfunction. He has been in a stable, monogamous relationship for many years. Over the last 3 years, he has had progressive difficulty attaining and maintaining an erection sufficient for successful intercourse. He relates that his sexual desire is unchanged, but he no longer has spontaneous morning erections. His medical problems include type 2 diabetes mellitus, hypertension, hyperlipidemia, and coronary artery disease. He underwent successful angioplasty of the proximal left anterior descending artery for non-ST elevation myocardial infarction 2 years ago with a drug-eluting stent. He can walk up 4 flights of stairs and about 6 blocks at a modest pace before he has to stop due to fatigue. He has occasional episodes of angina while walking at a fast pace or in cold weather. His current medications include metformin, rosuvastatin, losartan, metoprolol succinate, clopidogrel, low-dose aspirin, and isosorbide mononitrate. His blood pressure is 124/74 mm Hg, pulse is 64/min, and respirations are 14/min. His BMI is 31 kg/m2. Cardiopulmonary and abdominal examinations are within normal limits. Femoral and peripheral pulses are 2+ and symmetric. Testes are normal size. Both feet have decreased sensation to pinprick. Echocardiogram shows ejection fraction of 42%. He is able to walk on a treadmill to 84% of predicted maximum without chest pain or ECG changes. His systolic blood pressure does not decrease with treadmill exercise. Laboratory testing shows normal complete blood count and a morning total serum testosterone of 340 ng/dL. Which of the following is the best next step in management of this patient?",
    "choice_a": "Intraurethral alprostadil",
    "choice_b": "Low-dose sildenafil",
    "choice_c": "Penile prosthesis",
    "choice_d": "Testosterone",
    "choice_e": "Yohimbine",
    "correct_answer": "A",
    "explanation": "This patient presents with erectile dysfunction (ED) with intact libido and normal testosterone levels. Patients unable to have spontaneous morning erections most likely have vascular or neurogenic causes of ED. This patient exercises moderately without angina and would likely tolerate sexual activity without safety concerns. Current guidelines recommend phosphodiesterase inhibitors (PDE) as first-line therapy for ED. PDE inhibitors (eg, sildenafil, vardenafil, and tadalafil) increase cyclic guanosine monophosphate (cGMP), leading to increased nitric oxide-mediated vasodilation and erection. Nitrates stimulate guanylate cyclase, increase cGMP, and cause systemic vasodilation. Patients taking both nitrates and PDE inhibitors have increased risk for hypotension and syncope. This patient has occasional angina with excessive activity; he therefore needs to continue isosorbide mononitrate and cannot take PDE inhibitors (Choice B). Second-line therapy includes penile self-injectable drugs, intraurethral alprostadil, and vacuum devices. Most patients prefer intraurethral alprostadil, a vasodilator that increases penile blood flow to cause an erection. It is generally well tolerated with few side effects, is more convenient, has no drug interactions with nitrates, and would be the best treatment option for this patient. (Choice C) Penile prosthesis is generally reserved for patients failing or refusing other therapies (eg, intraurethral therapy, vacuum erection therapy). Prostheses are invasive with risks of infection, anesthesia, and device failure. (Choice D) This patient does not have signs and symptoms of testosterone deficiency (eg, decreased libido, depression, anemia) and has a normal testosterone level. Testosterone replacement would be harmful. (Choice E) Yohimbine is a selective alpha-2-adrenergic receptor blocker that may increase parasympathetic tone, reduce sympathetic tone, and result in an erection. However, it has limited efficacy in studies and is not recommended in patients with cardiovascular disease due to side effects such as tachycardia and hypertension. Educational objective: Phosphodiesterase inhibitors (eg, sildenafil) are contraindicated for treating erectile dysfunction in patients taking nitrates for angina due to the risks of hypotension and syncope. Treatment options for these patients include intraurethral alprostadil and vacuum assist devices. References • Sildenafil citrate potentiates the hypotensive effects of nitric oxide donor drugs in male patients with stable angina. • Treatment of men with erectile dysfunction with transurethral alprostadil. Medicated Urethral System for Erection (MUSE) Study Group.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_003",
    "system": "male reproductive system",
    "stem": "A 43-year-old man seeks care for a painful testicle. The discomfort started 2-3 days ago and has progressed to sharp left testicular pain every time he steps down with his left foot. He has no fever, chills, or dysuria. He has been in a stable monogamous relationship for 20 years and denies anal sexual intercourse. He has not had this problem previously. There is no history of trauma to the area. He considers himself in good health and takes no medications. His temperature is 37.4 C (99.4 F), blood pressure is 130/80 mm Hg, and pulse is 84/min. Cremasteric reflexes are normal bilaterally. He has no skin lesions involving the genitalia and no palpable inguinal lymph nodes. The scrotum is warm, and the left testicle feels slightly swollen with severe tenderness to palpation, especially over its posterior aspect. There are no inguinal hernias. There is no urethral discharge. A urinalysis is normal. Which of the following is the most likely diagnosis?",
    "choice_a": "Epididymitis",
    "choice_b": "Germ cell tumor",
    "choice_c": "Testicular torsion",
    "choice_d": "Varicocele",
    "choice_e": "Viral orchitis",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with epididymitis. Epididymitis usually presents with acute onset testicular pain, fever, possible urinary symptoms (e.g., urinary frequency or urgency), and exquisite tenderness on testicular examination. The cremasteric reflex is usually present. Urinalysis can be normal in patients without urinary symptoms. The diagnosis is usually made clinically, but Doppler ultrasound can be done in equivocal cases to document increased flow to the affected epididymis. Chlamydia trachomatis and Neisseria gonorrhoeae are more common in men <35, while E. coli is more common in older men and men practicing anal intercourse. Treatment is usually outpatient and consists of testicular elevation, NSAIDs, and antibiotics with close follow-up. (Choice B) Germ cell tumors usually present with painless testicular swelling and less commonly with testicular pain due to hemorrhage or infarction. (Choice C) Although more common in boys <= age 12, testicular torsion can occur in adult men. Testicular torsion is associated with a \"high-riding\" testicle and absence of the cremasteric reflex. Confirmation of the diagnosis can be obtained by color Doppler ultrasound and surgery is the definitive means of treatment. (Choice D) Varicocele is a dilated spermatic vein that can be asymptomatic or present with dull scrotal aching worsened with standing and relieved with sitting. This patient's acute pain makes this diagnosis less likely. (Choice E) Viral orchitis without epididymitis (e.g., mumps, rubella, and parvovirus) can present with scrotal swelling, pain, and tenderness with erythema. However, it is more common in children and adolescents. Adults tend to present more commonly with epididymo-orchitis. Educational objective: Epididymitis usually presents with acute scrotal pain, exquisite testicular tenderness, and an intact cremasteric reflex. Diagnosis is usually made clinically, but Doppler ultrasound can be used in equivocal cases to document increased flow to the affected epididymis. Treatment usually consists of testicular elevation, NSAIDs, and antibiotics with close follow-up. References Diagnosis and management of epididymitis. • Epididymitis and orchitis: an overview.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_004",
    "system": "male reproductive system",
    "stem": "A 31-year-old man comes to the physician because of right testicular swelling for the past one week. He recalls trauma to the perineum and testes when he fell from a bike one month ago. He is otherwise healthy and has no other complaints. His past medical history is unremarkable. He admits to several unprotected sexual encounters in the past. He smokes marijuana occasionally but does not smoke tobacco. He denies any intravenous drug use. On physical examination, a non-tender right testicular mass is palpated. Scrotal ultrasound shows a well-defined 2x1.5 cm hypoechoic lesion without cystic components in the right testis. His HIV test is negative. Serum alpha-fetoprotein and ẞ-hCG levels are normal. CT scan of the abdomen and pelvis do not reveal any lymphadenopathy. Which of the following is the best next step in managing this patient?",
    "choice_a": "Fine needle aspiration",
    "choice_b": "Incisional biopsy",
    "choice_c": "Radical inguinal orchiectomy",
    "choice_d": "Repeat ultrasound in 4-6 weeks",
    "choice_e": "Trial of antibiotic therapy",
    "correct_answer": "C",
    "explanation": "This patient's presentation is concerning for testicular cancer. The majority (95%) of testicular cancers are germ cell tumors (GCT), which are further divided into seminomas and non-seminomatous tumors. Testicular malignancies classically present as painless scrotal swelling. Patients with suspected testicular cancer on physical examination should undergo testicular ultrasound to differentiate cystic from hypoechoic (more likely malignant) lesions. In addition, ultrasound can also rule out hydrocele or epididymitis. After the ultrasound, a staging work-up should be performed. A CT scan of the abdomen and pelvis is required in all patients since testicular cancer initially spreads to the regional retroperitoneal lymph nodes. In addition, a chest x-ray and tumor markers should also be obtained. Non-seminomas typically have elevated AFP and/or ẞ-hCG. Pure seminomas may have elevated ẞ-hCG, but AFP is usually not elevated. Thus, these tumor markers either alone or in combination are insufficient to establish a diagnosis of testicular cancer. Definitive diagnosis and histology is confirmed by inguinal orchiectomy. Biopsy procedures (e.g., fine needle aspiration, incisional biopsy) are contraindicated due to the risk of local seeding and poorer outcomes (Choices A and B). Histologic distinction is important, since the treatment differs for seminomas (usually chemotherapy and/or radiation therapy) and non-seminomas (usually chemotherapy). (Choice D) An expedited work-up is important as the majority (90%) of GCTs can be cured. (Choice E) Antibiotics would treat epididymitis, which usually presents as acute testicular pain with exquisite tenderness on examination. Educational objective: Testicular cancers are usually hypoechoic on ultrasound. Pure seminomas do not cause alpha-fetoprotein elevation. Testicular cancer spreads into the retroperitoneum and imaging of the abdomen is an important part of staging. Testicular biopsy is contraindicated. Radical orchiectomy is required for confirming the diagnosis, histologic classification, and local tumor control, even in patients with metastasis. References • Part I: testicular cancer-management of early disease • The role of imaging in staging and monitoring testicular cancer.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_005",
    "system": "male reproductive system",
    "stem": "A 66-year-old man comes to the office due to 3 months of scrotal discomfort. He reports heaviness and a dull ache in the left scrotal area that is worse toward the end of the day. He has no fever, dysuria, hematuria, or penile discharge. The patient has a history of hypertension and takes amlodipine. He had a vasectomy 20 years ago. He lives with his wife and has 2 grown children. On examination, the abdomen is soft and nontender without organomegaly. Examination in the standing position shows a palpable, soft, irregular, nontender mass above the left testis that disappears in the supine position. There is no skin redness, groin bulge, or transillumination. Both testes are normal in size and without tenderness. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Annual scrotal ultrasound",
    "choice_b": "CT scan of abdomen and pelvis",
    "choice_c": "Scrotal support and analgesics",
    "choice_d": "Serial semen analysis",
    "choice_e": "Surgical referral",
    "correct_answer": "C",
    "explanation": "This patient's presentation suggests a varicocele, which is due to tortuous dilation of the pampiniform plexus of veins surrounding the spermatic cord and testis in the scrotum. Varicoceles occur in up to 20% of men (usually age 15-25); they are usually left sided, but up to 30% can be bilateral. The left spermatic (gonadal) vein enters the left renal vein at a right angle. The aorta and superior mesenteric artery can compress the left renal vein and increase intravascular pressure within the left renal and gonadal veins. This can cause incompetence of the valves, retrograde blood flow, and venous dilation. Patients can be asymptomatic or develop a dull ache with standing. Examination usually shows a soft mass that is enlarged with standing and Valsalva maneuvers but diminishes when supine. Ultrasound can show retrograde venous flow and dilation of pampiniform plexus. Asymptomatic patients do not require treatment. Those with scrotal discomfort usually improve with analgesics (eg, nonsteroidal anti-inflammatory drugs) and/or scrotal support. Potential complications include infertility and testicular atrophy (due to increased scrotal temperature). (Choice A) Annual scrotal ultrasound is not typically recommended for varicoceles. However, this patient may require further imaging if he has persistent symptoms or new testicular findings (eg, solid mass). (Choice B) Because the right gonadal vein empties directly into the inferior vena cava, right-sided varicoceles are rare and can indicate inferior vena cava compression (eg, renal cell carcinoma) or obstruction (eg, thrombus). Sudden onset of left-sided varicocele that does not diminish in the recumbent position may also indicate obstruction. CT imaging is suggested in such cases but is otherwise not necessary. (Choices D and E) Serial semen analysis is usually reserved for men who desire fertility. Surgical referral is recommended for younger men with scrotal atrophy or older men who desire fertility. This patient has no scrotal atrophy and has had a vasectomy. Educational objective: Varicoceles are due to tortuous dilation of the pampiniform plexus surrounding the spermatic cord. Asymptomatic patients do not require treatment; those with scrotal discomfort usually improve with analgesics (eg, nonsteroidal anti-inflammatory drugs) and/or scrotal support. References • The varicocele. • Testicular varicocele: an overview.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_006",
    "system": "male reproductive system",
    "stem": "A 68-year-old man comes to the physician because of increased urinary frequency and nocturia. He has not increased his daily oral fluid intake. He has no dysuria, hematuria, penile discharge, or difficulty urinating. His other medical problems include recently diagnosed hypertension and osteoarthritis of his knees. His temperature is 36.7 C (98 F), blood pressure is 130/82 mm Hg, and pulse is 80/min. Cardiopulmonary examination is normal. There is no jugular venous distention or peripheral edema. The abdomen is soft and without suprapubic tenderness. The prostate gland is normal in size, has no distinct nodules, and is nontender. Which of the following is the most appropriate next step in management?",
    "choice_a": "Review medication list",
    "choice_b": "Start ciprofloxacin",
    "choice_c": "Start doxazosin",
    "choice_d": "Start finasteride",
    "choice_e": "Urine culture",
    "correct_answer": "A",
    "explanation": "Bladder storage symptoms such as frequency and nocturia are very common in older adults. Although benign prostatic hyperplasia (BPH) is a common etiology of these symptoms in men, potentially offending medications should be investigated and discontinued prior to further testing or treatment. Hydrochlorothiazide, a common first-line antihypertensive, is often the culprit in urinary frequency and nocturia. With discontinuation and change to an alternate nondiuretic antihypertensive medication, this patient's symptoms will likely resolve. If this patient is not taking hydrochlorothiazide or other diuretics, he needs urinalysis, serum chemistries, and blood glucose testing to further evaluate urinary frequency. Serum PSA testing is also reasonable in patients with prostate enlargement. (Choice B) Prostatitis and urinary tract infections are also common causes of bladder storage symptoms. A nontender, normal-sized prostate argues against a diagnosis of prostatitis. This patient has no fever, dysuria, or suprapubic tenderness. Therefore, empiric antibiotics are not warranted. (Choices C and D) First-line therapy for clinically diagnosed BPH is an alpha-adrenergic receptor blocker such as doxazosin (Cardura). If symptoms do not improve on this therapy alone, a 5-alpha reductase inhibitor such as finasteride (Proscar) is often added. However, these medications should be started only after a careful history (of bladder storage and obstructive symptoms), digital rectal examination, and laboratory studies (including a urinalysis and prostate-specific antigen serology) confirm the diagnosis. Close evaluation of possible external causes such as caffeine and daily fluid intake and offending medications should precede all further diagnostics and treatment. (Choice E) Urine culture is indicated only if the patient's urinalysis is positive or there are symptoms and signs of infection. Educational objective: Bladder storage symptoms such as frequency and nocturia are common side effects of diuretic therapy, which should be discontinued prior to further testing or treatment of benign prostatic hyperplasia. References The evaluation and treatment of nocturia: a consensus statement.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_007",
    "system": "male reproductive system",
    "stem": "A 72-year-old man comes to the office due to increased urinary frequency and pain during urination. The patient has had mild urinary hesitancy and frequent nocturia for several years but was not bothered until he began experiencing intermittent burning pain during urination 3 months ago. The patient has also been urinating several times during the day as well as at night and has had urgent need to urinate. He has had no fever, abdominal or back pain, or hematuria. The patient was given oral trimethoprim-sulfamethoxazole a month ago after testing revealed a urinary tract infection. His symptoms improved while taking the antibiotics but recurred after finishing the 1-week course of treatment. Medical history is notable for hypertension and gout. He is a former smoker with a 30-pack-year history and does not drink alcohol. The patient worked in a petroleum refinery for many years before retiring at age 65. Temperature is 36.7 C (98 F), blood pressure is 130/84 mm Hg, and pulse is 72/min. The abdomen is soft and nontender with no masses or hepatosplenomegaly. There is no costovertebral angle tenderness. Digital rectal examination shows a diffusely enlarged and moderately tender prostate. Leukocyte count is 9,200/mm3 Urinalysis results are as follows: Leukocyte esterase positive, Nitrite positive, Bacteria moderate, White blood cells 30-50/hpf, Red blood cells 5-10/hpf. Which of the following is the most likely cause of this patient's current urinary symptoms?",
    "choice_a": "Chronic prostatitis",
    "choice_b": "Interstitial cystitis",
    "choice_c": "Progression of benign prostatic hyperplasia",
    "choice_d": "Urinary bladder calculi",
    "choice_e": "Urothelial malignancy",
    "correct_answer": "A",
    "explanation": "This patient has lower urinary tract symptoms (LUTS), pyuria, and an enlarged, tender prostate consistent with chronic bacterial prostatitis (CBP). CBP can be asymptomatic or present with dysuria and increased urinary frequency. However, unlike in acute prostatitis, systemic symptoms (eg, fever, chills) are typically absent. It is usually caused by enteric gram-negative bacilli, and is a potential cause of recurrent symptoms in patients receiving an inadequate course of antibiotics for acute prostatitis. Although symptoms may be temporarily alleviated by short courses of antibiotics, the same organism can often be isolated when symptoms recur. The diagnosis of CBP should be suspected in men with persistent or recurrent LUTS, especially if the same organism is repeatedly found on culture. Culture of prostatic secretions or urine culture following prostatic massage can confirm the diagnosis, but most patients are treated empirically. Prolonged antibiotic therapy (4-6 weeks) is recommended; fluoroquinolones (eg, ciprofloxacin) are preferred in most cases (alternate: trimethoprim-sulfamethoxazole). Treatment failure is common, and complications include prostatic abscess, bacteremia, and epididymitis. (Choice B) Interstitial cystitis (ie, painful bladder syndrome) is more common in women and usually presents with suprapubic pain (made worse with either bladder filling or emptying), increased urinary frequency, urgency, and nocturia. It would not cause prostatic tenderness or bacteriuria. (Choice C) Benign prostatic hyperplasia can cause chronic LUTS, but obstructive voiding symptoms (eg, dribbling, decreased force of stream) are usually more prominent, and this patient's pyuria and dysuria are more consistent with CBP. (Choice D) Bladder stones are an uncommon cause of irritative voiding symptoms. They are typically seen in patients with incomplete bladder emptying, recurrent infection, or foreign bodies in the bladder. Although patients with gout can occasionally form urate bladder stones, this patient's prostatic tenderness is more consistent with CBP. (Choice E) Urothelial (transitional cell) carcinoma of the bladder usually presents with painless gross hematuria, and sometimes with urinary frequency, urgency, and dysuria. Smoking is a major risk factor, but this patient's pyuria, lack of significant hematuria, and previous response to antibiotics make bladder cancer less likely. Educational objective: Chronic prostatitis is characterized by recurrent or persistent lower urinary tract symptoms, prostatic tenderness, and repeated identification of the same organism on urine culture. A prolonged (4-6 weeks) course of antibiotics is recommended, and fluoroquinolones (eg, ciprofloxacin) are preferred for most patients. References Chronic prostatitis: management strategies. • Common questions about chronic prostatitis.",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  },
  {
    "id": "MREPRO_008",
    "system": "male reproductive system",
    "stem": "A 27-year-old man comes to the emergency department due to scrotal pain. Three days ago, he was diagnosed with acute epididymitis by his primary care physician and was treated with ceftriaxone and doxycycline. Nuclear acid amplification test for Chlamydia trachomatis was positive. He has persistent pain and states that he has been compliant with his oral doxycycline. He denies anal intercourse. Examination reveals tenderness and swelling involving the left side of the scrotal sac. The pain is relieved with elevation of the sac and the cremasteric reflex is equivocal. Rectal examination shows a normal-sized and nontender prostate. Which of the following is the most appropriate next step in management?",
    "choice_a": "Add levofloxacin",
    "choice_b": "Change doxycycline to azithromycin",
    "choice_c": "Discuss HIV and syphilis testing",
    "choice_d": "Reassure and provide analgesics",
    "choice_e": "Scrotal ultrasound",
    "correct_answer": "E",
    "explanation": "This patient has refractory scrotal pain despite adequate therapy for epididymitis, and he should be evaluated for more emergent causes (eg, testicular torsion, testicular abscess, or testicular infarction). History and physical examination often cannot differentiate between these diagnoses. For instance, although an abscess usually demonstrates fluctuance, the examination may not always show this. Similarly, although testicular torsion (associated with an absent cremasteric reflex) is more common in boys age ≤12 it can also occur in adult men. Despite receiving antibiotic therapy, this patient has persistent left-sided scrotal pain and swelling that is decreased with sac elevation (consistent with but not specific to epididymitis, and uncommon in testicular torsion) along with an equivocal cremasteric reflex. He needs immediate evaluation by a urologist and ultrasonography or radionuclide scrotal imaging to identify the cause of his pain and to determine the need for surgical intervention. Although he was initially diagnosed with epididymitis, this particular patient was eventually found to have testicular cancer, which can occasionally present as acute testicular pain. (Choices A and B) Adding either drug would not address possible alternative emergency diagnoses. Changing antibiotics would likely not improve outcomes, as Chlamydia trachomatis has low levels of in vitro and in vivo resistance to quinolones, macrolides, and doxycycline. Addition of fluoroquinolones (eg. ofloxacin or levofloxacin) is recommended if the suspected cause of epididymitis is due to enteric organisms (eg, Escherichia coli). Epididymitis is usually seen in men age ≥35 and in men who engage in anal intercourse. (Choice C) Current guidelines recommend HIV and syphilis testing in men with high-risk behavior or with sexually transmitted infections. Although this patient has a sexually transmitted infection and may require HIV and syphilis testing, neither of these are likely to cause his current pain. (Choice D) Patients should note symptomatic improvement after 1-3 days of therapy for epididymitis. Patients without improvement should undergo investigation for complications or antibiotic resistance, instead of reassurance and analgesics. Educational objective: Patients with epididymitis refractory to therapy require investigation (eg, scrotal ultrasound) for emergent etiologies (eg, torsion) or complications (eg, abscess, infarction). References • Role of color Doppler ultrasonography in evaluation of scrotal swellings: pattern of disease in 120 patients with review of literature • Epididymitis and orchitis: an overview",
    "source": "ABIM - Male Reproductive System - @USMLEWorldStep3.pdf"
  }
]