[
  {
    "id": "OPHTHAL_001",
    "system": "Ophthalmology",
    "stem": "A 65-year-old man comes to the physician because of floaters in his right eye for the past 2 days. He also experienced some brief flashes of light as well as poor vision in the same eye 1 day ago. He has always been nearsighted and has worn glasses since he was a teenager. He has no eye pain or trauma. There is no history of diabetes mellitus. No obvious abnormalities are detected on funduscopic examination, but an extensive right-sided visual field defect is confirmed by confrontation. Which of the following is the most likely diagnosis?",
    "choice_a": "Central retinal artery occlusion",
    "choice_b": "Macular degeneration",
    "choice_c": "Optic neuritis",
    "choice_d": "Retinal detachment",
    "choice_e": "Temporal arteritis",
    "correct_answer": "D",
    "explanation": "This patient's history and examination findings are most compatible with a retinal detachment, which is a separation of the multilayer neurosensory retina from the underlying retinal pigment and choroid. This detachment can occur passively due to fluid accumulation or actively due to vitreous traction on the retina. Rhegmatogenous detachment (break in the retina with a full thickness hole or tear) is the most common detachment and usually presents as a posterior vitreous detachment. Risk factors for non-traumatic retinal detachment include myopia and age >50. Non-rhegmatogenous detachments usually occur in patients with proliferative diabetic retinopathy. Patients typically present with a new onset of floaters, flashing lights, or loss of vision. Direct funduscopy has low sensitivity for retinal detachment and may be normal; clinical detection often depends on identification of visual field defects. Patients with vision loss should see a retinal specialist within 24 hours. All other patients may see the ophthalmologist more electively, especially if flashes and floaters are the only symptoms. Symptomatic detachments usually require surgical therapy to preserve vision. Patients who have retinal detachment without retinal breaks or tears may be treated conservatively. (Choice A) Central retinal artery occlusion is usually preceded by amaurosis fugax and is associated with marked vision loss. Funduscopic examination usually shows a pale fundus with a cherry-red spot in the macula, which is not present in this patient. (Choice B) Dry macular degeneration usually presents as gradual vision loss with drusen (areas of retinal depigmentation). Wet macular degeneration usually presents as acute vision loss with subretinal fluid and/or hemorrhage on funduscopic examination. This patient's normal funduscopic examination makes both diagnoses unlikely. (Choice C) Optic neuritis usually presents as vision loss in younger individuals. It may accompany multiple sclerosis and is associated with pain on eye movement. (Choice E) Temporal (giant cell) arteritis with loss of vision is often preceded by symptoms of polymyalgia rheumatica and/or scalp and temporal pain. Visual symptoms in temporal arteritis most often include amaurosis, scotomata, diplopia, and blurred vision. Educational objective: Retinal detachment most commonly presents as a posterior vitreous detachment with floaters, flashing lights, and occasional vision loss. Patients with retinal detachment and vision loss require urgent referral to an ophthalmologist.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_002",
    "system": "Ophthalmology",
    "stem": "An 18-year-old previously healthy woman comes to the office due to redness and discharge from both eyes for the past several days. The patient also has itchiness and irritation in the eyes and has awakened with crusting in the morning. She has had a runny nose and sneezing for the last 4 days but no fever, eye pain, or photophobia. She does not wear contact lenses and her vision is unchanged. The patient is visiting her aunt, who has 2 small children; they are not ill but have a pet cat. Eye examination reveals diffuse bilateral conjunctival erythema and edema with clear discharge. Pupils are equal and reactive bilaterally. Vision acuity is normal. No corneal opacities are present and the anterior chambers appear grossly normal. Which of the following is the best next step in management of this patient?",
    "choice_a": "Reassurance only",
    "choice_b": "Topical antibiotic",
    "choice_c": "Topical antihistamine",
    "choice_d": "Topical corticosteroid",
    "choice_e": "Topical cyclosporine",
    "correct_answer": "C",
    "explanation": "This patient with conjunctival erythema, edema (chemosis), and clear discharge most likely has allergic conjunctivitis (AC). AC is often associated with other allergic symptoms and can occur in a seasonal (eg, due to pollen) or sporadic (eg, due to animal dander) pattern. Patients with other atopic diseases (eg, allergic rhinitis, asthma, eczema) are at higher risk. Morning crusting and mattering of the lids can be seen in conjunctivitis of any cause, but significant itching is more specific for an allergic etiology. The diagnosis of AC is based primarily on clinical features. Findings that suggest an alternate diagnosis include focal (rather than diffuse) erythema, changes in visual acuity, corneal opacity, photophobia or headache, abnormal pupillary responsiveness, or redness at the cornea-sclera border (ciliary flush). Most cases can be managed with over-the-counter antihistamine/decongestant drops (eg, naphazoline/pheniramine) as needed. Persistent symptoms usually respond to prescription ocular antihistamines (eg, azelastine, olopatadine), mast cell stabilizers (eg, cromolyn), or nonsteroidal anti-inflammatory drugs (eg, ketorolac). (Choice B) Ophthalmic antibiotics are indicated for bacterial conjunctivitis, which is typically unilateral (at least initially) and associated with purulent discharge. This patient's bilateral symptoms and associated itching are more consistent with AC. (Choice D) Topical corticosteroids are indicated for certain steroid-responsive ocular disorders but are not recommended for AC. These agents have significant risk (eg, corneal perforation, cataract formation) and should be used only under the supervision of an ophthalmologist. (Choice E) Ophthalmic cyclosporine is an immunomodulator indicated for the treatment of dry eye symptoms due to keratoconjunctivitis sicca, a chronic condition typically seen in association with certain autoimmune disorders (eg, Sjögren syndrome). Acute discharge and itching suggest AC. Educational objective: Allergic conjunctivitis is characterized by bilateral conjunctival redness, discharge, and itching. It is often associated with other allergic symptoms and atopic conditions (eg, asthma, eczema). Treatment options include topical antihistamines/decongestants, mast cell stabilizers, and nonsteroidal anti-inflammatory drugs.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_003",
    "system": "Ophthalmology",
    "stem": "A 67-year-old man comes to the office due to decreased vision in his left eye. While driving 2 weeks ago, he noticed things appeared distorted or were \"missing.\" He has also had difficulty reading despite changing his reading glasses multiple times over the last several months. The patient has had no headaches, eye pain, or double vision. He has a long-standing history of hypertension and is an ex-smoker with a 40-pack-year history. Funduscopic findings are shown in the image below. Which of the following is the most likely diagnosis?",
    "choice_a": "Age-related macular degeneration",
    "choice_b": "Central retinal artery occlusion",
    "choice_c": "Hypertensive retinopathy",
    "choice_d": "Open-angle glaucoma",
    "choice_e": "Retinal detachment",
    "correct_answer": "A",
    "explanation": "This patient with progressive, painless, monocular vision loss has age-related macular degeneration (AMD). AMD is a major cause of blindness and visual impairment in older adults (age >50). Damage to the macula may initially be asymptomatic but eventually leads to progressive distortion and vision loss, primarily in the center of the visual field (central scotomas). AMD occurs in 2 forms: \"dry\" and \"wet.\" In the dry form, as in this patient, cellular debris called drusen accumulates between the retina and the choroid, sometimes leading to retinal detachment. In the wet form, which is more severe, blood vessels grow up from the choroid behind the retina, and the retina can become detached. This is often associated with retinal hemorrhage. Peripheral vision is usually spared. (Choice B) Central retinal artery occlusion is characterized by acute retinal ischemia due to thrombosis or emboli in the central retinal artery (branch of ophthalmic artery). Patients develop sudden-onset, painless loss of vision in one eye, with a cherry red macula and retinal pallor on examination. Additional findings may include a relative afferent pupillary defect (Marcus Gunn pupil). (Choice C) Hypertensive retinopathy can present with gradual, painless, binocular vision loss and headaches, although most patients have no visual symptoms initially. Characteristic features on funduscopic examination include \"copper and silver wiring,\" hard exudates, flame hemorrhages, arteriovenous nicking, arteriolar narrowing, and ischemic changes (\"cotton wool spots\"). (Choice D) Open-angle glaucoma presents with gradual, painless loss of vision. Examination shows optic nerve atrophy with increased optic cup size and cup-to-disk ratio. Tonometry usually shows elevated intraocular pressures. (Choice E) Retinal detachment is characterized by acute vision loss associated with flashes of light (photopsia), numerous floaters (drifting spots or strings in the visual field), and eye heaviness. Patients may describe the impression of a veil or curtain being drawn over the field of vision. Both peripheral and central vision are affected. Educational objective: Age-related macular degeneration is characterized by progressive, painless central vision loss in patients age >50. Ocular findings include drusen, with or without hypervascularity and hemorrhages.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_004",
    "system": "Ophthalmology",
    "stem": "A 65-year-old Asian woman comes to the office because of a red right eye. She has severe pain in the eye and has developed decreased vision with halos around bright objects. Her symptoms started a few hours ago while attending a movie. She does not wear contact lenses and has had no purulent discharge from the eye. She denies a foreign body sensation in the eye and has not experienced any eye trauma. She had a recent upper respiratory tract infection for which she self-medicated with an over-the-counter medication. Examination reveals a red right eye and a moderately dilated pupil with sluggish light reaction. There is pain with eye movement. Her vision is markedly reduced and she can count fingers at two feet. Which of the following is the most likely cause of her symptoms?",
    "choice_a": "Acute angle-closure glaucoma",
    "choice_b": "Acute anterior uveitis",
    "choice_c": "Bacterial conjunctivitis",
    "choice_d": "Corneal abrasion",
    "choice_e": "Temporal arteritis",
    "correct_answer": "A",
    "explanation": "In the management of patients with acute eye problems, including the \"red\" eye, the main challenge is to determine when immediate referral to an ophthalmologist is appropriate. Patients need immediate evaluation or referral if they have impaired vision, inability to open the eye due to foreign body sensation, photophobia, significant eye pain, diminished pupil reactivity, and the presence of a corneal opacity. Acute angle-closure glaucoma is an ocular emergency and is most commonly seen in hyperopic older persons, especially in individuals of Asian ethnicity. Optic atrophy and vision loss can occur within hours without appropriate treatment. Patients are often slumped over in distress while covering the affected eye and complain of headache, nausea, and vomiting. Examination shows a fixed pupil in mid-dilation, a red eye, ciliary flush, elevated ocular pressures, and no discharge. Acute angle-closure glaucoma can be precipitated by exposure to sympathomimetic and anticholinergic drugs. (Choice B) Acute anterior uveitis usually affects younger individuals and requires urgent ophthalmologic referral. It is usually associated with a red eye, pain, decreased vision, white or yellowish discharge at the base of the anterior chamber, and a normal pupil response. (Choice C) Bacterial conjunctivitis is usually associated with significant purulent discharge, often with swelling of the lid and a markedly inflamed red eye. There may be some mild pain, but the pupils react normally with normal vision. (Choice D) Complicated corneal abrasion is often associated with contact lens use or trauma and presents with a painful red eye, slightly diminished vision, and normal pupillary response. (Choice E) Temporal arteritis can present with headache and acute vision loss, but the eye is usually not red and the patient often has symptoms of polymyalgia rheumatica. Educational objective: A red eye associated with significant pain, visual loss, vomiting, headache, and abnormal pupil reactivity in an older individual is diagnostic of acute angle-closure glaucoma. Immediate referral to ophthalmology is required for treatment in order to prevent irreversible optic nerve damage.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_005",
    "system": "Ophthalmology",
    "stem": "A 22-year-old woman comes to the office due to redness and discharge from her right eye for the past 3 days. She also has had a gritty sensation and crusting in the eye, which is \"stuck shut\" in the morning. Today, the patient noticed that her left eye has also become red. She has had no visual disturbances, photophobia, or eye pain or itching and reports no recent upper respiratory infection or exposure to a person with similar symptoms. The patient does not use contact lenses. Her other medical problem includes allergic rhinitis, for which she takes fexofenadine as needed. Physical examination reveals bilateral diffuse conjunctival erythema with scant discharge that does not reappear when the initial discharge is wiped away. No corneal opacity is noted. Visual acuity is normal. The remainder of the physical examination is normal. Which of the following is the most appropriate next step in management of this patient's eye symptoms?",
    "choice_a": "Ophthalmology referral",
    "choice_b": "Symptomatic therapy only",
    "choice_c": "Topical antibiotic",
    "choice_d": "Topical glucocorticoid",
    "choice_e": "Topical nonsteroidal anti-inflammatory drug",
    "correct_answer": "B",
    "explanation": "This patient has conjunctival erythema and scant discharge without changes in visual acuity, which is consistent with viral conjunctivitis (\"pink eye\"). Most cases are caused by adenovirus and may be associated with upper respiratory symptoms. Typical findings include eye redness, irritation (often described as a gritty sensation), and scant watery discharge. Symptoms often begin unilaterally, but bilateral eye involvement may occur within 48 hours of onset. Symptoms typically last 1-2 weeks and are self-limited; management is directed at reducing patient discomfort. Topical antihistamines and ocular decongestants can reduce symptoms, and moist compresses (warm or cool) can also provide comfort. No treatment has been shown to shorten the duration of illness. Viral conjunctivitis is highly contagious, and patients should be counseled on infection precautions (eg, handwashing). (Choice A) Indications for ophthalmologic evaluation in acute red eye syndrome include loss of visual acuity, hyphema or hypopyon (red or white cells, respectively, layered in the anterior chamber), suspected bacterial keratitis (eg, contact lens user with pain, photophobia, and foreign body sensation), angle-closure glaucoma (eg, headache, vomiting, hazy cornea, fixed pupil), and iritis (eg, photophobia, erythematous flush around the iris). (Choice C) Topical antibiotics (eg, erythromycin, trimethoprim/polymixin) are indicated for bacterial conjunctivitis, which is typically associated with significant ocular pain and a purulent discharge that rapidly reappears after being wiped away. Morning mattering of the lids (\"stuck shut\") can be seen with conjunctivitis of any cause. (Choice D) Topical glucocorticoids are indicated for certain steroid-responsive ocular disorders but are not recommended for viral conjunctivitis. These agents have significant risk (eg, corneal perforation, cataract formation) and should be used only under the supervision of an ophthalmologist. (Choice E) Topical nonsteroidal anti-inflammatory drugs (eg, diclofenac) are useful for pain following ocular surgery (eg, cataract), inhibition of intraoperative miosis, and allergic conjunctivitis. They have not been studied extensively in viral conjunctivitis. Educational objective: Viral conjunctivitis is characterized by acute conjunctival erythema, discomfort, and watery or mucoid discharge. Most cases are caused by adenovirus and may be associated with upper respiratory symptoms. Viral conjunctivitis is a self-limited condition; moist compresses and topical antihistamines and decongestants can reduce the symptoms.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_006",
    "system": "Ophthalmology",
    "stem": "A 22-year-old woman comes to the urgent care clinic with a painful, gritty sensation in her right eye, eyelid swelling, and photophobia for the past 2 days. She has been studying for college exams and initially attributed her symptoms to fatigue. The patient wears contact lenses for myopia but has been using glasses since this morning. Physical examination shows conjunctival injection and upper eyelid swelling. Fluorescein staining shows a 6-mm corneal defect. Visual acuity is normal bilaterally. Which of the following is the best next step in management of this patient?",
    "choice_a": "Eye patching",
    "choice_b": "Swab culture",
    "choice_c": "Topical corticosteroid",
    "choice_d": "Topical erythromycin",
    "choice_e": "Topical fluoroquinolone",
    "correct_answer": "E",
    "explanation": "Bacterial keratitis (BK) is the most common infectious complication of contact lens use, especially in patients who use extended-wear or overnight lenses. Symptoms include pain, eyelid swelling, photophobia, and conjunctival injection. If the corneal lesion (visible under fluorescein staining) is central, vision may also be affected. An inflammatory infiltrate (hypopyon) is occasionally seen in the anterior chamber. The diagnosis of BK is primarily clinical. Treatment with empiric, broad-spectrum topical antibiotics (with Pseudomonas coverage) such as gatifloxacin should be initiated (Choice E). Culture (via corneal scrapings) or impression cytology is helpful in severe infections or those that fail to respond to initial antibiotic treatment (Choice B). Antibiotics should be applied hourly for the first 24-48 hours, and concomitant corticosteroids should be avoided in the acute phase (Choice C). (Choice A) Eye patching should be avoided in BK as it can create a warm, moist environment favorable to further bacterial growth. (Choice D) Topical erythromycin has limited activity against Pseudomonas. Educational objective: Bacterial keratitis is the most common infectious complication of contact lens use. Symptoms include pain, eyelid swelling, photophobia, and conjunctival injection. Empiric treatment with broad-spectrum topical antibiotics is advised.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_007",
    "system": "Ophthalmology",
    "stem": "A 40-year-old woman comes to the office due to a red left eye. She was feeling well until 2 days ago when she awoke in the morning with sudden onset of redness and tearing of the eye. The patient has had no ocular itching or pain, but says, \"I feel like there is something caught in my eye but I can't find anything.\" Medical history is notable for asthma, for which she uses an albuterol inhaler as needed. The patient does not use tobacco, alcohol, or illicit drugs. She works as an elementary school teacher and lives with her husband and 2 teenage children. Vital signs are normal. Examination shows normal extraocular movements, pupillary reflexes, funduscopic findings, and visual acuity. Inspection of the eye is as shown in the exhibit. Which of the following is the most appropriate next step in management of this patient's eye condition?",
    "choice_a": "Erythromycin ointment",
    "choice_b": "Lubricating eyedrops",
    "choice_c": "Systemic glucocorticoids",
    "choice_d": "Topical antihistamines",
    "choice_e": "Urgent laser iridotomy",
    "correct_answer": "B",
    "explanation": "This patient has redness and tearing of the eye and examination findings consistent with (nodular) episcleritis. Episcleritis is characterized by acute inflammation of the white of the eye, without involvement of the uveal tract (ie, iris, ciliary body, choroid). It often causes mild irritation or a foreign-body sensation. Episcleritis is most common in young to middle-aged women. It is usually self-limited (with most attacks resolving within 3 weeks) and idiopathic, although evaluation for systemic disease (eg, rheumatoid arthritis) should be considered for recurrent cases. Management is generally conservative with topical lubricants. Topical or oral nonsteroidal anti-inflammatory drugs can be considered for persistent symptoms. In contrast to episcleritis, scleritis is a potentially dangerous eye condition often associated with active systemic rheumatologic disease. Significant pain, visual impairment, and a dark red sclera (in contrast to bright red in episcleritis) with scleral edema are classic features, and manifestations generally progress (eg, worsening pain) over days to weeks. Systemic glucocorticoids and immunosuppressants are typically employed (Choice C). (Choice A) Topical antibiotics (eg, erythromycin) are appropriate for bacterial conjunctivitis, which typically presents with ocular pain, mucoid/purulent discharge and crusting, and diffuse conjunctival redness. (Choice D) Topical antihistamines are used for allergic conjunctivitis, which is characterized by prominent itchiness and diffuse redness of the conjunctiva and is often bilateral. (Choice E) Patients with acute angle-closure glaucoma often require urgent iridotomy. This condition is much more common in older patients, and is associated with ocular pain, headache, nausea, corneal opacity, and decreased visual acuity. Educational objective: Episcleritis is characterized by acute inflammation of the white of the eye, without involvement of the uveal tract. Episcleritis causes mild irritation or a foreign-body sensation without significant pain, visual impairment, or photophobia and is usually self-limited and idiopathic. Treatment is primarily with topical lubricants.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_008",
    "system": "Ophthalmology",
    "stem": "A 64-year-old man comes to the office for a preventive visit. The patient has type 2 diabetes mellitus, which is being managed with lifestyle modification. He has had no polyuria, polydipsia, or changes in weight but states that he has had trouble seeing distant objects for the past several months. He has never had vision problems before and reports normal near vision. Two weeks ago the patient saw an optometrist who prescribed glasses with -2.5 diopter lens on the right and -0.75 diopter lens on the left that have improved his vision. Dilated eye examination 6 months ago was unremarkable. His glycated hemoglobin level is 6.8%. Which of the following is the most likely cause of this patient's visual symptoms?",
    "choice_a": "Diabetic retinopathy",
    "choice_b": "Macular degeneration",
    "choice_c": "Nuclear cataract",
    "choice_d": "Open-angle glaucoma",
    "choice_e": "Presbyopia",
    "correct_answer": "C",
    "explanation": "The most common age-related vision disorder is presbyopia, which is impairment of near vision due to loss of distensibility of the lens (Choice E). This patient, however, has reduced distance vision, often termed myopic shift, which is a common early effect of nuclear cataract formation due to increased thickness at the center of the lens and a change in dioptric power. Myopic shift typically occurs before visible opacification of the lens or other clinical findings (eg, glare, halos around lights, loss of the red reflex), which explains this patient's normal dilated eye examination 6 months ago. Oxidative damage of the lens occurs with aging and leads to cataract formation. Age-related cataract is typically slowly progressive, bilateral, and asymmetric. In addition to age, smoking, chronic sunlight exposure, diabetes mellitus, and glucocorticoid use may also contribute to cataract formation. Cataract surgery is indicated when vision declines to the point that the patient is unable to perform activities of daily living despite correction with glasses. (Choice A) Proliferative diabetic retinopathy may present with blurry vision, flashing lights, or black spots, and occurs most commonly in patients with uncontrolled diabetes. Symptoms usually develop in patients with advanced disease. This patient had no signs of retinopathy on recent examination. (Choice B) Age-related macular degeneration (AMD) causes a slow, progressive loss of vision. However, patients commonly experience impaired reading or difficulty with close-up, fine work. Also, AMD is typically associated with distortions of vision or scotoma rather than gradual blurring, and patients usually have visible signs on retinal examination. (Choice D) Open-angle glaucoma is characterized by painless loss of peripheral vision associated with increased intraocular pressure. Distance vision is not affected. Educational objective: Nuclear cataract is typically slowly progressive, bilateral, and asymmetric. Patients frequently experience a worsening of distance vision (myopic shift) initially, which may occur before opacification becomes evident.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_009",
    "system": "Ophthalmology",
    "stem": "A 29-year-old man comes to the office with right eye pain, redness, and blurry vision for the past 2 days. Physical examination findings are shown below. No discharge is present. Which of the following is the most likely diagnosis?",
    "choice_a": "Acute angle-closure glaucoma",
    "choice_b": "Anterior uveitis",
    "choice_c": "Bacterial conjunctivitis",
    "choice_d": "Episcleritis",
    "choice_e": "Hordeolum",
    "correct_answer": "B",
    "explanation": "This patient has acute anterior uveitis (iritis), which is characterized by a unilateral painful, red eye and photophobia. Inflammation can affect both the anterior (iris, ciliary body) and posterior (choroid) uveal tract in addition to adjacent structures such as the retina and vitreous humor. Most cases are idiopathic, but common secondary causes may include: • Infections (eg, toxoplasmosis, cytomegalovirus, syphilis) • Autoimmune diseases (eg, ankylosing spondylitis, sarcoidosis, Behçet's disease) • Medications (eg, rifabutin, cidofovir). Gross examination may show a ciliary flush (marked erythema ringing the iris) and hypopyon (leukocytic exudate in the anterior chamber). The presence of leukocytes in the anterior chamber is diagnostic of anterior uveitis and differentiates it from other causes of red eye. Anterior chamber flare is another common manifestation and is created by extravasated protein that causes dispersal of light on slit lamp examination. Patients with suspected uveitis warrant expedited ophthalmology consultation. Topical corticosteroids are the treatment of choice for noninfectious uveitis. (Choice A) Acute angle-closure glaucoma presents in a similar manner with monocular blurry vision and pain, but it is more likely to be accompanied by headache, nausea, and vomiting. Examination would not show leukocytes in the anterior chamber. (Choice C) Bacterial conjunctivitis presents with erythema and thick, purulent discharge that typically continues throughout the day. (Choice D) Episcleritis does not commonly present with pain but rather with erythema and tearing. Vision remains unimpaired. (Choice E) Hordeolum is the acute obstruction of the meibomian gland, eyelash follicle, or lid-margin tear gland, with associated inflammation and possible Staphylococcus aureus infection. It does not result in inflammation of the globe itself. Educational objective: Anterior uveitis is characterized by a unilateral painful, red eye and photophobia. Diagnosis is confirmed by identifying leukocytic exudate in the anterior chamber. Noninfectious etiologies are treated with topical corticosteroids.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_010",
    "system": "Ophthalmology",
    "stem": "A 24-year-old man comes to the physician due to right eye pain for the last 12 hours. When he opens his right eyelid, he feels a foreign body sensation in the eye. Prior to onset of the pain, he was hiking off-trail with a friend and was hit in the face with 2 tree branches. The patient has rubbed his eyelid several times and washed the eye with ocular solution without any relief. He does not wear contact lenses. Examination of the right eye shows a small, round, and reactive pupil. The conjunctiva is red with no purulent discharge. There is no evidence of penetrating injury or visible foreign body. The anterior chamber is clear. There is a red reflex. Fluorescein staining under cobalt blue filter of an ophthalmoscope shows a small linear stain across the central cornea. Visual acuity screening shows 20/40 in the affected eye. In addition to measures that reduce pain, which of the following is the best management for this patient?",
    "choice_a": "Eye patch for 72 hours",
    "choice_b": "Topical antibacterial ointment",
    "choice_c": "Topical corticosteroid",
    "choice_d": "Topical ganciclovir",
    "choice_e": "Topical pilocarpine",
    "correct_answer": "B",
    "explanation": "This patient's eye pain and foreign body sensation that cause him to keep the affected eye shut are highly suggestive of a corneal abrasion. Corneal abrasions can be spontaneous or due to trauma/foreign body, contact lenses, or herpes simplex type 1 infection. Patients usually present with the following findings: • Normal visual acuity (unless abrasion is within the visual field) • Normal pupil and anterior chamber • Corneal abrasion seen through fluorescein staining under cobalt blue filter • Corneal edema developing after 12 hours. Urgent ophthalmology referral is indicated for penetrating trauma, corneal infiltrate/opacity (white spot), foreign bodies that cannot be easily removed, significant decrease in vision (eg, >1-2 lines on Snellen chart), or symptoms that worsen or do not improve. After ruling out potential ocular emergencies, most ophthalmologists prescribe antibiotic ointment (not drops) until symptom resolution. This helps to prevent an infection from complicating the healing process. Most abrasions heal spontaneously within 24-72 hours without any complications. Follow-up is required for large abrasions (≥3 mm), or any abrasion associated with contact lenses or decreased vision. (Choice A) Eye patches do not provide significant benefit for small corneal abrasions and have low patient compliance. They should not be applied for >24 hours to avoid causing further complications. In addition, they should not be used in contact lens abrasion or with infectious infiltrates due to the risk of causing or worsening an infection. (Choice C) Topical corticosteroids should not be used for a traumatic corneal abrasion as they do not facilitate healing. In addition, they can alter the body's defense if an infection is present. (Choice D) Topical ganciclovir or trifluorothymidine is the treatment of choice for herpes simplex virus keratitis, which usually presents with a branching or dendritic pattern under fluorescein examination. This patient's linear pattern makes this less likely. (Choice E) Topical pilocarpine is a parasympathomimetic that can be part of the treatment of acute angle-closure glaucoma (ACG). ACG typically presents in older adults with painful loss of vision, conjunctival erythema, and a poorly reactive mid-dilated pupil. This patient's young age, normal pupillary response, and linear fluorescein stain on the cornea make the diagnosis unlikely. Educational objective: Corneal abrasion typically presents with eye pain and a foreign body sensation resulting in difficultly keeping the eye open. Urgent ophthalmology referral is indicated for penetrating trauma, corneal infiltrate/opacity, foreign bodies that cannot be easily removed, or a significant decrease in vision. Antibiotic ointment is the first-line therapy.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_011",
    "system": "Ophthalmology",
    "stem": "A 72-year-old man comes to the office for a regular visit. His vision has been deteriorating gradually for the past year. The patient has been having difficulty reading the newspaper and has been using reading glasses more frequently to read small print. Lately, he has also had difficulty driving and now drives only during the daytime. The patient has a history of hypertension and osteoarthritis. He has smoked a pack of cigarettes daily for 38 years. His blood pressure is 155/77 mm Hg and pulse is 76/min. BMI is 31 kg/m2. Ocular examination shows no visible abnormalities of the cornea or lens, and the pupils are round and reactive. Visual acuity is diminished in both eyes, the left eye more than the right. Funduscopic examination shows mottling of sub-retinal pigments and bright yellow drusen deposits in the macular area of the left retina. Cardiopulmonary and neurologic examination is unremarkable. Which of the following is the best initial management of this patient's vision problems?",
    "choice_a": "Aggressive hypertension control",
    "choice_b": "Daily low-dose aspirin",
    "choice_c": "Immediate smoking cessation",
    "choice_d": "Laser photocoagulation",
    "choice_e": "Weight loss",
    "correct_answer": "C",
    "explanation": "This patient likely has age-related macular degeneration (AMD), the leading cause of blindness in industrialized countries. The condition likely results from chronic oxidative damage to the retinal pigment epithelium and choriocapillaris. Major risk factors include advanced age, smoking, and family history. AMD is classified into dry and wet subtypes. This patient's gradual vision loss in both eyes and difficulty with reading and driving at night is characteristic of dry AMD. Funduscopy classically shows subretinal drusen deposits with pigment abnormalities. Dry AMD can progress to wet AMD, which presents with acute vision loss (days to weeks) and metamorphopsia (distortion of straight lines) due to subretinal hemorrhage or fluid accumulation. Funduscopy can show a grayish-green subretinal discoloration with adjacent fluid or hemorrhage. Smokers with AMD should receive smoking cessation counseling as it is one of the most important interventions to prevent disease progression. Patients with moderate to severe AMD (dry or wet) should also receive daily antioxidant vitamins and zinc as these may reduce the risk of progression to severe AMD and lower the likelihood of developing vision loss in the good eye. Wet AMD usually requires specific treatment with vascular endothelial growth factor (VEGF) inhibitors (eg, ranibizumab, bevacizumab) to stabilize/reverse vision loss. (Choices A and E) Although physical activity can decrease the risk of developing AMD, the relationship of AMD, hypertension, and elevated BMI is conflicting. In addition, aggressive hypertension control in the elderly can increase the risk of orthostatic hypotension and falls. (Choice B) Observational studies have shown that regular use of aspirin may be associated with an increased risk of dry and wet AMD. (Choice D) Laser photocoagulation can be considered in select patients with wet AMD; however, it has not been shown to reduce the risk of vision loss in patients with dry AMD and may be associated with an increased rate of choroidal neovascularization in these patients. Educational objective: Dry macular degeneration typically presents in older adults with progressive vision loss in one or both eyes and subretinal drusen deposits with pigment abnormalities on funduscopy. Smoking cessation and daily antioxidant vitamins with zinc can reduce the risk of disease progression.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_012",
    "system": "Ophthalmology",
    "stem": "A 52-year-old African American man comes to the physician because of foggy vision in both eyes. He denies any headache, nausea, or vomiting. He was diagnosed with extensive cellulitis and osteomyelitis of the right foot 4 weeks ago and has been taking oral linezolid. His other medical problems include sarcoidosis, pulmonary hypertension, lower extremity venous stasis, deep vein thrombosis, type 2 diabetes for 5 years, hypertension, and chronic kidney disease. His medications include warfarin, prednisone (10 mg/day), insulin, hydralazine, clonidine, metoprolol, valsartan, and furosemide. He has been compliant with his medication regimen. He quit smoking 7 years ago and denies the use of alcohol or illicit drugs. He is allergic to vancomycin. His temperature is 36.7 C (98 F), blood pressure is 150/90 mm Hg, and pulse is 72/min. His BMI is 32 kg/m2. Visual acuity is 20/400 in both eyes with considerable optic disc edema, hyperemia, and reduced color perception. A right carotid bruit is present. Examination shows jugular venous distention, a few fine crackles in all lung fields, normal first and second heart sounds, and a palpable liver 2 cm below the costal margin. Bilateral 1+ pitting lower extremity edema to the mid shin and a resolving right leg cellulitis is present. Which of the following is the most immediate next step in management?",
    "choice_a": "Carotid Doppler ultrasound",
    "choice_b": "Discontinue linezolid",
    "choice_c": "Increase prednisone dose",
    "choice_d": "Obtain ESR",
    "choice_e": "Perform temporal artery biopsy",
    "correct_answer": "B",
    "explanation": "This patient's bilateral ophthalmological complaints while on prolonged linezolid treatment is most consistent with drug-induced optic neuropathy. Linezolid is active against most gram-positive bacteria including streptococci, vancomycin-resistant enterococci (VRE), and methicillin-resistant Staphylococcus aureus (MRSA). The main indications of linezolid are skin and soft tissue infections and pneumonia. The long-term use of linezolid has been associated with bone marrow suppression, peripheral neuropathy, and optic neuropathy. Both the peripheral and optic neuropathy may be irreversible, possibly due to mitochondrial toxicity. Guidelines recommend no more than 28 days of linezolid therapy with a weekly CBC to monitor for possible bone marrow suppression. Periodic eye and neurological examinations are recommended in patients requiring > 4 weeks of linezolid. Patients developing optic neuropathy (such as this one) should discontinue linezolid. (Choice A) This patient's unilateral carotid artery stenosis is less likely to present with bilateral changes in vision. (Choice C) Sarcoidosis typically causes anterior uveitis and patients usually present with a red eye. Optic neuropathy can also be seen with sarcoidosis. The optic disc may have a nodular appearance (granulomatous infiltration). However, this patient is on prednisone, which makes a sarcoid flare less likely. (Choices D & E) An ESR measurement and a temporal artery biopsy are helpful for the diagnosis of giant-cell arteritis. This patient does not have any systemic symptoms to suggest these diagnoses. Also, the patient is already on prednisone which makes it even less likely. Educational objective: Linezolid-induced optic neuropathy usually occurs after long-term use (> 4 weeks). Patients should receive periodic eye and neurological examinations to document early findings and discontinue the drug if present.",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  },
  {
    "id": "OPHTHAL_013",
    "system": "Ophthalmology",
    "stem": "A 65-year-old woman comes to the emergency department with acute loss of vision in her right eye. Three hours ago, she was watching television when she suddenly noticed the vision in her right eye become cloudy and then go completely black. She has no headache, eye pain, double vision, dysarthria, dysphasia, muscle weakness, or numbness. Past medical history includes type 2 diabetes mellitus and hypertension. Her medications include lisinopril and metformin. She has a 40-pack-year smoking history. Vital signs are within normal limits. Visual acuity is 20/40 in the left eye and there is no light perception in the right eye. There is a relative afferent pupillary defect on the right. Ocular motility is normal on cardinal signs of gaze testing. The remainder of the physical examination is within normal limits. Funduscopic examination is shown in the image below. Which of the following is the most likely diagnosis for this patient's acute vision loss?",
    "choice_a": "Acute angle-closure glaucoma",
    "choice_b": "Central retinal artery occlusion",
    "choice_c": "Nonarteritic anterior ischemic optic neuropathy",
    "choice_d": "Optic neuritis",
    "choice_e": "Retinal detachment",
    "correct_answer": "B",
    "explanation": "Central retinal artery occlusion (CRAO) is a rare condition (<0.01% of the population) that usually affects patients age >60 with hypertension, diabetes, and history of cigarette smoking. CRAO is most commonly due to carotid artery atherosclerosis as the central retinal artery is a branch of the ophthalmic artery, which arises from the internal carotid artery. Other etiologies include cardiac embolism, small-vessel disease (eg, hypertension, diabetes), and vasculitis. Patients typically present with acute, painless, and severe vision loss in one eye. There is generally a complete or relative afferent pupillary defect. Funduscopic examination usually shows diffuse ischemic retinal whitening and cherry red spots. Diagnosis includes laboratory studies to exclude giant cell arteritis (erythrocyte sedimentation rate, C-reactive protein), carotid artery imaging, and cardiac evaluation in patients with suspected embolic source. Irreversible retinal damage can occur within 90-100 minutes of CRAO. As a result, patients require urgent ophthalmology consultation and measures to lower intraocular pressure (eg, ocular massage, anterior chamber paracentesis, intravenous acetazolamide or mannitol). Intra-arterial thrombolysis is still experimental but is performed at some treatment centers. Long-term management includes atherosclerosis risk factor modification (lipid-reducing and antiplatelet agents) and prevention of recurrent vascular events. Prognosis is poor in patients initially presenting with severe vision loss. (Choice A) Patients with acute angle-closure glaucoma typically present with vision loss, severe eye pain, headache, nausea, and vomiting. They may also report seeing light halos. Examination shows conjunctival redness and a poorly reactive, dilated pupil. (Choice C) Nonarteritic anterior ischemic optic neuropathy presents with painless vision loss in one eye, usually on awakening, in individuals age >50. Visual examination shows afferent pupillary defect, and funduscopy shows optic nerve head swelling or papilledema. Cherry red spots are not seen. (Choice D) Optic neuritis is an inflammatory demyelination of the optic nerve that typically affects patients age <50 and can be the presenting symptom of multiple sclerosis. Patients present with acute or subacute painful loss of vision in one eye, color desaturation, headache, pain with eye movement, and afferent pupillary defect. Funduscopic examination may be normal or show papilledema. (Choice E) Retinal detachment presents with vision loss (peripheral followed by central) and photopsia with showers of floaters. It is usually associated with trauma, previous eye surgery, aging, and severe myopia. Educational objective: Central retinal artery occlusion presents with acute, painless, severe vision loss in one eye and relative afferent pupillary defect. Funduscopy shows diffuse ischemic retinal whitening and cherry red macula. Treatment includes urgent ophthalmology consultation and measures to lower intraocular pressure (eg. ocular massage, anterior chamber paracentesis, intravenous acetazolamide or mannitol).",
    "source": "ABIM - Ophthalmology - @USMLEWorldStep3.pdf"
  }
]