[
{
"id": "Psych_001",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 75-year-old man with a history of Parkinson disease, bipolar disorder, and hypertension is brought to the emergency department with confusion and fever. His caregivers report that last week he complained of stomach cramps and diarrhea and stopped taking his medications as he thought they were worsening his symptoms. His medications include carbidopa/levodopa, sertraline, lithium, lisinopril, and amlodipine. He does not use tobacco or illicit drugs but drinks 2 or 3 beers on weekends. On evaluation, the patient is diaphoretic and confused. Temperature is 38.3 C (101 F), blood pressure is 180/95 mm Hg, pulse is 114/min, and respirations are 20/min. The mucous membranes are dry. He has prominent generalized muscular rigidity and bilateral tremor. The abdomen is nontender and bowel sounds are present. Laboratory results are as follows: Complete blood count Hematocrit 40% Platelets 300,000/mm3 Leukocytes 13,000/mm3 Serum chemistry Sodium 146 mEq/L Potassium 4.8 mEq/L Chloride 100 mEq/L Bicarbonate 24 mEq/L Blood urea nitrogen 40 mg/dL Creatinine 1.4 mg/dL Glucose 120 mg/dL Creatine kinase, serum 1,520 U/L ECG shows sinus tachycardia and nonspecific T-wave changes. Spinal fluid evaluation shows no abnormalities. Which of the following is the most likely diagnosis?",
"choice_a": "Lithium toxicity",
"choice_b": "Malignant hyperthermia",
"choice_c": "Neuroleptic malignant syndrome",
"choice_d": "On-off phenomenon",
"choice_e": "Serotonin syndrome",
"correct_answer": "C",
"explanation": "Although rigidity can be seen in Parkinson disease, the combination of this patient's confusion, fever, diffuse rigidity, and autonomic instability (eg, diaphoresis, hypertension, tachycardia) in the context of recently stopping his Parkinson medication is suggestive of neuroleptic malignant syndrome (NMS). NMS most commonly occurs as an idiosyncratic adverse effect of antipsychotic medications, but it can also occur in patients with Parkinson disease after withdrawal, dose reduction, or a switch in dopamine agents (where it is also referred to as parkinsonism-hyperpyrexia syndrome). The key features of NMS are altered sensorium, hyperthermia, autonomic instability, and generalized muscular (lead-pipe) rigidity. Muscle rigidity is often severe and leads to elevated creatine kinase levels (typically more than 1,000 IU/L). Severe cases can result in rhabdomyolysis with complications of myoglobinuria and acute renal failure. Other common laboratory findings include leukocytosis and electrolyte abnormalities. Treatment involves immediate discontinuation of antipsychotic medication or reinstitution of dopamine agents, as well as supportive care (eg, rehydration, cooling body temperature). NMS has a mortality rate of 10%-20% with admission to the intensive care unit commonly necessary. Muscle relaxants (eg, dantrolene) or dopamine agonists (eg, bromocriptine) are reserved for patients who do not improve with restarting dopaminergic medication and supportive care. (Choice A) Lithium toxicity can present with confusion and neuromuscular symptoms such as slurred speech, tremor, and ataxia. Diffuse rigidity and hyperpyrexia, however, would not be expected. This patient has stopped taking his lithium, making toxicity unlikely. (Choice B) Malignant hyperthermia is seen in the context of procedures requiring the use of halogenated inhalant anesthetics plus succinylcholine. (Choice D) Patients who have taken levodopa for long periods may experience fluctuations in motor symptoms with periods of increased rigidity and bradykinesia. This is known as the \"on-off\" phenomenon. It is not associated with fever, confusion, or autonomic instability. (Choice E) Serotonin syndrome presents similarly to NMS; however, hyperreflexia and myoclonus, rather than diffuse muscle rigidity, would be expected. This patient stopped taking his sertraline last week, making serotonin syndrome unlikely. The presence of generalized rigidity and the onset of symptoms after stopping Parkinson medication make NMS more likely. Educational objective: Neuroleptic malignant syndrome presents with mental status changes, fever, muscle rigidity, and autonomic instability after starting antipsychotics or withdrawing dopamine agonists. Treatment includes withdrawal of a neuroleptic agent or reinstitution of a dopamine agonist, as well as supportive care.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_002",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 28-year-old woman is brought to the emergency department after passing out at work. The patient was diagnosed with type 2 diabetes a year and a half ago with a hemoglobin A1c of 8.2%. She was started on metformin at that time; however, within 2 months the medication was discontinued due to intolerable gastrointestinal side effects. The patient was then switched to glipizide, achieving good glycemic control within 3 months. However, approximately 6 months ago the patient began experiencing hypoglycemic episodes with associated dizziness and decreased level of consciousness. The glipizide dose was decreased, but she continued to report hypoglycemic episodes. The patient's primary care physician recommended that she switch to a different antidiabetic agent, but the patient preferred to continue glipizide. Over the previous 6 months, the patient has been seen in the emergency department on numerous occasions and has been hospitalized once. Her most recent hemoglobin A1c 2 weeks ago was 8.1%. Currently, the patient's only medication is glipizide, which she insists she is taking as prescribed. Supine blood pressure is 122/83 mm Hg and pulse is 62/min. After 5 minutes of standing, blood pressure is 117/79 mm Hg and pulse is 71/min. The patient is currently drinking apple juice, chatting cheerfully with the nurse, and in no apparent distress. Physical examination is within normal limits. Laboratory results drawn prior to any intervention are as follows: Sodium 136 mEq/L Potassium 4.2 mEq/L Chloride 98 mEq/L Bicarbonate 26 mEq/L Blood urea nitrogen 11 mg/dL Creatinine 0.8 mg/dL Glucose 41 mg/dL Which of the following is the most likely explanation for this patient's symptoms?",
"choice_a": "Adrenal insufficiency",
"choice_b": "Brittle diabetes mellitus",
"choice_c": "Factitious disorder",
"choice_d": "Malingering",
"choice_e": "Somatic symptom disorder",
"correct_answer": "C",
"explanation": "This patient's history of repeated, unexplained hypoglycemic events in the context of a sustained hemoglobin A1c ≥8% despite treatment should raise suspicion of factitious disorder. Patients with factitious disorder deliberately falsify or manipulate their own medical condition to appear ill for purposes of assuming the sick role. This is in contrast to malingering, in which patients intentionally falsify their medical condition for external rewards (eg, to obtain disability pay or drugs) (Choice D). Additional clues that this patient is intentionally misusing her medication to manipulate her glucose levels include her frequent emergency department visits, atypical course of illness with inconsistent or poor response to standard treatments (eg, initially responds then destabilizes; unresponsiveness to glipizide dose reduction), resistance to changing her antidiabetic agent, and an upbeat, incongruent mood in the emergency department. Factitious disorder is a diagnosis of exclusion, and alternative explanations for a patient's symptoms must be explored and ruled out prior to a definitive diagnosis. This patient's history is consistent with factitious disorder with oral hypoglycemic agents. Management includes compassionate feedback about the clinical findings and psychotherapy referral if the patient is receptive. (Choice A) Although adrenal insufficiency may be associated with hypoglycemia, the patient's presentation, laboratory findings (normal sodium and potassium levels), and physician examination (no orthostatic hypotension, no hyperpigmentation to suggest primary adrenal insufficiency) make this diagnosis less likely and are more consistent with a diagnosis of factitious disorder. (Choice B) Brittle diabetes mellitus is rare in type 2 diabetics. The patient's presentation is better explained by factitious disorder. (Choice E) Somatic symptom disorder and factitious disorder can both manifest with excessive preoccupation with somatic symptoms and treatment seeking. However, in somatic symptom disorder, patients are not consciously falsifying their illness. Educational objective: Factitious disorder involves the intentional falsification of symptoms for the purpose of assuming the sick role. It should be suspected in patients with inconsistencies in their history, examination, and laboratory tests and poor response to standard treatments.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_003",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "An 82-year-old man is brought to the emergency department by his daughter due to severe depression and a 6.8-kg (15-lb) weight loss over the past month. The daughter reports that he remains depressed, despite treatment with therapeutic doses of sertraline, and is withdrawn from the family. She says, \"He no longer plays with the grandchildren, has been eating poorly, and wanders around the house at night when he can't sleep.\" The daughter became alarmed when she found him talking aloud to his wife, who died 20 years ago. In his 40s, the patient was diagnosed with depression, which responded to a tricyclic antidepressant at that time. Medical history includes hypertension and hypercholesterolemia, both well controlled with medication. In the hospital, the patient is alert and oriented but gives minimal responses. Efforts to get him to eat and drink are unsuccessful. He reluctantly discloses that he hears voices and has thoughts of suicide. Vital signs are normal and physical examination is unremarkable aside from weight loss. Extensive laboratory testing shows mild dehydration but is otherwise within normal limits. CT scan of the brain shows no acute processes. Which of the following is the most appropriate treatment for this patient?",
"choice_a": "Discontinue sertraline and start antipsychotic medication",
"choice_b": "Initiate electroconvulsive therapy",
"choice_c": "Switch to a different selective serotonin reuptake inhibitor",
"choice_d": "Switch to a norepinephrine-dopamine reuptake inhibitor",
"choice_e": "Switch to a tricyclic antidepressant",
"correct_answer": "B",
"explanation": "This patient's severe depression, marked weight loss, sleep disturbance, and auditory hallucinations are consistent with major depression with psychotic features. First-line treatment of psychotic depression consists of either combination pharmacotherapy (with an antidepressant plus an antipsychotic) or electroconvulsive therapy (ECT). ECT is preferred for patients who are not eating or drinking as it provides a more rapid clinical response compared to medications. Other indications for using ECT as a first-line treatment include severe suicidality and catatonia. ECT is also indicated for treatment-resistant illness. ECT involves inducing a 30- to 60-second generalized tonic-clonic seizure. Numerous studies substantiate the safety and efficacy of ECT for geriatric depression. Hemodynamic changes are brief, and cardiac complications are rare. Adverse cognitive effects (eg, acute confusion, anterograde and retrograde amnesia) are usually transient. (Choice A) Antipsychotic monotherapy would not adequately treat this patient's depression. Combination antidepressant and antipsychotic therapy would be appropriate in a less-urgent situation. (Choices C and D) Antidepressants typically take up to 6-8 weeks for response and would need to be combined with an antipsychotic medication to effectively treat major depression with psychotic features. ECT is preferred due to the need for rapid response in this patient with severe depression who is suicidal and not eating or drinking. (Choice E) Although this patient previously responded to a tricyclic antidepressant, antidepressant monotherapy is inadequate to treat psychotic depression. Educational objective: Electroconvulsive therapy (ECT) is a first-line treatment for major depression with psychotic features, and is appropriate for patients with severe depression who require rapid intervention (eg, not eating/drinking, severe suicidality). Evidence demonstrates that ECT is highly effective and safe for geriatric patients.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_004",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 58-year-old man with a long-standing diagnosis of schizoaffective disorder is brought to the emergency department for acute change in mental status. He lives in a group home and was assigned a new roommate 2 weeks earlier; the staff reports that the patient has become increasingly paranoid and agitated since then. His antipsychotic medication was changed from quetiapine to fluphenazine last week, but his behavior did not improve despite increasing dosages. The patient's other medications include a selective serotonin reuptake inhibitor and acetaminophen. Over the past several days, he developed a fever and has become increasingly confused. On arrival, the patient's temperature is 40.0 C (104 F), blood pressure is 170/110 mm Hg, pulse is 115/min., and respirations are 22/min. The patient is diaphoretic, and examination shows diffuse rigidity. There is no evidence of infection. He is disoriented to place and time. Laboratory evaluation shows leukocytes 11,500/mm3 and creatine kinase 3,500 U/L. Urinalysis is unremarkable. In addition to supportive measures, which of the following is the most appropriate initial step in management of this patient?",
"choice_a": "Administer benztropine",
"choice_b": "Administer cyproheptadine",
"choice_c": "Administer dantrolene",
"choice_d": "Discontinue antipsychotic medication",
"choice_e": "Discontinue selective serotonin reuptake inhibitor",
"correct_answer": "D",
"explanation": "This patient's development of high fever, confusion, autonomic instability, generalized muscular rigidity, and elevated creatine kinase shortly after starting the first-generation antipsychotic fluphenazine is consistent with neuroleptic malignant syndrome (NMS). NMS is a rare but potentially lethal adverse reaction to antipsychotic medications and is characterized by severe hyperthermia, muscular (lead-pipe) rigidity, altered sensorium, and autonomic instability. An elevated creatine kinase level due to muscle breakdown and leukocytosis is a common finding. The single most important intervention in NMS is prompt discontinuation of the causative agent. Transfer to the intensive care unit for supportive care (eg, aggressive cooling, antipyretics, fluid and electrolyte repletion, blood pressure control) may be necessary. Signs and symptoms of NMS should improve after the antipsychotic is stopped. The use of dantrolene, a direct-acting muscle relaxant, is not well supported and should be considered only when patients do not respond to supportive care and withdrawal of medication (Choice C). (Choice A) Benztropine is used to treat antipsychotic-induced extrapyramidal symptoms, such as acute dystonic reactions and parkinsonism. Anticholinergic agents are ineffective in the treatment of NMS and may worsen hyperthermia. (Choices B and E) Administering cyproheptadine, which has anti-serotonergic properties, and discontinuing the selective serotonin reuptake inhibitor are treatments for serotonin syndrome. Serotonin syndrome also presents with autonomic instability and altered mental status, but it is characterized by neuromuscular irritability and gastrointestinal symptoms rather than diffuse rigidity. It is less likely in this patient who has had a recent increase in his antipsychotic dose and has diffuse rigidity rather than hyperreflexia and myoclonus. Educational objective: Neuroleptic malignant syndrome is characterized by mental status change, muscle rigidity, high fever, and autonomic instability. Management involves prompt discontinuation of the causative agent and aggressive supportive measures.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_005",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 27-year-old man is brought to the emergency department after becoming agitated in a grocery store and screaming that voices are tormenting him and telling him to kill himself. The patient has a history of bipolar disorder currently treated with lithium and fluoxetine. In the emergency department, he becomes combative when approached by staff and receives several doses of intramuscular haloperidol and lorazepam. Urine toxicology is negative. The patient is admitted to the inpatient psychiatry unit, where he is placed in seclusion and restraints due to continued agitation. The following day he is calm but appears confused. He is disoriented to time and place and unable to respond to questions. Temperature is 39.9 C (103.8 F), blood pressure is 180/90 mm Hg, pulse is 112/min, and respirations are 16/min. On examination, the patient is diaphoretic. He has tremors and severe, generalized muscle stiffness but no hyperreflexia or myoclonus. His examination is otherwise normal. Laboratory tests have been ordered but are still pending. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Drug-induced parkinsonism",
"choice_b": "Lithium toxicity",
"choice_c": "Malignant hyperthermia",
"choice_d": "Neuroleptic malignant syndrome",
"choice_e": "Serotonin syndrome",
"correct_answer": "D",
"explanation": "The patient's acute onset of confusion, high fever, muscle rigidity, and diaphoresis after receiving multiple doses of intramuscular haloperidol is suggestive of neuroleptic malignant syndrome (NMS). NMS is an idiosyncratic drug reaction to dopamine antagonist medications that typically begins within days of drug initiation or dose escalation. It is characterized by a tetrad of mental status change, lead-pipe rigidity, fever, and autonomic dysregulation. Although most often seen with high-potency first-generation antipsychotics (eg, haloperidol), the syndrome can occur with second-generation antipsychotics. Key laboratory findings in NMS include elevated creatine kinase due to muscle necrosis and leukocytosis. In severe cases, myoglobinuria and acute renal failure can result. Treatment involves cessation of the offending agent and aggressive supportive measures. (Choice A) Drug-induced parkinsonism is a type of extrapyramidal symptom characterized by tremor, rigidity, bradykinesia, and gait abnormalities. It would not explain this patient's high fever and autonomic instability. (Choice B) Lithium intoxication presents with coarse tremors, ataxia, altered mental status, and gastrointestinal symptoms. It would not cause generalized muscle rigidity and hyperthermia as seen in this patient and can be ruled out by obtaining a lithium level. (Choice C) Malignant hyperthermia is a rare genetic disorder that presents with muscle rigidity and hyperthermia in the setting of exposure to volatile anesthetics or succinylcholine. (Choice E) Serotonin syndrome (typically caused by multiple serotonergic drugs or drug interactions) can be difficult to distinguish from NMS as both can present with fever, mental status change, and autonomic instability. Serotonin syndrome is characterized by neuromuscular irritability rather than the lead-pipe rigidity seen in NMS. Hyperreflexia and myoclonus are typical in serotonin syndrome and are not found in this patient. In addition, fever in serotonin syndrome is usually not as high as it is in NMS, and gastrointestinal symptoms (nausea, vomiting, and diarrhea) are more common. Educational objective: Neuroleptic malignant syndrome is a life-threatening, idiosyncratic drug reaction to dopamine antagonists. It typically occurs within days of antipsychotic initiation or dose escalation and presents with high fever, generalized muscle rigidity, autonomic instability, and mental status change.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_006",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 66-year-old woman is brought to the emergency department with agitation, slurred speech, and muscle jerks. Her daughter found her confused at home this morning. Her past medical history includes gastroesophageal reflux, osteoarthritis, hypertension, and bipolar disorder controlled with lithium therapy. She cannot recall her other medications. The daughter reports that the patient was started on a new antihypertensive medication 2 weeks ago. Her temperature is 36.7 C (98.1 F), blood pressure is 136/84 mm Hg, pulse is 90/min and regular, and respirations are 16/min On physical examination, she is restless and confused. Neurologic examination reveals coarse tremor, sporadic myoclonic jerks, and ataxia. She has no nuchal rigidity and is able to move all 4 extremities. Deep-tendon reflexes are symmetric. The remainder of the physical examination is unremarkable. Laboratory results are as follows: Complete blood count Hematocrit 36% Leukocytes 7,500/μL Serum chemistry Sodium 144 mEq/L Potassium 3.8 mEq/L Chloride 101 mEq/L Bicarbonate 23 mEq/L Creatinine 1.6 mg/dL Glucose 100 mg/dL Urinalysis Specific gravity 1.007 Protein Trace Blood Negative Leukocyte esterase Negative White blood cells 1-2/hpf Red blood cells 1-2/hpf Casts None Which of the following medications most likely contributed to this patient's current presentation?",
"choice_a": "Amlodipine",
"choice_b": "Carvedilol",
"choice_c": "Clonidine",
"choice_d": "Hydralazine",
"choice_e": "Lisinopril",
"correct_answer": "E",
"explanation": "This patient's neurologic deterioration is likely due to lithium toxicity precipitated by the new antihypertensive medication. Any factor that decreases renal excretion of lithium can precipitate toxicity (eg, volume depletion with diuretics, NSAIDs, or angiotensin-converting enzyme [ACE] inhibitors). Thus, patients require close monitoring of lithium levels (0.8-1.2 mEq/L is recommended) when these medications are added to their therapeutic regimen. However, lithium is absorbed slowly into the central nervous system and drug levels may not correlate with the degree of symptoms in acute toxicity. ACE inhibitors and angiotension II receptor blockers (ARBs) increase lithium levels by decreasing the glomerular filtration rate (GFR). Elderly patients are at high risk due to reduced GFR. Treatment of lithium poisoning includes supportive care (eg, IV fluids, benzodiazepines for seizures), gastric decontamination (eg, bowel irrigation with polyethylene glycol) if needed, and hemodialysis for severe toxicity. (Choices A, B, C & D) Amlodipine, carvedilol, clonidine, and hydralazine do not usually interact with lithium and are less likely to have caused this patient's symptoms. Educational objective: Lithium interacts with several medications (eg, ACE inhibitors, ARBS, NSAIDs, and diuretics) that increase serum lithium levels by decreasing GFR or increasing diuresis. The elderly are at increased risk for lithium toxicity due to reduced GFR and volume of distribution. Treatment includes IV hydration, gastric lavage, and/or hemodialysis in cases of large ingestion.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_007",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 28-year-old man is brought to the emergency department by his parents due to agitation, paranoid delusions, and hearing voices. The patient has no medical issues. He drinks a beer each day but does not use illicit drugs. Family history is significant for Graves disease and depression in his mother and hypertension and coronary heart disease in his father. Medical and substance-induced causes of psychosis are ruled out; further history indicates that the patient has become increasingly paranoid and withdrawn over the past year. He is diagnosed with schizophrenia and hospitalized, then started on olanzapine and as-needed lorazepam. After a week the patient is significantly calmer and less paranoid and reports that the voices have decreased in frequency and intensity. He is discharged on olanzapine 20 mg. The patient is seen for a routine medical checkup 3 months later. Apart from an upper respiratory infection a month ago, he has been well. Vital signs and physical examination are unremarkable. He no longer hears voices and has no suicidal ideation. Which of the following tests is the most appropriate at this visit?",
"choice_a": "Complete blood count",
"choice_b": "Electrocardiogram",
"choice_c": "Fasting glucose and lipids",
"choice_d": "Liver function tests",
"choice_e": "Thyroid function tests",
"correct_answer": "C",
"explanation": "Second-generation antipsychotics (eg, olanzapine) are increasingly used as first-line therapy as they have a lower risk of extrapyramidal side effects compared with first-generation antipsychotics. However, as a class, they are associated with metabolic adverse effects (eg, weight gain, dyslipidemia, hyperglycemia, increased risk of diabetes). Olanzapine and clozapine are associated with the greatest risk and can result in significant weight gain, dyslipidemia, and new-onset diabetes. Drugs with lower risk include aripiprazole and ziprasidone. Guidelines for patients on second-generation antipsychotics recommend monitoring BMI monthly and checking fasting plasma glucose and lipids, blood pressure, and waist circumference at baseline, 3 months, and annually thereafter. Patients with preexisting diabetes or who gain >5% of their initial weight should be monitored earlier and more frequently. (Choice A) Olanzapine rarely causes agranulocytosis, and routine monitoring of complete blood counts is not recommended. The antipsychotic clozapine, not olanzapine, requires weekly blood counts during the first 6 months of treatment due to the risk of agranulocytosis. (Choice B) Olanzapine treatment in patients without preexisting cardiac disease does not require routine ECG monitoring. The second-generation antipsychotic ziprasidone is associated with QT prolongation at higher doses. (Choice D) Olanzapine has been associated with asymptomatic increase in liver enzymes. However, significant liver enzyme elevation is rare and routine monitoring of liver function tests is not indicated. (Choice E) Treatment with olanzapine does not require routine thyroid function tests. Patients on the mood stabilizer lithium require regular testing due to the drug's known adverse effects on thyroid function. Educational objective: Second-generation antipsychotics are associated with metabolic side effects, and patients should be routinely monitored for weight gain, hyperglycemia, and dyslipidemia. Olanzapine and clozapine are associated with the greatest risk.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_008",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 54-year-old man comes to the emergency department for evaluation of fever and sore throat, and also due to trouble sleeping, poor energy, and hearing voices for the past 3 days. He has a history of hypertension, hypercholesterolemia, and schizoaffective disorder. The patient has been hospitalized several times in the past for auditory hallucinations ordering him to kill himself and has attempted suicide twice in the past 3 years. His symptoms have been stable on his current regimen of lithium and clozapine for the past 8 months. The patient's other medications include metoprolol and atorvastatin. He has started to feel depressed again and is concerned that the voices may get worse. He has no current suicidal ideation. Temperature is 39.4 C (103 F), blood pressure is 110/70 mm Hg, pulse is 108/min, and respirations are 16/min. Examination is significant for pharyngeal erythema. Laboratory results are as follows: Complete blood count Hemoglobin 14 g/dL Hematocrit 44% Platelets 200,000/mm3 Leukocytes 1,900/mm3 Neutrophils 25% Eosinophils 1% Lymphocytes 74% Serum chemistry Sodium 136 mEq/L Potassium 3.6 mEq/L Creatinine 0.8 mg/dL Glucose 120 mg/dL Lithium level 0.4 mmol/L In addition to antibiotic therapy, which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Add fluoxetine",
"choice_b": "Add haloperidol",
"choice_c": "Discontinue clozapine",
"choice_d": "Increase clozapine",
"choice_e": "Increase lithium",
"correct_answer": "C",
"explanation": "Clozapine is a second-generation antipsychotic that is highly effective in treating schizophrenia and schizoaffective disorder. It is not, however, used as a first-line agent due to its potential for causing life-threatening neutropenia and agranulocytosis. Clozapine is prescribed through a central registry that monitors absolute neutrophil counts (ANCs), and patients must be told to report any symptoms of infection promptly. If the ANC falls below 1,000/mm3, clozapine should be held until the ANC is above 1,000/mm3; an ANC below 500/mm3 requires discontinuing clozapine indefinitely. This patient has symptoms consistent with infection (eg, fever, sore throat) and an ANC of 475/mm3 (25% of 1,900). His clozapine must be stopped. (Choices A, B, and E) Increasing lithium and/or adding an antidepressant or another antipsychotic could be considered for management of this patient's psychiatric condition. However, the most pressing concern is stopping his clozapine as clozapine-induced agranulocytosis can be life-threatening. (Choice D) Clozapine must be stopped due to this patient's agranulocytosis. Educational objective: Clozapine treatment can result in the development of life-threatening neutropenia and agranulocytosis. Clozapine should be held if the absolute neutrophil count falls below 1,000/mm3 and discontinued indefinitely at levels below 500/mm3",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_009",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 64-year-old woman is brought to the emergency department after her husband found her obtunded at home. He found open bottles of her usual medications of sertraline, diphenhydramine, amitriptyline, and lorazepam at her bedside. Her husband does not know how many pills from each bottle may be missing. He reports that the patient appeared more depressed recently and had been expressing increased hopelessness. She has not seen any of her doctors in the past couple of months. The patient has a long-standing history of depression, lower back pain, and insomnia but no other medical problems. She has no known history of cardiac problems or stroke. The patient does not use tobacco, alcohol or illicit drugs. In the emergency department, she is sedated but intermittently arousable. Temperature is 37.2 C (99 F), blood pressure is 95/45 mm Hg, and pulse is 106/min. Oxygen saturation is 94% on room air. The pupils are mildly dilated. Heart sounds are normal. The lungs are clear. She moves all extremities on command but has hyperreflexia of both lower extremities and exhibits frequent myoclonic jerks. She appears confused. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Administer cyproheptadine",
"choice_b": "Administer flumazenil",
"choice_c": "Assess PR interval duration on ECG",
"choice_d": "Assess QRS complex duration on ECG",
"choice_e": "Obtain amitriptyline and diphenhydramine serum levels",
"correct_answer": "D",
"explanation": "The primary concern in this patient is the possibility of cardiac toxicity due to possible tricyclic antidepressant (TCA) and diphenhydramine overdose. A wide complex tachycardia or a QRS duration of >100 msec indicates potential cardiac toxicity, requiring intravenous sodium bicarbonate even in the absence of acidosis as it predicts a higher risk of arrhythmia, which may be fatal. Sodium bicarbonate is administered incrementally up to a pH of 7.45-7.55 until the QRS complex duration normalizes. TCA overdose can manifest with respiratory depression, hypotension, tachycardia, sedation, seizures, coma, and death. Anticholinergic toxicity caused by amitriptyline and/or diphenhydramine could additionally result in hyperthermia, flushing, mydriasis, delirium, and urinary retention. Sertraline overdose may lead to serotonin syndrome (characterized by hyperreflexia, seizures, fever, autonomic instability, and mental status changes) but it does not commonly affect cardiac conduction. Lorazepam overdose may cause delirium, sedation, and respiratory depression and may require intubation. (Choice A) Cyproheptadine is a serotonin antagonist used to treat serotonin syndrome. Although this patient may have overdosed with sertraline as well, the immediate concern is her cardiac status given the possibility of TCA and/or diphenhydramine overdose. (Choice B) Flumazenil should not be administered as it can lower the seizure threshold if the patient has overdosed on a TCA and a benzodiazepine (or if the patient is benzodiazepine dependent and at risk for withdrawal). (Choice C) PR interval durations frequently increase in TCA overdose but do not predict the risk for arrhythmia as well as QRS duration does. (Choice E) Serum levels of amitriptyline or other medications do not correlate well with cardiac toxicity and do not play a role in acute management. Educational objective: Tricyclic antidepressant overdose manifests with respiratory depression, hypotension, tachycardia, sedation, seizures, coma, and death. A wide complex tachycardia or a QRS duration of >100 msec is an indication for intravenous sodium bicarbonate even in the absence of acidosis as it predicts a higher risk of arrhythmia, which may be fatal.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_010",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 59-year-old woman with schizoaffective disorder is brought to the emergency department by her daughter due to restlessness, sweating, diarrhea, and agitation over the last 24 hours. She was seen 3 days ago in an urgent care clinic for acute lower back pain. Physical examination showed no significant abnormalities and no further testing was ordered. The patient was given renewal prescriptions for haloperidol and benztropine and a new prescription for tramadol, and sent home. She is known to have osteoarthritis, chronic kidney disease, hypertension, and type 2 diabetes mellitus. Her other medications include acetaminophen, glipizide, sitagliptin, sertraline, and hydrochlorothiazide. Temperature is 38.9 C (102 F), blood pressure is 146/94 mm Hg, pulse is 110/min and regular, and respirations are 16/min. Oxygen saturation on room air is 97%. The patient appears restless and startles easily. She has slow, continuous horizontal eye movements. Her neck is supple. Cardiopulmonary and abdominal examinations are within normal limits. She has a tremor and is hyperreflexic in her arms and legs. She has sustained bilateral patellar and ankle clonus, and Babinski sign is present bilaterally. Muscle tone is increased diffusely. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Anticholinergic toxicity",
"choice_b": "Haloperidol overdose",
"choice_c": "Malignant hyperthermia",
"choice_d": "Neuroleptic malignant syndrome",
"choice_e": "Serotonin syndrome",
"correct_answer": "E",
"explanation": "This patient's presentation is consistent with serotonin syndrome, which presents as a triad with varying degrees of: Mental status changes, Autonomic hyperactivity, and Neuromuscular abnormalities. Gastrointestinal symptoms and diaphoresis are also common. This syndrome can occur after initiation or dose increase of a serotonergic drug, administration of ≥2 drugs with serotonergic effects, or intentional overdose of a serotonergic drug. Common precipitating agents include MDMA, tramadol, selective serotonin reuptake inhibitors/serotonin-norepinephrine reuptake inhibitors, ergot derivatives, linezolid, and tricyclic antidepressants. This patient was given tramadol (a drug that impairs serotonin reuptake) while taking sertraline (a selective serotonin reuptake inhibitor). Diagnosis is made clinically as there is no diagnostic test for this syndrome. Clonus is an important clinical finding. Treatment involves removing the offending drug, benzodiazepines for symptoms (eg, agitation), and supportive care. Critically ill patients require intubation in the intensive care unit. Cyproheptadine is the preferred antidote if supportive measures are unsuccessful. (Choice A) Anticholinergic toxicity can result in elevated temperature and blood pressure, agitation, altered mental status, mydriasis, dry mucous membranes, ileus, and urinary retention. However, anticholinergic toxicity would not cause hyperreflexia, tremors, and clonus. (Choice B) Although restlessness and other extrapyramidal symptoms can occur with haloperidol, the most likely presentation of a patient with haloperidol overdose would be over-sedation, without gastrointestinal symptoms, myoclonus, or other symptoms of serotonin syndrome. (Choice C) Malignant hyperthermia may occur in genetically susceptible patients in the setting of perioperative exposure to volatile anesthetics or succinylcholine. It can lead to muscle rigidity, hyperthermia, and hypercarbia. (Choice D) Neuroleptic malignant syndrome is a life-threatening condition associated with the use of antipsychotics. It is characterized by delirium, very high fevers (often >40 C [104 F]), autonomic instability, and lead-pipe rigidity (rather than hyperreflexia and myoclonus). Educational objective: Serotonin syndrome presents with mental status changes, autonomic hyperactivity, and neuromuscular abnormalities after exposure to serotonergic agents. Clonus is an important clinical finding. Treatment involves removing the offending drug, benzodiazepines for agitation, and supportive care. Cyproheptadine is the preferred antidote if supportive measures are unsuccessful.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_011",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 75-year-old woman with stage 4 breast cancer with brain metastases is admitted to hospice with a life expectancy of 2-4 weeks. She responded poorly to her last chemotherapy treatment and decided with her family that palliative care was best. Although her pain is fairly well controlled, the patient has very poor appetite, little energy, and sleeps for most of the day. She often does not get up for meals and has lost 3.6 kg (8 lb) in the past week. During a family visit, the daughter notices that the patient is quieter than usual and appears very depressed; she says, \"She barely responds to us anymore and just cries softly.\" Physical examination is unchanged. The patient is alert and oriented. When the physician asks the patient about her mood she says, \"Of course I am depressed given my situation. I'm just so hopeless and tired.\" In addition to providing support, which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Administer electroconvulsive therapy",
"choice_b": "Prescribe escitalopram",
"choice_c": "Prescribe methylphenidate",
"choice_d": "Prescribe mirtazapine",
"choice_e": "Reassure that the behavior is a normal grief reaction",
"correct_answer": "C",
"explanation": "Major depression in terminally ill patients is under-recognized and undertreated as physicians may assume that depression is a normal part of the grieving process. After ensuring adequate pain control and providing support, physicians should have a low threshold for pharmacological treatment with the goal of alleviating patient and family distress and facilitating emotional connection in the last weeks of life. The patient's anticipated life expectancy should guide medication selection. First-line treatments for depression such as selective serotonin reuptake inhibitors (eg, escitalopram) typically require several weeks to take effect and would be appropriate for patients with a life expectancy of several months (Choice B). In patients whose life expectancy is only 2-4 weeks, psychostimulants (eg, methylphenidate, dextroamphetamine, modafinil) are preferred due to their faster onset of antidepressant action. Stimulants may also be useful in counteracting general fatigue and opioid-related sedation. They are generally well tolerated, and improvement in mood and energy can be seen within 1-2 days. (Choice A) Electroconvulsive therapy (ECT) can achieve a more rapid response in severely depressed patients compared to medication. However, this patient's brain metastases are a relative contraindication to ECT, and its use would be inconsistent with palliative care's goal of providing nonintrusive comfort care. (Choice D) Mirtazapine is a first-line antidepressant that is particularly helpful in patients with anorexia and insomnia due to its appetite-stimulating and sedating properties. However, like other antidepressants, it typically requires weeks to take effect. (Choice E) Although it can be difficult to differentiate grief from major depression in terminal illness, this patient's severely depressed mood, withdrawal from family, and despondency are concerning for depression. A rapid antidepressant response could alleviate her suffering and improve quality of life in the weeks she has left. Patients, families, and physicians should not underestimate the impact of depression under the assumption that anyone in the same situation would be depressed. Educational objective: Depression in terminally ill patients is undertreated. Due to their rapid onset of action, psychostimulants should be considered for treating depressed palliative care patients with a life expectancy of days to weeks.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_012",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "An 84-year-old man with a long history of obesity, diabetes, and peripheral artery disease is hospitalized for an extensive gangrenous ulcer on his right foot. A surgical consultant recommends urgent below-the-knee amputation as a life-saving procedure. The patient refuses, saying, \"I've had a long life. Most of my friends are dead and all I have left are memories.\" He does not want to undergo any type of surgical procedure and prefers to be treated with medications only. His primary care provider is uncomfortable with this decision as the patient seems forgetful. On evaluation and record review, there is no evidence of delirium or psychosis. The patient is sad about the death of several friends over the past year. His appetite is normal and he reports no changes in sleep. He is able to provide a summary of his medical condition and acknowledges that refusing surgery may result in his death. His score on a Montreal Cognitive Assessment is 24/30. Which of the following is the most appropriate course of action?",
"choice_a": "Initiate treatment for depression and reassess the patient's capacity",
"choice_b": "Initiate treatment with a cholinesterase inhibitor and reassess the patient's capacity",
"choice_c": "Obtain a psychiatric consult to evaluate the patient's capacity",
"choice_d": "Respect the patient's decision and treat nonsurgically",
"choice_e": "Seek an appropriate family member for discussion and a surrogate decision",
"correct_answer": "D",
"explanation": "Determination of patients' capacity to make medical decisions requires establishing a balance between respecting patient autonomy and protecting those with cognitive impairment. Patients who refuse treatment should be assessed for decision-making capacity according to the criteria in the table. The physician does not have to agree with a patient's decision provided the patient demonstrates consistent, logical reasoning. This patient has decision-making capacity. He is able to articulate reasons for his decision and shows no signs of delirium, psychosis, or severe depression that could interfere with his ability to understand the information and appreciate the risks of refusing surgery. He has the right to refuse treatment and his decision should be respected. Although he may have mild cognitive impairment, as evidenced by his Montreal Cognitive Assessment (MoCA) score of 24/30, there is no evidence that his ability to understand the specific consequences of his decision is impaired. MoCA scores <26/30 generally indicate mild cognitive impairment; however, there is no single score with high sensitivity and specificity to assess capacity. (Choice A) This patient expresses sadness associated with the loss of his friends but does not exhibit other symptoms of depression. There is no evidence that his mood has impaired his decision-making capacity regarding surgery. (Choice B) There is no evidence of impairment in decision-making capacity. Furthermore, there is limited evidence for significant benefit of cholinesterase inhibitors in mild cognitive impairment. (Choice C) Psychiatric consultation regarding capacity would be appropriate for complex cases in which the physician suspects that the patient's decision-making is compromised due to psychosis, depression, or cognitive impairment. (Choice E) This patient has decision-making capacity. If it were determined that he does not have decision-making capacity, the next step would be to contact a family member for surrogate decision-making regarding the surgery. Educational objective: Capacity to consent to or refuse treatment requires the ability to express a choice, understand the relevant medical information, appreciate the consequences of treatment options, and offer a rationale for the decision. Patients with decision-making capacity have the right to refuse medical treatment. Physicians must adhere to these decisions regardless of what they believe to be the best choice.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_013",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 43-year-old woman is seen in the hospital following a laparoscopic cholecystectomy. The patient had no significant operative complications but was observed overnight due to nausea during recovery from anesthesia. The nausea has resolved and she is tolerating a regular diet. The patient reports continuous moderate incisional pain with occasional spikes of increased pain with movement. Medical history is unremarkable and she takes no chronic medications. She does not use tobacco, alcohol, or illicit drugs. Vital signs are normal. Examination shows intact abdominal incisions with normal bowel sounds and no significant abdominal tenderness. The remainder of the examination is normal. Which of the following is the most appropriate prescription for home pain control for this patient?",
"choice_a": "3-day supply of hydrocodone plus acetaminophen",
"choice_b": "7-day supply of codeine plus acetaminophen",
"choice_c": "7-day supply of oxycodone",
"choice_d": "14-day supply of tramadol",
"choice_e": "Low-dose fentanyl patch",
"correct_answer": "A",
"explanation": "Overprescribing of opioid analgesics is associated with risk for abuse and diversion. Even when the initial indication for opioid therapy is appropriate, excess pills can be misused by patients and others, leading to overdose and dependence. Strategies to reduce overprescribing include: Using non-opioid medications (eg, acetaminophen, nonsteroidal anti-inflammatory drugs) for mild pain (eg, low back pain, headache). For patients with moderate to severe pain who require opioid therapy, prescribing limited quantities and providing frequent follow-up to reassess opioid requirements. This opioid-naive patient has moderate postoperative incisional pain. Short-acting opioids (eg, hydrocodone, oxycodone) are appropriate and can be combined with acetaminophen or a nonsteroidal anti-inflammatory drug (eg, ibuprofen) to reduce opioid requirements (short-acting hydrocodone is available in the United States only in combination with acetaminophen or ibuprofen). However, most patients with uncomplicated laparoscopic cholecystectomy have a significant reduction in pain within the first 3 days. Therefore, the most appropriate care for this patient is to provide a short-term (3-5 days) opioid prescription with availability for office follow-up if pain persists beyond that time. (Choices B and C) The analgesic effect of codeine is more variable than that of other opioids. Oxycodone or hydrocodone are more appropriate for postoperative patients, but a 7-day supply is more than is needed for most patients. (Choice D) Tramadol can provide relief of mild to moderate pain, including postoperative pain, and may be associated with a reduced risk of abuse compared to other opioids. However, the risk of misuse of tramadol is still substantial, and a 14-day supply is excessive. (Choice E) A fentanyl transdermal patch can provide relief of chronic pain for up to 72 hours. However, long-acting opioids are associated with increased risk of respiratory depression and are not recommended for acute pain in opioid-naive patients. Educational objective: Strategies to reduce overprescribing of opioid medications include using non-opioid medications for mild pain and prescribing limited quantities of opioid medications for moderate to severe pain. For most patients with moderate postoperative pain, a short-term (3-5 days) prescription of an opioid analgesic is appropriate.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_014",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 35-year-old man comes to the office for increasing anxiety associated with public speaking. The patient previously worked in product development but was recently promoted to a leadership sales position that requires leading daily team meetings and frequent public speaking. When speaking before a group of people, the patient becomes extremely anxious; his face turns bright red; he starts to sweat profusely; and he feels that his heart is racing. He also becomes acutely aware that other people notice his anxiety and judge him negatively. The patient reports that he has been uncomfortable in large groups and while meeting new people since he was a teenager. His new job has been very stressful as he can no longer avoid these situations. He recognizes that his anxiety and fear of public speaking are excessive. The patient has no depression and is otherwise healthy. Blood pressure is 118/68 mm Hg and pulse rate is 86/min. BMI is 23 kg/m2. The remainder of the physical examination is unremarkable. Which of the following is the most appropriate pharmacologic treatment in management of this patient?",
"choice_a": "Alprazolam",
"choice_b": "Buspirone",
"choice_c": "Clonazepam",
"choice_d": "Propranolol",
"choice_e": "Sertraline",
"correct_answer": "E",
"explanation": "This patient's excessive anxiety in social situations in which he fears scrutiny and embarrassment is consistent with social anxiety disorder (SAD). Patients with SAD experience extreme distress in social situations, leading to avoidance behavior. In this case, the patient's job promotion has resulted in increased demands for public speaking and social interactions, thereby exacerbating his social anxiety that has been present since adolescence. Treatment of SAD includes cognitive-behavioral psychotherapy and pharmacotherapy. Selective serotonin reuptake inhibitors (SSRIs) such as sertraline and serotonin-norepinephrine reuptake inhibitors (SNRIs) are first-line medications. Benzodiazepines are reserved for patients who have an inadequate response to SSRI/SNRIs and should be used only in patients with no history of substance use disorder. Patients whose anxiety is restricted to performance situations (ie, performance-only subtype) and who have rarely recurring performance situations can be treated on an as-needed basis with beta blockers or benzodiazepines. (Choices A and C) Benzodiazepines (eg, alprazolam, clonazepam) have demonstrated efficacy in SAD but are generally used as second-line agents due to their potential for tolerance, abuse, and dependence. Adverse effects of sedation and impaired concentration may also be problematic when mental clarity is important for performance. (Choice B) Buspirone is ineffective in SAD. It has been used to treat generalized anxiety disorder. (Choice D) Beta blockers such as propranolol have been used as needed for the performance-only subtype of SAD (eg, propranolol 10 mg, an hour before a performance or speech). However, this patient shows evidence of more generalized social anxiety and encounters stressful social situations and performance situations on a daily basis. SSRIs/SNRIs would be preferred. Educational objective: Selective serotonin reuptake inhibitors and serotonin-norepinephrine reuptake inhibitors are first-line pharmacotherapy for social anxiety disorder. Benzodiazepines can be considered for poor responders without a history of substance use. Beta blockers can be used as needed for rarely occurring performance situations.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_015",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 28-year-old woman comes to the office for a routine evaluation. During the review of systems she reports weight gain, fatigue, bloating, flatulence, constipation, mild acne, and menstrual irregularity. The patient describes difficulty losing weight despite trying numerous low-calorie diets. She is depressed about her weight and feels that her appearance has always been a source of insecurity. She is also unhappy with her current position as an administrative assistant but lacks the motivation to look for another job. The patient has an active social life with friends but is not in a relationship. She smokes marijuana 1 or 2 times a month and has used cocaine at parties twice in the past year. Temperature is 37.1 C (98.8 F), blood pressure is 110/60 mm Hg, and pulse is 68/min. On physical examination, the patient has mild facial acne and is slightly overweight. BMI is 27 kg/m2. The oropharynx is remarkable for painless, mildly swollen parotid glands. The remainder of the physical examination is normal. Complete blood count is normal and serum electrolytes are notable for mildly decreased serum potassium, slightly elevated serum bicarbonate, and mildly decreased serum chloride levels. Thyroid function tests, liver function tests, and urinalysis are unremarkable. Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Bulimia nervosa",
"choice_b": "Persistent depressive disorder (dysthymia)",
"choice_c": "Polycystic ovary syndrome",
"choice_d": "Somatic symptom disorder",
"choice_e": "Surreptitious laxative ingestion",
"correct_answer": "A",
"explanation": "Patients with bulimia nervosa (BN) may be reluctant to disclose their binging and purging behavior, requiring the physician to be alert to physical signs, symptoms, and laboratory findings suggestive of the disorder. This patient's bilateral parotid gland hypertrophy and mild electrolyte abnormalities, as well as her preoccupation with her appearance and weight, are suggestive of BN. Parotid gland hypertrophy (sialadenosis) due to self-induced vomiting occurs in up to 25% of patients with BN and is typically bilateral and painless. Patients with BN are usually normal weight to slightly overweight and frequently have comorbid substance use, depression, and anxiety disorders. Common medical symptoms of BN include lethargy, menstrual irregularities, abdominal bloating, and constipation. Chronic purging can also lead to mild electrolyte abnormalities, including hypokalemia, slightly elevated serum bicarbonate, and slightly decreased serum chloride levels. Hypokalemia in otherwise healthy young adults is highly specific for covert BN. Other signs suspicious for this disorder include oropharyngeal ulcers, erosion of dental enamel, and scars and calluses on the back of the hand. (Choice B) This patient enjoys an active social life and her depressive symptoms revolve around dissatisfaction with her appearance and weight. Persistent depressive disorder (dysthymia) requires depressed mood and at least 2 other depressive symptoms for ≥2 years and would not explain this patient's physical examination and electrolyte abnormalities. (Choice C) Although this patient has some features of polycystic ovary syndrome (eg, weight gain, irregular menses), there would also be evidence of hyperandrogenism, such as hirsutism or inflammatory rather than mild acne. Her preoccupation with weight, coupled with parotid enlargement and electrolyte abnormalities, makes BN more likely. (Choice D) Patients with somatic symptom disorder are preoccupied with ≥1 unexplained physical symptoms, leading to high health care utilization. This patient's somatic symptoms and findings are consistent with BN. (Choice E) Surreptitious laxative ingestion may cause hypokalemia, but BN with self-induced vomiting is a more likely explanation of this patient's parotid hypertrophy. Educational objective: Bulimia nervosa should be suspected in otherwise healthy patients who present with bilateral parotid gland enlargement and mild electrolyte abnormalities. Other suspicious findings include oropharyngeal ulcers, erosion of dental enamel, and scars and calluses on the back of the hand.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_016",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 32-year-old man comes to the office due to severely depressed mood. He says, \"For the past month I have had no energy. I could sleep all day and have missed several days at work because I can't motivate myself to get out of bed.\" The patient is sleeping 12 hours a day and his appetite is poor. He has suicidal ideation but no intent or plan. He has no delusions or hallucinations. The patient has a history of depression in his 20s that responded poorly to fluoxetine. He was hospitalized briefly 2 years ago after being arrested for aggressive behavior when police attempted to restrain him as he entered a government building without authorization. At the time, the patient wanted to explain his \"strategy for world peace at the United Nations.\" Following discharge, he did not follow up with treatment and currently takes no medication. The patient has a history of childhood asthma and knee pain from a motorcycle accident. He drinks beer on weekends and does not use illicit drugs. Family history is significant for depression in his maternal grandfather, who was treated with nortriptyline. Blood pressure is 122/78 mm Hg, pulse is 72/min, and respirations are 16/min. Physical examination is unremarkable. Which of the following is the most appropriate pharmacotherapy?",
"choice_a": "Bupropion",
"choice_b": "Nortriptyline",
"choice_c": "Paroxetine",
"choice_d": "Quetiapine",
"choice_e": "Venlafaxine",
"correct_answer": "D",
"explanation": "This patient currently meets the criteria for a major depressive episode. However, his history of hospitalization for impulsive, aggressive behavior and probable grandiose delusions suggests a prior manic episode, supporting a diagnosis of bipolar I disorder. Quetiapine is a second-generation antipsychotic with established efficacy in treating bipolar depression and is effective in patients with or without psychotic features. Other FDA-approved treatments for bipolar depression include the second-generation antipsychotic lurasidone and the combination of olanzapine and fluoxetine. There is also evidence for the efficacy of the mood stabilizer lithium and the anticonvulsants lamotrigine and valproate. Antidepressants in the absence of mood stabilizers have not been shown to be effective in bipolar depression (Choices A, C, and E). In general, antidepressant monotherapy should be avoided in bipolar depression due to the risk of precipitating mania and inducing rapid cycling (≥4 mood episodes per year). In patients who do not improve with first-line treatment of bipolar depression, antidepressants can be added cautiously to mood stabilizers (eg, lithium, valproate) or second-generation antipsychotics (eg, quetiapine, olanzapine) as this appears to decrease the risk of antidepressant-induced switching from depression to mania. (Choice B) Although this patient has a family history of response to the tricyclic antidepressant nortriptyline, like all antidepressants, it would be contraindicated as monotherapy for a patient with bipolar I disorder. Educational objective: The second-generation antipsychotic quetiapine is a first-line treatment for bipolar depression. Antidepressant monotherapy should be avoided in patients with bipolar I disorder due to the risk of switching to mania or inducing rapid cycling.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_017",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 48-year-old woman comes to the emergency department due to \"fluttering\" in her chest and 10/10 nonradiating chest pain. She feels as if \"someone is sitting on my chest.\" The patient has had similar episodes during the past 6 months that occur at rest and with exertion. In addition to the chest pain, she experiences dyspnea, dizziness, paresthesias, and abdominal cramping. She has also noticed that she fears and avoids being in public places such as crowded shopping malls and restaurants. The patient now insists that her husband drive her to work due to fear of having an attack while driving alone. Over the past month, she has left work on multiple occasions due to the episodes and worries that she will have to stop working or be fired for repeated absences. The patient is an administrative assistant with an approximately 20-year smoking history. She does not use other substances and her medical history is insignificant. She is postmenopausal. Her father and paternal uncle suffered myocardial infarctions in their 50s. Temperature is 37.2 C (99 F), blood pressure is 130/80 mm Hg, pulse is 94/min, and respirations are 18/min. The patient is a well-developed woman who appears her stated age. She is anxious and diaphoretic. Physical examination is otherwise normal. ECG shows no evidence of an ischemic event. Laboratory studies, including complete blood count, chemistries, liver function, and urinalysis, are within normal limits. The patient has negative serial troponin and CK-MB levels. Which of the following is the most appropriate pharmacotherapy for this patient's symptoms?",
"choice_a": "Aripiprazole and alprazolam",
"choice_b": "Bupropion and paroxetine",
"choice_c": "Clonazepam and fluoxetine",
"choice_d": "Risperidone and propranolol",
"choice_e": "Sertraline and buspirone",
"correct_answer": "C",
"explanation": "This patient's history of recurrent, unexpected anxiety attacks with classic physical symptoms (palpitations, chest pain, dyspnea, dizziness, sweating, paresthesias, and gastrointestinal symptoms) is consistent with panic disorder. Her development of agoraphobia (ie, avoidance of situations in which she fears having a panic attack) is a common complication. Treatment of panic disorder includes cognitive-behavioral psychotherapy, antidepressants, and benzodiazepines. Selective serotonin reuptake inhibitors (SSRIs) (eg, fluoxetine) and serotonin-norepinephrine reuptake inhibitors are preferred first-line pharmacotherapy due to their relatively benign side effect profile but typically require 2-4 weeks to take effect. Benzodiazepines (eg, clonazepam) have the advantage of rapid onset of action and are appropriate in acutely symptomatic patients, such as this patient, who require rapid relief. They are also useful in those who cannot tolerate antidepressants, or as short-term therapy while waiting for SSRIs to take effect. Benzodiazepines should be avoided in patients with an active substance use disorder. (Choices A and D) Antipsychotic medications such as aripiprazole and risperidone are not used to treat panic disorder. Propranolol has a role in treating the performance-only subtype of social anxiety disorder but has very limited evidence for efficacy in panic disorder. (Choice B) The use of 2 antidepressants is not considered first-line treatment for panic disorder. Bupropion is a norepinephrine-dopamine reuptake inhibitor. Although it is an effective antidepressant, it tends to be stimulating and has no established efficacy in treating panic disorder. (Choice E) Buspirone is a second-line agent for anxiety disorders due to its weaker anxiolytic effect compared with benzodiazepines. It is used in generalized anxiety disorder but is not effective in panic disorder. Educational objective: Selective serotonin reuptake inhibitors and serotonin-norepinephrine reuptake inhibitors are first-line medications for treatment of panic disorder. Benzodiazepines can provide immediate relief and are appropriate for patients experiencing acute and distressing symptoms while waiting for the antidepressant to take effect.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_018",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 16-year-old girl comes to the office due to a 3-week history of constipation and stomachaches, which are getting worse despite over-the-counter laxatives. The patient has no significant medical history and takes no medication. She consumes a vegan diet and exercises 2 hours a day, which she says \"is necessary so I don't become any fatter than I am already.\" Family history is significant for Hashimoto thyroiditis in her mother, as well as scleroderma and obsessive-compulsive disorder in her sister. Physical examination is significant for a thin, young female with fine hair on her face and body and with dry skin. Temperature is 37.2 C (99 F), blood pressure is 80/55 mm Hg, pulse is 39/min, and respirations are 14/min BMI is 16.5 kg/m2. Laboratory results are as follows: Sodium 138 mEq/L Potassium 3.2 mEq/L Chloride 101 mEq/L Bicarbonate 24 mEq/L Blood urea nitrogen 16 mg/dL Creatinine 0.7 mg/dL Glucose 68 mg/dL Which of the following is the best next step in management of this patient?",
"choice_a": "Cognitive-behavioral therapy",
"choice_b": "Hospitalization",
"choice_c": "Nutritional counseling",
"choice_d": "Psychiatric evaluation",
"choice_e": "Thyroid function tests",
"correct_answer": "B",
"explanation": "This patient's significantly low BMI (<18.5 kg/m2), distorted view of her body weight, lanugo hair, bradycardia, hypotension, and hypokalemia are consistent with anorexia nervosa (AN). The mainstay of treatment in medically stable patients is psychotherapy and nutritional rehabilitation. However, when malnutrition is severe, organ compromise (eg, cardiomyopathy, cardiac atrophy, arrhythmia, respiratory failure, seizures) resulting from lack of nutrients or from electrolyte and fluid imbalances can be fatal. In these cases, inpatient hospitalization is required for medical stabilization and careful refeeding. Hospitalization of patients with AN is indicated with ≥1 of the following symptoms: Unstable vital signs, BMI <15 kg/m2, syncope, electrolyte disturbance, seizures, cardiac failure, or dysrhythmias. This patient's presentation includes abnormal vital signs (hypotension, bradycardia) and electrolyte disturbances (hypokalemia). (Choices A and C) Although nutritional counseling and psychotherapy are the main forms of treatment for AN, this patient is medically unstable and first must be hospitalized due to the risks of complications from organ failure and cardiac compromise. (Choice D) Psychiatric evaluation is important in assessing for comorbid disorders such as depression and anxiety, which are often seen with AN. Hospitalization, however, is a priority in this patient. (Choice E) Although hypothyroidism can lead to constipation, bradycardia, and dry skin, it more often results in weight gain and hypertension rather than the hypotension and very low weight seen in this patient. In addition, thyroid function tests may not be helpful in management of AN as patients can present with euthyroid sick syndrome (ie, low T3 or T4) due to the body's adaption to chronic nutritional depletion. Educational objective: The long-term treatment of anorexia nervosa includes psychotherapy and nutritional rehabilitation. However, a patient with unstable vital signs, BMI <15 kg/m2 or serious medical complication of malnutrition (eg, syncope, electrolyte disturbance, seizures, cardiac failure, dysrhythmias) must be hospitalized to prevent mortality from organ failure.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_019",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 56-year-old woman with major depressive disorder comes to the office for follow-up. Three months ago she was started on fluoxetine 20 mg. Her dosage was subsequently increased to 40 mg after 4 weeks due to nonresponse. At today's visit, the patient says she is \"discouraged\" and continues to feel sad and unmotivated. Her energy remains low and she sleeps 9-10 hours a day without feeling rested. Although she forces herself to go out with friends, she has difficulty enjoying these occasions. The patient also describes an increased appetite and is discouraged by having gained an additional 2.3 kg (5 lb) since her last visit. She is not interested in psychotherapy at this time. The patient is tolerating fluoxetine without difficulty and takes no other medication. She does not use tobacco or alcohol. Blood pressure is 128/70 mm Hg and pulse is 68/min. BMI is 25 kg/m2. Physical examination is normal. Mental status examination is remarkable for sad affect and no suicidal ideation. Which of the following is the most appropriate next step in treatment of this patient?",
"choice_a": "Continue fluoxetine and add mirtazapine",
"choice_b": "Continue fluoxetine for an additional 4 weeks",
"choice_c": "Discontinue fluoxetine and start aripiprazole",
"choice_d": "Discontinue fluoxetine and start phenelzine",
"choice_e": "Discontinue fluoxetine and start venlafaxine",
"correct_answer": "E",
"explanation": "Pharmacologic treatment options for patients with treatment-resistant depression include switching to another antidepressant or augmenting with a second agent. This patient has failed to respond to an adequate trial (>6 weeks) of high-dose fluoxetine. Patients with little to no improvement (nonresponders) or unacceptable tolerability generally benefit from switching to another antidepressant rather than augmentation. Discontinuing fluoxetine and starting venlafaxine, a serotonin-norepinephrine reuptake inhibitor, would be the most appropriate next step. Partial responders, in contrast, can consider augmentation as a first-line option as switching carries a risk of losing the partial therapeutic benefit from the original drug. Augmentation strategies include adding a second-generation antipsychotic, an antidepressant with a different mechanism of action, or occasionally lithium or triiodothyronine. (Choice A) This patient has had no improvement on fluoxetine, so adding mirtazapine, an antidepressant that is sedating and increases appetite, would be a poor choice given her symptoms of low energy and weight gain. (Choice B) This patient has already taken fluoxetine 40 mg for 8 weeks with no improvement. Waiting an additional 4 weeks is unlikely to be beneficial and may unnecessarily prolong her suffering. (Choice C) The second-generation antipsychotic aripiprazole is an effective augmentation strategy for treatment-resistant major depression. However, it is not used as monotherapy. (Choice D) Phenelzine, a monoamine oxidase inhibitor, can be considered as alternate monotherapy in treatment-resistant patients. However, due to the risks of hypertensive crisis or serotonin syndrome, it is generally reserved for patients who have failed more than 2 antidepressant trials. In addition, a 5-week washout period would be required due to fluoxetine's long half-life. Educational objective: Patients who are nonresponders to an adequate trial of their initial antidepressant should generally be switched to a different antidepressant. Partial responders may benefit from augmentation with a second agent.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_020",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 74-year-old white, widowed man comes to the office at the request of his daughter due to lack of appetite and a 4.54-kg (10-lb) weight loss over the past 4 months. Prior to breaking his hip last year when he fell from a horse, the patient had worked as a rancher for over 50 years. His daughter says he never quite recovered from the fall and refused to participate in an outpatient physical rehabilitation program. The patient says, \"I don't want to be around a bunch of disabled people, and those exercises are a waste of time; I just have to accept that my life is over.\" He says his mood is \"bad\" but that depression is for \"the weak-minded.\" When asked about suicidal thoughts and plans, he is initially silent; with further prompting he says, \"I believe in keeping my options open.\" The patient had a depressive episode in his late 40s that responded well to antidepressant treatment. He has never attempted suicide. His daughter lives in a nearby city and checks on him once a month. The patient has a history of hypertension that has been well controlled for many years with atenolol. Physical examination is notable for decreased mobility, arthritis, and a healed gunshot wound sustained in a hunting accident last year. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Discontinue atenolol due to its risk of inducing depression",
"choice_b": "Obtain screening laboratory tests and reassess in 1-2 weeks",
"choice_c": "Offer home-based physical rehabilitation and nutrition supplementation",
"choice_d": "Recommend psychiatric hospitalization",
"choice_e": "Refer for psychotherapy and initiate antidepressant treatment",
"correct_answer": "D",
"explanation": "Older men are at very high risk for suicide, particularly through violent means. Patients in this population who commit suicide are also less likely to have a history of suicide attempts or to endorse suicidal ideation. As a result, these high-risk patients require careful suicide assessment and aggressive clinical intervention. This patient has a number of suicide risk factors, including history of depression, advanced age, white ethnicity, widowed marital status, living alone, physical illness, hopelessness, and access to firearms. In addition, his reluctance to answer questions about suicide, belief about suicide as an option, and the statement that his life is over are worrisome. This patient's suicide risk is high and sending him home is inadvisable. The most appropriate next step is hospitalization, during which aggressive treatment of his depression can be initiated in a safe environment. (Choice A) Although beta blockers appear to cause small increases in the risk of fatigue and sexual dysfunction, the previously reported association with increased risk of depression has not been supported. (Choice B) Screening laboratory tests to assess for medical causes of depression and weight loss (eg, thyroid function tests) are necessary. However, hospitalization due to this patient's high risk for suicide takes priority. (Choice C) Home-based physical rehabilitation and nutritional supplementation may be useful strategies after assessment and treatment of the patient's acute depression. Patients with untreated depression are often unable to fully participate in physical rehabilitation due to poor motivation and nonadherence. (Choice E) A combination of cognitive-behavioral therapy and medication is beneficial, but this patient is at high risk for suicide and requires hospitalization to ensure his safety. Specific treatment can be initiated in the hospital setting. Educational objective: Older men have the highest risk of suicide and should be screened carefully for depression. Physicians must perform a careful assessment of risk and protective factors and use clinical judgment to identify those at high risk who require psychiatric hospitalization.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_021",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 68-year-old man is seen for follow-up of non-small cell lung cancer with bone metastases. He is accompanied by his wife, who is worried about his condition. The patient has undergone surgical resection and several courses of combination chemotherapy. His prognosis is 3-6 months. At today's visit, the patient reports that his cancer pain is generally controlled, but he feels extremely weak and fatigued. He has difficulty falling asleep and also awakens at 2:00 and 4:00 AM. His wife says, \"I make his favorite foods but he barely takes a bite. When the children visited last weekend, he seemed uninterested in spending time with his son and grandson and retired to his room while they were still there.\" The patient says, \"I am just so exhausted all the time. I know I'm not getting better and feel guilty about being a burden to my family.\" The patient has lost 8.2 kg (18 lb) since his last visit. Physical examination is otherwise unchanged. His mood is sad but he is able to smile when appropriate. He thinks about death and dying but has no suicidal ideation, intent, or plan. Which of the following symptoms is most suggestive of major depression in this patient?",
"choice_a": "Early-morning awakening and weight loss",
"choice_b": "Guilt over burdening his family",
"choice_c": "Persistent lack of energy",
"choice_d": "Thoughts of death",
"choice_e": "Withdrawal from family",
"correct_answer": "E",
"explanation": "Depression in cancer patients is under-recognized and undertreated. Diagnosis is challenging as somatic symptoms of depression (eg, low energy, anorexia, weight loss, sleep disturbance) overlap with the physiological effects of cancer itself and its treatment. Therefore, assessment should emphasize nonsomatic symptoms such as loss of interest and pleasure in activities, feelings of worthlessness, excessive guilt, and suicidal ideation. This patient's low energy, loss of appetite, and insomnia are less reliable indicators of depression as they may be caused by his metastatic lung cancer or chemotherapy side effects (Choices A and C). His loss of interest in spending time with his family and inability to engage with them in shared interests are the most concerning signs for depression. Nondepressed cancer patients may be periodically sad and discouraged, but they retain the ability to experience pleasure and engage with their loved ones. The American Society of Clinical Oncology recommends screening every patient with cancer for depression when the initial cancer diagnosis is made and periodically thereafter. There should be a low threshold for initiating treatment as untreated depression has a significant impact on quality of life for the patient and family. (Choice B) Guilt over burdening one's family is an understandable reaction to a cancer diagnosis with poor prognosis and can also occur in nondepressed cancer patients. In contrast, excessive guilt (eg. feeling sinful and deserving of punishment) associated with despair would be more indicative of depression. (Choice D) Thinking about death is normal for patients who have advanced cancer and only months to live. Patients should be assessed for thoughts of suicide, which would be concerning for depression. Educational objective: The diagnosis of depression in patients with advanced cancer should rely primarily on nonsomatic symptoms such as loss of interest and pleasure, worthlessness, excessive guilt, and suicidality. Patients with cancer should be evaluated periodically for symptoms of depression as treatment can improve quality of life for both patients and families.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_022",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 38-year-old man comes to the office stating that \"my skin is being eaten away by flesh-eating bacteria.\" He has repeatedly used a stiff brush to apply antibacterial soap and disinfectant to the skin he insists is infected. The patient describes a progression of itching and redness followed by intense, burning pain at infected sites that spreads almost daily to new body areas. The patient systematically inspects his skin twice a day and records detailed descriptions of the affected areas. He is able to fall asleep at night but awakens sometimes to scratch his skin. He works as an accountant and has had a stable job performance. Current medications include a multivitamin and acetaminophen as needed. He drinks alcohol socially and does not use tobacco or illicit drugs. Temperature is 36.5 C (97.7 F), blood pressure is 122/76 mm Hg, and pulse is 62/min. Physical examination reveals scattered lesions on his extremities that appear to have been caused by intense, abrasive scrubbing. The remainder of the physical examination is unremarkable. Which of the following is the patient's most likely psychiatric diagnosis?",
"choice_a": "Body dysmorphic disorder",
"choice_b": "Delusional disorder",
"choice_c": "Illness anxiety disorder",
"choice_d": "Obsessive-compulsive disorder",
"choice_e": "Somatic symptom disorder",
"correct_answer": "B",
"explanation": "This patient's false, fixed belief that his skin is being eaten by flesh-eating bacteria is consistent with delusional disorder, somatic type. Patients with delusional disorder have fixed delusions without prominent hallucinations or other symptoms of psychosis. Their behavior may not be obviously odd or bizarre, and their functioning unrelated to their delusions may appear normal. Common themes in the somatic type include concern about infestation, deformity, foul body odor, or halitosis. Patients with this disorder typically have no insight into their condition and are more likely to see a dermatologist or primary care physician than a psychiatrist. Treatment involves antipsychotic medications, psychotherapy, and regular appointments to monitor the patient's course. (Choice A) Body dysmorphic disorder is an obsessive-compulsive-related disorder that involves preoccupation with perceived ugliness and defects in appearance. This patient has fixed false beliefs about skin infestation rather than concerns regarding appearance flaws, making delusional disorder the appropriate diagnosis. (Choice C) Patients with illness anxiety disorder fear having a serious undiagnosed medical illness, but they are not delusional and can acknowledge the possibility that they do not have the feared illness. In addition, patients with illness anxiety disorder have few if any somatic symptoms, unlike this patient who experiences severe itching and burning. (Choice D) Obsessive-compulsive disorder involves time-consuming obsessions (eg, intrusive thoughts, urges, images) and compulsions (eg, repetitive behaviors) and are typically not delusional. This patient's obsessive concern with being infected with flesh-eating bacteria and resultant checking behaviors revolve around his somatic delusion. (Choice E) Patients with somatic symptom disorder typically have excessive anxiety about multiple physical symptoms but are not delusional. Educational objective: Patients with delusional disorder, somatic type, typically seek care from primary care providers and dermatologists rather than psychiatrists. The disorder is characterized by fixed delusions that something is wrong with their body; patients' functioning is otherwise intact with no other prominent symptoms of psychosis.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_023",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 24-year-old man comes to the office due to concern that he is unable to adequately complete his work at his construction job. He is constantly distracted by thoughts that he has hurt one of his coworkers and spends hours each day repeatedly checking to make sure he has completed his assignments and that no one is injured. The patient feels the need to hammer nails in a specific geometric pattern and to make sure he uses only an odd number of nails. He counts the number of nails at least 3 times, saying to himself, \"If I don't do this, someone could fall or injure themselves.\" He is extremely distressed by these thoughts and behaviors. On his last performance review, his supervisor reported that the patient is very cautious and has good skills but takes longer to complete jobs than his coworkers. The patient is afraid he will be fired if he doesn't start working more efficiently. He is otherwise healthy but smokes cigarettes and occasionally uses marijuana. Physical examination is unremarkable apart from hard callouses on his ring fingers and right thumb. Laboratory studies, including complete blood count, comprehensive metabolic panel, and TSH, are within normal limits. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Clomipramine",
"choice_b": "Dialectical behavioral therapy",
"choice_c": "Fluoxetine",
"choice_d": "Psychodynamic psychotherapy",
"choice_e": "Risperidone",
"correct_answer": "C",
"explanation": "This patient's repetitive, time-consuming thoughts about having harmed someone, along with an accompanying need to check and recheck his work, nail in a particular pattern, and count objects, are consistent with obsessive-compulsive disorder (OCD). Patients with OCD usually have distressing and intrusive obsessions that may include thoughts about contamination (eg, germs, dirt), unwanted urges (eg, to hurt someone or the self), violent images, or concerns with having harmed someone. Repetitive behaviors (eg, washing, checking, counting), often in the form of rituals, are undertaken to prevent the fears from materializing. Initial treatment of OCD consists of serotonergic antidepressants and/or cognitive-behavioral therapy (CBT). Selective serotonin reuptake inhibitors (SSRIs) are considered first-line treatment due to their favorable side effect profile. A higher dose than what is generally used for depression may be required and should be continued for at least 6 weeks, as effects are often delayed. The tricyclic antidepressant clomipramine is typically used as second-line treatment in patients who do not respond to an adequate SSRI trial (Choice A). (Choices B and D) CBT that includes exposure and response prevention (eg, patient gradually exposed to obsessional fears and prevented from performing the compulsion) is the psychotherapy of choice for OCD. Dialectical behavioral therapy (ie, CBT focusing on dangerous/suicidal behavior) is the preferred treatment for patients with borderline personality disorder. Psychodynamic psychotherapy can be helpful in developing insight for many conditions but is less effective than CBT in targeting obsessions and compulsions. (Choice E) Antipsychotic monotherapy is not a first-line treatment for OCD. If a patient does not respond adequately to an SSRI alone, an antipsychotic can be used as augmentation. Educational objective: Treatment of obsessive-compulsive disorder consists of serotonergic medications and/or cognitive-behavioral therapy. Selective serotonin reuptake inhibitors are first-line treatment due to their favorable side effect profile. Higher doses and trials of at least 6 weeks are often necessary for response.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_024",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 42-year-old woman is evaluated for insomnia, anxiety, and irritability. She is accompanied by her husband to the appointment due to her fear of leaving home unaccompanied. The patient was raped in her neighborhood 3 months ago. Since then, she has become increasingly socially isolated and no longer goes out shopping or to the gym to exercise. The patient has difficulty falling and staying sleep and has frequent nightmares. She has difficulty concentrating when reading or staying focused during long conversations. During the day she feels anxious and exhausted, and she has had several unusual episodes of feeling a sense of unreality and as if she is detached from her physical body. Her husband comments, \"She seems to be someplace else when I am talking to her.\" Her appetite is unchanged and she has continued her hobbies of painting and sewing at home. She has no suicidal thoughts. Vital signs and physical examination are normal. Which of the following is the most likely explanation for this patient's symptoms?",
"choice_a": "Acute stress disorder",
"choice_b": "Agoraphobia",
"choice_c": "Depersonalization/derealization disorder",
"choice_d": "Major depressive disorder",
"choice_e": "Post-traumatic stress disorder",
"correct_answer": "E",
"explanation": "This patient's history of a traumatic experience followed by ≥1 month of insomnia, nightmares, and avoidance behavior are suggestive of post-traumatic stress disorder (PTSD). Flashbacks and dissociative symptoms such as amnesia and depersonalization/derealization (feelings of unreality or being detached from one's body) are also characteristic of the disorder. Most patients with PTSD have intense anxiety and hyperarousal when experiencing reminders of the trauma and compensate by avoidance (as in this patient's reluctance to leave her home). Irritability, decreased interest in activities, and feelings of emotional detachment from others commonly occur. Treatment consists of trauma-focused cognitive-behavioral therapy and serotonergic antidepressants. (Choice A) Patients experiencing post-traumatic stress and functional impairment for the first 30 days following a traumatic event are diagnosed as having acute stress disorder, which is treated primarily with cognitive-behavioral therapy. Patients who remain symptomatic after 30 days are diagnosed with PTSD and may benefit from the addition of an antidepressant. (Choice B) This patient's avoidance behavior is associated with trauma-specific cues and would be explained by PTSD. An independent diagnosis of agoraphobia is not required. (Choice C) Depersonalization and derealization are dissociative symptoms that can be seen as part of PTSD. Depersonalization/derealization disorder is not diagnosed as a separate disorder when PTSD criteria are met. (Choice D) This patient still enjoys doing activities at home and does not have sufficient depressive symptoms to diagnose major depressive disorder. Patients with PTSD are at increased risk for developing major depression. Educational objective: Post-traumatic stress disorder is characterized by at least 1 month of symptoms in response to a life-threatening event and includes intrusive thoughts, nightmares, or flashbacks about the trauma; avoidance of reminders of the event; hyperarousal; dissociative symptoms; and sleep disturbance.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_025",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 45-year-old woman returns to the office for follow-up of depression. Three months ago, she was diagnosed with major depressive disorder with suicidal ideation and was started on sertraline. At her one-month follow-up, the patient had slight improvement with no suicidal ideation but reported sexual dysfunction with anorgasmia. She has been in a mutually supportive relationship with a single partner for several years and had not experienced sexual dysfunction previously. Her sertraline dose was decreased to help with this effect. At today's visit the patient reports that her mood is \"okay\" but that she still has \"more down days than not\" and low energy. She continues to suffer from anorgasmia, which is distressing and negatively affecting her relationship. Her other medical problems include hypertension and type 2 diabetes mellitus, and she takes lisinopril and metformin. She does not use tobacco or illicit drugs. Vital signs and general examination are within normal limits. A recent chemistry panel was normal, and a recent hemoglobin A1c was 6.8%. Which of the following is the best next step in management of this patient?",
"choice_a": "Add bupropion and taper sertraline",
"choice_b": "Add venlafaxine and taper sertraline",
"choice_c": "Decrease the dose of sertraline",
"choice_d": "Discontinue sertraline and switch to bupropion",
"choice_e": "Watchful waiting",
"correct_answer": "A",
"explanation": "All selective serotonin reuptake inhibitors (SSRIs) may be associated with sexual dysfunction in both women (decreased libido and anorgasmia) and men (ejaculatory dysfunction). There is no definitive evidence that one SSRI causes less sexual dysfunction than another. Treatment options include lowering the antidepressant dose if feasible, switching to another antidepressant, or augmenting with another agent. For patients with only modest response to an SSRI or with severe sexual dysfunction, switching agents rather than augmenting is preferable. This patient has had an inadequate antidepressant response and her sexual dysfunction persists despite a reduction in her sertraline dose. The best approach is to switch her medication to a non-SSRI antidepressant, such as bupropion or mirtazapine, which has no or limited effect on sexual function. Patients who are SSRI responders may benefit from adjunctive therapy with sildenafil (phosphodiesterase-5 inhibitor) or bupropion. (Choice B) Serotonin-norepinephrine reuptake inhibitors such as venlafaxine have also been associated with sexual dysfunction, making bupropion a better option. (Choice C) Decreasing the SSRI dose is most appropriate for patients in remission who are on high doses. This patient is already on a low dose of sertraline with only modest improvement, and further dose reduction would risk worsening her depression. (Choice D) When switching to bupropion, a dopamine-norepinephrine reuptake inhibitor, an SSRI should be tapered rather than stopped abruptly. This is because bupropion and sertraline have differing mechanisms of action and can require up to 6 weeks to take effect. Stopping the SSRI abruptly could result in discontinuation syndrome and a recurrence of depressive symptoms before bupropion can take effect. (Choice E) Watchful waiting may be a reasonable approach in an SSRI responder but would not be appropriate for this patient, who has only modest improvement. For most patients, SSRI-induced sexual side effects typically do not diminish over time. Educational objective: Selective serotonin reuptake inhibitors are often associated with sexual dysfunction. Treatment options include lowering the dose, switching to another antidepressant (eg, bupropion, mirtazapine), or augmenting with either bupropion or a phosphodiesterase inhibitor.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_026",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 72-year-old man comes to the office accompanied by his daughter. She relates that he is not doing well and frequently does not answer his phone until noon. There was little food in the refrigerator when she visited recently. The patient appears to care less about his grooming and appearance lately and does not seem to be eating well. His wife died 2 years ago. After a period of mild depression immediately following her death, he felt better and has continued to live independently. The patient says that he is doing fine. He admits to insomnia (frequent awakenings in the middle of the night) and not eating well. He spends his days playing cards with friends and watching televised sports and news programs. He has been to the emergency department twice in the last 8 months, once to be checked after a minor motor vehicle accident and once after suffering a shoulder injury in a fall. The patient appears to be his stated age on general examination. Blood pressure is 148/90 mm Hg and pulse is 84/min. BMI is 18 kg/m2. His general examination is unremarkable. The patient scores 27/30 on the Mini-Mental State Examination. He has no suicidal ideation. There are no focal neurologic findings. Laboratory results are as follows: Complete blood count Hemoglobin 12.0 g/dL Mean corpuscular volume 102 fL Platelets 150,000/mm3 Leukocytes 6,600/mm3 Serum chemistry Sodium 140 mEq/L Potassium 3.6 mEq/L Chloride 98 mEq/L Bicarbonate 26 mEq/L Blood urea nitrogen 4 mg/dL Creatinine 1.2 mg/dL Calcium 9 mg/dL Glucose 120 mg/dL Liver function studies Albumin 3.4 g/dL Bilirubin Total 0.3 mg/dL Direct 0.1 mg/dL Alkaline phosphatase 170 U/L Aspartate aminotransferase (SGOT) 82 U/L Alanine aminotransferase (SGPT) 46 U/L Which of the following is the most likely primary cause of the patient's decline?",
"choice_a": "Cognitive impairment",
"choice_b": "Major depressive disorder",
"choice_c": "Occult malignancy",
"choice_d": "Poor nutritional status",
"choice_e": "Substance use disorder",
"correct_answer": "E",
"explanation": "This patient's history of recent accidents, in combination with an elevated mean corpuscular volume and a disproportionately increased aspartate aminotransferase, suggests an alcohol use disorder. Middle-of-the-night insomnia, decreased concern about appearance (poor self-care), and poor oral intake are common findings. Further evaluation of this patient should include questions about frequency, amounts, and complications of alcohol use. Although depression is also a concern, the patient's social engagement, interest in television programs, and lack of suicidal ideation make major depression less likely (Choice B). In patients in whom significant depression is present, both problems should be addressed concurrently. Approximately 30% of alcoholism encountered in individuals age >65 is late-onset in nature. Alcoholism in the aging population remains undiagnosed in >50% of cases. History of substance use, bereavement, depression, anxiety, disability, and pain are risk factors. Alcoholism may be difficult to recognize as signs and symptoms frequently mimic common pathologies seen in the elderly, and underlying comorbid conditions may distract the clinician from considering alcoholism as a diagnosis. (Choice A) Cognitive impairment can be associated with alcoholism and depression, but this patient's Mini-Mental State Examination score of 27/30 and his normal neurologic examination make this less likely. A score <24 is suggestive of dementia or delirium. (Choice C) The lack of systemic symptoms and a normal physical examination make the diagnosis of occult malignancy unlikely. (Choice D) Although this patient has a low BMI, he has no evidence of muscle wasting (eg, bitemporal wasting, atrophy in extremities) and has a relatively normal albumin, making nutritional deficiencies less likely. This patient's poor eating is likely secondary to his alcohol abuse. Educational objective: Alcoholism is often unrecognized in the elderly and is frequently accompanied by changes in sleep, poor oral intake, and decreased attention to self-care. Unexplained accidents, elevated mean corpuscular volume, and elevated liver function studies should prompt consideration of alcohol use disorder.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_027",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 53-year-old man has been prescribed fluphenazine for many years for schizophrenia. He lives in a group home and is accompanied by his caseworker. His psychotic symptoms have been stable, but he has developed a tremor in his hands and his caseworker has noticed that he walks slower. His medical history is significant for obesity, hypercholesterolemia, and hypertension, for which he takes lisinopril and simvastatin. He has been trying to exercise and eat healthy foods and has managed to lose 5 kg (11 lb) since his last visit 3 months ago. He is concerned about his hands shaking and would like to lose more weight. He wonders if he might do better on a different medication. Vital signs are normal. BMI is 37 kg/m2 Mental status examination is significant for psychomotor retardation, slow speech, and lack of facial expressions. A resting tremor of the hands is noted. ECG shows normal sinus rhythm without abnormalities. The physician discusses the risks and benefits of switching to a different antipsychotic medication. Considering the patient's history, which of the following medications would be most appropriate?",
"choice_a": "Aripiprazole",
"choice_b": "Clozapine",
"choice_c": "Haloperidol",
"choice_d": "Olanzapine",
"choice_e": "Risperidone",
"correct_answer": "A",
"explanation": "Antipsychotic medications for schizophrenia are equally efficacious but have variable side effects. Common side effects include weight gain, metabolic syndrome (obesity, lipid and cholesterol abnormalities, hypertension, impaired glucose metabolism), extrapyramidal side effects (EPS) (acute dystonia, akathisia, parkinsonism), and tardive dyskinesia. High-potency, first-generation antipsychotics (eg, haloperidol, fluphenazine) generally have a higher incidence of EPS and may not be tolerated by many patients. Second-generation antipsychotic (SGA) agents have less potential to cause EPS but may be associated with weight gain and metabolic syndrome to varying degrees. This patient has parkinsonism (tremor, bradykinesia, masked facies), an EPS, and could benefit from a switch to an SGA. Of the SGAs, aripiprazole has a lower potential for causing weight gain or metabolic syndrome and should be considered in this obese, hypertensive patient. Ziprasidone is also associated with comparatively less weight gain but has somewhat greater risk of QT prolongation than other SGAs. (Choices B and D) Clozapine and olanzapine are more likely to cause weight gain and metabolic syndrome compared to other antipsychotics. In addition, clozapine can cause life-threatening agranulocytosis and is reserved for treatment-resistant cases. (Choice C) Like fluphenazine, haloperidol is a high-potency, first-generation antipsychotic and would likely cause a similar degree of EPS. Switching to the SGA aripiprazole is a better choice. (Choice E) Risperidone is more likely to cause EPS when compared with other SGAs, especially at doses greater than 4 mg/day. In addition, it is associated with more weight gain compared to aripiprazole, making the latter a better choice in this obese patient. Educational objective: Antipsychotic medications are equally efficacious but have different side effect profiles. The second-generation antipsychotic (SGA) medications cause fewer extrapyramidal side effects than first-generation antipsychotics but may be associated with weight gain and metabolic syndrome. Among the SGAS, aripiprazole has a lower potential to cause weight gain and metabolic effects and is a preferred drug for minimizing these issues.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_028",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 75-year-old woman comes to the office due to increasing forgetfulness and difficulty concentrating. Her memory has always been sharp, but over the last several months her friends have noticed that she has been forgetful. The patient used to visit them regularly at the community center, but now she prefers to stay home most days. She mentions difficulty with focusing and easy fatigability. She falls asleep earlier than usual and has frequent nighttime awakenings. The patient's husband died from a stroke 6 months ago, and she has been living alone since. Her children live far away and have not been checking up on her regularly. Vital signs are normal. Mini-Mental State Examination score is 26/30, with difficulties in delayed recall, concentration, and attention. Physical examination is unremarkable. Laboratory studies, including vitamin B12 levels and thyroid function, are normal. Which of the following is the best next step in management of this patient?",
"choice_a": "Assess the patient's mood",
"choice_b": "Interview family members about the patient's functioning",
"choice_c": "Obtain MRI of the brain",
"choice_d": "Perform the Montreal Cognitive Assessment",
"choice_e": "Reassure the patient that symptoms represent normal aging; continue to monitor",
"correct_answer": "A",
"explanation": "When older adults present with cognitive impairment, mood and affect should be closely examined to determine if underlying depression may be causing these deficits. This patient has no known medical problems, and results of her physical examination and screening laboratory studies are normal. Her recent cognitive decline and associated symptoms of social withdrawal, fatigue, and sleep disturbance in the setting of bereavement raise concern for major depressive disorder. Late-life depression frequently presents with reversible cognitive impairment (pseudodementia) and neurovegetative features rather than subjective report of mood changes. Validated depression screening tools such as the PHQ-9 and geriatric depression scale can also help diagnose depression in older patients. When the underlying depression is treated, the cognitive impairment often fully resolves. (Choice B) Although interviewing family members can often yield valuable information about behavioral changes and functional impairment, this patient lives alone and does not see her family regularly. Asking the patient about her mood is more important. (Choice C) Neuroimaging is most useful for ruling out other reversible causes of dementia (eg, subdural hematoma, normal-pressure hydrocephalus, treatable cancer), which are unlikely in the absence of focal neurologic findings. Although structural neuroimaging should be considered in the evaluation of all patients with dementia, this patient's cognitive deficits are more likely secondary to depression, which should be ruled out first. (Choice D) This patient's Mini-Mental State Examination score of 26/30 makes dementia less likely as scores <24/30 are highly sensitive and specific for dementia. Assessing the patient for depression would take precedence over performing additional cognitive testing. (Choice E) Although normal aging is associated with some memory loss and changes in sleep pattern, this patient is functionally impaired and is becoming more socially isolative. She requires further evaluation and treatment. Educational objective: Major depressive disorder in older patients can present with reversible cognitive changes rather than depressed mood. Older patients with new-onset cognitive impairment should routinely be assessed for depression.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_029",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 24-year-old woman is brought to the office by her mother for evaluation. Since dropping out of college 3 years ago, the patient has been unemployed and living at home. Over the past year, she has become increasingly isolated from her friends. She spends most of the day alone in her room on the computer and has no motivation to look for work. The patient won't go outside because she is convinced that people on the street are talking about her. She eats only food that she has prepared herself because she fears someone may be trying to poison her. The patient has no medical issues and takes no medication. Family history is significant for opioid use disorder in her brother and colon cancer in her father, who died 2 years ago after a long illness. The patient smokes marijuana twice a month and does not use alcohol. Physical examination reveals a thin, disheveled woman. She refuses to change into an examination gown, makes poor eye contact, and gives very brief responses. Vital signs are normal and physical examination is unremarkable. A urine toxicology screen is positive for cannabinoids. A complete blood count and basic chemistry panel are normal. Which of the following is the most likely diagnosis?",
"choice_a": "Delusional disorder",
"choice_b": "Major depression with psychotic features",
"choice_c": "Schizophrenia",
"choice_d": "Schizotypal personality disorder",
"choice_e": "Substance-induced psychotic disorder",
"correct_answer": "C",
"explanation": "This patient's positive symptoms of paranoid delusions and negative symptoms of flat affect, social isolation, lack of motivation, and poverty of speech are consistent with schizophrenia. Diagnosis requires >6 months of marked functional decline including ≥2 of the following: Delusions, hallucinations, disorganized speech, disorganized behavior, and negative symptoms. Negative symptoms are considered a core feature of schizophrenia and are persistent and relatively resistant to treatment. The diagnosis of schizophrenia requires ruling out medical and substance-induced causes of psychosis and differentiation from other psychotic disorders and mood disorders with psychotic features. It can be challenging to differentiate depressive from negative symptoms due to overlapping features (eg, social withdrawal, loss of motivation and interest). This patient's lack of prominent mood symptoms makes schizophrenia the most likely diagnosis. (Choice A) Delusional disorder is characterized by persistent delusion(s) for >1 months but does not include other psychotic symptoms or the marked functional impairment commonly seen in schizophrenia. This patient's prominent negative symptoms and functional decline are more characteristic of schizophrenia. (Choice B) In major depression with psychotic features, patients typically become severely depressed (eg, marked sadness, sleep and appetite disturbance, suicidal ideation) and then subsequently develop delusions and/or hallucinations with depressive themes. (Choice D) Schizotypal personality disorder is characterized by a longstanding pattern of odd, magical thinking and eccentric behavior, but it does not explain this patient's persistent, well-formed delusions and recent decline in functioning. (Choice E) Although cannabis can trigger or exacerbate an underlying psychotic disorder, there is little evidence that sporadic use alone can cause persistent psychosis to the degree seen in this patient. Educational objective: Schizophrenia is characterized by ≥2 of the following: Delusions, hallucinations, disorganized speech, disorganized behavior, and negative symptoms for >6 months. Negative symptoms, which can be difficult to differentiate from depression, are a core feature of the illness.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_030",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 25-year-old man comes to the office due to problems with concentration and restlessness. His younger brother takes stimulants for attention-deficit hyperactivity disorder, and the patient wonders if medication will help him to focus. He is accompanied by his girlfriend, who says, \"Over the past month, he has been uncharacteristically hyperactive and irritable, jumping from one activity to another but getting little accomplished.\" The patient is frustrated with his current job as a computer data entry clerk, which he feels is beneath him, and he was upset when his boss recently criticized him for making several mistakes. His girlfriend says that he is on the verge of losing his job. The patient stays up late developing plans for a new business that he believes will make him a millionaire. He is sleeping 2-3 hours a night. He drinks 3-4 alcoholic drinks a week and uses marijuana twice a month. Physical examination is unremarkable. Urine toxicology is positive for tetrahydrocannabinol. On mental status examination, the patient appears restless and easily distracted. He is very talkative and leaves his chair to pace during the interview. His mood is irritable. He has no suicidal ideation or psychotic features. Which of the following is the most likely diagnosis?",
"choice_a": "Adjustment disorder",
"choice_b": "Adult attention-deficit hyperactivity disorder",
"choice_c": "Bipolar disorder",
"choice_d": "Narcissistic personality disorder",
"choice_e": "Substance-induced mood disorder",
"correct_answer": "C",
"explanation": "This patient's one-month history of hyperactivity, irritability, grandiosity, and decreased need for sleep is suggestive of a manic episode of bipolar disorder. Irritable (rather than elevated) mood is common, and patients typically exhibit increased energy, distractibility due to racing thoughts, impulsivity in taking on new and foolish business ventures, and inability to complete the many projects they start. His increased physical activity on mental status examination (restlessness, pacing) and talkativeness are also consistent with this disorder. Patients with bipolar disorder frequently have poor insight into their behavior, and collateral information is often needed to make the diagnosis. Bipolar disorder can be distinguished from attention-deficit hyperactivity disorder (ADHD) in adults by an episodic course. Although hyperactivity, irritability, distractibility, restlessness, and hypertalkativeness are seen in both disorders, this patient's recent onset of behavioral changes representing a marked change from his baseline makes bipolar disorder more likely than ADHD (Choice B). In addition, he lacks a history of ADHD symptoms dating back to childhood, which is necessary for the diagnosis of ADHD. (Choice A) Adjustment disorder is diagnosed when symptoms occur in response to a stressor and do not meet the criteria for another mental disorder. This patient's manic symptoms and impairment are likely the cause and not the result of his workplace stress. (Choice D) Although patients with narcissistic personality disorder may also exhibit grandiosity and sensitivity to criticism, this patient lacks the lifelong pattern of excessive need for admiration, superficial and exploitative relationships, and lack of empathy that characterize this disorder. A personality disorder would not explain his recent change in behavior. (Choice E) Substance-induced disorders should be ruled out prior to diagnosing primary psychiatric illness. However, the amount and extent of this patient's alcohol and marijuana use would be unlikely to explain his current symptoms. Stimulants such as cocaine or amphetamines are more likely causes of manic symptoms but would lead to positive results on urinary toxicology screen. Educational objective: Manic episodes are characterized by elevated or irritable mood, hyperactivity, grandiosity, distractibility, hypertalkativeness, and decreased need for sleep. An episodic, as opposed to chronic, course is helpful in differentiating bipolar disorder from adult attention-deficit hyperactivity disorder.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_031",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 31-year-old woman is assessed for difficulty sleeping and feeling exhausted nearly every day for the past 6 months. When the patient pushes herself to perform basic household tasks, she has no energy for the next 1 or 2 days and says, \"My muscles ache for hours afterward.\" She gets 6-7 broken hours of sleep a night and does not feel rested on awakening. The patient also has intermittent headaches and difficulty concentrating. Other than an episode of influenza 8 months ago, she has been in good health. The patient describes feeling \"down in the dumps\" as she cannot go to the gym or socialize with friends as she once did. She works as a counselor but has recently missed at least a day of work a week due to worsening exhaustion and body aches. She enjoys her job and is anxious that the frequent absences will result in her termination; she asks the physician for a doctor's note. The patient does not use tobacco, alcohol, or illicit drugs. Vital signs and physical examination are unremarkable. Laboratory results are as follows: Hemoglobin 13 g/dL Creatinine 0.8 mg/dL TSH 2.4 μ U/mL Erythrocyte sedimentation rate 10 mm/hr Which of the following is the most likely diagnosis in this patient?",
"choice_a": "Chronic fatigue syndrome",
"choice_b": "Fibromyalgia",
"choice_c": "Malingering",
"choice_d": "Persistent depressive disorder (dysthymia)",
"choice_e": "Somatic symptom disorder",
"correct_answer": "A",
"explanation": "This patient's presentation suggests chronic fatigue syndrome (CFS), also known as systemic exertion intolerance disease (SEID). CFS affects primarily young to middle-aged adults and is twice as common in women. It may be misdiagnosed as malingering due to lack of objective findings. Diagnosis involves excluding other causes of fatigue with a thorough history, physical examination, and laboratory evaluation (eg, complete blood count, metabolic panel, TSH level, erythrocyte sedimentation rate). Potential causes that must be excluded include psychiatric disorders (eg, depression, anxiety), which may also be comorbidities, and medical conditions. Clinical clues suggesting CFS include: Sudden onset of fatigue, often after an upper respiratory infection; Resolution of infection with residual intense fatigue and sleep or cognitive disturbances; Symptoms exacerbated by physical activity; Patients usually healthy and highly functioning prior to onset of fatigue; Physical examination typically normal. First-line treatment includes cognitive-behavioral therapy and graded exercise therapy. (Choice B) Fibromyalgia is characterized by diffuse musculoskeletal pain, with tenderness on examination. This patient has fatigue rather than pain, and her physical examination is normal, making CFS the more accurate diagnosis. (Choice C) There is no evidence that this patient is feigning her symptoms for an external goal, which would be the case in malingering. (Choice D) Persistent depressive disorder (dysthymia) is characterized by a depressed mood for most of the day for at least 2 years. This patient's depression stems from her fatigue and has been present for only 6 months. In addition, the fact that she continues to enjoy her work, had symptom onset following infection, and has debilitating muscle aches after exertion make CFS more likely than dysthymia. (Choice E) Somatic symptom disorder typically involves multiple organ systems and is more likely when there is no medical explanation for symptoms; it has an early onset and a chronic course. This patient's 6-month history of fatigue and exercise intolerance is consistent with CFS. Educational objective: Chronic fatigue syndrome is characterized by a relatively sudden onset of intense fatigue that is worse on exertion, is not relieved by rest, and represents a marked deterioration from a previous level of functioning. Sleep and cognition are commonly affected. Treatment includes cognitive-behavioral therapy and graded exercise therapy.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_032",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 35-year-old man comes to the office due to sleep disturbance, low energy, and loss of appetite for the past 3 months. Further history indicates that he lost his job 6 months ago when his company was relocated overseas, and he has been feeling \"too depressed and unmotivated\" to look for new work. He has stopped exercising and prefers not to be around his friends, feeling embarrassed that he had to move back in with his parents. He has thoughts that \"life is not worth living\" but has no thoughts of suicide. Physical examination and laboratory evaluation are noncontributory. The patient is diagnosed with major depressive disorder and started on sertraline 25 mg. At the patient's 2-week follow-up, he is tolerating the medication well, but his symptoms are unchanged. The dose is increased to 100 mg, which is within the therapeutic range. The patient phones 2 weeks later and requests to try another medication, saying, \"Aside from sleeping and eating better, I still feel depressed.\" Which of the following is the most appropriate course of action in management of this patient?",
"choice_a": "Augment sertraline with aripiprazole",
"choice_b": "Continue sertraline for 4 more weeks",
"choice_c": "Discontinue sertraline and start bupropion",
"choice_d": "Discontinue sertraline and start venlafaxine",
"choice_e": "Increase sertraline dosage",
"correct_answer": "B",
"explanation": "An adequate antidepressant trial is generally considered to be 6 weeks at a therapeutic dosage. Patients may be mistakenly labeled as treatment-resistant if they do not receive an adequate antidepressant trial. This patient has taken sertraline 100 mg for only 2 weeks and is beginning to show signs of response (eg, improvement in sleep and appetite). The physician should explain that 2 weeks at the 100-mg dosage is an inadequate trial and recommend that the patient continue sertraline for an additional 4 weeks. The initial 2-week period when the patient was on a subtherapeutic dose of 25 mg should not be counted as part of the trial. Physicians should be aware that inadequate dosage and/or duration is a common reason for perceived inefficacy. Patients may become easily discouraged, leading to nonadherence or premature medication changes and/or inappropriate polypharmacy on the part of the physician. To achieve a positive outcome, it is essential to explain the typical time course of antidepressant response and to encourage the patient to complete an adequate trial. (Choice A) Patients should receive an adequate trial of monotherapy before considering augmentation with a second medication. (Choices C and D) It would be premature to discontinue sertraline 100 mg after 2 weeks. Switching to an alternate antidepressant such as bupropion or venlafaxine can be considered if the patient has minimal response to a maximally tolerated dosage after 6 weeks. (Choice E) Increasing the dosage would not be indicated at this point as the patient is showing signs of responding to sertraline 100 mg. The dose should be maintained for the duration of an adequate trial. Increasing the dosage prematurely risks exposing the patient to unnecessary side effects. Educational objective: Patients with depression can be mistakenly labeled as treatment-resistant if they fail to receive an adequate antidepressant trial. Antidepressants should be continued for at least 6 weeks at a therapeutic dosage before considering medication augmentation or switching.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_033",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 34-year-old woman with a history of migraine headaches comes to the office due to insomnia. She has difficulties with sleep initiation/maintenance that started 5 years ago when she became the caretaker for her mother, who had Alzheimer dementia. She slept poorly as she had to be alert in case her mother called for her during the night. Although her mother passed away 3 years ago, the patient still has insomnia. The patient takes ≥1 hour to fall asleep. She wakes up twice in the middle of the night and may take up to 45 minutes to fall back asleep. When she can't sleep, she stays in bed thinking about her career, lack of social life, and \"ticking biological clock.\" She is exhausted the next day. The patient has no snoring or awakenings with gasping. She does not feel depressed. There is no history of tobacco, alcohol, or illegal drug use. Vital signs are within normal limits. The patient is thin and in no acute distress. Physical examination is unremarkable. Which of the following is the most appropriate treatment for this patient's insomnia?",
"choice_a": "Cognitive-behavioral therapy",
"choice_b": "Melatonin",
"choice_c": "Temazepam",
"choice_d": "Trazodone",
"choice_e": "Zolpidem",
"correct_answer": "A",
"explanation": "Nonpharmacologic management, rather than hypnotic medications, is the recommended initial treatment for chronic insomnia. Cognitive-behavioral therapy (CBT) for insomnia is the treatment of choice and should be recommended to this patient. CBT for insomnia combines several approaches, including cognitive therapy to address dysfunctional thoughts about sleep, and behavioral measures such as sleep hygiene, sleep restriction, stimulus control, and relaxation techniques. The benefits of CBT persist beyond the active treatment period. Hypnotic medications should be reserved for patients who do not improve with CBT alone. Common adverse effects associated with benzodiazepines and nonbenzodiazepine hypnotics include residual daytime sedation, drowsiness, dizziness, lightheadedness, cognitive impairment, motor incoordination, and dependence. Long-term treatment of insomnia with medication alone is unlikely to be beneficial. (Choice B) Melatonin is not recommended as an initial treatment for insomnia unless the sleep disturbance is due to delayed sleep-wake phase syndrome (a circadian rhythm disorder with bedtimes and wake times significantly later than conventional or desired times). Patients with chronic insomnia have difficulty falling asleep regardless of bedtime; in delayed sleep-wake phase syndrome, patients fall asleep readily when allowed to sleep at desired times. (Choice C) Benzodiazepines (eg, temazepam) should be avoided in treating chronic insomnia as tolerance typically develops to their hypnotic effects and they are associated with risks of abuse and dependence. (Choice D) Although low doses of the sedating antidepressant trazodone have been used to treat insomnia, this medication is associated with significant side effects and is not recommended as initial treatment. (Choice E) The nonbenzodiazepine zolpidem is effective for the short-term treatment of insomnia but is also associated with adverse effects, including somnolence and cognitive impairment. Educational objective: Cognitive-behavioral therapy (CBT) is the first-line treatment for chronic insomnia. Patients with continued severe insomnia can be treated with a combination of CBT and short-term pharmacotherapy.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_034",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 25-year-old graduate student comes to the physician requesting treatment for attention-deficit hyperactivity disorder (ADHD). He has a childhood history of ADHD treated with stimulant medication and depression as a teenager. The patient says he is under a lot of stress and currently feels anxious, restless, and unable to concentrate. He has been up all night the past week because he is on the verge of a major scientific breakthrough in his research and is worried that someone might steal his data. His girlfriend reports that he has been uncharacteristically irritable and hyperactive, with angry outbursts for no apparent reason. The patient drinks several beers on weekends and uses marijuana twice a month. Physical examination is normal and urine drug screen is negative. Which of the following is the most likely diagnosis?",
"choice_a": "Adjustment disorder with anxious mood",
"choice_b": "Adult attention-deficit hyperactivity disorder",
"choice_c": "Bipolar disorder",
"choice_d": "Generalized anxiety disorder",
"choice_e": "Substance-induced mood disorder",
"correct_answer": "C",
"explanation": "This patient's recent distractibility, hyperactivity, sleep disturbance, and irritability represent a change in his baseline behavior and suggest a diagnosis of bipolar disorder. His history of depression as a teen and possible grandiosity are further clues that his current symptoms are manifestations of a mood disorder. Patients with bipolar disorder frequently come initially to primary care, and physicians must be alert for signs and symptoms of hypomania and mania (euphoric or irritable mood, grandiosity, decreased need for sleep, pressured speech, racing thoughts, distractibility, hyperactivity, impulsivity). (Choice A) Adjustment disorder is diagnosed when symptoms occur in response to a stressor and do not meet the criteria for another mental disorder. (Choice B) Although this patient has a history of attention-deficit hyperactivity disorder (ADHD) as a child, patients with adult ADHD have chronic, not episodic, symptoms; this diagnosis would not explain his recent, severe sleep disturbance and irritability. Studies show that patients with bipolar disorder frequently have a history of ADHD. (Choice D) Generalized anxiety disorder involves chronic worry, anxiety, and tension related to multiple life issues and would not adequately explain this patient's manic symptoms. (Choice E) Substance-induced disorders must always be ruled out prior to diagnosing primary psychiatric illness. However, this patient's urine drug screen is negative, and the amount and extent of his alcohol and marijuana use would be unlikely to cause his current symptoms. Cocaine and stimulants are more likely to induce manic symptoms. Educational objective: Bipolar disorder is frequently misdiagnosed. Physicians must be alert to signs of mania or hypomania and consider bipolar disorder in the differential diagnosis of patients with hyperactivity and decreased sleep.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_035",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 75-year-old woman comes to the office due to difficulty with memory and thinking. The patient has stopped going for walks and has not attended bingo in months; she explains that these activities are no longer enjoyable. She has low energy and difficulty falling asleep. Her appetite has decreased, and she has lost >6.8 kg (>15 lb) in the past 3 months. Medical history is significant for hypertension, well-controlled epilepsy, and type 2 diabetes mellitus. The patient lives alone and drove herself to today's appointment. She has not gotten lost while driving and has had no difficulty caring for herself. Blood pressure is 138/84 mm Hg, pulse is 76/min, and respirations are 14/min. Neurologic examination is nonfocal, and she scores a 26/30 on the Montreal Cognitive Assessment. Laboratory results, including thyroid function studies, are normal. Which of the following is the most appropriate pharmacotherapy?",
"choice_a": "Bupropion",
"choice_b": "Donepezil",
"choice_c": "Memantine",
"choice_d": "Sertraline",
"choice_e": "Vitamin E",
"correct_answer": "D",
"explanation": "This patient's anhedonia, weight loss, disrupted sleep, low energy, and cognitive impairment are consistent with a diagnosis of major depressive disorder (MDD). MDD in the elderly frequently presents with a more prominent cognitive impairment component (eg, subjective memory problems, poor concentration) and can be difficult to differentiate from neurocognitive disorders. Psychotherapy and/or pharmacotherapy are effective treatments for MDD in the elderly. Selective serotonin reuptake inhibitors (eg, sertraline) are considered first-line pharmacotherapy. Cognitive impairment due to MDD in the elderly is reversible and improves when the depression is treated appropriately. Irreversible, progressive cognitive impairment of the kind found in major neurocognitive disorder (ie, dementia) may be accompanied by a prodromal depressive syndrome; however, unlike the cognitive impairment found in MDD, treatment of depression in prodromal major neurocognitive disorder does not reverse the cognitive impairment. The cognitive impairment that accompanies MDD in the elderly is typically less severe than the impairment in major neurocognitive disorder. (Choice A) Bupropion is contraindicated in patients with a seizure disorder because it can lower seizure threshold. (Choices B, C, and E) Although this patient is experiencing cognitive impairment, she is independent with respect to her activities of daily living (eg, bathing, dressing, feeding); this lack of functional impairment makes the diagnosis of major neurocognitive disorder highly unlikely. Although donepezil, memantine, and/or vitamin E may be beneficial in major neurocognitive disorder, they have not been shown to be beneficial in mild neurocognitive disorder or cognitive impairment secondary to MDD. Educational objective: The cognitive impairment that may accompany major depressive disorder in the elderly is reversible and generally improves with treatment of the depression; selective serotonin reuptake inhibitors are first-line pharmacotherapy.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_036",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 31-year-old woman comes to the office due to headaches, intermittent diarrhea, dizziness, poor sleep, and fatigue. She describes muscle tension in her shoulders and neck, frequent tension headaches, and nonspecific gastrointestinal distress. Her symptoms have been ongoing for the past year but are worse since she separated from her husband 3 months ago. The patient has difficulty falling asleep, frequently lying awake in bed for several hours worrying about her health, finances, work deadlines, and lack of social life. During the day she is anxious and irritable and has low energy and difficulty concentrating at work. She rarely goes out with her friends as she is too tired at the end of the day. The patient was evaluated 6 months ago for similar symptoms. She says, \"I was reassured that everything was normal, but I am still worried something was missed.\" The patient does not use alcohol or illicit drugs. She has a history of asthma treated with albuterol as needed. The patient is afebrile; blood pressure is 130/72 mm Hg, pulse is 88/min, and respirations are 14/min BMI is 22 kg/m2 Physical examination is unremarkable. Serum TSH level, complete blood count, and urinalysis are normal. Which of the following is the most likely diagnosis?",
"choice_a": "Adjustment disorder",
"choice_b": "Generalized anxiety disorder",
"choice_c": "Illness anxiety disorder",
"choice_d": "Major depressive disorder",
"choice_e": "Somatic symptom disorder",
"correct_answer": "B",
"explanation": "This patient's multiple worries, muscle tension, fatigue, sleep disturbance, irritability, and difficulty concentrating are consistent with generalized anxiety disorder (GAD), one of the most common psychiatric disorders. Patients with GAD frequently have insomnia and physical manifestations of anxiety (eg, headaches, gastrointestinal distress, dizziness) and are high utilizers of health care resources. GAD is characterized by excessive, uncontrollable anxiety about multiple issues or events (eg, work, health, finances, safety of family members, minor matters). Although 6 months is required for diagnosis, many patients describe lifelong anxiety with exacerbation during stressful periods. There is significant symptom overlap between major depressive disorder and GAD (eg, fatigue, insomnia, impaired concentration) and the conditions are frequently comorbid. However, this patient does not exhibit additional depressive symptoms required to diagnose a major depressive episode (eg, depressed mood, loss of interest or pleasure, appetite disturbance, feelings of worthlessness or guilt, suicidal ideation) (Choice D). (Choice A) Adjustment disorder is not diagnosed when the patient meets criteria for another disorder. This patient's GAD symptoms predated her marital separation. (Choice C) In illness anxiety disorder (formerly known as hypochondriasis), the patient has minimal or no actual symptoms but is preoccupied with having a serious, undiagnosed, specific disease (eg, a brain tumor). This patient has multiple anxiety-related somatic symptoms that are characteristic of GAD, and her anxiety is not restricted to health concerns. (Choice E) Although this patient has multiple somatic symptoms, these are better explained as physical manifestations of GAD. Somatic symptom disorder involves excessive preoccupation with >1 unexplained somatic symptom(s) and would not explain this patient's anxiety about multiple nonsomatic issues. Educational objective: Generalized anxiety disorder is characterized by excessive, uncontrollable worry about multiple issues lasting ≥6 months. It commonly presents with insomnia and anxiety-related somatic symptoms.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_037",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 30-year-old woman comes to the office due to concerns about her weight despite losing 10.9 kg (24 lb) in the past 6 months. She says, \"I still feel very unattractive and I am afraid that my weight problems are destroying my marriage.\" During the past 5 years, the patient has had wide fluctuations in her weight, and at one point weighed 104.3 kg (230 lb). Much of this weight gain occurred surrounding her 2 pregnancies, the last being over 2 years ago. She is typically home all day caring for the children. At times the patient will consume large quantities of food, only to vomit intentionally before her husband returns from work. On weekends when her husband is home, she avoids this behavior and instead reduces her food consumption dramatically. She becomes anxious if her husband returns home early for fear that he will witness her overeating or vomiting. The patient is angry at her husband and also at herself for not having better control of her life. She denies feelings of depression or hopelessness but does feel overwhelmed. On examination, the patient's vital signs are within normal limits. BMI is 25.3 kg/m2 In addition to psychotherapy, which of the following is the most appropriate management for this patient?",
"choice_a": "Bupropion",
"choice_b": "Fluoxetine",
"choice_c": "No pharmacotherapy is effective",
"choice_d": "Nutritional education",
"choice_e": "Olanzapine",
"correct_answer": "B",
"explanation": "Recurrent binge eating with subsequent self-induced vomiting and caloric restriction to prevent weight gain are consistent with bulimia nervosa (BN). Unlike in anorexia nervosa, the patient's weight is usually within or above the normal range. Contributing factors in BN include interpersonal stressors (eg, conflicts or tension in social relationships) and feelings of dysphoria and poor self-esteem related to body image. The mainstay of treatment for BN is a combination of nutritional rehabilitation (establishing a structured and consistent meal pattern), cognitive-behavioral therapy, and selective serotonin reuptake inhibitors. Among antidepressants, fluoxetine has the best evidence. Studies have shown that the combination of therapies is better than any component alone. However, if nutritional rehabilitation and psychotherapy are not available, pharmacotherapy alone has been found to be effective. (Choice A) Bupropion is contraindicated in patients with eating disorders due to the risk of seizures. (Choice C) Pharmacotherapy is effective for the behavioral and cognitive symptoms of BN and is considered a first-line treatment. (Choice D) Although nutritional education is helpful to teach patients about proper nutrition, education alone is unlikely to stop the cycle of bingeing and purging. Full nutritional rehabilitation involves structured meal planning and monitoring. (Choice E) Olanzapine is used as an adjunctive treatment in anorexia nervosa and can help these patients establish a healthier weight. However, antipsychotics are generally not indicated for patients with BN in the absence of psychotic symptoms. Educational objective: Selective serotonin reuptake inhibitors, particularly fluoxetine, have been shown to be effective in reducing bingeing and purging in patients with bulimia nervosa.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_038",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 54-year-old woman comes to the office due to irritability, insomnia, headache, and fatigue. The patient's medical conditions include hypothyroidism, treated with a stable dose of levothyroxine, and major depressive disorder. She had been doing well on paroxetine for 2 years but decided to stop the medication 3 days ago due to concerns about sexual side effects and weight gain. Since then, the patient has been very worried as she already feels \"terribly anxious and depressed.\" She describes frequent tearfulness, feeling panicky, and body aches and pains. Temperature is 37 C (98.6 F), blood pressure is 130/80 mm Hg, and pulse is 88/min. Physical examination is normal. Mental status examination shows an anxious, irritable mood with a full range of affect. The patient has no suicidal ideation. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Administer lorazepam",
"choice_b": "Obtain thyroid function tests",
"choice_c": "Restart paroxetine and taper",
"choice_d": "Switch to bupropion",
"choice_e": "Switch to venlafaxine",
"correct_answer": "C",
"explanation": "Abrupt discontinuation of selective serotonin reuptake inhibitors (SSRIs) can precipitate an antidepressant discontinuation syndrome that consists of both physical and psychological symptoms, typically beginning within a few days from drug discontinuation and lasting several weeks. Patients may experience acute onset of depression, irritability, anxiety, fatigue, dizziness, gastrointestinal distress, and flu-like symptoms. Other physical symptoms include tremor, paresthesias, and \"electric shock\" sensations. The syndrome occurs more frequently following abrupt discontinuation of shorter half-life antidepressants (eg, paroxetine, venlafaxine) and less commonly with longer half-life drugs (eg, fluoxetine). Most patients experience only mild and transient discontinuation symptoms, but some cases can be severe. The best next step is to restart the patient's paroxetine to treat her withdrawal, followed by a slow taper over 2-4 weeks. The physician should reassure the patient that her mood symptoms are unlikely to represent a depressive recurrence and that her physical symptoms are not medically dangerous. An alternate strategy to restarting and tapering the same antidepressant is substitution of fluoxetine, which is more easily tapered due to its long half-life. (Choice A) Lorazepam would not target the underlying cause of the patient's condition, which is withdrawal from a serotonergic antidepressant. (Choice B) This patient's hypothyroidism has been controlled on stable doses of medication and is an unlikely cause of her acute symptoms. (Choice D) Bupropion is a norepinephrine and dopamine reuptake inhibitor often prescribed for depression due to its favorable side effect profile (no weight gain or sexual side effects). Bupropion would be a reasonable choice for this patient if she decided to resume treatment with an antidepressant, but it would not treat her acute withdrawal from a serotonergic drug. (Choice E) Venlafaxine is a serotonin-norepinephrine reuptake inhibitor that is associated with sexual side effects, making it a poor choice for this patient. It also commonly causes discontinuation symptoms with abrupt cessation. Educational objective: Abrupt discontinuation of short half-life antidepressants such as paroxetine or venlafaxine can result in an antidepressant discontinuation syndrome. Treatment consists of restarting the medication and gradually tapering or substituting an equivalent dose of long-acting fluoxetine.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_039",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 36-year-old woman with a history of recurrent major depressive episodes comes to the office due to a 1- month history of severely depressed mood, social isolation, decreased libido, low energy, sleeping 14 hours a day, and weight gain. The patient works as a real estate agent but recently took a leave of absence as she has no motivation and is unable to concentrate. She has had 4 prior episodes of severe depression, starting in her mid-20s after the birth of her first child. The patient's first episode responded to sertraline within several days. She also responded well to venlafaxine, but her husband recalls that she was instructed to stop the medication after 2 weeks due to severe insomnia. The patient has no significant medical history. She has a family history of opioid use disorder. She drinks 1 or 2 glasses of wine a day and does not use illicit drugs. Temperature is 36 C (96.8 F), blood pressure is 118/75 mm Hg, and pulse is 68/min. Physical examination is normal. Which of the following would be most important to obtain prior to initiating antidepressant treatment?",
"choice_a": "Complete blood count",
"choice_b": "History of alcohol-related complications",
"choice_c": "History of anxiety symptoms",
"choice_d": "History of elevated mood",
"choice_e": "Urine drug screen",
"correct_answer": "D",
"explanation": "Patients with bipolar disorder may be misdiagnosed with unipolar major depressive disorder when the physician fails to assess for history of manic or hypomanic episodes. This patient's atypically rapid antidepressant response and adverse event of intolerable insomnia on venlafaxine are suggestive of treatment-emergent mania, raising concern for bipolar disorder. Other clues to possible bipolarity include early onset of severe or psychotic depression, family history of bipolar disorder, and depressive episodes characterized by lethargy and hypersomnia. Prior to beginning antidepressant therapy, all patients with a major depressive episode should be screened for history of manic or hypomanic episodes to rule out bipolar disorder. Questions regarding periods of elevated mood, decreased need for sleep, racing thoughts, and uncharacteristic risk-taking behavior should be explored. Involving a family member is often helpful as patients may have limited insight, difficulty recalling, or a tendency to minimize past manic or hypomanic episodes. If further history substantiates a diagnosis of bipolar disorder, antidepressant monotherapy should be avoided due to the risk of inducing hypomania/mania. (Choice A) Routine screening laboratory tests (eg, complete blood count, metabolic panel) are not indicated for this patient with a history of depression, no significant medical history, and a normal physical examination. Selected laboratory tests should be performed in cases of new-onset or treatment-resistant depression or in patients who experience new-onset physical symptoms along with depression. (Choice B) The extent of this patient's alcohol use is unlikely to result in complications or be a primary cause of her depression. She should be advised that alcohol use can exacerbate her depressed mood, but it would not affect the decision to prescribe an antidepressant. (Choice C) Assessing for comorbid illness such as anxiety is necessary to gain a deeper understanding of the patient's symptoms. However, first-line pharmacotherapy for both depression and anxiety is antidepressant medications. Ruling out bipolar disorder would take priority due to the risk of inducing mania. (Choice E) This patient denies illicit drug use and shows no signs of substance abuse. Educational objective: Prior to initiating antidepressants, physicians should carefully screen patients with depression for past hypomanic and manic episodes to rule out bipolar disorder. Antidepressant monotherapy should be avoided in patients with bipolar disorder.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_040",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 54-year-old woman with a history of depression, migraine headaches, and fibromyalgia is evaluated at the office at the request of her husband. The couple was returning home from an extended weekend vacation when the patient began behaving strangely. Her husband says she could remember details about herself and their family, but continually asked where they were going even after being told several times. She was anxious and was able to talk and answer questions appropriately. However, she could not remember any new information that she was told during this roughly 8-hour episode. Throughout the event, her husband saw no changes in the patient's ability to walk, write, or speak. He said that the following day she seemed to be back to normal although she did not recall what had happened. The patient has no dizziness, visual difficulties, chest pain, or other concerns. The patient underwent endoscopy the previous week and was diagnosed with gastroesophageal reflux disease. She is now receiving treatment with a proton pump inhibitor but otherwise has had no recent changes to her medications, which include sertraline and ibuprofen. Physical examination is unremarkable. This patient's presentation is most likely a result of which of the following?",
"choice_a": "Complex partial seizure disorder",
"choice_b": "Depersonalization-derealization disorder",
"choice_c": "Dissociative amnesia",
"choice_d": "Transient global amnesia",
"choice_e": "Transient ischemic attack",
"correct_answer": "D",
"explanation": "The patient's presentation is consistent with transient global amnesia (TGA), a condition in which transient loss of memory for recent events and difficulty retaining new information occur (anterograde amnesia). Patients are disoriented to place or time, become anxious or upset, and may repeatedly ask questions such as where they are and why they are there. However, self-awareness, language, and motor and social skills are preserved, and neurologic examination is normal. The episode lasts for less than 24 hours (usually 1-10 hours) and may be precipitated by exertion, stress, changes in body temperature, Valsalva maneuver, or recent procedures. The pathophysiology of this condition is unclear. A history of migraines and age >50 are risk factors. Initial evaluation and management should focus on excluding other diagnoses (eg, toxic/metabolic encephalopathy, stroke, seizures). TGA usually does not recur, and treatment or driving restriction is not required. (Choices A and E) Transient ischemic attacks (TIAs) and seizure activity are the main differential diagnostic considerations for patients with TGA. In this patient, however, there are no accompanying symptoms such as speech or motor deficits that are suggestive of TIA and no automatisms such as chewing, lip smacking, or staring that characterize complex partial seizures. (Choices B and C) Depersonalization-derealization disorder is marked by the experience of detachment from oneself or one's surroundings rather than memory loss. Dissociative amnesia presents as loss of autobiographical memory. This patient was able to remember details about herself and her family during the episode. Educational objective: Transient global amnesia is characterized by a transient episode of impairment in anterograde memory. Patients are disoriented to place or time, but self-awareness and motor and social skills are preserved. The differential diagnoses include toxic/metabolic encephalopathy, stroke, and seizures, which must be ruled out.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_041",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "An 80-year-old man comes to the office for routine follow-up. He lives alone and is independent in his activities of daily living. He still drives infrequently but has his groceries delivered. His spouse of 50 years died 2 years ago. The patient denies feeling down and is still interested in music and playing golf but remarks that he is not going out as much as he once did. He admits to lacking companionship and feeling lonely. He has hypertension, hyperlipidemia, benign prostatic hyperplasia, and osteoarthritis of the knees. The patient takes 5 medications daily and is adherent with his medical regimen. He drinks 1 or 2 glasses of wine a day. On physical examination, the patient is well dressed and groomed. Blood pressure is 130/84 mm Hg and pulse is 80/min. BMI is 25 kg/m2 Mini-Mental Status Examination score is 27/30. He has slight tenderness to palpation of the joint line of his left knee but has full range of motion. The rest of the examination is within normal limits. Which of the following is the strongest risk factor for functional decline and increased mortality in this patient?",
"choice_a": "Alcohol use",
"choice_b": "Hypertension",
"choice_c": "Loneliness",
"choice_d": "Masked depression",
"choice_e": "Osteoarthritis",
"correct_answer": "C",
"explanation": "The elderly often suffer from loneliness due to the loss of friends and relatives, resulting in a smaller social network. Loneliness is a modifiable risk factor that has been found to be an independent predictor of functional decline and death when adjusting for depression and medical illness severity. If not addressed, social isolation can lead to increased rates of anxiety, depression, disability, and suicide. For patients who admit to feeling lonely, physicians can help to improve quality of life with interventions that decrease social isolation, such as referral to social services agencies, senior center activities, and volunteer work. Providers should routinely ask elderly patients about loneliness in primary care visits as a method of primary prevention regarding subsequent disability. (Choice A) This patient's alcohol use is in the moderate range (men <3, women <2 drinks/day) with no indication of misuse. Some studies have shown a decreased mortality associated with moderate alcohol consumption. (Choice B) Hypertension has been associated with increased morbidity and mortality due to cardiovascular events (eg, myocardial infarction, cerebrovascular accident); however, this patient's blood pressure appears to be well controlled on medications. (Choice D) Many patients who report loneliness do not have associated depression. This patient denies feeling down and still has interest in doing things. Intervention to counter his social isolation rather than treatment for depression is indicated. (Choice E) Although osteoarthritis can create physical limitations, this patient has good range of motion; it is his loneliness rather than his osteoarthritis that is a source of distress. Educational objective: Loneliness is an independent risk factor for functional disability and increased mortality in the elderly that is modifiable with social interventions. Physicians should routinely inquire about loneliness at health care visits and recommend interventions that decrease social isolation.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
},
{
"id": "Psych_042",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 52-year-old man comes to the office for follow-up of depression. The patient was initially seen 6 months ago for symptoms of low energy, lack of motivation, anxiety, hypersomnia, increased appetite, weight gain, and poor concentration. At that time, he was having difficulty functioning at his job as an accountant and was worried about being fired for poor performance. Physical examination was unremarkable and routine laboratory tests were within normal limits. The patient was diagnosed with major depression and started on sertraline 50 mg. After several weeks, his dosage was gradually increased to 150 mg and he has steadily improved since then. The patient has a history of 2 prior major depressive episodes at ages 35 and 49 but was never treated. At today's visit, he reports that his mood is \"good\" and that he is functioning well at home and at work. The patient is tolerating sertraline without difficulty and has no suicidal ideation. He asks how long he should continue the medication. Which of the following is the most appropriate recommendation for this patient?",
"choice_a": "Continue sertraline for an additional 3 months",
"choice_b": "Continue sertraline for an additional 6 months",
"choice_c": "Continue sertraline for an additional 1-3 years",
"choice_d": "Gradually taper and discontinue sertraline over 2-4 weeks",
"choice_e": "Gradually taper and discontinue sertraline over 3 months",
"correct_answer": "C",
"explanation": "Following response to acute treatment, patients with a single episode of unipolar major depression should continue antidepressants for an additional 6 months. However, patients with a history of multiple depressive episodes (ie, recurrent major depression) are at high risk for recurrence and are candidates for maintenance antidepressant treatment. Other risk factors for recurrence include early age of onset (≤18) persistent residual depressive symptoms, and comorbid psychiatric disorders. Patients with an increased risk of recurrence should be maintained on antidepressants for at least an additional 1-3 years to reduce risk of relapse and can also consider continuing treatment indefinitely. Those with a history of highly recurrent illness (eg, ≥3 lifetime depressive episodes), chronic episodes (≥2 years), or severe episodes (eg, suicide attempts) are particularly good candidates for maintaining antidepressant treatment indefinitely. This patient has a history of 2 prior episodes of major depression and would be an appropriate candidate for maintenance pharmacotherapy. For such patients, it may be helpful to conceptualize recurrent major depression as a chronic illness similar to other chronic medical diseases (eg, hypertension) that may also require long-term medications. (Choices A, B, D, and E) This patient should continue antidepressant medication for an additional 1-3 years due to his increased risk of recurrence. If the decision is made to discontinue medication, a gradual taper over several weeks to months is preferable. Patients with a history of recurrent episodes who discontinue antidepressants should be monitored closely, and antidepressant therapy should be reinstituted at the first signs of recurrence. Educational objective: Maintenance antidepressant pharmacotherapy (1-3 years) is indicated for patients with recurrent episodes. Patients with ≥3 lifetime depressive episodes, severe episodes (eg, suicide attempts), or episodes lasting ≥2 years can be maintained on treatment indefinitely.",
"source": "Compressed ABIM_Psychiatric,Behavioral_Substance_Abuse@USMLEWorldStep3.pdf"
}, 
  {
    "id": "Psych_043",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 65-year-old woman with moderate chronic obstructive pulmonary disease and hypertension comes to the office for dyspnea that occurs when she walks more than 2 or 3 blocks. The dyspnea is not new and she has a chronic cough. The patient has a 40-pack-year smoking history and wants to know if there is anything she can do to stop. \"I want to be done with these damn cigarettes.\" She briefly tried nicotine replacement therapy and cognitive-behavioral therapy for smoking cessation but found them to be only partially helpful. The patient also has a history of bipolar disorder and a chronic eating disorder. Her last episode of depression was a year ago. Medications include albuterol, salmeterol, fluticasone, and hydrochlorothiazide. She takes no psychiatric medications. The patient is afebrile. Blood pressure is 138/88 mm Hg and pulse is 94/min. Physical examination shows decreased breath sounds and expiratory wheezes, which are not new. Which of the following is the most appropriate next step to help this patient quit smoking?",
    "choice_a": "Behavioral counseling only",
    "choice_b": "Bupropion",
    "choice_c": "Nicotine patch only",
    "choice_d": "Varenicline and nicotine patch",
    "choice_e": "Varenicline monotherapy",
    "correct_answer": "E",
    "explanation": "Smoking cessation is beneficial, even in those who have smoked for many years. Most smokers attempt to quit several times, using different pharmacological and behavioral approaches, before they are finally successful. Varenicline is a high-affinity nicotine receptor partial agonist that increases long-term success rates for smoking cessation. It is more effective than nicotine replacement therapy (NRT) and bupropion. Despite initial concerns about increasing the risk of suicide and/or depression, newer findings have shown no increased neuropsychiatric risk from varenicline, so this patient's psychiatric history is not a contraindication to its use. There is a possible increase in cardiovascular risk, but the benefits of smoking cessation often outweigh this. Bupropion, a norepinephrine and dopamine reuptake inhibitor and antidepressant, can be effective for smoking cessation and may help reduce post-cessation weight gain. However, it is contraindicated in patients with active eating disorders or a history of seizures, and it may destabilize mood in patients with bipolar disorder (Choice B). NRT is used to decrease withdrawal symptoms and reduce nicotine cravings. Combining a long-acting NRT (eg, patch) with a short-acting NRT (eg, gum, lozenge, nasal spray), termed a \"patch-plus\" regimen, is more effective than either modality alone. In a patient with poor previous response to NRT, the use of short-acting NRT alone is likely to be suboptimal (Choice E). (Choice A) Behavioral interventions have a significant but small benefit for smoking cessation. Even brief counseling (3 minutes) has been shown to increase quit rates by approximately 5%. However, pharmacotherapy is indicated as this patient has smoking-related complications and insufficient response to past behavioral treatments. (Choice D) Combining varenicline and NRT should not be considered unless the patient has already failed varenicline monotherapy. Also, study results have been inconsistent regarding added clinical benefit from this combination over varenicline alone, and there is questionable justification for this combination, given that nicotine and varenicline compete for the same nicotinic receptor. Educational objective: Varenicline is the most effective intervention for smoking cessation, and the small increased risk of cardiovascular events is outweighed by the risks of continued smoking for most patients. Bupropion is a first-line agent but is contraindicated in patients with eating disorders or seizures.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_044",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 40-year-old man comes to the office due to sleep difficulties over the past 2 years. He regularly goes to bed at 11:00 PM but is unable to fall asleep until 12:30 AM. As bedtime approaches, he typically becomes tense, watches the clock, and worries about the prospect of another sleepless night. The patient eventually falls asleep and awakens by alarm at 6 AM in order to arrive at his office by 8 AM. During the day he feels fatigued and is concerned that his insomnia is negatively affecting his work performance. The patient does not take naps during the day. His wife has not noticed any snoring or unusual limb movements during sleep. His general health has been good and he takes no medication. He would like to exercise but feels too tired. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Advise daytime naps to replenish sleep debt",
    "choice_b": "Advise remaining in bed doing a relaxing activity even if unable to sleep",
    "choice_c": "Recommend aerobic exercise before going to bed",
    "choice_d": "Recommend going to bed only when feeling sleepy",
    "choice_e": "Recommend restricting time in bed to 5-6 hours a night",
    "correct_answer": "D",
    "explanation": "This patient's presentation is consistent with chronic insomnia. The first-line treatment for chronic insomnia is cognitive-behavioral therapy for insomnia (CBT-I), which includes sleep hygiene education, stimulus control, sleep restriction, and relaxation techniques. Stimulus control therapy aims to break the association between the bed and being awake/anxious. Key instructions include: Going to bed only when feeling sleepy. Using the bed and bedroom only for sleep and sex (no reading, working, or watching TV). If unable to fall asleep within 20 minutes, leaving the bed and going to another room to do a quiet activity (eg, reading a boring book) until sleepy. Maintaining a consistent wake-up time, even on weekends. Avoiding daytime naps. (Choice A) Napping during the day decreases sleep drive at night and should be avoided. (Choice B) Remaining in bed while awake reinforces the association between the bed and wakefulness/anxiety. (Choice C) While regular exercise improves sleep, it should be avoided within 4-5 hours of bedtime as it can be stimulating. (Choice E) Sleep restriction therapy involves limiting time in bed to the actual amount of time spent sleeping (e.g., if a patient is in bed 8 hours but only sleeps 5, their time in bed is restricted to 5 hours). While this is a component of CBT-I, stimulus control (Choice D) is often the most effective initial behavioral intervention for patients who lie awake in bed worrying. Educational objective: Stimulus control therapy for insomnia includes going to bed only when sleepy and leaving the bed if unable to sleep within 20 minutes to break the cycle of bedtime anxiety.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_045",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 38-year-old woman with type 2 diabetes mellitus comes to the office for follow-up. Although her laboratory results indicate good glycemic control (A1c 6.8%), she reports feeling depressed for the past 2 months. She has low energy, difficulty concentrating, and is sleeping 12 hours a day. She says, \"I just can't seem to get anything done.\" The patient is concerned about her weight as she has gained 4.5 kg (10 lb) since her last visit. She has a history of major depression in her 20s that responded well to paroxetine, which was also used by her sister with success. She has no history of mania or hypomania. Which of the following is the most appropriate initial antidepressant for this patient?",
    "choice_a": "Bupropion",
    "choice_b": "Escitalopram",
    "choice_c": "Mirtazapine",
    "choice_d": "Paroxetine",
    "choice_e": "Venlafaxine",
    "correct_answer": "A",
    "explanation": "Selection of an initial antidepressant should be guided by the patient's specific symptoms, medical history, and potential side effect profile. This patient presents with \"atypical\" features of depression, including hypersomnia and weight gain. Bupropion, a norepinephrine-dopamine reuptake inhibitor, is an appropriate choice as it is generally more activating and is associated with weight loss or weight neutrality. It also lacks sexual side effects, which are common with SSRIs/SNRIs. Bupropion should be avoided in patients with seizures and active eating disorders due to its lowering of the seizure threshold (Choice A). (Choices B, D, and E) These SSRI (escitalopram, paroxetine) and SNRI (venlafaxine) medications are not preferred for this patient as they are associated with weight gain and sexual side effects. Although the patient's sister responded to paroxetine, this particular drug has been associated with the most weight gain among the SSRIs. (Choice C) Although mirtazapine does not cause sexual dysfunction, it is associated with increased appetite, weight gain, and sedation, which would be problematic for this overweight, hypersomnic patient. Educational objective: Drug side effect profiles and specific depressive symptoms can help guide initial antidepressant medication selection. Bupropion, a norepinephrine dopamine reuptake inhibitor, is a first-line treatment for major depressive disorder that is associated with less weight gain and fewer sexual side effects compared with selective serotonin reuptake inhibitors.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_046",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 55-year-old man comes to the office due to the sudden onset 4 months ago of inability to maintain an erection. He describes the problem as severe and persistent. He is still able to have an erection upon awakening in the morning, but cannot achieve one during sexual activity with his wife. He has also been feeling \"down\" lately and reports poor sleep, decreased appetite, and low energy. He feels guilty that he can no longer provide for his family as he once did. He has a history of hypertension and type 2 diabetes mellitus. Medications include metformin, lisinopril, and atorvastatin. He does not smoke or use illicit drugs. Physical examination shows no abnormalities. Which of the following is the most likely cause of this patient's erectile dysfunction?",
    "choice_a": "Autonomic neuropathy",
    "choice_b": "Hypogonadism",
    "choice_c": "Medication side effect",
    "choice_d": "Psychogenic cause",
    "choice_e": "Vascular disease",
    "correct_answer": "D",
    "explanation": "Sudden onset of erectile dysfunction (ED) while continuing to have intact early morning erections suggests a psychogenic (\"inorganic\") etiology, in this case a mood disorder (characterized by depressive symptoms, including impaired sleep, poor appetite, low energy, and guilt). Nocturnal erections, which occur during periods of rapid eye movement (REM) sleep, often continue in a patient with psychogenic ED. Organic ED is typically slowly progressive and can be due to multiple causes (eg, diabetes, cardiovascular disease, hypertension, obesity, low testosterone, hyperprolactinemia, thyroid dysfunction, smoking). However, this patient's continued ability to have early morning erections indicates that his erectile dysfunction is not due to any anatomic or physiologic causes, such as diabetes or vascular disease (Choices A and E). (Choice B) Hypogonadism is characterized by small testes and reduced interest in sex, neither of which is present in this patient. (Choice C) Medication adverse effects are an unlikely explanation of this patient's sudden-onset ED 4 months ago and his intact early morning erections. Educational objective: Erectile dysfunction can be due to multiple etiologies, including vascular, neurologic, hormonal, and psychological abnormalities. Psychogenic causes should be suspected if erectile dysfunction has a sudden onset and the patient is able to have early morning and nocturnal erections during REM sleep.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_047",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 61-year-old woman comes to the office due to insomnia. She describes difficulty both falling and staying asleep over the past 6 months. Her insomnia varies and is much worse some days than others. In the mornings, she wakes up half an hour earlier than she would like and rarely feels well rested. The patient has tried several over-the-counter sleep medications, but they make her feel too tired the next day. She is not aware if she snores. The patient drinks a glass of wine several times a week and does not use illicit drugs. She has a history of osteoarthritis and major depression for which she takes ibuprofen and venlafaxine. She has lived alone since her divorce 2 years ago and maintains close relationships with her adult children and grandchildren. The patient is worried about one son who recently lost his job, but she has had no change in mood or appetite. Physical examination is noncontributory. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "2-week sleep diary",
    "choice_b": "Cognitive-behavioral therapy",
    "choice_c": "Polysomnography",
    "choice_d": "Psychiatric evaluation",
    "choice_e": "Trial of low-dose zolpidem",
    "correct_answer": "A",
    "explanation": "Initial evaluation of patients with chronic insomnia requires a detailed sleep history to clarify sleep patterns and identify contributing factors (eg, substances, psychosocial stressors, environmental issues). For patients who describe variability in their sleep pattern and whose report may be affected by recall bias, the first step is to obtain a 2-week sleep diary. A sleep diary provides detailed information regarding the patient's quantity and quality of sleep, bedtime routine, daytime symptoms, use of causative substances, and relationship to environmental factors and psychosocial stressors. It can identify patterns to assist the physician in making specific sleep-hygiene recommendations or providing targeted behavioral guidance (Choice A). (Choices B and E) Cognitive-behavioral therapy (CBT) is considered a first-line treatment for patients who do not improve with general behavioral recommendations. Low-dose zolpidem would be appropriate for patients who do not respond to nonpharmacological interventions. (Choice C) Polysomnography would be indicated for further evaluation of suspected sleep apnea, but it is not part of routine evaluation for insomnia. (Choice D) A psychiatric evaluation is appropriate when there is concern that psychiatric illness is the primary cause of the patient's insomnia. It would be premature for this patient who denies significant mood changes. Educational objective: A 2-week sleep diary is a useful assessment tool that can help confirm the diagnosis and guide treatment interventions in patients with chronic insomnia.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_048",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 43-year-old executive comes to the office for a follow-up appointment. He has been traveling between the United States and Europe for business and reports significant difficulty adjusting to the time changes. He says, \"I'm exhausted during the day but can't sleep at night when I arrive in London.\" This has resulted in several poor presentations at meetings. He is otherwise healthy and takes no medications. He has tried avoiding caffeine and alcohol during his flights without much success. Which of the following is the most appropriate initial treatment for this patient's jet lag?",
    "choice_a": "Lorazepam",
    "choice_b": "Melatonin",
    "choice_c": "Modafinil",
    "choice_d": "Timed light exposure",
    "choice_e": "Zolpidem",
    "correct_answer": "B",
    "explanation": "Jet lag usually occurs after crossing several time zones and is characterized by sleep disturbances, daytime fatigue, reduced performance, malaise, and gastrointestinal symptoms. Behavioral modifications and melatonin are effective initial treatments with few side effects. Melatonin is a hormone that regulates the circadian rhythm and is effective in most patients when taken at local bedtime for up to 5 nights after arrival. Other treatments include timed light exposure, exercise during the day, and short strategic naps (Choice B). (Choices A and E) Benzodiazepines (eg, lorazepam) and non-benzodiazepine receptor agonists (eg, zolpidem) may improve insomnia due to jet lag but do not promote adjustment of the endogenous circadian timing system. They have greater potential to cause unwanted side effects and should not be suggested as first-line treatment. (Choice C) Modafinil is a wake-promoting agent approved for shift work sleep disorder but not jet lag. (Choice D) While timed light exposure can help, melatonin is considered a more effective initial pharmacological treatment for accelerating adjustment to the new time zone. Educational objective: Jet lag results from crossing multiple time zones. Behavioral modifications and melatonin are effective initial treatments.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_049",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 31-year-old woman comes to the physician with a year-long history of gradually worsening anxiety and restlessness. The patient says she is constantly \"on edge\" and has difficulty relaxing. She worries about her job, her health, and her finances, and finds it difficult to control her worrying. She also reports muscle tension and frequent headaches. Her symptoms have interfered with her ability to complete her work on time. She denies any traumatic events, nightmares, or flashbacks. Which of the following is the most likely diagnosis?",
    "choice_a": "Acute stress disorder",
    "choice_b": "Adjustment disorder",
    "choice_c": "Generalized anxiety disorder",
    "choice_d": "Post-traumatic stress disorder",
    "choice_e": "Social anxiety disorder",
    "correct_answer": "C",
    "explanation": "This patient's 1-year history of excessive, uncontrollable worry about multiple issues (job, health, finances), along with symptoms of restlessness and muscle tension, is consistent with generalized anxiety disorder (GAD). GAD is characterized by at least 6 months of persistent anxiety and worry about various events or activities. (Choice A) Acute stress disorder (ASD) develops within 4 weeks of a traumatic event and is characterized by intrusive re-experiencing, hyperarousal, and avoidance behaviors. (Choice B) Adjustment disorder is diagnosed when behavioral symptoms develop within 3 months of an identifiable stressor and do not meet criteria for another disorder. (Choice D) Post-traumatic stress disorder (PTSD) requires a history of exposure to a life-threatening trauma and symptoms lasting more than a month. Educational objective: Generalized anxiety disorder is characterized by at least 6 months of excessive, uncontrollable worry about multiple areas of life accompanied by physical symptoms of anxiety.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_050",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 44-year-old man comes to the office for an annual physical examination. He has no significant medical history and takes no medications. The patient has a history of depression in his early 20s that responded well to sertraline. He currently has no depressive symptoms. He is married, has 2 school-age children, and works as a landscaping contractor. The patient drinks socially and does not use recreational drugs. He has a 25 pack-year smoking history. He says that his mother and brother are recovering alcoholics. Physical examination is unremarkable. Routine laboratory blood tests are obtained. Which of the following is the best next step in assessing this patient for unhealthy alcohol use?",
    "choice_a": "Administer the CAGE screening questionnaire",
    "choice_b": "Administer the single-item screening test or Alcohol Use Disorders Identification Test-C",
    "choice_c": "Check laboratory test results to detect abnormalities suggestive of alcohol abuse",
    "choice_d": "Obtain a comprehensive substance use history",
    "choice_e": "Obtain urine toxicology screen",
    "correct_answer": "B",
    "explanation": "All adult primary care patients should be screened for unhealthy alcohol use. Studies support the use of either a single-item screening test or the AUDIT-C (Alcohol Use Disorders Identification Test-C) screen. A single-item screen (asking \"How many times in the past year have you had 5 [4 for women] or more drinks in a day?\") efficiently identifies unhealthy use. AUDIT-C is also widely validated. (Choice A) The CAGE questionnaire is no longer recommended as an initial screen because it focuses on complications of heavy use rather than the full spectrum of unhealthy use. (Choice C) While lab tests can support a diagnosis, they are nonspecific and not recommended for initial screening. (Choice D) A full history is performed after a positive screening result. (Choice E) Urine toxicology does not provide info on patterns or amount of use. Educational objective: A single-item screening or AUDIT-C is recommended to identify unhealthy alcohol use in primary care.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_051",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 53-year-old man is seen for a routine health examination. He has a 30-year history of schizophrenia and was recently diagnosed with type 2 diabetes mellitus. The patient’s other medical conditions include hypercholesterolemia and seborrheic dermatitis. Medications include metformin, lovastatin, and haloperidol. The patient's schizophrenia had been controlled for many years on olanzapine until he was hospitalized 6 months ago for an acute psychotic episode that occurred when he was forced to move into a group home following the death of his father. Since discharge, his psychotic symptoms have been well controlled on a stable dose of haloperidol. On examination, the patient is cooperative but makes little eye contact. He appears extremely anxious and restless. He shifts frequently in his chair and crosses and uncrosses his legs continually. Vital signs are within normal limits. The remainder of the physical examination, apart from moderate obesity, is unremarkable. Which of the following is the most likely explanation for this patient's symptoms?",
    "choice_a": "Acute dystonic reaction",
    "choice_b": "Adjustment disorder with anxiety",
    "choice_c": "Akathisia",
    "choice_d": "Psychotic agitation",
    "choice_e": "Tardive dyskinesia",
    "correct_answer": "C",
    "explanation": "This patient's prominent physical restlessness, shifting in his chair, and inability to sit still are characteristic of akathisia, an extrapyramidal symptom (EPS) caused by antipsychotic medications (like haloperidol). It is often distressing and may be mistaken for anxiety or psychotic agitation (Choice C). Management includes dose reduction, or adding a beta blocker or benzodiazepine. (Choice A) Acute dystonic reactions are involuntary muscle contractions (neck, tongue) occurring early in treatment. (Choice B) While he has stressors, the physical restlessness is more characteristic of akathisia. (Choice D) His psychosis is well controlled on haloperidol. (Choice E) Tardive dyskinesia involves repetitive, purposeless rhythmic movements (eg, lip smacking) rather than generalized restlessness. Educational objective: Akathisia is characterized by inner restlessness and difficulty sitting still due to antipsychotics.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_052",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 32-year-old woman comes to the office at her husband's insistence for evaluation of weight loss. She is unconcerned about her weight and reports that she has been eating more than usual. Her medical history is unremarkable and she takes no medications. The patient says she has been feeling \"great\" for the past month, with lots of energy and a decreased need for sleep. Her husband reports that she has been spending excessive amounts of money on unnecessary items and has been talking much faster than usual. She is currently working on several new business projects and believes she is going to be very successful. On examination, the patient is talkative and pressured in her speech. Her mood is elevated. She has no suicidal or homicidal thoughts. Which of the following is the most likely diagnosis?",
    "choice_a": "Bipolar I disorder",
    "choice_b": "Bipolar II disorder",
    "choice_c": "Cyclothymic disorder",
    "choice_d": "Major depressive disorder",
    "choice_e": "Schizoaffective disorder",
    "correct_answer": "A",
    "explanation": "This patient's symptoms of elevated mood, decreased need for sleep, pressured speech, grandiosity (business projects), and impulsive spending are consistent with a manic episode. A manic episode lasting at least 1 week and causing significant functional impairment (or requiring hospitalization) defines bipolar I disorder. (Choice B) Bipolar II disorder requires hypomanic episodes (less severe, no marked impairment) and major depressive episodes. (Choice C) Cyclothymic disorder involves at least 2 years of hypomanic and depressive symptoms that do not meet full criteria. (Choice E) Schizoaffective disorder requires a period of psychosis (delusions/hallucinations) for at least 2 weeks in the absence of a major mood episode. Educational objective: Bipolar I disorder is characterized by at least one manic episode.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_053",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 32-year-old woman at 16 weeks gestation with no previous medical or psychiatric history comes to the office for a follow-up due to worsening depression. She says, \"I don't understand why I feel this way since I was so happy to become pregnant and my fiance is very supportive. Sometimes I start crying over nothing at all.\" The patient began seeing a therapist 8 weeks ago after her sister noticed that she seemed down. She had suicidal thoughts at that time, but has been able to control these by speaking with the therapist weekly. The therapy has helped somewhat, but the patient still feels depressed most of the day, has trouble sleeping, and wakes up early in the morning. She is also having trouble concentrating at work and has lost 2.5 kg (5.5 lb) over the past 4 weeks. She has no current suicidal or homicidal thoughts or psychotic symptoms. Physical examination is unremarkable. Which of the following is the most appropriate treatment for the patient at this time?",
    "choice_a": "Electroconvulsive therapy",
    "choice_b": "Increased frequency of psychotherapy sessions",
    "choice_c": "Mirtazapine",
    "choice_d": "Sertraline",
    "choice_e": "Venlafaxine",
    "correct_answer": "D",
    "explanation": "Selective serotonin reuptake inhibitors (SSRIs) are first-line treatment for pregnant patients with moderate to severe major depression or those who do not respond to psychotherapy alone. Sertraline is commonly used and has a favorable safety profile (Choice D). Risks to the fetus and mother from untreated maternal depression generally outweigh potential risks of treatment. (Choice A) ECT is reserved for severely depressed pregnant patients who are quickly decompensating or require rapid treatment (eg, not eating/drinking, psychotic). (Choice B) While she may benefit from more therapy, the severity of her depression and weight loss make medication a priority. (Choices C and E) Mirtazapine and SNRIs appear safe but are generally second-line behind SSRIs due to more extensive safety data for the latter. Educational objective: SSRIs are first-line treatment for moderate to severe depression during pregnancy.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_054",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 43-year-old man comes to the office for follow-up 12 weeks after starting sertraline for major depressive disorder. The patient's mood has improved significantly, and he is now functioning well. However, he reports persistent sexual dysfunction with inability to maintain an erection and delayed ejaculation. He says this is causing significant distress and is affecting his relationship with his wife. He is currently taking sertraline 100 mg daily. Which of the following is the most appropriate next step in management of this patient's sexual dysfunction?",
    "choice_a": "Add bupropion",
    "choice_b": "Add sildenafil",
    "choice_c": "Decrease the dose of sertraline",
    "choice_d": "Switch to mirtazapine",
    "choice_e": "Watchful waiting",
    "correct_answer": "B",
    "explanation": "Sexual dysfunction is a common side effect of SSRIs. Management depends on the patient's antidepressant response. In SSRI responders (like this patient), augmentation with a second agent is preferred to avoid losing the antidepressant benefit. In men with erectile dysfunction, augmentation with a phosphodiesterase-5 inhibitor (eg, sildenafil) is recommended (Choice B). (Choice A) Augmentation with bupropion is typically suggested for women or for generalized sexual dysfunction, but sildenafil is more targeted for ED in men. (Choice D) Switching to a non-SSRI (bupropion, mirtazapine) is recommended for nonresponders or partial responders. (Choice C) Decreasing the dose may diminish therapeutic effects. (Choice E) Watchful waiting is typically ineffective. Educational objective: In SSRI responders with erectile dysfunction, augmentation with a phosphodiesterase-5 inhibitor is beneficial.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_055",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 54-year-old woman comes to the office for her annual health maintenance visit. The patient's medical problems include hypercholesterolemia, gastroesophageal reflux disease, and alcohol use disorder. She was hospitalized for treatment of alcohol withdrawal last year and attended an outpatient substance abuse program after discharge. The patient maintained abstinence for 3 months following completion of the program. Since then, she has attempted to limit her consumption to 1 drink a day; however, since being let go from her job last month, she has started drinking heavily again and currently consumes 8-10 vodka drinks daily. She says, \"I thought I could control it on my own, but the cravings are so intense.\" The patient lives alone and is currently looking for work. In addition to psychosocial interventions, which of the following is the most appropriate pharmacotherapy?",
    "choice_a": "Bupropion",
    "choice_b": "Chlordiazepoxide",
    "choice_c": "Disulfiram",
    "choice_d": "Fluoxetine",
    "choice_e": "Naltrexone",
    "correct_answer": "E",
    "explanation": "Pharmacotherapy is appropriate for patients with moderate to severe alcohol use disorder. Naltrexone is a first-line treatment that decreases cravings and heavy drinking. It can be initiated in patients who are still drinking (Choice E). (Choice A) Bupropion is not effective in alcohol use disorder. (Choice B) Benzodiazepines are used for acute withdrawal, not maintenance treatment. (Choice C) Disulfiram is an aversive agent that does not reduce cravings directly and is reserved for highly motivated, abstinent patients. (Choice D) SSRIs are not effective for alcohol use disorder without comorbid mood disorders. Educational objective: Naltrexone is a first-line treatment for alcohol use disorder that reduces cravings.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_056",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 26-year-old man is brought to the physician by his former girlfriend, who became alarmed after receiving an email from him containing suicidal threats and photographs of several self-inflicted cuts on his forearm. She says that he became extremely angry and distraught when she ended their relationship 2 days ago. The patient has a history of impulsive behavior, including several reckless driving incidents and excessive spending. He describes a pattern of intense and unstable relationships and a chronic feeling of emptiness. On examination, the patient is tearful and distraught, saying, \"I can't live without her.\" He has several superficial cuts on his left forearm. Which of the following is the most appropriate initial treatment for this patient?",
    "choice_a": "Dialectical behavioral therapy",
    "choice_b": "Fluoxetine",
    "choice_c": "Lithium",
    "choice_d": "Olanzapine",
    "choice_e": "Sertraline",
    "correct_answer": "A",
    "explanation": "This patient's pattern of unstable relationships, impulsivity, suicidal gestures (email threats), self-injury (cutting), and feelings of emptiness are characteristic of borderline personality disorder (BPD). The primary treatment for BPD is psychotherapy. Dialectical behavioral therapy (DBT) is a form of CBT developed specifically for BPD that focuses on emotion regulation and distress tolerance (Choice A). There is no FDA-approved medication for BPD. (Choices B and E) Antidepressants are of minimal benefit for core BPD pathology. (Choice C) Lithium is for bipolar disorder. (Choice D) Antipsychotics may be used as adjuncts for aggression or cognitive distortions but are not first-line. Educational objective: Psychotherapy, particularly dialectical behavioral therapy, is the first-line treatment for borderline personality disorder.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_057",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 65-year-old woman comes to the office due to involuntary facial and mouth movements. The patient first noticed the condition 6 months ago with protruding and twisting movements of the tongue and puckering movements of the lips; the movements have worsened since then. She has also experienced foot-tapping movements and an uncontrollable twisting of her neck to the right side. The patient has type 2 diabetes mellitus and chronic gastroparesis. She also has a long history of bipolar disorder that has been stable over the past year on a combination of lithium and quetiapine. Other medications include metformin and metoclopramide. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Add benztropine",
    "choice_b": "Add Carbidopa-levodopa",
    "choice_c": "Discontinue lithium",
    "choice_d": "Discontinue metoclopramide",
    "choice_e": "Switch quetiapine to risperidone",
    "correct_answer": "D",
    "explanation": "This patient's involuntary movements (tongue protrusion, lip puckering, foot tapping) are characteristic of tardive dyskinesia (TD). TD results from prolonged exposure to dopamine receptor blockers. While quetiapine is an antipsychotic, it has a very low risk of TD. Metoclopramide, used for gastroparesis, is a potent dopamine antagonist and a common cause of TD, especially in older women with diabetes. The first step in management is to discontinue the offending drug (Choice D). (Choice A) Benztropine can exacerbate TD. (Choice B) Carbidopa-levodopa can worsen dyskinetic movements. (Choice C) Lithium does not cause TD. (Choice E) Risperidone has a higher risk of EPS/TD than quetiapine. Educational objective: Tardive dyskinesia is a movement disorder due to prolonged dopamine blockade. Metoclopramide should be discontinued if TD develops.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_058",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 32-year-old woman comes to the office due to fatigue and loss of energy. She sleeps poorly due to multiple awakenings to feed her 3-month-old son, and it takes her a long time to fall back asleep. During the day, the patient is able to nap when the baby is sleeping but still feels tired all the time. Although the baby is healthy, she worries about him constantly. She has trouble concentrating and fears that she will neglect some aspect of his care. The patient says, \"I was elated for the first few weeks after giving birth, but for the last couple of months I haven't been able to enjoy him and just feel I am a bad mother.\" Which of the following is the most likely diagnosis?",
    "choice_a": "Adjustment disorder",
    "choice_b": "Generalized anxiety disorder",
    "choice_c": "Postpartum blues",
    "choice_d": "Postpartum depression",
    "choice_e": "Postpartum thyroiditis",
    "correct_answer": "D",
    "explanation": "This patient's symptoms of fatigue, insomnia, poor concentration, constant worry, and anhedonia (unable to enjoy her baby) occurring within the postpartum period and lasting more than 2 weeks are consistent with postpartum depression (PPD). Guilt (\"bad mother\") is also common. (Choice B) While she has anxiety, the presence of anhedonia and depressed mood makes PPD more likely. (Choice C) Postpartum blues are milder, peak at 5 days, and resolve within 2 weeks. (Choice E) Postpartum thyroiditis can cause fatigue but would not explain the psychological symptoms of anhedonia and guilt. Educational objective: Postpartum depression is diagnosed when a major depressive episode occurs after delivery and lasts longer than 2 weeks.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_059",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 63-year-old woman comes to the office for her annual checkup. Her medical problems include intermittent insomnia and chronic headaches and stomach pains for several years. She reports no significant change in the frequency and intensity of her headaches or any change in bowel habits. The patient has a history of major depressive disorder treated with citalopram 20 mg. She reports that her mood is \"okay” and her appetite is good. She does not use tobacco or alcohol but confides, \"I'm worried about my husband because he has been under a lot of stress lately and his drinking is getting worse. We have been arguing and he promises that he will cut down his drinking, but it has been difficult.\" Vital signs are within normal limits. Physical examination shows mild bruising on her arms that the patient says she sustained while moving heavy furniture. She is tearful when discussing her husband but denies depression. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Encourage AA participation for husband",
    "choice_b": "Enquire about depressive symptoms",
    "choice_c": "Explore reasons for remaining in marriage",
    "choice_d": "Recommend couple's therapy",
    "choice_e": "Screen the patient for intimate partner violence",
    "correct_answer": "E",
    "explanation": "All patients should be screened routinely for intimate partner violence (IPV). Clues in this patient include distressed affect, poorly explained bruises, and reports of her husband's escalating alcohol use. The priority is to ascertain whether she is being hurt or feels threatened (Choice E). (Choice B) While depressive symptoms are relevant, her immediate safety takes precedence. (Choice C) Exploring reasons for staying is inappropriate before assessing risk. (Choices A and D) These may be helpful later, but screening for IPV is the necessary first step. Educational objective: Patients should be routinely screened for intimate partner violence, especially when presenting with chronic somatic symptoms or unexplained injuries.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_060",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "A 20-year-old woman is assessed at the insistence of her parents, who are worried about her weight loss and restrictive eating habits. The patient believes she is overweight and needs to lose more weight. She exercises 3 hours a day and avoids all carbohydrates. Her BMI is 16.5 kg/m2. Physical examination shows bradycardia and fine hair on her arms. Nutritional rehabilitation and cognitive-behavioral therapy are initiated, but after 4 weeks the patient has continued to lose weight. Which of the following is the most appropriate pharmacotherapy to adjunct her treatment?",
    "choice_a": "Aripiprazole",
    "choice_b": "Bupropion",
    "choice_c": "Fluoxetine",
    "choice_d": "Olanzapine",
    "choice_e": "Sertraline",
    "correct_answer": "D",
    "explanation": "This patient has anorexia nervosa. The mainstay of treatment is nutritional rehabilitation and psychotherapy. In treatment-resistant cases where weight gain is not achieved despite these interventions, the second-generation antipsychotic olanzapine can be used as an adjunct to help accelerate weight gain (Choice D). (Choice B) Bupropion is contraindicated due to seizure risk in eating disorders. (Choices C and E) SSRIs have not been shown to be beneficial in anorexia nervosa (unlike in bulimia). Educational objective: Olanzapine is an adjunctive treatment for anorexia nervosa to assist with weight gain in resistant cases.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
  {
    "id": "Psych_061",
    "system": "Psychiatric, Behavioral & Substance Abuse",
    "stem": "An 85-year-old man comes to the office due to increasing dyspnea and fatigue, which are affecting his ability to perform activities of daily living. His medical conditions include chronic obstructive pulmonary disease and congestive heart failure. The patient's wife passed away a year ago and he is struggling to come to terms with her death. He misses her and feels hopeless that his medical conditions will ever improve. The patient has stopped going to his community recreation center as \"it is such an effort to get there and I don't enjoy it anymore.\" He admits to occasionally forgetting to take his medications. Which of the following is the best next step in management of this patient?",
    "choice_a": "Assessment for suicidal thoughts",
    "choice_b": "Education about medication adherence",
    "choice_c": "Grief counseling",
    "choice_d": "Mini-Mental Status Examination",
    "choice_e": "Referral for senior center support",
    "correct_answer": "A",
    "explanation": "This patient's sense of hopelessness, anhedonia (lack of enjoyment), fatigue, and self-isolation are concerning for depression. Elderly white men have the highest rate of suicide completion. Risk factors include age, spousal loss, living alone, and chronic physical illness. The priority is to assess for suicidal thoughts (Choice A). (Choice B) Nonadherence may be due to depression. (Choice C and E) These are helpful later, but safety assessment comes first. (Choice D) While cognitive impairment should be checked, suicidality is a more immediate concern. Educational objective: Elderly white men are at high risk for suicide. There should be a low threshold for suicide screening in this population.",
    "source": "Compressed ABIM_Psychiatric,_Behavioral_Substance_Abuse_@USMLEWorldStep3.pdf"
  },
{
"id": "Psych_062",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 43-year-old executive comes to the office for a follow-up appointment. He has been traveling between the United States and Switzerland for business every 2 months. Each time he flies to Switzerland, he has difficulty adjusting to the time difference for 4-5 days afterward and is unable to sleep well at night. The patient gets irritable during work hours due to lack of sleep at night and inability to control his sleepiness during the day. He is worried that his colleagues in Switzerland have noticed his fatigue and that his work performance has suffered. He has no other medical conditions and takes no daily medications. Vitals signs are normal. Examination shows no abnormalities. Apart from advising exercise and exposure to bright light during the day, which of the following is the best recommendation for improving this patient's jet lag?",
"choice_a": "Lorazepam",
"choice_b": "Melatonin",
"choice_c": "Modafinil",
"choice_d": "No drug therapy",
"choice_e": "Zolpidem",
"correct_answer": "B",
"explanation": "Jet lag (circadian rhythm sleep-wake disorder, jet lag type) is a temporary sleep disorder that occurs when the body's internal clock (circadian rhythm) is out of sync with the local time after traveling across multiple time zones. Symptoms include insomnia, daytime sleepiness, fatigue, irritability, and gastrointestinal upset. Behavioral interventions include adjusting the sleep-wake schedule to the destination time zone before travel, avoiding alcohol and caffeine, and using timed light exposure and exercise. Pharmacotherapy can be used as an adjunct to behavioral measures. Melatonin is the most evidence-based pharmacological treatment for jet lag. It is a hormone produced by the pineal gland that helps regulate the sleep-wake cycle. Taking melatonin at the appropriate target bedtime in the new time zone can help shift the circadian rhythm and improve sleep. (Choice A) Benzodiazepines like lorazepam can help with insomnia but do not address the underlying circadian rhythm misalignment and are associated with side effects such as daytime sedation and dependency. (Choice C) Modafinil is a wake-promoting agent used for shift work disorder and narcolepsy but is not first-line for jet lag. (Choice D) While behavioral measures are important, melatonin has been shown to be effective and safe in speeding up adjustment to new time zones. (Choice E) Non-benzodiazepine hypnotics like zolpidem can help with sleep initiation but, like benzodiazepines, do not reset the circadian clock. Educational objective: Melatonin is the preferred pharmacological treatment for jet lag as it helps shift the circadian rhythm to the new time zone.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_063",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 28-year-old man is brought to the emergency department by his brother because of increasingly bizarre behavior. The patient has been claiming that he is a \"high priest of an ancient civilization\" and that he can communicate with the dead through the television. He has been spending all his money on \"sacred relics\" and has not slept in 3 days. He is extremely talkative, moving rapidly from one topic to another. His brother reports that the patient has a history of several episodes of severe depression but no prior episodes like this. He has no medical problems and takes no medications. On examination, the patient is agitated, grandiose, and has pressured speech. Physical examination is otherwise normal. Laboratory results, including toxicology, are unremarkable. Which of the following is the most likely diagnosis?",
"choice_a": "Bipolar I disorder",
"choice_b": "Bipolar II disorder",
"choice_c": "Schizoaffective disorder",
"choice_d": "Schizophrenia",
"choice_e": "Substance-induced psychotic disorder",
"correct_answer": "A",
"explanation": "This patient is experiencing a manic episode, characterized by grandiosity, decreased need for sleep, pressured speech, and psychotic features (delusions of being a high priest and communicating through the TV). The presence of a manic episode, regardless of the history of depression, meets the criteria for Bipolar I disorder. Bipolar I requires at least one manic episode. (Choice B) Bipolar II is characterized by hypomanic episodes (less severe, no psychosis, no marked functional impairment) and at least one major depressive episode. The presence of psychosis and 3 days of no sleep with marked agitation makes this mania, not hypomania. (Choice C) Schizoaffective disorder requires a period of at least 2 weeks of delusions or hallucinations in the absence of a major mood episode (manic or depressive). This patient's psychosis is occurring during a clear manic episode. (Choice D) Schizophrenia is characterized by at least 6 months of psychotic symptoms and functional decline, and the symptoms cannot be better explained by a mood disorder. (Choice E) Toxicology is negative, making this less likely. Educational objective: Bipolar I disorder is defined by the occurrence of at least one manic episode. Psychotic features can occur during manic episodes in Bipolar I.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_064",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 35-year-old woman is evaluated for a 6-month history of worrying about \"everything.\" She worries about her children's safety at school, her husband's job security, and her own health, despite no objective reasons for concern. She feels restless, easily fatigued, and has difficulty concentrating. She also reports muscle tension and difficulty falling asleep. Her symptoms have caused significant distress and she has missed several days of work. She denies a history of trauma or panic attacks. Physical examination and laboratory studies are normal. Which of the following is the best initial pharmacological treatment for this patient?",
"choice_a": "Alprazolam",
"choice_b": "Buspirone",
"choice_c": "Escitalopram",
"choice_d": "Propranolol",
"choice_e": "Quetiapine",
"correct_answer": "C",
"explanation": "The patient's presentation meets the criteria for Generalized Anxiety Disorder (GAD): excessive worry about various topics for at least 6 months, associated with at least 3 physical symptoms (restlessness, fatigue, difficulty concentrating, muscle tension, sleep disturbance). First-line pharmacological treatments for GAD include selective serotonin reuptake inhibitors (SSRIs) such as escitalopram, paroxetine, or sertraline, and serotonin-norepinephrine reuptake inhibitors (SNRIs) such as venlafaxine or duloxetine. (Choice A) Benzodiazepines like alprazolam are effective for acute symptom relief but are second-line due to risks of dependence and tolerance. (Choice B) Buspirone is a second-line agent for GAD. (Choice D) Beta-blockers are used for performance-only social anxiety but not for GAD. (Choice E) Quetiapine is an antipsychotic and not first-line for GAD. Educational objective: SSRIs and SNRIs are first-line pharmacological treatments for Generalized Anxiety Disorder.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_065",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 52-year-old woman comes to the office because of a 3-month history of feeling sad, losing interest in her hobbies, and having low energy. She has also noticed that she is waking up at 4 AM every morning and cannot fall back asleep. She has lost 5 kg (11 lb) during this time. The patient reports that these symptoms began shortly after she was diagnosed with breast cancer. She is currently undergoing radiation therapy. She has no prior psychiatric history. Her medical history is significant for hypertension. On examination, her mood is depressed and she appears tearful. She has no suicidal ideation. Which of the following is the most likely diagnosis?",
"choice_a": "Adjustment disorder with depressed mood",
"choice_b": "Major depressive disorder",
"choice_c": "Normal grief reaction",
"choice_d": "Psychological factors affecting other medical conditions",
"choice_e": "Somatic symptom disorder",
"correct_answer": "B",
"explanation": "This patient meets the DSM-5 criteria for Major Depressive Disorder (MDD): at least 5 of 9 symptoms (depressed mood, anhedonia, sleep disturbance/early morning awakening, weight loss, low energy) for at least 2 weeks. Even though her symptoms followed a cancer diagnosis, the severity and number of symptoms qualify for MDD. It is important to treat depression in cancer patients as it improves quality of life and potentially treatment adherence. (Choice A) Adjustment disorder is diagnosed when symptoms develop in response to a stressor but do not meet the full criteria for MDD. (Choice C) Normal grief typically involves \"waves\" of sadness specifically related to a loss rather than persistent anhedonia and pervasive depressed mood. (Choice D) This refers to psychological issues that adversely affect the course or treatment of a medical condition, but MDD is a more specific and appropriate diagnosis here. (Choice E) Somatic symptom disorder involves excessive anxiety about physical symptoms, which is not the primary issue here. Educational objective: Major Depressive Disorder can be triggered by a serious medical illness; if full criteria are met, it should be diagnosed and treated as MDD.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_066",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 19-year-old college student is brought to the university health center by her roommate because of a sudden change in behavior. The roommate reports that the patient has been staying up all night for the past 4 days, talking rapidly, and claiming that she has \"discovered a way to solve world hunger.\" The patient has been spending her tuition money on expensive gifts for people she barely knows. On examination, the patient is hyperactive, easily distracted, and pressured in her speech. She has no prior psychiatric history. Laboratory studies, including a urine drug screen, are normal. Which of the following is the most likely diagnosis?",
"choice_a": "Brief psychotic disorder",
"choice_b": "Cyclothymic disorder",
"choice_c": "Manic episode",
"choice_d": "Schizoaffective disorder",
"choice_e": "Schizophreniform disorder",
"correct_answer": "C",
"explanation": "The patient is presenting with a classic manic episode: elevated/expansive mood, grandiosity, decreased need for sleep, pressured speech, and excessive involvement in activities with high potential for painful consequences (spending tuition money). Since this has lasted at least 4 days and involves significant functional impairment, it is a manic episode. If it lasts at least a week (or results in hospitalization), it confirms Bipolar I disorder. (Choice A) Brief psychotic disorder involves delusions/hallucinations for 1 day to 1 month but lacks the pervasive manic mood/energy features. (Choice B) Cyclothymic disorder involves at least 2 years of fluctuating hypomanic and depressive symptoms. (Choice D) Schizoaffective disorder requires mood symptoms plus at least 2 weeks of psychosis in the absence of mood symptoms. (Choice E) Schizophreniform disorder involves symptoms of schizophrenia lasting 1-6 months. Educational objective: A manic episode is characterized by a distinct period of abnormally elevated, expansive, or irritable mood and increased energy lasting at least 1 week.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_067",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 24-year-old woman comes to the office for evaluation of recurrent \"attacks\" of intense fear. During these episodes, which occur unexpectedly, she experiences a racing heart, sweating, trembling, and a feeling that she is going to die. The episodes peak within 10 minutes and last about 30 minutes. She has had 5 such episodes in the past month. Between attacks, she worries constantly about when the next one will happen. She has no medical problems and takes no medications. Physical examination and ECG are normal. Which of the following is the best long-term pharmacological treatment for this patient?",
"choice_a": "Alprazolam",
"choice_b": "Buspirone",
"choice_c": "Paroxetine",
"choice_d": "Propranolol",
"choice_e": "Quetiapine",
"correct_answer": "C",
"explanation": "The patient has Panic Disorder, characterized by recurrent, unexpected panic attacks and at least 1 month of persistent concern about future attacks. The physical symptoms (tachycardia, diaphoresis, tremors, fear of dying) are classic. First-line long-term treatments are SSRIs (like paroxetine) or SNRIs. (Choice A) Alprazolam is a benzodiazepine; it is effective for acute relief but not preferred for long-term maintenance due to dependency risks. (Choice B) Buspirone is used for GAD, not panic disorder. (Choice D) Propranolol is used for performance-only social anxiety. (Choice E) Quetiapine is an antipsychotic. Educational objective: SSRIs and SNRIs are the first-line long-term pharmacological treatments for Panic Disorder.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_068",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 78-year-old man is brought to the office by his daughter because of increasing confusion and forgetfulness over the past 6 months. The daughter reports that the patient has also become very withdrawn, has lost his appetite, and cries easily. He has stopped going to his weekly card games. On examination, the patient is slow to answer questions and often says \"I don't know.\" He scores 22/30 on the Mini-Mental State Examination (MMSE), with primary deficits in recall and concentration. His physical examination and laboratory studies, including TSH and B12, are normal. Which of the following is the most appropriate next step in management?",
"choice_a": "Begin treatment with donepezil",
"choice_b": "Begin treatment with sertraline",
"choice_c": "Order a CT scan of the head",
"choice_d": "Perform a more detailed neuropsychological evaluation",
"choice_e": "Reassure the daughter that this is normal aging",
"correct_answer": "B",
"explanation": "In an elderly patient presenting with both cognitive decline and depressive symptoms (withdrawal, crying, loss of appetite, anhedonia), \"pseudodementia\" (depression-related cognitive impairment) must be considered. In pseudodementia, patients often give \"I don't know\" answers and may have reversible cognitive deficits when the depression is treated. Sertraline (an SSRI) is a safe and appropriate choice for geriatric depression. (Choice A) Donepezil is for Alzheimer's; however, depression should be treated first if it is suspected to be the cause of cognitive issues. (Choice C) Neuroimaging is part of a dementia workup but treating the obvious depressive symptoms is an appropriate next step. (Choice D) This may be needed if he doesn't respond to antidepressants. (Choice E) This is not normal aging. Educational objective: In elderly patients with cognitive impairment and signs of depression, a trial of antidepressants is often indicated to rule out pseudodementia.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_069",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 45-year-old man with a long history of schizophrenia is seen in the clinic for a routine follow-up. He has been taking haloperidol for many years. His caseworker reports that the patient has recently developed repetitive, involuntary movements of his tongue and smacking of his lips. The patient is unaware of these movements. On examination, you observe choreoathetoid movements of the tongue and occasional grimacing. Which of the following is the most likely diagnosis?",
"choice_a": "Acute dystonia",
"choice_b": "Akathisia",
"choice_c": "Drug-induced parkinsonism",
"choice_d": "Neuroleptic malignant syndrome",
"choice_e": "Tardive dyskinesia",
"correct_answer": "E",
"explanation": "Tardive dyskinesia (TD) is a late-onset extrapyramidal symptom (EPS) occurring after prolonged use of dopamine antagonists (especially first-generation antipsychotics like haloperidol). It is characterized by involuntary, repetitive movements of the face (lip smacking, tongue protrusion), trunk, or extremities. (Choice A) Acute dystonia occurs early in treatment (hours to days) and involves muscle spasms (eg, torticollis). (Choice B) Akathisia is a feeling of inner restlessness. (Choice C) Parkinsonism involves tremors, rigidity, and bradykinesia. (Choice D) NMS is a life-threatening emergency with fever, rigidity, and autonomic instability. Educational objective: Tardive dyskinesia is characterized by involuntary choreoathetoid movements, particularly of the face and tongue, due to long-term antipsychotic use.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_070",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 22-year-old woman is brought to the emergency department after being found in a park, appearing confused and talking to people who are not there. Her parents report that she has been increasingly isolated and suspicious over the past 8 months. She dropped out of college because she believed her professors were \"beaming thoughts into her head.\" On examination, she is disheveled, has a flat affect, and describes hearing voices telling her she is \"evil.\" Laboratory studies and toxicology are normal. Which of the following is the most likely diagnosis?",
"choice_a": "Brief psychotic disorder",
"choice_b": "Delusional disorder",
"choice_c": "Schizoaffective disorder",
"choice_d": "Schizophrenia",
"choice_e": "Schizophreniform disorder",
"correct_answer": "D",
"explanation": "The patient has experienced hallucinations (voices), delusions (thought broadcasting/beaming), and negative symptoms (social isolation, flat affect) for more than 6 months (8 months reported). This meets the criteria for Schizophrenia. (Choice A) Brief psychotic disorder lasts 1 day to 1 month. (Choice B) Delusional disorder involves delusions but not the other core symptoms of schizophrenia like hallucinations or flat affect. (Choice C) Schizoaffective requires a major mood episode. (Choice E) Schizophreniform disorder lasts 1 to 6 months. Educational objective: Schizophrenia requires at least 6 months of symptoms, including at least 1 month of active-phase symptoms (delusions, hallucinations, or disorganized speech).",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_071",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 31-year-old woman with a history of bipolar disorder comes to the office for a routine checkup. She has been stable on lithium for the past 2 years. She reports that she and her husband are planning to start a family and she is concerned about the effects of lithium on a potential pregnancy. Which of the following is the most significant risk to the fetus associated with lithium use during the first trimester?",
"choice_a": "Ebstein's anomaly",
"choice_b": "Neural tube defects",
"choice_c": "Orofacial clefts",
"choice_d": "Pyloric stenosis",
"choice_e": "Renal agenesis",
"correct_answer": "A",
"explanation": "Lithium use during the first trimester of pregnancy is associated with an increased risk of Ebstein's anomaly, a congenital heart defect involving displacement of the tricuspid valve leaflets into the right ventricle. (Choice B) Neural tube defects are associated with valproate and carbamazepine. (Choices C, D, E) These are not specifically linked to lithium exposure. While the absolute risk of Ebstein's anomaly is still low, it is significantly higher than in the general population. Educational objective: Lithium exposure in the first trimester of pregnancy is associated with Ebstein's anomaly.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_072",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 25-year-old man is brought to the emergency department after a witnessed seizure. His friends report that he has been drinking heavily for several years and recently tried to stop \"cold turkey.\" On examination, the patient is tremulous, diaphoretic, and tachycardic (pulse 110/min). He is disoriented to time and place. Laboratory studies show a blood alcohol level of zero. Which of the following is the best initial treatment for this patient?",
"choice_a": "Carbamazepine",
"choice_b": "Haloperidol",
"choice_c": "Lorazepam",
"choice_d": "Phenobarbital",
"choice_e": "Phenytoin",
"correct_answer": "C",
"explanation": "The patient is experiencing alcohol withdrawal, specifically withdrawal seizures and autonomic hyperactivity (tremor, diaphoresis, tachycardia). Benzodiazepines, such as lorazepam, diazepam, or chlordiazepoxide, are the first-line treatment for alcohol withdrawal to prevent progression to delirium tremens and further seizures. (Choices A, D, E) While these are anticonvulsants, they are not the preferred treatment for alcohol withdrawal seizures. (Choice B) Haloperidol can lower the seizure threshold and is not indicated for withdrawal unless severe agitation/psychosis is present alongside benzodiazepines. Educational objective: Benzodiazepines are the first-line treatment for alcohol withdrawal and withdrawal-related seizures.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_073",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 29-year-old woman comes to the office because of a 4-month history of intense fear of being in crowded places where she might not be able to escape. She has stopped going to the grocery store and movies. She only feels safe when she is at home or with her mother. She reports having had several panic attacks in the past. Which of the following is the most likely diagnosis?",
"choice_a": "Agoraphobia",
"choice_b": "Generalized anxiety disorder",
"choice_c": "Panic disorder",
"choice_d": "Social anxiety disorder",
"choice_e": "Specific phobia",
"correct_answer": "A",
"explanation": "Agoraphobia involves intense fear or anxiety about being in situations where escape might be difficult or help might not be available (eg, crowds, open spaces, public transport). It often leads to avoidance behavior, such as staying at home. While often associated with panic disorder, it can occur independently. (Choice B) GAD involves generalized worry about many topics. (Choice C) Panic disorder involves recurrent panic attacks; however, the specific fear of situations where escape is difficult defines agoraphobia. (Choice D) Social anxiety is fear of scrutiny by others. (Choice E) Specific phobia is fear of a specific object (eg, spiders) or single situation (eg, heights). Educational objective: Agoraphobia is the fear of being in situations where escape might be difficult or embarrassing.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_074",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 48-year-old woman comes to the clinic for follow-up of her depression. She was started on fluoxetine 20 mg 4 weeks ago. She reports that her mood has improved \"about 30%\" and she is sleeping better, but she still feels low energy and lacks motivation. She has no side effects from the medication. Which of the following is the most appropriate next step in management?",
"choice_a": "Add aripiprazole",
"choice_b": "Continue fluoxetine 20 mg and reassess in 2 weeks",
"choice_c": "Increase fluoxetine to 40 mg",
"choice_d": "Switch to venlafaxine",
"choice_e": "Switch to bupropion",
"correct_answer": "C",
"explanation": "The patient has had a partial response (about 30% improvement) to a starting dose of fluoxetine after 4 weeks. In patients with a partial response and good tolerability, the most appropriate next step is to increase the dose to the next therapeutic level. (Choice A) Augmentation with an atypical antipsychotic is usually reserved for patients who have failed multiple trials or have only a partial response to a maximal dose. (Choice B) Since the dose is low and she is only partially responding, waiting is less likely to achieve remission than increasing the dose. (Choices D, E) Switching is usually indicated for non-responders or those who cannot tolerate the current medication. Educational objective: For partial response to an antidepressant after 4-6 weeks, increasing the dose is an appropriate next step if the medication is well-tolerated.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_075",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 19-year-old woman is brought to the clinic by her parents because they found hidden stashes of candy and cookies in her room and noticed she spends a lot of time in the bathroom after meals. The patient is 165 cm (5'5\") tall and weighs 59 kg (130 lb). On examination, she has dental enamel erosion and calluses on the dorsal aspect of her hands. Laboratory studies show hypokalemia and metabolic alkalosis. Which of the following is the most likely diagnosis?",
"choice_a": "Anorexia nervosa, binge-eating/purging type",
"choice_b": "Bulimia nervosa",
"choice_c": "Binge-eating disorder",
"choice_d": "Rumination disorder",
"choice_e": "Somatic symptom disorder",
"correct_answer": "B",
"explanation": "Bulimia nervosa (BN) is characterized by recurrent episodes of binge eating followed by compensatory behaviors (purging via vomiting, laxatives, or excessive exercise) to prevent weight gain. Patients with BN are typically normal weight (as this patient is with a BMI of 21.7). Physical signs include dental erosion (from stomach acid) and Russell's sign (calluses on knuckles). Labs show hypokalemia and metabolic alkalosis (from vomiting). (Choice A) Anorexia nervosa requires a significantly low body weight (BMI < 18.5). (Choice C) Binge-eating disorder involves binges but no compensatory purging. Educational objective: Bulimia nervosa involves binge eating and purging in a patient with a normal or near-normal body weight.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_076",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 42-year-old man comes to the office because he is \"tired of being a loner.\" He has never had a close friend and has never been in a romantic relationship. He works as a night security guard and enjoys the solitude. He says he does not feel lonely and has no interest in social interactions. He has no history of delusions or hallucinations. On examination, he is emotionally cold and detached. Which of the following is the most likely diagnosis?",
"choice_a": "Avoidant personality disorder",
"choice_b": "Borderline personality disorder",
"choice_c": "Schizoid personality disorder",
"choice_d": "Schizotypal personality disorder",
"choice_e": "Social anxiety disorder",
"correct_answer": "C",
"explanation": "Schizoid personality disorder is characterized by a pervasive pattern of detachment from social relationships and a restricted range of emotional expression. These individuals typically prefer solitary activities and lack the desire for close relationships. (Choice A) Avoidant personality disorder individuals desire relationships but avoid them due to fear of rejection. (Choice B) Borderline is characterized by instability and fear of abandonment. (Choice D) Schizotypal involves eccentric behavior and odd beliefs. (Choice E) Social anxiety involves fear of scrutiny. Educational objective: Schizoid personality disorder is marked by social detachment and a lack of interest in social relationships.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_077",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 55-year-old woman with a history of hypertension and osteoarthritis comes to the office due to a 2-week history of feeling severely depressed, having difficulty sleeping, and having thoughts that her internal organs are \"rotting away.\" She believes she is being punished for a minor mistake she made at work years ago. She has lost 3 kg (6.6 lb) and feels hopeless. She has no prior psychiatric history. Which of the following is the most appropriate initial treatment?",
"choice_a": "Sertraline monotherapy",
"choice_b": "Risperidone monotherapy",
"choice_c": "Sertraline plus risperidone",
"choice_d": "Valproate",
"choice_e": "Buspirone",
"correct_answer": "C",
"explanation": "The patient has Major Depressive Disorder with Psychotic Features (the delusion that her organs are rotting). First-line treatment for psychotic depression is either the combination of an antidepressant and an antipsychotic (eg, sertraline and risperidone) or electroconvulsive therapy (ECT). (Choices A, B) Monotherapy with either an antidepressant or an antipsychotic is significantly less effective than the combination. (Choice D) Valproate is a mood stabilizer for bipolar disorder. (Choice E) Buspirone is for GAD. Educational objective: Major depressive disorder with psychotic features is treated with a combination of an antidepressant and an antipsychotic.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_078",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "A 30-year-old man comes to the office complaining of difficulty falling asleep for the past month. He says he stays up until 2 AM playing video games and then has to wake up at 7 AM for work. He is exhausted during the day but feels wide awake at night. On weekends, if he is allowed to sleep in, he will sleep until 11 AM and feel perfectly rested. Which of the following is the most likely diagnosis?",
"choice_a": "Delayed sleep-wake phase disorder",
"choice_b": "Insomnia disorder",
"choice_c": "Narcolepsy",
"choice_d": "Obstructive sleep apnea",
"choice_e": "Shift work disorder",
"correct_answer": "A",
"explanation": "Delayed sleep-wake phase disorder is a circadian rhythm disorder where the internal clock is shifted later than the desired or socially acceptable time. Patients have difficulty falling asleep at conventional bedtimes but sleep normally and feel rested if allowed to follow their internal clock (eg, sleeping late on weekends). (Choice B) Chronic insomnia involves difficulty sleeping regardless of the timing or opportunity. (Choice C) Narcolepsy involves daytime sleepiness and cataplexy. (Choice D) Sleep apnea involves snoring and gasping. (Choice E) Shift work disorder occurs in people whose work hours overlap with normal sleep times. Educational objective: Delayed sleep-wake phase disorder is characterized by a persistent delay in sleep-onset and wake times.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
},
{
"id": "Psych_079",
"system": "Psychiatric, Behavioral & Substance Abuse",
"stem": "An 85-year-old man comes to the office due to increasing dyspnea and fatigue. His medical conditions include COPD and heart failure. His wife died a year ago. He feels hopeless and has stopped going to his senior center. He admits to occasionally forgetting his medications. Which of the following is the most important next step in management?",
"choice_a": "Assessment for suicidal thoughts",
"choice_b": "Education about medication adherence",
"choice_c": "Grief counseling",
"choice_d": "Mini-Mental Status Examination",
"choice_e": "Referral for senior center support",
"correct_answer": "A",
"explanation": "Elderly white men have the highest rates of completed suicide. This patient has multiple risk factors: advanced age, male gender, chronic illness (COPD, CHF), and loss of a spouse. His hopelessness and withdrawal are red flags for depression and suicide. Assessment of suicidality is the priority. (Choice B) Nonadherence may be a sign of depression/hopelessness. (Choice C) Helpful, but safety first. (Choice D) Cognitive screening is part of the workup but not the most immediate safety priority. (Choice E) He already stopped going; the underlying reason (depression/suicide risk) must be addressed. Educational objective: Elderly white men are at the highest risk for suicide completion; screening for suicidal ideation is the priority in this population.",
"source": "ABIM_Psychiatric,_Behavioral_Substance_Abuse_2.pdf"
} 
]