[
{
"id": "RENAL_001",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "Several of your patients have had an estimated glomerular filtration rate (eGFR) calculated by the hospital's laboratory based upon the patient's measured serum creatinine and other variables (ie, ethnic background, age, gender, body weight). The hospital's laboratory uses a well-recognized reference standard to calibrate creatinine measurements. Which of the following patients has a calculated eGFR that is a close approximation of their actual GFR?",
"choice_a": "45-year-old man with cirrhosis, ascites, edema, and a serum creatinine of 1.5 mg/dL",
"choice_b": "19-year-old healthy man with a serum creatinine of 0.8 mg/dL",
"choice_c": "65-year-old woman in intensive care with sepsis, oliguria, and a serum creatinine of 1.8 mg/dL",
"choice_d": "50-year-old woman with chronic kidney disease and a serum creatinine of 2.3 mg/dL",
"choice_e": "50-year-old man with a BMI of 40 kg/m^2 and a serum creatinine of 1.4 mg/dL",
"correct_answer": "D",
"explanation": "One of 3 formulas (ie, Cockcroft-Gault, MDRD, and CKD-EPI) is used by most hospital laboratories to provide clinicians with an estimated glomerular filtration rate (eGFR) for patients in whom a serum creatinine measurement is obtained. The Cockcroft-Gault formula was developed in a relatively small (n=249) population, the MDRD formula was derived from a population of Caucasians with a mean age of 51 years and a GFR of 40 mL/min, and the CKD-EPI formula was derived from individuals with normal to slightly reduced GFR. Because the formulas appear less accurate for individuals with a normal GFR, the laboratories often report an eGFR of >60 mL/min as the upper limit. For the most part, all 3 of these formulas tend to underestimate the actual GFR, and all are dependent upon accurate measurement of serum creatinine as well as a stable steady-state clinical setting. These formulas provide a reasonable estimate of GFR, with the CKD-EPI formula providing the most accurate estimate in individuals with GFR >60 mL/min From a practical perspective, eGFR measurements provide useful information for the dosing of drugs eliminated in whole or in part by the kidneys, and for the identification and classification of patients with chronic kidney disease. (Choice A) Assessment of the GFR in patients with advanced cirrhosis is difficult. GFR is often significantly diminished. Diminished muscle mass can cause a decrease in creatinine production; and ascites and edema cause an increase in the volume of distribution of creatinine. Cirrhosis is often associated with enhanced tubular secretion of creatinine. As a result of all these factors, neither the formulae used for eGFR nor the creatinine clearance measurements provide accurate estimates of GFR in cirrhosis. (Choice B) The eGFR formulas appear less accurate for young individuals with a normal GFR. (Choice C) This patient is not clinically stable and the formulae are unreliable to estimate GFR in non- steady-state conditions. (Choice E) There are a number of populations and clinical settings in which the eGFR formulas have not been validated; morbid obesity is one of these settings. Educational objective: The estimated glomerular filtration rate (eGFR) data provided by the hospital laboratory is valid only under stable clinical conditions. The commonly used formulas appear less accurate for individuals with a normal GFR.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_002",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 52-year-old woman comes to the physician for routine follow-up. She has no complaints and thinks of herself as \"pretty healthy.\" She takes lisinopril and hydrochlorothiazide for hypertension and lansoprazole for gastroesophageal reflux disease. She was treated with isoniazid for latent tuberculosis 7 years ago. Her mother died of uterine cancer at age 62. The patient does not smoke. She jogs 3 miles a day and eats a balanced diet. She takes 2000 units of vitamin D3 a day orally as a dietary supplement. Her blood pressure is 139/82 mm Hg and pulse is 74/min. Her BMI is 28 kg/m^2. There are no neck masses or lymph node enlargement. Breast examination is unremarkable. Lungs are clear to auscultation. The spleen is not palpable. There are no skin rashes. Laboratory results are as follows: Sodium 140 mEq/L, Potassium 3.8 mEq/L, Chloride 100 mEq/L, Creatinine 1.0 mg/dL, Calcium 12.0 mg/dL, Glucose 73 mg/dL, Albumin 4.0 g/dL. Repeat calcium level is 12.1 mg/dL. Hydrochlorothiazide is discontinued. Which of the following is the most likely diagnosis?",
"choice_a": "Granulomatous disease",
"choice_b": "Occult malignancy",
"choice_c": "Osteoporosis",
"choice_d": "Parathyroid adenoma",
"choice_e": "Vitamin D toxicity",
"correct_answer": "D",
"explanation": "Primary hyperparathyroidism is the most common cause of hypercalcemia. Patients with primary hyperparathyroidism are usually asymptomatic and present with incidental hypercalcemia on routine laboratory testing. However, the serum calcium in primary hyperparathyroidism is only mildly elevated. Hydrochlorothiazide can also slightly increase serum calcium to a borderline high range by increasing renal tubular calcium absorption. Patients who have overtly high serum calcium on hydrochlorothiazide generally have underlying primary hyperparathyroidism. This patient is asymptomatic and was incidentally found to have mild hypercalcemia. The most likely etiology of her hypercalcemia is primary hyperparathyroidism, which is most often caused by a parathyroid adenoma. (Choice A) Granulomatous diseases (eg, sarcoid, fungal infections, tuberculosis) cause hypercalcemia by extrarenal production of 1-alpha-hydroxylase, which in turn increases the formation of 1, 25 (OH)2 vitamin D. However, these patients generally have symptoms of the primary disease. (Choice B) Malignancy is the second most common cause of hypercalcemia. Most patients with hypercalcemia of malignancy have rapid onset with moderate to high serum calcium levels (>13 to 14 mg/dL) associated with symptoms of hypercalcemia or the primary malignancy. (Choice C) Hypercalcemia is not a feature of primary osteoporosis. (Choice E) Ingestion of very high doses of vitamin D is required for the development of toxicity. This patient is taking 2000 units of vitamin D3 daily as a supplement, which is unlikely to cause toxicity. Most guidelines state that the \"tolerable upper limit\" of daily vitamin D3 intake is 4000 units. Educational objective: Primary hyperparathyroidism is the most common cause of hypercalcemia. Serum calcium in hydrochlorothiazide-induced hypercalcemia is typically high normal or modestly elevated. The majority of hydrochlorothiazide-treated patients with overt hypercalcemia have underlying primary hyperparathyroidism.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_003",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 39-year-old man seeks care for his third episode of gross hematuria. His first episode occurred shortly after onset of an upper respiratory infection 2 years ago. His most recent episode started about 5 days ago. Both episodes lasted 5-10 days and were not associated with either flank or abdominal pain. The episodes had accompanying mild dysuria. There were no blood clots passed. He has no other medical problems. He takes no medication. There is no family history of kidney disease. His blood pressure is 132/90 mm Hg, pulse is 72/min and respirations are 12/min. Physical examination shows no significant abnormalities. The patient's laboratory studies show: Hematocrit 42%, Platelet count 280,000/mm^3, Leukocyte count 9000/mm^3, Serum creatinine 1.4 mg/dL, Total protein 7.0 g/dL, Albumin 4.0 g/dL. Urinalysis: Specific gravity 1.020, Protein 3+, Blood moderate, Glucose negative, Ketones negative, Leukocyte esterase negative, Nitrites negative, WBC 1-2/hpf, RBC many/hpf, Casts granular. Using phase-contrast microscopy, the pathologist finds several dysmorphic red blood cells in the urine. Which of the following is the most appropriate next step in management?",
"choice_a": "Antibasement membrane antibody test",
"choice_b": "Cystoscopy",
"choice_c": "Kidney CT scan",
"choice_d": "Quantitative assessment of glomerular filtration rate and proteinuria",
"choice_e": "Urine cytology",
"correct_answer": "D",
"explanation": "The significant proteinuria and dysmorphic red blood cells on urinalysis establishes glomerular disease as the most likely cause of this patient's hematuria, and the clinical presentation is suggestive of IgA nephropathy. Clinical Presentation: One or more episodes of gross hematuria after an upper respiratory infection (40%-50%); Microscopic hematuria with proteinuria on incidental urinalysis without symptoms (30%-40%); Nephritic syndrome or rapidly progressive glomerulonephritis (<10%). The table above summarizes the most common clinical presentations of IgA nephropathy, which is the most common cause of idiopathic glomerulonephritis in developed countries. Factors associated with an adverse prognosis include elevated blood pressure, lower than normal estimated glomerular filtration rate (GFR) and significant proteinuria. Thus, quantitative assessment of GFR and proteinuria to establish a baseline in this patient is the next step to predict future deterioration in renal function and therapeutic options. Renal biopsy is usually done to confirm the diagnosis in patients with protein excretion >500 mg/day, elevated serum creatinine (>1.5 mg/dL) and hypertension. (Choice A) Antibasement membrane antibody is found in patients with Goodpasture syndrome, a pulmonary-renal syndrome characterized by pulmonary hemorrhage and glomerulonephritis. Goodpasture syndrome is rarely associated with recurrent episodes of hematuria and usually causes significant pulmonary hemorrhage with markedly decreased GFR. (Choice B) Cystoscopy is indicated in the evaluation of hematuria if there is suspicion of bladder cancer. In this young patient, gross hematuria with proteinuria suggests a glomerular cause of hematuria, and cystoscopy is not indicated. (Choice C) Kidney CT scan is useful to evaluate for nephrolithiasis, chronic tubulointerstitial nephritis, or mass lesions (e.g., renal cell carcinoma). Because this patient's hematuria with proteinuria suggests a glomerular etiology, a renal CT scan would be less diagnostic. (Choice E) Urine cytology can be helpful in diagnosing cancers of the renal pelvis, ureter, and bladder. However, this patient's clinical presentation is less consistent with these diagnoses. Educational objective: The presence of significant proteinuria and dysmorphic red blood cells on urinalysis suggests a glomerular cause of hematuria. IgA nephropathy is characterized by recurrent episodes of gross hematuria (glomerulonephritis), typically following an upper respiratory infection. Factors associated with an adverse prognosis include elevated blood pressure, lower than normal estimated glomerular filtration rate, and significant proteinuria.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_004",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "You are following five patients who have had various aspects of their kidney function measured on one or more occasions over time. All patients are clinically stable without any ongoing acute events. Which of the following laboratory changes would represent the greatest loss in glomerular filtration rate?",
"choice_a": "Increase in serum creatinine from 0.8 to 1.2 mg/dL",
"choice_b": "Increase in serum creatinine from 4.0 to 8.0 mg/dL",
"choice_c": "Increase in BUN/creatinine ratio from 10 to 30",
"choice_d": "Increase in BUN from 10 to 20 mg/dL",
"choice_e": "Decrease in 24-hr urine creatinine clearance from 100 to 80 ml/min",
"correct_answer": "A",
"explanation": "The relationship between serum creatinine concentration and glomerular filtration rate (GFR) is non-linear. As a rule of thumb, every time the GFR halves, the serum creatinine doubles. For example, if you assume that the GFR is 100 ml/min, the corresponding serum creatinine would be 1.0 mg/dL. As the GFR decreases to a value of 50 ml/min, the corresponding serum creatinine would be 2 mg/dL With further decreases in GFR to 25, 12.5, and 6.25 ml/min, the corresponding serum creatinine concentrations would be 4.0, 8.0, and 16.0 mg/dL, respectively. This curvilinear relationship between GFR and serum creatinine is such that when the GFR is normal, relatively large decreases in GFR result in only small increases in serum creatinine (Choice A). Thus, when baseline serum creatinine is normal, serum creatinine is an insensitive indicator for decreasing GFR. (Choice B) When GFR is significantly decreased at baseline, small decrements in GFR produce relatively large changes in serum creatinine. The estimated loss of GFR with an increase in serum creatinine from 4.0 to 8.0 mg/dL is modest at about 12.5 ml/min. (Choices C & D) Blood urea nitrogen (BUN) is more affected than serum creatinine by factors other than GFR. For example, high protein diet, upper gastrointestinal hemorrhage, and the anti-anabolic effects of corticosteroids can increase BUN without affecting GFR and serum creatinine. Neither the BUN/creatinine ratio nor small changes in BUN are helpful indicators of GFR. (Choice E) A 24-hour urine collection for creatinine clearance is rarely done at present. Despite detailed instruction, it is difficult to obtain accurate collections. The 20 ml/min calculated decrease in creatinine clearance is modest and likely significantly less than that in choice A. Educational objective: The relationship between serum creatinine concentration and glomerular filtration rate (GFR) is non-linear; every time the GFR halves, the serum creatinine doubles. When the GFR is normal, relatively large decreases in GFR result in only small increases in serum creatinine. Conversely, when the GFR is significantly decreased, small decrements in GFR produce relatively large changes in serum creatinine.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_005",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 45-year-old man is evaluated for recurrent urolithiasis. He underwent a Roux-en-Y procedure for morbid obesity two years ago. He passed his first kidney stone one year ago and has passed several since then. He has lost approximately 15 kg (33 lb) since the surgery and feels well otherwise. His current medications include lisinopril for hypertension, esomeprazole for gastro-esophageal reflux disease, and a daily multivitamin. He has no family history of kidney stones. Which of the following factors is most likely responsible for this patient's kidney stone formation?",
"choice_a": "High urinary oxalate and low urinary citrate",
"choice_b": "Hypercalciuria",
"choice_c": "Hyperuricosuria and low urine pH",
"choice_d": "Low urinary volume",
"choice_e": "Vitamin D deficiency",
"correct_answer": "A",
"explanation": "This bariatric surgery patient has recurrent urolithiasis that is likely due to calcium oxalate stones caused by hyperoxaluria and hypocitraturia. Calcium oxalate stones commonly occur in patients with malabsorption due to small bowel disease (e.g., Crohn's disease), bowel resection with intestinal bypass (e.g., bariatric surgery), and cystic fibrosis. Malabsorption causes more intestinal fatty acid binding to calcium, which increases colonic oxalate absorption and renal oxalate excretion. Malabsorption also causes low urinary citrate due to unclear reasons. One possibility is hypokalemia or chronic metabolic acidosis (from malabsorptive diarrhea), leading to increased citrate reabsorption in the renal proximal tubules. Since citrate is an inhibitor of kidney stones, the combined effect of hyperoxaluria and hypocitraturia increases the risk of kidney stones by up to 4% per year. Patients can be treated with a low oxalate diet and exogenous citrate supplementation. (Choice B) Hypercalciuria is most commonly associated with calcium stones seen in primary hyperparathyroidism and chronic metabolic acidosis. However, it is not a significant contributor to malabsorption-associated kidney stone formation. (Choice C) Hyperuricosuria and low urine pH are known risk factors for uric acid stones; however, they are not associated with calcium oxalate stones due to malabsorption. (Choice D) Patients with bowel disorders and significant diarrhea can have low urinary volumes, which by itself is not a significant risk factor for calcium oxalate stones. Low urinary volume can contribute to uric acid and calcium oxalate stones when combined with low urine pH, metabolic acidosis, and hypocitraturia. (Choice E) The Roux-en-Y procedure can lead to decreased absorption of fat-soluble vitamins (e.g.. vitamin D), but vitamin D excess (not deficiency) is associated with calcium stones. Educational objective: Recurrent urolithiasis commonly occurs in gastric bypass patients due to hyperoxaluria and hypocitraturia. Treatment involves a low oxalate diet and exogenous citrate supplementation.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_006",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 45-year-old woman comes to the physician because of frequent urination for the last six months. She states that she has been waking up several times at night to urinate. These symptoms also disrupt her professional work schedule. She has been taking lithium to treat a mood disorder for the past 5 years. She has tried many other drugs for her mood disorder, but none have been as successful as lithium. She is adherent to her treatment and has her lithium level measured regularly. She had one episode of mild lithium toxicity two years ago. Her physical examination is unremarkable. Laboratory results are as follows: Creatinine 1.6 mg/dL, Calcium 9.8 mg/dL, Glucose 78 mg/dL. Urinalysis: Protein trace, Glucose negative, WBC none, RBC none, Casts none. Water deprivation test: Urine osmolality (baseline) 300 mOsm/kg, Urine osmolality (after DDAVP) 325 mOsm/kg. Which of the following would be the best initial treatment for this patient?",
"choice_a": "Amiloride",
"choice_b": "DDAVP",
"choice_c": "Fluid restriction",
"choice_d": "High dietary solute intake",
"choice_e": "NSAIDs",
"correct_answer": "A",
"explanation": "This patient's presentation is consistent with lithium-induced nephrogenic diabetes insipidus (DI). Chronic lithium use can cause chronic interstitial nephritis, type I distal renal tubular acidosis, hyperparathyroidism with hypercalcemia, and nephrogenic DI (up to 20-40% of patients). Lithium induces ADH resistance by impairing water channel function and water reabsorption in the collecting duct. Patients typically present with acute onset nocturia and polyuria. However, patients taking lithium may also develop central Di or primary polydipsia due to their underlying psychiatric condition. Thus, the diagnosis must be confirmed with a water deprivation test, since the treatment differs for these conditions. With nephrogenic DI, the change in urine osmolality is minimal after DDAVP administration (central DI has > 50% increase in urine osmolality). Lithium-induced nephrogenic DI may be permanent or partially reversible and discontinuation of lithium is preferred. Patients who cannot stop lithium should be treated with salt restriction and selected diuretics (i.e., amiloride or thiazides). Amiloride blocks sodium channels in the collecting ducts to prevent lithium's cellular entry, while thiazides combined with sodium restriction promote a mild hypovolemia that acts to increase proximal sodium and water reabsorption. However, serum lithium levels increase with both options and require close monitoring. (Choice B) High-dose DDAVP is an alternative therapeutic option in patients who do not respond to diuretics, and it is sometimes effective in partially reversible nephrogenic DI. (Choice C) Fluid restriction will decrease urine volume, but this could lead to significant extracellular fluid volume depletion and worsen this patient's renal function. (Choice D) Urine osmolality is usually fixed in nephrogenic DI; thus, the amount of excreted solute directly affects urine volume. Reducing solute intake can decrease urine volume, but increasing intake will have the opposite effect and worsen this patient's polyuria. (Choice E) NSAIDs decrease glomerular filtration rate, enhance tubular solute reabsorption, and can significantly decrease urine output in some cases of nephrogenic DI. However, this patient has a low GFR (creatinine of 1.6 mg/dL) and NSAIDs could further decrease the GFR. Educational objective: Lithium can be associated with nephrogenic DI in up to 20-40% of patients. Symptomatic patients should discontinue lithium. Patients who cannot stop lithium may be treated with salt restriction and a trial of diuretics (i.e., amiloride or thiazides) with careful monitoring of renal function and serum lithium levels.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_007",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 55-year-old man comes to the emergency department with severe right flank pain. CT scan shows a 5-mm stone in the right ureter and several smaller stones in both renal pelvices. Urinalysis results: Urine pH 4.5 (normal 5-6), White blood cells Absent, Red blood cells 50-100/hpf, Bacteria Absent, Nitrites Negative, Esterase Negative. The patient subsequently passes a stone and analysis shows it to be composed of predominantly uric acid. Besides high fluid intake, which of the following would be most helpful for this patient to prevent recurrent stones?",
"choice_a": "Calcium-restricted diet",
"choice_b": "Furosemide",
"choice_c": "High-protein diet",
"choice_d": "Hydrochlorothiazide",
"choice_e": "Potassium citrate",
"correct_answer": "E",
"explanation": "Uric acid stones account for approximately 10%-15% of nephrolithiasis cases. These are most commonly seen in patients with unusually low urine pH (which may be due to a defect in renal ammonia excretion) and hyperuricosuria. Uric acid stones are radiolucent on conventional radiographs but can often be seen on renal ultrasound or CT scan. Treatment of uric acid stones includes hydration, alkalinization of the urine, and a low-purine diet. Alkalinization of the urine to pH 6.0-6.5 with oral potassium citrate is recommended as uric acid stones are highly soluble in alkaline urine. In addition to alkalinizing the urine, citrate is a stone inhibitor and reduces crystallization. Allopurinol can be added if there are recurrent symptoms despite initial measures, especially if hyperuricosuria or hyperuricemia occurs. (Choice A) A calcium-restricted diet is not beneficial in the management of uric acid stones. It is not advised even in patients with calcium stones, as calcium restriction can potentially cause a negative calcium balance and hyperoxaluria due to the resulting increase in gastrointestinal absorption of oxalate. (Choice B) Furosemide increases urinary calcium excretion, and the resulting hypercalciuria can increase the risk of calcium stone formation. (Choice C) A purine-restricted (not high-protein) diet is indicated in patients with uric acid stones secondary to hyperuricosuria. (Choice D) Hydrochlorothiazide decreases urinary calcium excretion and is used in the management of recurrent hypercalciuric renal stones. Educational objective: Uric acid stones are often radiolucent but may be seen on ultrasound or CT scan. They are highly soluble in alkaline urine; alkalinization of the urine to pH 6.0-6.5 with oral potassium citrate is the treatment of choice. Allopurinol can be added if there are recurrent symptoms despite initial measures, especially if hyperuricosuria or hyperuricemia occurs.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_008",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 43-year-old man comes to the physician because of weakness and arthralgias for the last four months. He also has a pruritic rash on his legs that appeared two months ago. He denies fever or chills and his weight has been stable. His blood pressure is 140/90 mm Hg and pulse is 84/min. A rash is present on both lower extremities below the knees that consist of many erythematous macules. Laboratory results are as follows: Hematocrit 34%, Platelets 140,000 cells/uL, Leukocyte count 3,000 cells/uL. Creatinine 1.7 mg/dL, Albumin 3.1 g/dL, AST 78 U/L, ALT 99 U/L. Urinalysis: Protein +3, Blood moderate, Red blood cells 20-30/hpf. Complement: C3 50 mg/dL, C4 10 mg/dL (12-75 mg/dL). Rheumatoid factor 90 U/mL (< 40 U/mL). HIV antibody negative. Which of the following would be most helpful in establishing the diagnosis in this patient?",
"choice_a": "Anti-phospholipid antibodies",
"choice_b": "Bone marrow biopsy",
"choice_c": "Serum protein electrophoresis",
"choice_d": "Urine toxicology screen",
"choice_e": "Viral hepatitis serologies",
"correct_answer": "E",
"explanation": "This patient's presentation is consistent with mixed cryoglobulinemia causing glomerulonephritis. Cryoglobulinemia is classified as either type I or mixed (types II and III). Diagnosis is suggested by elevated cryoglobulins (cryocrit), ESR, CRP, autoantibodies (e.g., RF, ANA), and clinical symptoms (summarized in table). Mixed cryoglobulinemia is commonly associated with hepatitis C and elevated liver function tests, and more than 60% of patients with hepatitis C have cryoglobulins. Approximately 20% of patients with cryoglobulinemia develop renal disease, which is usually glomerulonephritis from hepatitis C-containing immune complexes. Patients with hepatitis C-associated cryoglobulinemia have a higher risk of developing lymphoma up to 5-10 years later. Treatment involves eradicating HCV, immunosuppression (eg, prednisone, cyclophosphamide), and/or plasmapheresis for moderate-severe cryoglobulinemia. (Choice A) Anti-phospholipid antibody syndrome (APS) can also cause anemia, thrombocytopenia, livedo reticularis, and glomerulonephritis. However, this patient has increased AST and ALT and low albumin, suggesting chronic liver disease. Also, most patients with APS have thrombotic episodes (eg. DVT. strokes). (Choice B) Bone marrow biopsy is more useful in type I cryoglobulinemia to diagnose an underlying hematological condition with bone marrow involvement. However, this patient likely has mixed cryoglobulinemia and would not need a bone marrow biopsy. (Choice C) Serum protein electrophoresis can help diagnose underlying plasma cell disorders (eg. multiple myeloma or Waldenström's macroglobulinemia), but they are associated more with type I than mixed cryoglobulinemia. (Choice D) Heroin users can develop membranous nephropathy (due to hepatitis B), membranoproliferative glomerulonephritis (due to hepatitis C), or focal segmental glomerulosclerosis. However, this patient's presentation is consistent with vasculitis. Viral serologies are more likely to give a correct diagnosis in this patient given the low white cell count, thrombocytopenia, and increased AST/ALT. Educational objective: Mixed cryoglobulinemia is commonly associated with hepatitis C and can cause glomerulonephritis. Treatment includes eradicating hepatitis C and immunosuppression and/or plasmapheresis for cryoglobulinemia.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_009",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 27-year-old man comes to the physician because of a 10-day history of crampy lower abdominal pain and diarrhea that awakens him at night. He says he might have some blood in his stool, but he is not sure. He also complains of fatigue. His past medical history is unremarkable. He takes a daily multivitamin and exercises regularly. He has a stable male partner and uses condoms regularly. His mother died of lymphoma and his older brother suffers from ulcerative colitis. He is afebrile. His blood pressure is 130/88 mm Hg, pulse is 90/min, and respirations are 12/min. His bowel sounds are normoactive. There is mild abdominal tenderness in both lower quadrants without rebound tenderness. The patient's labs reveal: Hematocrit 24%, MCV 87 fl, Platelets 55,000 cells/uL, Leukocyte count 11,000 cells/uL. Sodium 140 mEq/L, Potassium 4.4 mEq/L, Chloride 102 mEq/L, Bicarbonate 22 mEq/L, Creatinine 2.4 mg/dL. Which of the following is the best next step in managing this patient?",
"choice_a": "Antimotility drugs",
"choice_b": "Peripheral blood smear",
"choice_c": "Empiric antibiotics",
"choice_d": "Sigmoidoscopy",
"choice_e": "Stool cultures",
"correct_answer": "B",
"explanation": "This patient's presentation (anemia, thrombocytopenia, and acute kidney injury after a recent diarrheal illness) is concerning for hemolytic-uremic syndrome (HUS), most commonly caused by a shiga toxin- producing enterohemorrhagic E. coli. HUS is more common in children (but can also be seen in adults) and is similar to thrombotic thrombocytopenic purpura (TTP), which is more commonly seen in adults. However, HUS is associated with more renal disease and fewer primary neurological symptoms than TTP. The diagnosis of HUS is made clinically in patients who present with the classic triad after a prodromal diarrheal illness. As a result, a peripheral blood smear should be done next to look for schistocytes (fragmented blood cells), indicating a microangiopathic hemolytic anemia. (Choice A) Antimotility drugs (anticholinergics and narcotics) do not decrease the gastrointestinal symptoms, but can worsen HUS by increasing the risk of central nervous system dysfunction. As a result, antimotility agents are not recommended for a patient with suspected HUS from enterohemorrhagic E. coli. (Choice C) Empiric antibiotics do not decrease the duration of gastrointestinal symptoms and can possibly worsen HUS by increasing shiga toxin release. (Choice D) Sigmoidoscopy is indicated to evaluate for colitis, which can sometimes mimic HUS. However, the thrombocytopenia and renal injury are usually not seen in colitis and makes it less likely in this patient. (Choice E) Stool cultures are not as sensitive to detect enterohemorrhagic E. coli, since the bacteria may only be present in the stool for a few days after the onset of the illness. Serologic testing for E. coli is more sensitive. Educational objective: Hemolytic-uremic syndrome is associated with a prodromal diarrheal illness, usually caused by a shiga toxin-producing enterohemorrhagic E. coli leading to microangiopathic hemolytic anemia, thrombocytopenia, and acute kidney injury. The diagnosis is made clinically and can be evaluated with peripheral blood smear to look for schistocytes as well as serologic testing for enterohemorrhagic E. coli.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_010",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 28-year-old woman comes to the office because of frequent urination. She urinates approximately every 30 to 60 minutes during the day, which makes it difficult to concentrate at work and attend meetings. She also gets up 1 to 2 times per night to urinate. The patient drinks \"a lot of fluid to stay caught up.\" She says that her 'migraines' have worsened recently and she occasionally feels nauseated. She got a new pair of glasses due to worsening of her vision, which she attributes to spending a lot of time at work. She has had no lower abdominal pain or dysuria. Her other medical problems include anxiety disorder and knee trauma that she sustained three months ago while jogging. She required arthroscopic surgery and took opioid medications for pain control for two weeks. She has not experienced any knee pain since. Her BMI is 18 kg/m^2. Laboratory results show Sodium 136 mEq/L, Potassium 3.8 mEq/L, Creatinine 0.8 mg/dL. Urinalysis: Specific gravity 1.010, PH 5.6. Eight hours following a water deprivation, her weight remains unchanged and her plasma and urine osmolalties are 284 and 650 mOsm/kg H2O respectively. Which of the following is the most likely diagnosis?",
"choice_a": "Amphetamine abuse",
"choice_b": "Central diabetes insipidus",
"choice_c": "Nephrogenic diabetes insipidus",
"choice_d": "Primary polydipsia",
"choice_e": "Surreptitious diuretic use",
"correct_answer": "D",
"explanation": "This patient presents with polyuria with dilute urine and increased water intake, which is usually due to diabetes insipidus (DI) or primary polydipsia. However, the polyuria with water loss is appropriate in polydipsia but inappropriate in DI. Serum Na > 145 mEq/L with a urine osmolality < serum osmolality excludes primary polydipsia and suggests DI. However, patients with an intact thirst mechanism will have adequate water intake to compensate for the water loss and may have a normal sodium level (as in this patient). In cases where a clinical diagnosis is difficult, a water deprivation test should be done to confirm the diagnosis. However, patients suspected of having nephrogenic DI should receive desmopressin without water deprivation and be monitored for a lack of response. This patient is able to concentrate her urine and preserve her plasma osmolality at a normal level in response to observed water deprivation. This suggests that antidiuretic hormone (ADH) release and action are both intact and that the cause of her polyuria is excess fluid intake (primary polydipsia). Her urinary concentration may be subnormal due to chronic water diuresis. (Choice A) Amphetamine abuse can lead to hyponatremia due to increased fluid intake (from hyperthermia) and persistent secretion of ADH that decreases water excretion. This patient's water deprivation test is more consistent with primary polydipsia. (Choice B) Central diabetes insipidus would be associated with weight loss, increasing plasma osmolality (due to renal water loss), and urine osmolality < 300 mOsm/kg in response to water deprivation. (Choice C) Nephrogenic diabetes insipidus would not be associated with an increase in urine osmolality to this level with water deprivation. (Choice E) Chronic diuretic use/abuse is usually associated with hypokalemic alkalosis, which is not present in this patient. Educational objective: Polyuria and polydipsia can be due either to a solute diuresis (usually uncontrolled diabetes mellitus with glycosuria) or a water diuresis. Water diuresis can be due to impaired ADH secretion (central DI), impaired action of ADH on the kidney (nephrogenic DI), or excess fluid intake. The response to controlled/observed water deprivation differentiates among these possibilities.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_011",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 45-year-old man comes to the emergency department due to shortness of breath. He was diagnosed with idiopathic membranous nephropathy 6 months ago during evaluation of anasarca. Blood pressure is 144/84 mm Hg, pulse is 112/min and regular, and respirations are 18/min. Oxygen saturation is 91% while breathing ambient air. The lungs are clear on auscultation. The patient has 2+ bilateral, lower extremity pitting edema. Laboratory results: Creatinine 1.8 mg/dL, Albumin 2.0 g/dL, Troponin I 0.3 ng/mL (normal: <0.012 ng/mL), B-type natriuretic peptide 233 pg/mL. Urinalysis: Protein 3+, Red blood cells 5-10/hpf. ECG shows sinus tachycardia with nonspecific ST-T changes. Which of the following conditions is most likely associated with this patient's current symptoms?",
"choice_a": "Drug-associated pulmonary toxicity",
"choice_b": "Occlusion of the right coronary artery",
"choice_c": "Rapid accumulation of pericardial fluid",
"choice_d": "Stenosis of the renal arteries",
"choice_e": "Thrombosis of the renal veins",
"correct_answer": "E",
"explanation": "This patient with membranous nephropathy (a nephrotic syndrome) and acute-onset shortness of breath, chest pain, and tachycardia likely has a pulmonary embolism (PE) In patients with nephrotic syndrome, PE is often the presenting manifestation of chronic renal venous thrombosis (RVT). Patients with nephrotic syndrome (urine protein >3.5 g/day, albumin <3 g/dL edema) have a markedly increased risk of (venous > arterial) thrombosis, with 12%-30% of patients developing PE. The hypercoagulable state is likely due to both urinary loss of antithrombin III and plasminogen and increased levels of fibrinogen with platelet activation. Membranous nephropathy, the most common cause of nephrotic syndrome, carries the highest risk of thrombosis; up to 60% of patients with membranous nephropathy will develop RVT. This risk is particularly high in patients with >10 g/day of urinary protein or <2 g/dL of serum albumin. RVT that develops in membranous nephropathy is typically chronic, asymptomatic, and often not associated with worsening renal function or proteinuria (as opposed to acute RVT, which presents with pain, hematuria, and renal failure). The thrombus can propagate into the inferior vena cava and embolize into the pulmonary vasculature, resulting in PE (often the only manifestation of chronic RVT). Diagnosis of RVT can be made by selective venography, Doppler ultrasound, CT scan, or MRI; however, routine screening in membranous nephropathy is not recommended. Treatment is anticoagulation. (Choice A) Cyclophosphamide pulmonary toxicity typically results in a pneumonitis with symptoms of cough, fatigue, and dyspnea. It would be unlikely to cause acute chest pain, tachycardia, and a troponin elevation. (Choice B) Right coronary artery myocardial infarction causes an inferior wall myocardial infarction; however, an ECG would show ST elevations in the inferior leads (II,III, and aVF). The troponin elevation is likely due to right heart strain from acute PE. (Choice C) Pericardial effusions can cause shortness of breath and tachycardia; however, patients typically have elevated jugular venous distension, hypotension, and low voltages on ECG. (Choice D) Bilateral renal artery stenosis can cause flash pulmonary edema (Pickering syndrome); however, this typically presents with hypoxia, severe hypertension, and jugular venous distension. Educational objective: Nephrotic syndrome, particularly membranous nephropathy, is associated with a high frequency of thromboembolic events, predominately deep venous and renal venous thrombosis. Renal venous thrombosis is often asymptomatic; pulmonary embolism may be the presenting sign.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_012",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 40-year-old man with end-stage renal disease has been on chronic hemodialysis for 3 years. Parathyroid hormone and alkaline phosphatase levels have increased progressively despite efforts to maintain normal serum phosphorus. Labs: Creatinine 4.8 mg/dL, Calcium 9.6 mg/dL, Phosphorus 5.1 mg/dL, PTH 700 pg/mL, Vitamin D 60 ng/mL. Adding cinacalcet to this patient's regimen would most likely contribute to which of the following?",
"choice_a": "Decreased need for parathyroidectomy",
"choice_b": "Decreased occurrence of cardiovascular events",
"choice_c": "Development of osteitis fibrosa",
"choice_d": "Prolonged overall survival",
"choice_e": "Symptomatic hypercalcemia",
"correct_answer": "A",
"explanation": "Untreated or inadequately treated hyperphosphatemia and hypocalcemia in chronic kidney disease lead to secondary hyperparathyroidism. Calcimimetics increase the calcium sensitivity of calcium-sensing receptors on parathyroid glands and reduce serum PTH, calcium, and phosphate levels. Cinacalcet (Sensipar®) reduces fracture risk and improves symptoms of secondary hyperparathyroidism (eg, pruritus, bone pain, fractures, calciphylaxis, and avascular necrosis). Cinacalcet decreases the need for parathyroidectomy by approximately 50%. However, calcimimetics should not be used in patients with hypocalcemia as they may cause seizures and prolong the QT interval. (Choices B and D) Cinacalcet has been shown to reduce cardiovascular risk in patients age >65 but not in younger individuals. (Choice C) Cinacalcet decreases bone turnover due to secondary hyperparathyroidism and therefore reduces the risk for osteitis fibrosa development. (Choice E) The major side effects of cinacalcet are hypocalcemia and gastrointestinal disturbances. Educational objective: Calcimimetics such as cinacalcet decrease the frequency of fractures and the rate of parathyroidectomy in patients with chronic kidney disease who have hyperphosphatemia and secondary hyperparathyroidism. Calcimimetics also reduce the risk of cardiovascular disease in older patients (age >65). Major side effects are hypocalcemia and gastrointestinal disturbances.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_013",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 67-year-old man with a history of granulomatosis with polyangiitis (Wegener's) treated with cyclophosphamide 3 years ago presents with gross hematuria and passage of blood clots in his urine. He reports mild dysuria but denies fever, flank pain, or trauma. Blood pressure 130/86 mm Hg. Labs: Creatinine 1.7 mg/dL (unchanged), INR 1.0, aPTT 23 sec. Urinalysis shows gross blood and +1 protein. Which of the following would have the highest diagnostic yield?",
"choice_a": "Abdominal CT scan without contrast",
"choice_b": "ANCA, C-reactive protein, and ESR",
"choice_c": "Cystoscopy",
"choice_d": "Phase contrast microscopy of urine red blood cell morphology",
"choice_e": "Ultrasound-guided renal biopsy",
"correct_answer": "C",
"explanation": "When hematuria is of renal glomerular or tubular/interstitial origin, a relatively small amount of blood is diluted by tubular fluid and urine. Consequently, glomerular and other intrarenal causes of hematuria are rarely, if ever, associated with the passage of clots into the urine. This patient has a history of cyclophosphamide exposure and presents with painless hematuria in the absence of urinary tract symptoms. Evaluation for bladder lesions via cystoscopy would have the highest diagnostic yield. Cyclophosphamide can induce a chemical cystitis and be associated with the development of bladder cancer. (Choice A) An abdominal CT to look for a renal tumor or stones is appropriate; however, given this patient's history, cystoscopy is of higher diagnostic yield. (Choice B and E) Measurement of ANCA, C-reactive protein, and ESR may help ascertain the activity of granulomatosis with polyangiitis, and biopsy can diagnose kidney involvement. However, this patient has a non-glomerular source for his hematuria (clots) and cystoscopy is the diagnostic test of choice. (Choice D) Dysmorphic red blood cells are highly suggestive of a glomerular source, as are RBC casts and >500 mg/day of proteinuria. In this patient, the passage of urinary clots strongly suggests an extra-glomerular site of bleeding, and cystoscopy should be performed. Educational objective: In patients with hematuria, the passage of blood clots in the urine indicates a non-glomerular source of urinary tract bleeding. Thus, evaluation should proceed accordingly.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_014",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 67-year-old man with type 2 diabetes mellitus and hypertension presents with 3 months of progressive bilateral leg, arm, and lower back swelling, and exertional dyspnea. Exam shows distended jugular veins, an S4 heart sound, bibasilar crackles, hepatomegaly, and 4+ pitting edema. Labs: Creatinine 1.7 mg/dL, Albumin 2.2 g/dL, Total cholesterol 320 mg/dL, HbA1c 6.5%. Urinalysis: Protein 4+, RBCs 1-2/hpf, no casts. ECG shows low-voltage QRS complexes. Which of the following is the most likely diagnosis?",
"choice_a": "Diabetic nephropathy",
"choice_b": "Focal segmental glomerulosclerosis",
"choice_c": "Idiopathic membranous nephropathy",
"choice_d": "IgA nephropathy",
"choice_e": "Primary amyloidosis",
"correct_answer": "E",
"explanation": "This patient's heavy proteinuria, peripheral edema, and low albumin suggest nephrotic syndrome (NS). This patient's clinical findings of heart failure and low-voltage QRS complexes suggest restrictive cardiomyopathy. The combination of restrictive cardiomyopathy and NS is consistent with amyloidosis, which causes up to 20% of NS in patients age >60. Amyloidosis is characterized by extracellular fibrillar deposition of low molecular weight proteins. Amyloid light-chain (AL, or primary) amyloidosis is due to deposition of monoclonal immunoglobulin light chains. (Choice A) Diabetes can cause neuropathy and restrictive cardiac disease, but retinopathy is usually present, and HbA1c would typically be higher. (Choices B and C) FSGS and membranous nephropathy cause NS but are not usually associated with neuropathy or restrictive cardiomyopathy. (Choice D) IgA nephropathy typically presents with significant hematuria and dysmorphic RBCs. This patient's bland urinary sediment makes this less likely. Educational objective: Amyloidosis (primary [AL] or secondary [AA]) is a common cause of nephrotic syndrome in patients age >60. Other common manifestations include restrictive cardiomyopathy with heart failure.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_015",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "An 18-year-old man is found to have 2+ proteinuria on a college physical urinalysis. He is asymptomatic and healthy. Blood pressure 120/76 mm Hg. Labs: Creatinine 0.8 mg/dL, Albumin 4.2 g/dL. 24-hour urine protein is 2,100 mg and creatinine clearance is 121 mL/min. Which of the following is the most appropriate course of action?",
"choice_a": "HIV testing",
"choice_b": "Kidney biopsy",
"choice_c": "Kidney CT scan",
"choice_d": "Spot urine protein/creatinine ratio upon arising and at the end of the day",
"choice_e": "Urinary protein electrophoresis",
"correct_answer": "D",
"explanation": "This patient presents with isolated proteinuria (proteinuria without hematuria or elevated creatinine). Orthostatic proteinuria is a condition seen in children and young adults under 30, characterized by significant proteinuria in the upright position but minimal to no proteinuria in the supine position. A spot urine sample for protein and creatinine should be collected during the first morning void (supine) and then later in the day (upright). Demonstration of little to no proteinuria in the morning compared to significant proteinuria later supports the diagnosis. (Choice A) HIV nephropathy can present as proteinuria, but the patient is low risk. (Choice B) In the absence of active renal disease, biopsy is not indicated. (Choice C) There is no indication for imaging with normal renal function. (Choice E) Electrophoresis is not indicated without evidence of systemic disorder. Educational objective: Orthostatic proteinuria is a benign condition commonly seen in children and young adults. The diagnosis can be established by finding a difference in quantitative proteinuria estimated by spot urine protein-to-creatinine ratio obtained upon arising and at the end of the day.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_016",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 55-year-old man with CKD (Creatinine 3.0 mg/dL) has laboratory results showing: Calcium 8.0 mg/dL, Albumin 3.7 g/dL, Phosphorus 6.0 mg/dL, and PTH 200 pg/mL. In addition to a phosphate-restricted diet, which of the following would be the preferred therapeutic option?",
"choice_a": "1,25 dihydroxyvitamin D",
"choice_b": "Aluminum hydroxide",
"choice_c": "Calcium acetate",
"choice_d": "Lanthanum",
"choice_e": "Sevelamer",
"correct_answer": "C",
"explanation": "Chronic kidney disease (CKD) is associated with hyperphosphatemia due to impaired renal excretion. Early dietary phosphorus restriction is recommended. Phosphate binders are usually needed; they can be calcium-containing (calcium carbonate/acetate) or non-calcium containing (sevelamer/lanthanum). Calcium-containing binders are used in hypocalcemic or normocalcemic patients and are preferred due to cost. (Choice A) Vitamin D therapy may further increase serum calcium and promote vascular calcification in normocalcemic patients. (Choice B) Aluminum hydroxide should be avoided due to risk of accumulation and nonreversible encephalopathy. (Choices D and E) Non-calcium binders are preferred in patients with hypercalcemia, vascular calcification, or suppressed PTH (adynamic bone disease). Educational objective: Hyperphosphatemia is the inciting event for CKD-related mineral bone disease. Calcium-containing phosphate binders are preferred in hypocalcemic and normocalcemic patients. Non-calcium-containing binders are used in patients with hypercalcemia, low PTH levels, or vascular calcification.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_017",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 64-year-old man with BPH and non-ischemic cardiomyopathy (LVEF 40%) presents with worsening nocturia (2-3 episodes) and increased urinary urgency over 8 weeks. He has bilateral basal crackles and 2+ pitting edema. Labs: Sodium 133 mEq/L, Creatinine 1.1 mg/dL. Which of the following is the most appropriate next step in management?",
"choice_a": "Increase furosemide",
"choice_b": "Start doxazosin",
"choice_c": "Start finasteride",
"choice_d": "Start tolterodine",
"choice_e": "Stop beta blocker",
"correct_answer": "A",
"explanation": "This patient has worsening nocturia and signs of fluid retention suggesting worsening heart failure (HF). Nighttime recumbency in congestive HF improves renal perfusion and sodium excretion, resulting in nocturia. Uncontrolled volume overload can worsen symptoms of BPH. The first step is to optimize volume status by increasing the dose of diuretics. (Choices B and C) Alpha-antagonists and 5-alpha-reductase inhibitors are used if symptoms persist after achieving euvolemia. (Choice D) Anticholinergics should not be started until the patient is euvolemic to avoid urine retention. (Choice E) Beta blockers should be continued in mild HF exacerbations. Educational objective: Decompensated heart failure can worsen symptoms of benign prostatic hyperplasia (BPH). Volume overload should be treated with increased diuretic doses before adjustments are made to the BPH regimen.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_018",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 42-year-old woman presents with a recurring, non-pruritic, palpable purpuric rash on her legs, fatigue, and arthralgias in her hips and knees. Labs: Creatinine 1.4 mg/dL. Urinalysis: Protein 2+, RBCs 10-20/hpf, and occasional red blood cell casts. Which of the following would most likely be found in this patient?",
"choice_a": "Anti-double-stranded DNA antibodies",
"choice_b": "Anti-hepatitis C virus antibodies",
"choice_c": "Anti-Ro antibodies",
"choice_d": "Capillary IgA deposits on skin biopsy",
"choice_e": "Focal glomerular sclerosis on renal biopsy",
"correct_answer": "D",
"explanation": "This patient likely has Henoch-Schönlein purpura (HSP). It classically presents with the tetrad of palpable purpura, abdominal pain, arthritis, and renal involvement (glomerulonephritis). The disease is a leukocytoclastic vasculitis characterized by prominent IgA-immune complex deposition in small vessels. (Choice A) Anti-dsDNA is specific for SLE, which typically presents with a malar rash rather than palpable purpura. (Choice B) Mixed cryoglobulinemia is associated with hepatitis C but usually involves peripheral neuropathy and occurs in older patients or those with risk factors. (Choice C) Anti-Ro is seen in Sjögren syndrome (sicca symptoms). (Choice E) Renal biopsy in HSP usually shows mesangiocapillary glomerulonephritis with IgA deposition, not focal glomerular sclerosis. Educational objective: HSP is a systemic vasculitis characterized by IgA-immune complex deposition in small vessels and the renal mesangium. It should be suspected in patients with palpable purpura, abdominal pain, arthritis, and renal dysfunction.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_019",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 70-year-old man with BPH treated with an alpha-blocker now has intermittent urinary incontinence associated with a strong urge to void, triggered by running water or cold. Ultrasound bladder scan shows a residual urine volume of 60 mL. Which of the following is the best next step in management?",
"choice_a": "Add a 5-alpha reductase inhibitor",
"choice_b": "Add an antimuscarinic agent",
"choice_c": "Change to another alpha-adrenergic blocking agent",
"choice_d": "Sacral nerve stimulation",
"choice_e": "Urodynamic testing",
"correct_answer": "B",
"explanation": "This patient has developed urge incontinence, caused by detrusor hyperactivity. Persistent symptoms in the setting of BPH often respond to antimuscarinic agents (eg, tolterodine, oxybutynin). Postvoid residual volume (PVR) should be measured first; antimuscarinics should be used with caution if PVR >200 mL. This patient's PVR is 60 mL, making it safe. (Choice A) 5-alpha reductase inhibitors are for large prostate volumes and take weeks to work. (Choice D) Sacral nerve stimulation is for those who fail medical therapy. (Choice E) Urodynamic testing is invasive and reserved for unclear etiologies. Educational objective: Urge incontinence in the setting of BPH often responds to alpha-adrenergic blockers. Antimuscarinic agents can be added for persistent symptoms if postvoid residual volume is low.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_020",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 40-year-old man presents with sudden onset of 3+ pitting edema in his legs following a mild cold. Labs: Albumin 1.9 g/dL, Total cholesterol 420 mg/dL. Urinalysis: Protein 4+, no blood, no casts. Blood glucose 100 mg/dL. Which of the following diagnoses is most likely to be made with renal biopsy?",
"choice_a": "Allergic interstitial nephritis",
"choice_b": "IgA nephropathy",
"choice_c": "Membranoproliferative glomerulonephritis",
"choice_d": "Minimal change disease",
"choice_e": "Postinfectious glomerulonephritis",
"correct_answer": "D",
"explanation": "This patient has explosive-onset nephrotic syndrome (edema, 4+ proteinuria, low albumin, elevated cholesterol) following an upper respiratory infection with a bland urine sediment. These findings are most consistent with minimal change disease. It accounts for 10-15% of adult non-diabetic nephrotic syndromes. Renal biopsy shows normal-appearing glomeruli on light microscopy but effacement of podocyte foot processes on electron microscopy. (Choice A) AIN usually presents with fever/rash and no nephrotic-range proteinuria. (Choice B) IgA nephropathy involves hematuria. (Choice C) MPGN is associated with hematuria and RBC casts. (Choice E) PSGN presents with hematuria and hypertension, typically 2 weeks after infection. Educational objective: Explosive-onset nephrotic syndrome with heavy proteinuria and hypoalbuminemia following an upper respiratory infection is typical for minimal change disease. Adults should undergo biopsy to confirm diagnosis.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_021",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 32-year-old man with recurrent calcium oxalate nephrolithiasis consumes a diet high in processed foods and meats, avoiding fruits, vegetables, and dairy. Which of the following is the best dietary recommendation to reduce the risk of recurrence?",
"choice_a": "Add daily cranberry juice",
"choice_b": "Avoid coffee, tea, and alcohol",
"choice_c": "Decrease dietary purines",
"choice_d": "Increase dietary calcium",
"choice_e": "Increase dietary sodium",
"correct_answer": "D",
"explanation": "High dietary calcium intake decreases the risk of stone formation. Dietary calcium binds oxalate within the gastrointestinal tract, decreasing its absorption and subsequent urinary excretion. Supplemental calcium (vs dietary) may raise the risk. (Choice B) Coffee, tea, and alcohol actually decrease the risk by inhibiting ADH and increasing urine volume. (Choice C) Purine reduction is for uric acid stones. (Choice E) High sodium intake increases urinary calcium levels and raises stone risk. Educational objective: Calcium oxalate stones are the most common cause of nephrolithiasis. To reduce recurrence, patients should increase intake of fluids, dietary calcium, fruits, and vegetables, and decrease sodium and animal protein.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_022",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 58-year-old man with diabetic nephropathy (baseline creatinine 1.5 mg/dL, protein 1100 mg/day) is started on lisinopril 5 mg daily. Two weeks later, blood pressure is 133/85 mm Hg, creatinine is 1.8 mg/dL, and potassium is 4.8 mEq/L. Which of the following is the best next step in management?",
"choice_a": "Add irbesartan and repeat testing in 2-3 weeks",
"choice_b": "Continue lisinopril and repeat testing in 2-3 weeks",
"choice_c": "Discontinue lisinopril and repeat testing in 2-3 weeks",
"choice_d": "Switch to amlodipine and repeat testing in 2-3 weeks",
"choice_e": "Switch to valsartan and repeat testing in 2-3 weeks",
"correct_answer": "B",
"explanation": "Inhibition of the renin-angiotensin-aldosterone system (ACEi or ARB) is staple therapy for diabetic nephropathy. These cause an expected initial decrease in GFR from reduced renal capillary pressure. A rise in serum creatinine of up to 30%-35% from baseline is acceptable and not an indication to stop therapy. This patient's creatinine rose 20% (1.5 to 1.8). Potassium up to 5.5 mEq/L is also generally acceptable. (Choice D) ACEi/ARB are preferred over calcium channel blockers for renal protection. Educational objective: ACE inhibitors or ARBs are first-line for diabetic nephropathy. A rise in serum creatinine of up to 30%-35% is acceptable and should not cause discontinuation of therapy.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_023",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "An 80-year-old man presents with subacute acute kidney injury (Creatinine 2.9 mg/dL, baseline 1.4 mg/dL) two weeks after coronary arteriography. He has livedo reticularis on his legs. Labs show 13% eosinophils. Urinalysis: White blood cells 10-20/hpf, Red blood cells 5-10/hpf, and no blood on dipstick. Which of the following is the most likely diagnosis?",
"choice_a": "Acute interstitial nephritis",
"choice_b": "Acute kidney injury due to angiotensin converting enzyme inhibitor",
"choice_c": "Atheroembolic disease",
"choice_d": "Pre-renal acute kidney injury",
"choice_e": "Radiocontrast nephropathy",
"correct_answer": "C",
"explanation": "Renal atheroembolic disease (cholesterol crystal emboli) typically occurs 1-2 weeks after manipulation of the aorta. Diagnosis is suggested by subacute AKI and extrarenal embolic disease such as livedo reticularis and cyanotic toes. Eosinophilia and hypocomplementemia are common. (Choice A) AIN causes fever/rash/eosinophilia but not livedo reticularis. (Choice D) Pre-renal azotemia has low urinary sodium (<20) and normal sediment. (Choice E) Radiocontrast AKI occurs earlier (days 1-3) and typically resolves within two weeks; it is not associated with eosinophilia or livedo reticularis. Educational objective: Atheroembolic disease presents with AKI after arteriography and is associated with livedo reticularis and a cyanotic or gangrenous toe.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_024",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 67-year-old man reports nocturia (2-3 times/night) and straining to urinate. Exam shows a symmetric, nontender, mildly enlarged prostate. Urinalysis and creatinine are normal. Which of the following is the most appropriate next step in management?",
"choice_a": "Advise behavior modifications and observation",
"choice_b": "Initiate treatment with finasteride",
"choice_c": "Measure postvoid residual volume",
"choice_d": "Obtain abdominal ultrasound",
"choice_e": "Request urethrocystoscopy",
"correct_answer": "A",
"explanation": "This patient has mild lower urinary tract symptoms due to BPH. For those with mild symptoms, simple behavioral modifications are adequate: shifting fluid intake to earlier in the day, decreasing caffeine/alcohol, and double voiding. (Choice B) Finasteride is for large prostate volumes and moderate-to-severe symptoms. (Choice C) PVR is for urge or overflow incontinence. (Choice D) Ultrasound is for obstructive uropathy (hydronephrosis), unlikely here. (Choice E) Cystoscopy is for suspected calculi or cancer. Educational objective: For mild BPH, simple behavioral modifications may be adequate. More severe symptoms or complications warrant aggressive management.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_025",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "An 80-year-old woman recently started on hydrochlorothiazide for hypertension presents with fatigue, dizzy spells, nausea, and an unsteady gait. Mini-mental status exam is 22/30 (baseline 27/30). BMI is 19 kg/m^2. Fingerstick glucose is 220 mg/dL. Which of the following is most likely responsible for this patient's symptoms?",
"choice_a": "Cerebellar stroke",
"choice_b": "Hypercalcemia",
"choice_c": "Hyperglycemia",
"choice_d": "Hyponatremia",
"choice_e": "Volume depletion",
"correct_answer": "D",
"explanation": "Thiazide-induced hyponatremia is a common complication in older women with low BMI, usually occurring within 1-2 weeks of starting the drug. Thiazides increase sodium/potassium excretion and medullary water reabsorption (ADH-induced), diluting the serum. Patients can present with dizziness, lethargy, and vomiting. (Choice B) Thiazides can increase calcium but rarely cause symptomatic hypercalcemia. (Choice C) Hyperglycemia (220) is mild and unlikely to cause global CNS dysfunction. (Choice E) Volume depletion is less likely without orthostatic changes or tachycardia. Educational objective: Thiazide diuretics can lead to hyponatremia, especially in frail, elderly women. Evaluation of electrolytes is necessary if nonspecific symptoms occur after starting therapy.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_026",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 67-year-old woman with osteoarthritis and hypertension takes ibuprofen 1.2 g daily, atenolol, hydrochlorothiazide, and enalapril. Her home blood pressure readings are 140/90-100 mm Hg. Current BP 146/94 mm Hg, pulse 64/min. Creatinine is 1.7 mg/dL. Which of the following is the most appropriate next step in hypertension management?",
"choice_a": "Add a calcium channel blocker",
"choice_b": "Evaluate for obstructive sleep apnea",
"choice_c": "Increase the atenolol dose",
"choice_d": "Increase the hydrochlorothiazide dose",
"choice_e": "Stop ibuprofen",
"correct_answer": "E",
"explanation": "NSAIDs (ibuprofen) can cause suboptimal blood pressure control by enhancing renal vasoconstriction, causing sodium retention, and blunting the effects of antihypertensives (diuretics, ACEi). A trial of discontinuation is the most appropriate initial step. (Choice C) Her low pulse suggests adequate beta-blockade. (Choice D) Increasing HCTZ may worsen renal function. Educational objective: NSAIDs are commonly associated with elevations in blood pressure and can affect antihypertensive efficacy. Discontinuation should be considered in patients with suboptimal control.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_027",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 47-year-old man with recurrent calcium oxalate stones (85% calcium oxalate, 15% calcium phosphate) has labs: Calcium 10 mg/dL. 24-hour urine: Volume 1300 mL, Calcium 380 mg, Citrate 240 mg (normal 320-1240). Which of the following is the most appropriate recommendation?",
"choice_a": "Dietary sodium restriction",
"choice_b": "Esomeprazole discontinuation",
"choice_c": "Dietary calcium restriction",
"choice_d": "Vitamin D supplementation",
"choice_e": "Increase animal protein in the diet",
"correct_answer": "A",
"explanation": "This patient has idiopathic hypercalciuria (380 mg/24h) and low urinary citrate. A low sodium diet leads to increased proximal tubule sodium and calcium reabsorption, thereby decreasing urinary calcium excretion and stone incidence. (Choice C) Low calcium intake paradoxically increases risk by allowing more oxalate absorption. (Choice D) Vitamin D supplementation increases stone risk. (Choice E) Animal protein increases acid load and urinary calcium. Educational objective: Hypercalciuria is a common risk for calcium stones. Restricting sodium and animal protein while increasing fluids and citrate can reduce incidence.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_028",
"system": "Renal, Urinary Systems & Electrolytes",
"stem": "A 75-year-old man with hyperlipidemia and peripheral vascular disease has uncontrolled hypertension (165/86 mm Hg) on chlorthalidone, metoprolol, and amlodipine. An abdominal bruit is present. Doppler ultrasound shows >60% stenosis of bilateral renal arteries. Creatinine 1.2 mg/dL. Which of the following is the most appropriate next step in management?",
"choice_a": "Addition of an ACE inhibitor",
"choice_b": "Invasive renal angiography",
"choice_c": "Plasma renin activity measurement",
"choice_d": "Renal angioplasty with stenting",
"choice_e": "Surgical renal revascularization",
"correct_answer": "A",
"explanation": "Bilateral renal artery stenosis activates the RAAS. ACE inhibitors or ARBs are preferred initial treatments and decrease mortality and progression to ESRD. While they increase the risk of AKI, most patients only experience a small decline in GFR. Close monitoring is required. (Choice D) Angioplasty is reserved for those who fail medical therapy or have flash pulmonary edema/HF. (Choice B) Invasive angiography is the gold standard but less invasive imaging is preferred initially. Educational objective: Patients with bilateral renal artery stenosis should first be treated with medical therapy (ACEi/ARB and diuretic) as it is as efficacious as invasive procedures.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes@USMLEWorldStep3(1)(1).pdf"
},
{
"id": "RENAL_029",
"system": "Renal",
"stem": "Several of your patients have had an estimated glomerular filtration rate (eGFR) calculated by the hospital's laboratory based upon the patient's measured serum creatinine and other variables (ie, ethnic background, age, gender, body weight). The hospital's laboratory uses a well-recognized reference standard to calibrate creatinine measurements. Which of the following patients has a calculated eGFR that is a close approximation of their actual GFR?",
"choice_a": "45-year-old man with cirrhosis, ascites, edema, and a serum creatinine of 1.5~mg/dL",
"choice_b": "19-year-old healthy man with a serum creatinine of 0.8~mg/dL",
"choice_c": "65-year-old woman in intensive care with sepsis, oliguria, and a serum creatinine of 1.8~mg/dL",
"choice_d": "50-year-old woman with chronic kidney disease and a serum creatinine of 2.3~mg/dL",
"choice_e": "50-year-old man with a BMI of 40{kg/m}^{2} and a serum creatinine of 1.4~mg/dL",
"correct_answer": "D",
"explanation": "One of 3 formulas (ie, Cockcroft-Gault, MDRD, and CKD-EPI) is used by most hospital laboratories to provide clinicians with an estimated glomerular filtration rate (eGFR) for patients in whom a serum creatinine measurement is obtained. The Cockcroft-Gault formula was developed in a relatively small (n=249) population, the MDRD formula was derived from a population of Caucasians with a mean age of 51 years and a GFR of 40~mL/min, and the CKD-EPI formula was derived from individuals with normal to slightly reduced GFR. Because the formulas appear less accurate for individuals with a normal GFR, the laboratories often report an eGFR of >60~mL/min as the upper limit. For the most part, all 3 of these formulas tend to underestimate the actual GFR, and all are dependent upon accurate measurement of serum creatinine as well as a stable steady-state clinical setting. These formulas provide a reasonable estimate of GFR, with the CKD-EPI formula providing the most accurate estimate in individuals with GFR >60~mL/min From a practical perspective, eGFR measurements provide useful information for the dosing of drugs eliminated in whole or in part by the kidneys, and for the identification and classification of patients with chronic kidney disease. (Choice A) Assessment of the GFR in patients with advanced cirrhosis is difficult. GFR is often significantly diminished. Diminished muscle mass can cause a decrease in creatinine production; and ascites and edema cause an increase in the volume of distribution of creatinine. Cirrhosis is often associated with enhanced tubular secretion of creatinine. As a result of all these factors, neither the formulae used for eGFR nor the creatinine clearance measurements provide accurate estimates of GFR in cirrhosis. (Choice B) The eGFR formulas appear less accurate for young individuals with a normal GFR. (Choice C) This patient is not clinically stable and the formulae are unreliable to estimate GFR in non-steady-state conditions. (Choice E) There are a number of populations and clinical settings in which the eGFR formulas have not been validated; morbid obesity is one of these settings. Educational objective: The estimated glomerular filtration rate (eGFR) data provided by the hospital laboratory is valid only under stable clinical conditions. The commonly used formulas appear less accurate for individuals with a normal GFR.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_030",
"system": "Renal",
"stem": "A 52-year-old woman comes to the physician for routine follow-up. She has no complaints and thinks of herself as \"pretty healthy.\" She takes lisinopril and hydrochlorothiazide for hypertension and lansoprazole for gastroesophageal reflux disease. She was treated with isoniazid for latent tuberculosis 7 years ago. Her mother died of uterine cancer at age 62. The patient does not smoke. She jogs 3 miles a day and eats a balanced diet. She takes 2000 units of vitamin D3 a day orally as a dietary supplement. Her blood pressure is 139/82 mm Hg and pulse is 74/min. Her BMI is 28~kg/m^{2}. There are no neck masses or lymph node enlargement. Breast examination is unremarkable. Lungs are clear to auscultation. The spleen is not palpable. There are no skin rashes. Laboratory results are as follows: Sodium 140~mEq/L, Potassium 3.8~mEq/L, Chloride 100~mEq/L, Creatinine 1.0~mg/dL, Calcium 12.0~mg/dL, Glucose 73~mg/dL, Albumin 4.0~g/dL. Repeat calcium level is 12.1~mg/dL. Hydrochlorothiazide is discontinued. Which of the following is the most likely diagnosis?",
"choice_a": "Granulomatous disease",
"choice_b": "Occult malignancy",
"choice_c": "Osteoporosis",
"choice_d": "Parathyroid adenoma",
"choice_e": "Vitamin D toxicity",
"correct_answer": "D",
"explanation": "Primary hyperparathyroidism is the most common cause of hypercalcemia. Patients with primary hyperparathyroidism are usually asymptomatic and present with incidental hypercalcemia on routine laboratory testing. However, the serum calcium in primary hyperparathyroidism is only mildly elevated. Hydrochlorothiazide can also slightly increase serum calcium to a borderline high range by increasing renal tubular calcium absorption. Patients who have overtly high serum calcium on hydrochlorothiazide generally have underlying primary hyperparathyroidism. This patient is asymptomatic and was incidentally found to have mild hypercalcemia. The most likely etiology of her hypercalcemia is primary hyperparathyroidism, which is most often caused by a parathyroid adenoma. (Choice A) Granulomatous diseases (eg, sarcoid, fungal infections, tuberculosis) cause hypercalcemia by extrarenal production of 1-alpha-hydroxylase, which in turn increases the formation of 1, 25 (OH)2 vitamin D. However, these patients generally have symptoms of the primary disease. (Choice B) Malignancy is the second most common cause of hypercalcemia. Most patients with hypercalcemia of malignancy have rapid onset with moderate to high serum calcium levels (>13 to 14 mg/dL) associated with symptoms of hypercalcemia or the primary malignancy. (Choice C) Hypercalcemia is not a feature of primary osteoporosis. (Choice E) Ingestion of very high doses of vitamin D is required for the development of toxicity. This patient is taking 2000 units of vitamin D3 daily as a supplement, which is unlikely to cause toxicity. Most guidelines state that the \"tolerable upper limit\" of daily vitamin D3 intake is 4000 units. Educational objective: Primary hyperparathyroidism is the most common cause of hypercalcemia. Serum calcium in hydrochlorothiazide-induced hypercalcemia is typically high normal or modestly elevated. The majority of hydrochlorothiazide-treated patients with overt hypercalcemia have underlying primary hyperparathyroidism.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_031",
"system": "Renal",
"stem": "A 39-year-old man seeks care for his third episode of gross hematuria. His first episode occurred shortly after onset of an upper respiratory infection 2 years ago. His most recent episode started about 5 days ago. Both episodes lasted 5-10 days and were not associated with either flank or abdominal pain. The episodes had accompanying mild dysuria. There were no blood clots passed. He has no other medical problems. He takes no medication. There is no family history of kidney disease. His blood pressure is 132/90 mm Hg, pulse is 72/min and respirations are 12/min. Physical examination shows no significant abnormalities. The patient's laboratory studies show: Hematocrit 42%, Platelet count 280,000/mm^{3}, Leukocyte count 9000/mm^{3}. Serum chemistry: Serum creatinine 1.4~mg/dL, Total protein 7.0~g/dL, Albumin 4.0~g/dL. Urinalysis: Specific gravity 1.020, Protein 3+, Blood moderate, Glucose negative, Ketones negative, Leukocyte esterase negative, Nitrites negative, WBC 1-2/hpf, RBC many/hpf, Casts granular. Using phase-contrast microscopy, the pathologist finds several dysmorphic red blood cells in the urine. Which of the following is the most appropriate next step in management?",
"choice_a": "Antibasement membrane antibody test",
"choice_b": "Cystoscopy",
"choice_c": "Kidney CT scan",
"choice_d": "Quantitative assessment of glomerular filtration rate and proteinuria",
"choice_e": "Urine cytology",
"correct_answer": "D",
"explanation": "The significant proteinuria and dysmorphic red blood cells on urinalysis establishes glomerular disease as the most likely cause of this patient's hematuria, and the clinical presentation is suggestive of IgA nephropathy. Clinical Presentation: One or more episodes of gross hematuria after an upper respiratory infection (40%-50%); Microscopic hematuria with proteinuria on incidental urinalysis without symptoms (30%-40%); Nephritic syndrome or rapidly progressive glomerulonephritis (<10%). The table above summarizes the most common clinical presentations of IgA nephropathy, which is the most common cause of idiopathic glomerulonephritis in developed countries. Factors associated with an adverse prognosis include elevated blood pressure, lower than normal estimated glomerular filtration rate (GFR) and significant proteinuria. Thus, quantitative assessment of GFR and proteinuria to establish a baseline in this patient is the next step to predict future deterioration in renal function and therapeutic options. Renal biopsy is usually done to confirm the diagnosis in patients with protein excretion >500 mg/day, elevated serum creatinine (>1.5~mg/dL) and hypertension. (Choice A) Antibasement membrane antibody is found in patients with Goodpasture syndrome, a pulmonary-renal syndrome characterized by pulmonary hemorrhage and glomerulonephritis. Goodpasture syndrome is rarely associated with recurrent episodes of hematuria and usually causes significant pulmonary hemorrhage with markedly decreased GFR. (Choice B) Cystoscopy is indicated in the evaluation of hematuria if there is suspicion of bladder cancer. In this young patient, gross hematuria with proteinuria suggests a glomerular cause of hematuria, and cystoscopy is not indicated. (Choice C) Kidney CT scan is useful to evaluate for nephrolithiasis, chronic tubulointerstitial nephritis, or mass lesions (e.g., renal cell carcinoma). Because this patient's hematuria with proteinuria suggests a glomerular etiology, a renal CT scan would be less diagnostic. (Choice E) Urine cytology can be helpful in diagnosing cancers of the renal pelvis, ureter, and bladder. However, this patient's clinical presentation is less consistent with these diagnoses. Educational objective: The presence of significant proteinuria and dysmorphic red blood cells on urinalysis suggests a glomerular cause of hematuria. IgA nephropathy is characterized by recurrent episodes of gross hematuria (glomerulonephritis), typically following an upper respiratory infection. Factors associated with an adverse prognosis include elevated blood pressure, lower than normal estimated glomerular filtration rate, and significant proteinuria.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_032",
"system": "Renal",
"stem": "You are following five patients who have had various aspects of their kidney function measured on one or more occasions over time. All patients are clinically stable without any ongoing acute events. Which of the following laboratory changes would represent the greatest loss in glomerular filtration rate?",
"choice_a": "Increase in serum creatinine from 0.8 to 1.2~mg/dL",
"choice_b": "Increase in serum creatinine from 4.0 to 8.0~mg/dL",
"choice_c": "Increase in BUN/creatinine ratio from 10 to 30",
"choice_d": "Increase in BUN from 10 to 20~mg/dL",
"choice_e": "Decrease in 24-hr urine creatinine clearance from 100 to 80~ml/min",
"correct_answer": "A",
"explanation": "The relationship between serum creatinine concentration and glomerular filtration rate (GFR) is non-linear. As a rule of thumb, every time the GFR halves, the serum creatinine doubles. For example, if you assume that the GFR is 100~ml/min, the corresponding serum creatinine would be 1.0~mg/dL. As the GFR decreases to a value of 50~ml/min, the corresponding serum creatinine would be 2~mg/dL With further decreases in GFR to 25, 12.5, and 6.25~ml/min, the corresponding serum creatinine concentrations would be 4.0, 8.0, and 16.0~mg/dL, respectively. This curvilinear relationship between GFR and serum creatinine is such that when the GFR is normal, relatively large decreases in GFR result in only small increases in serum creatinine (Choice A). Thus, when baseline serum creatinine is normal, serum creatinine is an insensitive indicator for decreasing GFR. (Choice B) When GFR is significantly decreased at baseline, small decrements in GFR produce relatively large changes in serum creatinine. The estimated loss of GFR with an increase in serum creatinine from 4.0 to 8.0~mg/dL is modest at about 12.5~ml/min. (Choices C & D) Blood urea nitrogen (BUN) is more affected than serum creatinine by factors other than GFR. For example, high protein diet, upper gastrointestinal hemorrhage, and the anti-anabolic effects of corticosteroids can increase BUN without affecting GFR and serum creatinine. Neither the BUN/creatinine ratio nor small changes in BUN are helpful indicators of GFR. (Choice E) A 24-hour urine collection for creatinine clearance is rarely done at present. Despite detailed instruction, it is difficult to obtain accurate collections. The 20~ml/min calculated decrease in creatinine clearance is modest and likely significantly less than that in choice A. Educational objective: The relationship between serum creatinine concentration and glomerular filtration rate (GFR) is non-linear; every time the GFR halves, the serum creatinine doubles. When the GFR is normal, relatively large decreases in GFR result in only small increases in serum creatinine. Conversely, when the GFR is significantly decreased, small decrements in GFR produce relatively large changes in serum creatinine.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_033",
"system": "Renal",
"stem": "A 45-year-old man is evaluated for recurrent urolithiasis. He underwent a Roux-en-Y procedure for morbid obesity two years ago. He passed his first kidney stone one year ago and has passed several since then. He has lost approximately 15 kg (33 lb) since the surgery and feels well otherwise. His current medications include lisinopril for hypertension, esomeprazole for gastro-esophageal reflux disease, and a daily multivitamin. He has no family history of kidney stones. Which of the following factors is most likely responsible for this patient's kidney stone formation?",
"choice_a": "High urinary oxalate and low urinary citrate",
"choice_b": "Hypercalciuria",
"choice_c": "Hyperuricosuria and low urine pH",
"choice_d": "Low urinary volume",
"choice_e": "Vitamin D deficiency",
"correct_answer": "A",
"explanation": "This bariatric surgery patient has recurrent urolithiasis that is likely due to calcium oxalate stones caused by hyperoxaluria and hypocitraturia. Calcium oxalate stones commonly occur in patients with malabsorption due to small bowel disease (e.g., Crohn's disease), bowel resection with intestinal bypass (e.g., bariatric surgery), and cystic fibrosis. Malabsorption causes more intestinal fatty acid binding to calcium, which increases colonic oxalate absorption and renal oxalate excretion. Malabsorption also causes low urinary citrate due to unclear reasons. One possibility is hypokalemia or chronic metabolic acidosis (from malabsorptive diarrhea), leading to increased citrate reabsorption in the renal proximal tubules. Since citrate is an inhibitor of kidney stones, the combined effect of hyperoxaluria and hypocitraturia increases the risk of kidney stones by up to 4% per year. Patients can be treated with a low oxalate diet and exogenous citrate supplementation. (Choice B) Hypercalciuria is most commonly associated with calcium stones seen in primary hyperparathyroidism and chronic metabolic acidosis. However, it is not a significant contributor to malabsorption-associated kidney stone formation. (Choice C) Hyperuricosuria and low urine pH are known risk factors for uric acid stones; however, they are not associated with calcium oxalate stones due to malabsorption. (Choice D) Patients with bowel disorders and significant diarrhea can have low urinary volumes, which by itself is not a significant risk factor for calcium oxalate stones. Low urinary volume can contribute to uric acid and calcium oxalate stones when combined with low urine pH, metabolic acidosis, and hypocitraturia. (Choice E) The Roux-en-Y procedure can lead to decreased absorption of fat-soluble vitamins (e.g.. vitamin D), but vitamin D excess (not deficiency) is associated with calcium stones. Educational objective: Recurrent urolithiasis commonly occurs in gastric bypass patients due to hyperoxaluria and hypocitraturia. Treatment involves a low oxalate diet and exogenous citrate supplementation.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_034",
"system": "Renal",
"stem": "A 45-year-old woman comes to the physician because of frequent urination for the last six months. She states that she has been waking up several times at night to urinate. These symptoms also disrupt her professional work schedule. She has been taking lithium to treat a mood disorder for the past 5 years. She has tried many other drugs for her mood disorder, but none have been as successful as lithium. She is adherent to her treatment and has her lithium level measured regularly. She had one episode of mild lithium toxicity two years ago. Her physical examination is unremarkable. Laboratory results are as follows: Serum chemistry: Creatinine 1.6~mg/dL, Calcium 9.8~mg/dL, Glucose 78~mg/dL. Urinalysis: Protein trace, Glucose negative, WBC none, RBC none, Casts none. Water deprivation test: Urine osmolality (baseline) 300~mOsm/kg, Urine osmolality (after DDAVP) 325~mOsm/kg. Which of the following would be the best initial treatment for this patient?",
"choice_a": "Amiloride",
"choice_b": "DDAVP",
"choice_c": "Fluid restriction",
"choice_d": "High dietary solute intake",
"choice_e": "NSAIDS",
"correct_answer": "A",
"explanation": "This patient's presentation is consistent with lithium-induced nephrogenic diabetes insipidus (DI). Chronic lithium use can cause chronic interstitial nephritis, type I distal renal tubular acidosis, hyperparathyroidism with hypercalcemia, and nephrogenic DI (up to 20-40% of patients). Lithium induces ADH resistance by impairing water channel function and water reabsorption in the collecting duct. Patients typically present with acute onset nocturia and polyuria. However, patients taking lithium may also develop central Di or primary polydipsia due to their underlying psychiatric condition. Thus, the diagnosis must be confirmed with a water deprivation test, since the treatment differs for these conditions. With nephrogenic DI, the change in urine osmolality is minimal after DDAVP administration (central DI has > 50% increase in urine osmolality). Lithium-induced nephrogenic DI may be permanent or partially reversible and discontinuation of lithium is preferred. Patients who cannot stop lithium should be treated with salt restriction and selected diuretics (i.e., amiloride or thiazides). Amiloride blocks sodium channels in the collecting ducts to prevent lithium's cellular entry, while thiazides combined with sodium restriction promote a mild hypovolemia that acts to increase proximal sodium and water reabsorption. However, serum lithium levels increase with both options and require close monitoring. (Choice B) High-dose DDAVP is an alternative therapeutic option in patients who do not respond to diuretics, and it is sometimes effective in partially reversible nephrogenic DI. (Choice C) Fluid restriction will decrease urine volume, but this could lead to significant extracellular fluid volume depletion and worsen this patient's renal function. (Choice D) Urine osmolality is usually fixed in nephrogenic DI; thus, the amount of excreted solute directly affects urine volume. Reducing solute intake can decrease urine volume, but increasing intake will have the opposite effect and worsen this patient's polyuria. (Choice E) NSAIDs decrease glomerular filtration rate, enhance tubular solute reabsorption, and can significantly decrease urine output in some cases of nephrogenic DI. However, this patient has a low GFR (creatinine of 1.6~mg/dL) and NSAIDs could further decrease the GFR. Educational objective: Lithium can be associated with nephrogenic DI in up to 20-40% of patients. Symptomatic patients should discontinue lithium. Patients who cannot stop lithium may be treated with salt restriction and a trial of diuretics (i.e., amiloride or thiazides) with careful monitoring of renal function and serum lithium levels.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_035",
"system": "Renal",
"stem": "A 55-year-old man comes to the emergency department with severe right flank pain. CT scan shows a 5-mm stone in the right ureter and several smaller stones in both renal pelvices. Urinalysis results are as follows: Urine pH 4.5 (normal 5-6), White blood cells Absent, Red blood cells 50-100/hpf, Bacteria Absent, Nitrites Negative, Esterase Negative. The patient subsequently passes a stone and analysis shows it to be composed of predominantly uric acid. Besides high fluid intake, which of the following would be most helpful for this patient to prevent recurrent stones?",
"choice_a": "Calcium-restricted diet",
"choice_b": "Furosemide",
"choice_c": "High-protein diet",
"choice_d": "Hydrochlorothiazide",
"choice_e": "Potassium citrate",
"correct_answer": "E",
"explanation": "Uric acid stones account for approximately 10%-15% of nephrolithiasis cases. These are most commonly seen in patients with unusually low urine pH (which may be due to a defect in renal ammonia excretion) and hyperuricosuria. Uric acid stones are radiolucent on conventional radiographs but can often be seen on renal ultrasound or CT scan. Treatment of uric acid stones includes hydration, alkalinization of the urine, and a low-purine diet. Alkalinization of the urine to pH 6.0-6.5 with oral potassium citrate is recommended as uric acid stones are highly soluble in alkaline urine. In addition to alkalinizing the urine, citrate is a stone inhibitor and reduces crystallization. Allopurinol can be added if there are recurrent symptoms despite initial measures, especially if hyperuricosuria or hyperuricemia occurs. (Choice A) A calcium-restricted diet is not beneficial in the management of uric acid stones. It is not advised even in patients with calcium stones, as calcium restriction can potentially cause a negative calcium balance and hyperoxaluria due to the resulting increase in gastrointestinal absorption of oxalate. (Choice B) Furosemide increases urinary calcium excretion, and the resulting hypercalciuria can increase the risk of calcium stone formation. (Choice C) A purine-restricted (not high-protein) diet is indicated in patients with uric acid stones secondary to hyperuricosuria. (Choice D) Hydrochlorothiazide decreases urinary calcium excretion and is used in the management of recurrent hypercalciuric renal stones. Educational objective: Uric acid stones are often radiolucent but may be seen on ultrasound or CT scan. They are highly soluble in alkaline urine; alkalinization of the urine to pH 6.0-6.5 with oral potassium citrate is the treatment of choice. Allopurinol can be added if there are recurrent symptoms despite initial measures, especially if hyperuricosuria or hyperuricemia occurs.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_036",
"system": "Renal",
"stem": "A 43-year-old man comes to the physician because of weakness and arthralgias for the last four months. He also has a pruritic rash on his legs that appeared two months ago. He denies fever or chills and his weight has been stable. His blood pressure is 140/90 mm Hg and pulse is 84/min. A rash is present on both lower extremities below the knees that consist of many erythematous macules. Laboratory results are as follows: Complete blood count: Hematocrit 34%, Platelets 140,000~cells/mu L, Leukocyte count 3,000~cells/mu L. Serum chemistry: Creatinine 1.7~mg/dL, Albumin 3.1~g/dL, Aspartate aminotransferase 78 U/L, Alanine aminotransferase 99~U/L. Urinalysis: Protein +3, Blood moderate, Red blood cells 20-30/hpf. Immunologic studies: Complement C3 50~mg/dL, C4 10~mg/dL (12-75 mg/dL), Rheumatoid factor 90~U/mL (< 40 U/mL), HIV antibody negative. Which of the following would be most helpful in establishing the diagnosis in this patient?",
"choice_a": "Anti-phospholipid antibodies",
"choice_b": "Bone marrow biopsy",
"choice_c": "Serum protein electrophoresis",
"choice_d": "Urine toxicology screen",
"choice_e": "Viral hepatitis serologies",
"correct_answer": "E",
"explanation": "This patient's presentation is consistent with mixed cryoglobulinemia causing glomerulonephritis. Cryoglobulinemia is classified as either type I or mixed (types II and III). Diagnosis is suggested by elevated cryoglobulins (cryocrit), ESR, CRP, autoantibodies (e.g., RF, ANA), and clinical symptoms. Mixed cryoglobulinemia is commonly associated with hepatitis C and elevated liver function tests, and more than 60% of patients with hepatitis C have cryoglobulins. Approximately 20% of patients with cryoglobulinemia develop renal disease, which is usually glomerulonephritis from hepatitis C-containing immune complexes. Patients with hepatitis C-associated cryoglobulinemia have a higher risk of developing lymphoma up to 5-10 years later. Treatment involves eradicating HCV, immunosuppression (eg, prednisone, cyclophosphamide), and/or plasmapheresis for moderate-severe cryoglobulinemia. (Choice A) Anti-phospholipid antibody syndrome (APS) can also cause anemia, thrombocytopenia, livedo reticularis, and glomerulonephritis. However, this patient has increased AST and ALT and low albumin, suggesting chronic liver disease. Also, most patients with APS have thrombotic episodes (eg. DVT. strokes). (Choice B) Bone marrow biopsy is more useful in type I cryoglobulinemia to diagnose an underlying hematological condition with bone marrow involvement. (Choice C) Serum protein electrophoresis can help diagnose underlying plasma cell disorders (eg. multiple myeloma or Waldenström's macroglobulinemia), but they are associated more with type I than mixed cryoglobulinemia. (Choice D) Heroin users can develop membranous nephropathy (due to hepatitis B), membranoproliferative glomerulonephritis (due to hepatitis C), or focal segmental glomerulosclerosis. However, this patient's presentation is consistent with vasculitis. Viral serologies are more likely to give a correct diagnosis in this patient given the low white cell count, thrombocytopenia, and increased AST/ALT. Educational objective: Mixed cryoglobulinemia is commonly associated with hepatitis C and can cause glomerulonephritis. Treatment includes eradicating hepatitis C and immunosuppression and/or plasmapheresis for cryoglobulinemia.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_037",
"system": "Renal",
"stem": "A 27-year-old man comes to the physician because of a 10-day history of crampy lower abdominal pain and diarrhea that awakens him at night. He says he might have some blood in his stool, but he is not sure. He also complains of fatigue. His past medical history is unremarkable. He takes a daily multivitamin and exercises regularly. He has a stable male partner and uses condoms regularly. His mother died of lymphoma and his older brother suffers from ulcerative colitis. He is afebrile. His blood pressure is 130/88 mm Hg, pulse is 90/min, and respirations are 12/min. His bowel sounds are normoactive. There is mild abdominal tenderness in both lower quadrants without rebound tenderness. His examination is otherwise unremarkable. The patient's labs reveal: Complete blood count: Hematocrit 24%, MCV 87 fl, Platelets 55,000~cells/mu L, Leukocyte count 11,000~cells/mu L. Serum chemistry panel: Sodium 140~mEq/L, Potassium 4.4~mEq/L, Chloride 102~mEq/L, Bicarbonate 22~mEq/L, Creatinine 2.4~mg/dL. Which of the following is the best next step in managing this patient?",
"choice_a": "Antimotility drugs",
"choice_b": "Peripheral blood smear",
"choice_c": "Empiric antibiotics",
"choice_d": "Sigmoidoscopy",
"choice_e": "Stool cultures",
"correct_answer": "B",
"explanation": "This patient's presentation (anemia, thrombocytopenia, and acute kidney injury after a recent diarrheal illness) is concerning for hemolytic-uremic syndrome (HUS), most commonly caused by a shiga toxin-producing enterohemorrhagic E. coli. HUS is more common in children (but can also be seen in adults) and is similar to thrombotic thrombocytopenic purpura (TTP), which is more commonly seen in adults. However, HUS is associated with more renal disease and fewer primary neurological symptoms than TTP. The diagnosis of HUS is made clinically in patients who present with the classic triad after a prodromal diarrheal illness. As a result, a peripheral blood smear should be done next to look for schistocytes (fragmented blood cells), indicating a microangiopathic hemolytic anemia. (Choice A) Antimotility drugs (anticholinergics and narcotics) do not decrease the gastrointestinal symptoms, but can worsen HUS by increasing the risk of central nervous system dysfunction. As a result, antimotility agents are not recommended for a patient with suspected HUS from enterohemorrhagic E. coli. (Choice C) Empiric antibiotics do not decrease the duration of gastrointestinal symptoms and can possibly worsen HUS by increasing shiga toxin release. (Choice D) Sigmoidoscopy is indicated to evaluate for colitis, which can sometimes mimic HUS. However, the thrombocytopenia and renal injury are usually not seen in colitis and makes it less likely in this patient. (Choice E) Stool cultures are not as sensitive to detect enterohemorrhagic E. coli, since the bacteria may only be present in the stool for a few days after the onset of the illness. Serologic testing for E. coli is more sensitive. Educational objective: Hemolytic-uremic syndrome is associated with a prodromal diarrheal illness, usually caused by a shiga toxin-producing enterohemorrhagic E. coli leading to microangiopathic hemolytic anemia, thrombocytopenia, and acute kidney injury. The diagnosis is made clinically and can be evaluated with peripheral blood smear to look for schistocytes as well as serologic testing for enterohemorrhagic E. coli.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_038",
"system": "Renal",
"stem": "A 28-year-old woman comes to the office because of frequent urination. She urinates approximately every 30 to 60 minutes during the day, which makes it difficult to concentrate at work and attend meetings. She also gets up 1 to 2 times per night to urinate. The patient drinks \"a lot of fluid to stay caught up.\" She says that her 'migraines' have worsened recently and she occasionally feels nauseated. She got a new pair of glasses due to worsening of her vision, which she attributes to spending a lot of time at work. She has had no lower abdominal pain or dysuria. Her other medical problems include anxiety disorder and knee trauma that she sustained three months ago while jogging. She required arthroscopic surgery and took opioid medications for pain control for two weeks. She has not experienced any knee pain since. Her BMI is 18~kg/m^{2} Physical examination shows no abnormalities. Laboratory results are as follows: Serum chemistry: Sodium 136 mEq/L, Potassium 3.8 mEq/L, Chloride 104 mEq/L, Bicarbonate 24 mEq/L, Creatinine 0.8 mg/dL, Glucose 80 mg/dL. Urinalysis: Specific gravity 1.010, PH 5.6, Protein none, Blood negative, White blood cells 1-2/hpf, Red blood cells 1-2/hpf. Urine pregnancy test is negative. Eight hours following a water deprivation, her weight remains unchanged and her plasma and urine osmolalties are 284 and 650~mosm/kg $H{2}O$ respectively. Which of the following is the most likely diagnosis?",
"choice_a": "Amphetamine abuse",
"choice_b": "Central diabetes insipidus",
"choice_c": "Nephrogenic diabetes insipidus",
"choice_d": "Primary polydipsia",
"choice_e": "Surreptitious diuretic use",
"correct_answer": "D",
"explanation": "This patient presents with polyuria with dilute urine and increased water intake, which is usually due to diabetes insipidus (DI) or primary polydipsia. However, the polyuria with water loss is appropriate in polydipsia but inappropriate in DI. Serum Na > 145 mEq/L with a urine osmolality < serum osmolality excludes primary polydipsia and suggests DI. However, patients with an intact thirst mechanism will have adequate water intake to compensate for the water loss and may have a normal sodium level (as in this patient). In cases where a clinical diagnosis is difficult, a water deprivation test should be done to confirm the diagnosis. However, patients suspected of having nephrogenic DI should receive desmopressin without water deprivation and be monitored for a lack of response. This patient is able to concentrate her urine and preserve her plasma osmolality at a normal level in response to observed water deprivation. This suggests that antidiuretic hormone (ADH) release and action are both intact and that the cause of her polyuria is excess fluid intake (primary polydipsia). Her urinary concentration may be subnormal due to chronic water diuresis. (Choice A) Amphetamine abuse can lead to hyponatremia due to increased fluid intake (from hyperthermia) and persistent secretion of ADH that decreases water excretion. This patient's water deprivation test is more consistent with primary polydipsia. (Choice B) Central diabetes insipidus would be associated with weight loss, increasing plasma osmolality (due to renal water loss), and urine osmolality < 300 mOsm/kg in response to water deprivation. (Choice C) Nephrogenic diabetes insipidus would not be associated with an increase in urine osmolality to this level with water deprivation. (Choice E) Chronic diuretic use/abuse is usually associated with hypokalemic alkalosis, which is not present in this patient. Educational objective: Polyuria and polydipsia can be due either to a solute diuresis (usually uncontrolled diabetes mellitus with glycosuria) or a water diuresis. Water diuresis can be due to impaired ADH secretion (central DI), impaired action of ADH on the kidney (nephrogenic DI), or excess fluid intake. The response to controlled/observed water deprivation differentiates among these possibilities.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_039",
"system": "Renal",
"stem": "A 45-year-old man comes to the emergency department due to shortness of breath. His symptoms began when he woke up today and have not diminished since. The patient also reports mild chest pressure but has no cough, fever, wheezing, or chest pain. He was diagnosed with idiopathic membranous nephropathy 6 months ago during evaluation of anasarca, and cyclophosphamide and prednisone therapy were begun due to persistent heavy proteinuria. The patient is a lifelong nonsmoker and does not use alcohol or illicit drugs. Temperature is 37.2 C (99.0 F), blood pressure is 144/84 mm Hg, pulse is 112/min and regular, and respirations are 18/min. Oxygen saturation is 91% while breathing ambient air. There is no jugular venous distension. The lungs are clear on auscultation, and cardiac examination shows no abnormalities with the exception of tachycardia. The patient has 2+ bilateral, lower extremity pitting edema. There is no calf tenderness. Laboratory results are as follows: Hematocrit 38%, Platelets 200,000/mm^{3}, Creatinine 1.8~mg/dL, Calcium 8.8~mg/dL, Albumin 2.0~g/dL, Troponin I 0.3~ng/mL (normal: <0.012~ng/mL), B-type natriuretic peptide 233~pg/mL (normal <100~pg/mL). Urinalysis: Specific gravity 1.015, Protein 3+, Blood Negative, White blood cells 1-2/hpf, Red blood cells 5-10/hpf, Casts Occasional granular. ECG shows sinus tachycardia with nonspecific ST-T changes. Which of the following conditions is most likely associated with this patient's current symptoms?",
"choice_a": "Drug-associated pulmonary toxicity",
"choice_b": "Occlusion of the right coronary artery",
"choice_c": "Rapid accumulation of pericardial fluid",
"choice_d": "Stenosis of the renal arteries",
"choice_e": "Thrombosis of the renal veins",
"correct_answer": "E",
"explanation": "This patient with membranous nephropathy (a nephrotic syndrome) and acute-onset shortness of breath, chest pain, and tachycardia likely has a pulmonary embolism (PE) In patients with nephrotic syndrome, PE is often the presenting manifestation of chronic renal venous thrombosis ( (RVT). Patients with nephrotic syndrome (urine protein >3.5 g/day, albumin <3~g/dL edema) have a markedly increased risk of (venous > arterial) thrombosis, with 12\\%-30\\% of patients developing PE. The hypercoagulable state is likely due to both urinary loss of antithrombin III and plasminogen and increased levels of fibrinogen with platelet activation. Membranous nephropathy, the most common cause of nephrotic syndrome, carries the highest risk of thrombosis; up to 60% of patients with membranous nephropathy will develop RVT. This risk is particularly high in patients with >1k g/day of urinary protein or <2 g/dL of serum albumin. RVT that develops in membranous nephropathy is typically chronic, asymptomatic, and often not associated with worsening renal function or proteinuria (as opposed to acute RVT, which presents with pain, hematuria, and renal failure). The thrombus can propagate into the inferior vena cava and embolize into the pulmonary vasculature, resulting in PE (often the only manifestation of chronic RVT). Diagnosis of RVT can be made by selective venography, Doppler ultrasound, CT scan, or MRI; however, routine screening in membranous nephropathy is not recommended. Treatment is anticoagulation. (Choice A) Cyclophosphamide pulmonary toxicity typically results in a pneumonitis with symptoms of cough, fatigue, and dyspnea. It would be unlikely to cause acute chest pain, tachycardia, and a troponin elevation. (Choice B) Right coronary artery myocardial infarction causes an inferior wall myocardial infarction, which in turn causes chest pain and dyspnea; however, an ECG would show ST elevations in the inferior leads (II,III, and aVF). If the right ventricle is involved, hypotension and elevated jugular venous pressure will predominate. The troponin elevation is likely due to right heart strain from acute PE. (Choice C) Pericardial effusions can cause shortness of breath and tachycardia; however, patients typically have elevated jugular venous distension, hypotension, and low voltages on ECG. (Choice D) Bilateral renal artery stenosis can cause flash pulmonary edema (Pickering syndrome); however, this typically presents with hypoxia, severe hypertension, and jugular venous distension. Educational objective: Nephrotic syndrome, particularly membranous nephropathy, is associated with a high frequency of thromboembolic events, predominately deep venous and renal venous thrombosis. Renal venous thrombosis is often asymptomatic; pulmonary embolism may be the presenting sign.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_040",
"system": "Renal",
"stem": "A 40-year-old man with end-stage renal disease comes to the office for routine follow-up. He has been on chronic hemodialysis for the last 3 years. The patient's parathyroid hormone and alkaline phosphatase levels have increased progressively despite efforts to maintain normal serum phosphorus with phosphate binders and oral vitamin D. Laboratory results are as follows: Creatinine 4.8 mg/dL, Calcium 9.6 mg/dL, Albumin 3.4~g/dL, Alkaline phosphatase 320~U/L, Phosphorus, inorganic, serum 5.1 mg/dL, Parathyroid hormone, serum 700 pg/mL, Vitamin D (25-hydroxycholecalciferol) 60 ng/mL. Adding cinacalcet to this patient's regimen would most likely contribute to which of the following?",
"choice_a": "Decreased need for parathyroidectomy",
"choice_b": "Decreased occurrence of cardiovascular events",
"choice_c": "Development of osteitis fibrosa",
"choice_d": "Prolonged overall survival",
"choice_e": "Symptomatic hypercalcemia",
"correct_answer": "A",
"explanation": "Untreated or inadequately treated hyperphosphatemia and hypocalcemia in chronic kidney disease lead to secondary hyperparathyroidism. Calcimimetics increase the calcium sensitivity of calcium-sensing receptors on parathyroid glands and reduce serum PTH, calcium, and phosphate levels. Cinacalcet (Sensipar®) reduces fracture risk and improves symptoms of secondary hyperparathyroidism (eg, pruritus, bone pain, fractures, calciphylaxis, and avascular necrosis). Cinacalcet decreases the need for parathyroidectomy by approximately 50%. However, calcimimetics should not be used in patients with hypocalcemia as they may cause seizures and prolong the QT interval. (Choices B and D) Cinacalcet has been shown to reduce cardiovascular risk in patients age >65 but not in younger individuals. (Choice C) Cinacalcet decreases bone turnover due to secondary hyperparathyroidism and therefore reduces the risk for osteitis fibrosa development. (Choice E) The major side effects of cinacalcet are hypocalcemia and gastrointestinal disturbances. Educational objective: Calcimimetics such as cinacalcet decrease the frequency of fractures and the rate of parathyroidectomy in patients with chronic kidney disease who have hyperphosphatemia and secondary hyperparathyroidism. Calcimimetics also reduce the risk of cardiovascular disease in older patients (age >65). Major side effects are hypocalcemia and gastrointestinal disturbances.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_041",
"system": "Renal",
"stem": "A 67-year-old man comes to the physician because of bloody urine. This morning, he noticed gross hematuria with passage of a few small blood clots in his urine. He also reports mild dysuria. He has since continued to have grossly bloody urine with occasional small blood clots. He denies fever, chills, back/flank pain, and bruising or bleeding at other sites. He denies any history of urolithiasis or trauma. His other medical problems include a history of granulomatosis with polyangiitis (Wegener's) diagnosed 3 years ago. At that time, he was treated with 6 months of oral cyclophosphamide and tapering doses of prednisone. He has subsequently been maintained on oral methotrexate. He denies recent weight loss, arthralgias, or respiratory symptoms. His blood pressure is 130/86 mm Hg, pulse is 84/min, and respirations are 16/min. He is afebrile. There are no bruises or petechiae. He does not have any flank pain. Cardiopulmonary examination is normal. After sending a urine sample to the laboratory for culture, the following laboratory results are obtained: Hematocrit 34%, Platelets 180,000~cells/mu L, Leukocyte count 7,600~cells/mu L, Serum chemistry Creatinine 1.7~mg/dL (unchanged from previous values), International Normalized Ratio (INR) 1.0, Activated partial thromboplastin time 23 sec, Urinalysis Specific gravity 1.013, Protein +1, Blood gross. Which of the following would have the highest diagnostic yield?",
"choice_a": "Abdominal CT scan without contrast",
"choice_b": "ANCA, C-reactive protein, and ESR",
"choice_c": "Cystoscopy",
"choice_d": "Phase contrast microscopy of urine red blood cell morphology",
"choice_e": "Ultrasound-guided renal biopsy",
"correct_answer": "C",
"explanation": "When hematuria is of renal glomerular or tubular/interstitial origin, a relatively small amount of blood is diluted by tubular fluid and urine. Also, tissue plasminogen and urokinase are present within the tubules and glomeruli. Consequently, glomerular and other intrarenal causes of hematuria are rarely, if ever, associated with the passage of clots into the urine. This patient has a history of cyclophosphamide exposure and presents with painless hematuria in the absence of urinary tract symptoms. Evaluation for bladder lesions via cystoscopy would have the highest diagnostic yield. Cyclophosphamide can induce a chemical cystitis and be associated with the development of bladder cancer. (Choice A) An abdominal CT to look for a renal tumor or stones is appropriate; however, given this patient's history, cystoscopy is of higher diagnostic yield. (Choice B and E) Measurement of ANCA, C-reactive protein, and ESR may help ascertain the activity of this patient's granulomatosis with polyangiitis. A renal biopsy can diagnose and classify kidney involvement in granulomatosis with polyangiitis. However, this patient has a non-glomerular source for his hematuria and cystoscopy is the diagnostic test of choice. (Choice D) The detection of dysmorphic red blood cells (cells with blebs or protrusions, so-called \"Mickey-Mouse\" head RBCs) in the urine is highly suggestive of a glomerular source of hematuria, as is the presence of RBC casts and >500~mg/day of proteinuria. In this patient, the passage of urinary clots strongly suggests the presence of an extra-glomerular site of bleeding, and cystoscopy should be performed even if dysmorphic urinary RBCs are present. Educational objective: In patients with hematuria, the passage of blood clots in the urine indicates a non-glomerular source of urinary tract bleeding. Thus, evaluation should proceed accordingly.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_042",
"system": "Renal",
"stem": "A 67-year-old man comes to the office for evaluation of bilateral leg swelling. The patient has had 3 months of swelling of the feet and ankles, which has progressively worsened to involve the legs, arms, and lower back. He also noticed shortness of breath 3 months ago while walking a few blocks, and his dyspnea now occurs after walking only a single block. Past medical history is significant for type 2 diabetes mellitus, mild peripheral neuropathy, and hypertension. His medications include metformin, lisinopril, and hydrochlorothiazide. Blood pressure is 130/90 mm Hg, pulse is 72/min, and respirations are 14/min. There is no retinopathy. The patient has distended jugular neck veins to the angle of the jaw. Cardiac examination shows an S4 without murmurs. Pulmonary examination reveals bibasilar crackles but otherwise is clear to auscultation. Abdominal examination shows hepatomegaly without splenomegaly. He has 4+ pitting edema to the mid-thigh bilaterally. Laboratory and ECG results are as follows: Creatinine 1.7~mg/dL, Glucose 120~mg/dL, Albumin 2.2~g/dL, Total cholesterol 320~mg/dL, Hemoglobin A1c 6.5%, Urinalysis: Specific gravity 1.013, Protein 4+, Blood negative, Glucose negative, Leukocyte esterase negative, White blood cells 1-2/hpf, Red blood cells (RBCs) 1-2/hpf, RBC casts none, HIV-1 antibody negative, HIV-2 antibody negative. Which of the following is the most likely diagnosis?",
"choice_a": "Diabetic nephropathy",
"choice_b": "Focal segmental glomerulosclerosis",
"choice_c": "Idiopathic membranous nephropathy",
"choice_d": "IgA nephropathy",
"choice_e": "Primary amyloidosis",
"correct_answer": "E",
"explanation": "This patient's heavy proteinuria, peripheral edema, and low albumin suggest nephrotic syndrome (NS). Common etiologies of adult NS include minimal change disease, lupus, focal segmental glomerulosclerosis, membranous nephropathy, and amyloidosis. This patient's clinical findings of heart failure and low-voltage QRS complexes suggest restrictive cardiomyopathy. The combination of restrictive cardiomyopathy and NS is consistent with amyloidosis, which causes up to 20% of NS in patients age >60. Amyloidosis is characterized by extracellular fibrillar deposition of low molecular weight proteins. Amyloid light-chain (AL, or primary) amyloidosis is due to deposition of monoclonal immunoglobulin light chains and can be associated with other plasma cell dyscrasias (eg, multiple myeloma). Amyloid A (AA, or secondary) amyloidosis is usually due to elevated serum amyloid A, which is associated with chronic inflammatory conditions (eg, rheumatoid arthritis). Systemic features (eg, fatigue, weight loss) are more common in AL amyloidosis, though both types can involve multiple organs (Table). Diagnosis can be suggested by detection of a monoclonal protein in serum or urine and is confirmed by positive Congo red stain on tissue biopsy. Treatment (in addition to managing the underlying condition) is largely supportive with <1 year median survival in cardiac amyloidosis. (Choice A) Diabetes can cause peripheral neuropathy and restrictive cardiac disease. However, there is usually a correlation between neuropathy and A1c level (this patient's A1c is not significantly elevated at 6.5%), and patients with diabetic nephropathy also tend to have concurrent retinopathy, which is absent in this patient. (Choices B and C) Focal segmental glomerulosclerosis and idiopathic membranous nephropathy can cause nephrotic range proteinuria, as seen in this patient. However, neither condition is usually associated with neuropathy or restrictive cardiomyopathy. (Choice D) IgA nephropathy typically presents with significant proteinuria, hematuria, dysmorphic red blood cells, and possibly red blood cell casts on urinalysis. This patient's bland urinary sediment makes this less likely. Educational objective: Amyloidosis (primary IAL] or secondary [AA]) is a common cause of nephrotic syndrome in patients age >60. Other common manifestations include restrictive cardiomyopathy with heart failure. Treatment is largely supportive.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_043",
"system": "Renal",
"stem": "An 18-year-old man comes to the office because a college physical urinalysis indicated that he had proteinuria. The patient does not recall having a previous urinalysis. He denies flank pain, hematuria, dysuria, nocturia, edema, urinary frequency, hypertension, or family history of kidney disease. His review of systems provides no significant information. He is in excellent health, with the exception of one or two upper respiratory infections per year. He takes no medications. He has no known drug allergies. He does not use tobacco or illicit drugs and rarely drinks alcohol. He has no history of a sexually transmitted disease and he is not sexually active. His blood pressure is 120/76 mm Hg, pulse is 64/min, and respirations are 12/min. On examination, he appears healthy. Cardiovascular, pulmonary, and abdominal examinations show no abnormalities. He has no edema. The patient's laboratory studies reveal: Hematocrit 44%, Platelet count 245,000/mm^{3}, Leukocyte count 8,100/mm^{3}. Serum chemistry: Serum sodium 140~mEq/L, Serum potassium 4.2~mEq/L, Chloride 102~mEq/L, Bicarbonate 24~mEq/L, Serum creatinine 0.8~mg/dL. Urine: Specific gravity 1.020, Protein 2+, Blood negative, Glucose negative, Ketones negative, Leukocyte esterase negative, Nitrites negative, WBC 1-2/hpf, RBC 1-2/hpf, Casts none. 24-hour urine: Protein 2,100~mg/24 h, Calculated creatinine clearance 121~mL/min. Blood, plasma Protein: Total 7.0~g/dL, Albumin 4.2~g/dL. Which of the following is the most appropriate course of action?",
"choice_a": "HIV testing",
"choice_b": "Kidney biopsy",
"choice_c": "Kidney CT scan",
"choice_d": "Spot urine protein/creatinine ratio upon arising and at the end of the day",
"choice_e": "Urinary protein electrophoresis",
"correct_answer": "D",
"explanation": "This patient presents with isolated proteinuria, defined as proteinuria without hematuria or elevated serum creatinine. His unremarkable history, normal estimated glomerular filtration rate, normal blood pressure, and normal urinalysis collectively suggest the absence of significant kidney disease. Orthostatic proteinuria is a condition seen in children, adolescents, and young adults under the age of 30. It is characterized by significant proteinuria in the upright position, but minimal to no proteinuria in the supine position. Long-term follow-up of individuals with this condition has shown resolution of the proteinuria with advancing age in most patients, without development of renal failure. A spot urine sample for protein and creatinine provides a reasonable assessment of quantitative proteinuria, and should be collected during the first morning void and then later in the day in the upright position. Demonstration of little to no proteinuria in the supine position compared to significant proteinuria in the upright position supports the diagnosis. (Choice A) While HIV nephropathy can present as proteinuria, this patient appears to be at low risk for HIV and does not have evidence of kidney disease. (Choice B) In the absence of evidence of active renal disease, a renal biopsy is not indicated. (Choice C) Because this patient has normal renal function and no genitourinary tract symptoms, there is no clear indication for kidney imaging. (Choice E) Electrophoresis of urinary proteins can provide information on the molecular size of proteins in the urine. However, this is not indicated in this patient without evidence of active kidney disease or a systemic disorder. Educational objective: Orthostatic proteinuria is a benign condition commonly seen in children and young adults (2-5%). It is generally less than 1 g/day, but may surpass 3 g/day in select patients. The diagnosis can be established by finding a difference in quantitative proteinuria estimated by spot urine protein-to-creatinine ratio obtained upon arising (little, if any, proteinuria) and at the end of the day before recumbency (significant proteinuria).",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_044",
"system": "Renal",
"stem": "A 55-year-old man comes to the physician for follow-up of chronic kidney disease. He feels well overall and has no acute problems. His medical problems include type 2 diabetes mellitus, hypertension, obesity, and hyperlipidemia. His medications include furosemide, simvastatin, low-dose aspirin, amlodipine, and glipizide. Physical examination is normal with +2 peripheral pulses in all extremities. Laboratory results are as follows: Sodium 136 mEq/L, Potassium 4.4~mEq/L, Chloride 102 mEq/L, Bicarbonate 22~mEq/L, Creatinine 3.0~mg/dL, Calcium 8.0~mg/dL, Glucose 120~mg/dL, Albumin 3.7~g/dL, Phosphorus, inorganic 6.0~mg/dL, Parathyroid hormone 200~pg/mL. In addition to a phosphate-restricted diet, which of the following would be the preferred therapeutic option?",
"choice_a": "1,25 dihydroxyvitamin D",
"choice_b": "Aluminum hydroxide",
"choice_c": "Calcium acetate",
"choice_d": "Lanthanum",
"choice_e": "Sevelamer",
"correct_answer": "C",
"explanation": "Chronic kidney disease (CKD) is associated with hyperphosphatemia due to impaired ability of the kidneys to excrete phosphorus. Hyperphosphatemia is thought to be the inciting event in the onset of CKD-related mineral bone disease (MBD) (osteitis fibrosa, osteomalacia, and adynamic bone disease). Elevated serum phosphate triggers the release of fibroblast growth factor-23 from bone, which lowers calcitriol production and intestinal calcium absorption. Reduced serum calcium, along with hyperphosphatemia, leads to secondary hyperparathyroidism. Early dietary phosphorus restriction is recommended in all individuals with CKD. Phosphate $(PO{4})$ binders are usually needed as dietary restriction is not sufficient to lower $PO{4}$ levels. $PO{4}$ binders can be calcium containing (calcium carbonate/acetate) or non-calcium containing (sevelamer and lanthanum). Both are equally effective in treating hyperphosphatemia, although calcium-containing binders may be better tolerated. Calcium-containing binders are used in hypocalcemic patients and are also preferred in normocalcemic patients due to cost issues. (Choice A) This patient has normal serum calcium, and vitamin D therapy may further increase serum calcium and promote vascular calcification. (Choice B) Aluminum hydroxide is a potent phosphorus-binding agent, but chronic absorption and accumulation may lead to adynamic bone disease and nonreversible encephalopathy. It should be avoided in CKD patients. (Choices D and E) Excess serum calcium can promote coronary arterial calcification. Non-calcium-containing binders are preferred in patients with hypercalcemia or evidence of vascular calcification. Calcium supplementation in patients with suppressed parathyroid hormone or suspected adynamic bone disease can worsen CKD-MBD. Therefore, sevelamer or lanthanum is also preferred in these patients. Educational objective: Hyperphosphatemia is the inciting event for chronic kidney disease-related mineral bone disease (osteitis fibrosa, osteomalacia, adynamic bone disease). Calcium-containing phosphate binders are preferred in hypocalcemic and normocalcemic patients. Non-calcium-containing binders are used in patients with hypercalcemia, low parathyroid hormone levels, vascular calcification, or suspected adynamic bone disease.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_045",
"system": "Renal",
"stem": "A 64-year-old man comes to the office due to frequent urination. He has a history of benign prostatic hyperplasia with mild hesitancy and occasional nocturia. During the past 8 weeks, he has been bothered by 2 or 3 episodes of nocturia each night and increased urinary urgency. The patient has no dysuria or hematuria and says that his daytime urinary frequency is unchanged. He also has shortness of breath with exertion. His medical history includes hypertension, hypercholesterolemia, and non-ischemic cardiomyopathy with a left ventricular ejection fraction of 40% on an echocardiogram a year ago. The patient's medications include furosemide, carvedilol, lisinopril, spironolactone, and atorvastatin. Blood pressure is 140/80 mm Hg, pulse is 76/min, and respirations are 16/min. Pulmonary examination reveals bilateral basal crackles. Rectal examination shows a diffusely enlarged prostate. He has 2+ pitting edema of the bilateral lower extremities. Serum sodium is 133~mEq/L, potassium is 3.9~mEq/L, and creatinine is 1.1~mg/dL. Urinalysis is normal. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Increase furosemide",
"choice_b": "Start doxazosin",
"choice_c": "Start finasteride",
"choice_d": "Start tolterodine",
"choice_e": "Stop beta blocker",
"correct_answer": "A",
"explanation": "This patient with benign prostatic hyperplasia (BPH) has worsening nocturia without increase in daytime urinary frequency. He also has signs of fluid retention suggesting worsening heart failure (HF). Patients with congestive HF have decreased renal plasma flow and increased filtration fraction during ambulation. These are associated with sodium retention. Nighttime recumbency improves renal perfusion and sodium excretion, resulting in nocturia. Uncontrolled congestive HF (volume overload) or conditions such as chronic obstructive pulmonary disease (increased intra-abdominal pressure from coughing and downward displacement of the diaphragm) can worsen symptoms of BPH. The first step in management is to optimize volume status by increasing the dose of diuretics. (Choices B and C) If symptoms of BPH persist in the absence of other inciting factors and after instituting behavioral interventions, an alpha-1-adrenergic antagonist and, if necessary, a 5-alpha-reductase inhibitor should be started. (Choice D) Anticholinergic agents such as tolterodine or oxybutynin may be used in BPH with significant irritative symptoms (eg, urgency, incontinence) but should not be started until the patient is euvolemic. (Choice E) Beta blockers should be continued in patients with mild CHF exacerbations without signs of hypotension; discontinuing beta blockers during mild exacerbations has been associated with increased mortality. Educational objective: Decompensated heart failure can worsen symptoms of benign prostatic hyperplasia (BPH). Volume overload should be treated with increased diuretic doses before adjustments are made to the BPH regimen.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_046",
"system": "Renal",
"stem": "A 42-year-old woman comes to the office due to a rash. She has experienced recurring \"red spots\" on her legs for 2-3 years. These appear sporadically, last a few weeks to a few months, and disappear spontaneously. The rash is not pruritic. When it occurs, the patient also experiences generalized fatigue and arthralgias involving her hips and knees. She rarely has right lower quadrant pain with the rash. Review of systems is otherwise normal. Medical history is unremarkable. The patient has no known drug allergies. Her only medication is an oral contraceptive, which she has taken for several years. She does not use tobacco, alcohol, or illicit drugs. She is single and works in an office. On examination, the patient appears healthy. Blood pressure is 136/86 mm Hg, pulse is 72/min, and respirations are 14/min. BMI is 24~kg/m^{2}. Physical examination is normal except for the skin. A total of 10-12 palpable red lesions, measuring 1\times0.5 cm, are scattered over both lower extremities distal to the mid-calf. The lesions are nontender and do not blanch with pressure. Laboratory results are as follows: Leukocytes 8,000/mm^{3}, Hematocrit 38%, Platelets 240,000/mm^{3}, Creatinine 1.4~mg/dL. Urine: Specific gravity 1.020, Blood trace, Protein 2+, Glucose negative, Ketones negative, Leukocyte esterase negative, Nitrites negative, White blood cells 1-2/hpf, Red blood cells 10-20/hpf, Casts occasional red blood cell cast. Which of the following would most likely be found in this patient?",
"choice_a": "Anti-double-stranded DNA antibodies",
"choice_b": "Anti-hepatitis C virus antibodies",
"choice_c": "Anti-Ro antibodies",
"choice_d": "Capillary IgA deposits on skin biopsy",
"choice_e": "Focal glomerular sclerosis on renal biopsy",
"correct_answer": "D",
"explanation": "This patient likely has Henoch-Schönlein purpura (HSP); although often thought to be a childhood disorder, HSP and its recurrent forms are also seen in adults. It classically presents with the tetrad of palpable purpura (multiple raised, erythematous, nonblanching lesions on the lower extremities), abdominal pain, arthritis, and renal involvement in the form of glomerulonephritis; however, many patients do not have the full tetrad. The disease is a leukocytoclastic vasculitis characterized on skin biopsy by prominent IgA-immune complex deposition in small vessels. IgA deposits also affect the mesangium, resulting in a wide spectrum of renal dysfunction ranging from asymptomatic hematuria to nephrotic syndrome with acute kidney injury. Adults are much more likely than children to experience progressive renal decline. Treatment is mainly supportive; however, glucocorticoids are used in patients with severe renal disease (eg, >750~mg/day of proteinuria, nephrotic syndrome). (Choice A) Anti-double-stranded DNA antibodies are specific for systemic lupus erythematosus. Although this condition often involves the joints and kidneys, it is typically associated with a malar or discoid rash (eg, scarring erythematous plaque with scale) rather than palpable purpura. (Choice B) Mixed cryoglobulinemia syndrome is associated with hepatitis C infection in up to 95% of cases. The vasculitis presents like that of HSP, with palpable purpura, renal disease, and arthralgias; however, peripheral neuropathy is often present, and abdominal pain is less common and typically less prominent. In addition, hepatitis C infection is unlikely in this patient who was born after 1965 and has no intravenous drug use or blood transfusion history. (Choice C) Anti-Ro antibodies commonly occur in Sjögren syndrome, which is rarely associated with palpable purpura. However, these patients characteristically have sicca symptoms (dry eyes and mouth. parotid gland enlargement), and abdominal pain and renal dysfunction are not typical. (Choice E) Kidney biopsy in HSP usually demonstrates mesangiocapillary glomerulonephritis with prominent deposition of IgA. Focal glomerular sclerosis can occur in many contexts (eg, HIV, lupus nephritis, heroin use) but is less common in HSP. Educational objective: Henoch-Schönlein purpura is a systemic vasculitis characterized by IgA-immune complex deposition in small vessels and the renal mesangium. It is most common in children but can present in adults and should be suspected in patients with some combination of palpable purpura, abdominal pain, arthritis, and renal dysfunction.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_047",
"system": "Renal",
"stem": "A 70-year-old man seeks advice for continuing bladder problems. Over the last several years, the patient has had a slow decrease in the volume and force of his urinary stream associated with nocturia and urinary frequency. When seen in the office 12 months ago, his American Urological Association symptom score was 18 (indicating significant symptoms). Digital rectal examination showed a slightly enlarged, smooth, nontender prostate. Urinalysis and prostate-specific antigen were normal. The patient was prescribed a long-acting alpha adrenergic blocker and his symptoms improved. However, he now has intermittent urinary incontinence associated with a strong urge to void. This usually occurs when he senses a full bladder, but it is also triggered by the sound of running water or with exposure to cold. Limiting his fluid intake and scheduling himself to void frequently have not helped. The patient has had no associated dysuria and has not added any new medications in the past year. Genitourinary examination including prostate examination is unchanged from a year ago. Urinalysis is normal. Ultrasound bladder scan estimates a residual urine volume of 60 mL. Which of the following is the best next step in management of this patient's urinary symptoms?",
"choice_a": "Add a 5-alpha reductase inhibitor",
"choice_b": "Add an antimuscarinic agent",
"choice_c": "Change to another alpha-adrenergic blocking agent",
"choice_d": "Sacral nerve stimulation",
"choice_e": "Urodynamic testing",
"correct_answer": "B",
"explanation": "This patient has benign prostatic hyperplasia (BPH) and initially had typical obstructive voiding symptoms (eg, nocturia, decreased force of stream). However, he has developed urge incontinence, which is caused by detrusor hyperactivity leading to involuntary urine leakage associated with a sudden urge to void. The causes of detrusor hyperactivity are not always apparent, although it frequently occurs in the setting of neurologic disorders and urinary tract infections. Initial management of urge incontinence should include behavioral modification (eg, bladder training, fluid management strategies). Some men with urge incontinence in the setting of BPH may see improvement with alpha-adrenergic antagonist therapy (eg, terazosin, tamsulosin). Persistent symptoms often respond to antimuscarinic agents (eg, tolterodine, oxybutynin). Low-dose antimuscarinic drugs have been shown to be safe and effective for urge incontinence in men with underlying BPH; however, postvoid residual volume (PVR) should be measured prior to initiating therapy. Antimuscarinic agents should be used with caution to avoid causing urine retention in patients with PVR >200 mL. Common side effects include dizziness, dry mouth, and constipation. (Choice A) 5-alpha reductase inhibitors (eg, finasteride) improve lower urinary tract symptoms in men with BPH and large prostate volumes. However, these agents require several weeks to work and are not effective in men without large prostate volumes, such as this patient. (Choice C) It is unlikely that switching to another alpha-adrenergic blocking agent would improve this patient's urge incontinence symptoms. (Choice D) Sacral nerve stimulation via surgical lead placement is the most common and effective long-term surgical intervention for urge incontinence, but it is reserved for patients who fail combined medical therapy. (Choice E) Urodynamic studies provide information on bladder sensation, capacity, detrusor activity, outlet obstruction, and urine flow. However, these tests are invasive and are reserved for evaluation of individuals with unclear or possible multifactorial etiology. Educational objective: Urge incontinence in the setting of benign prostatic hyperplasia (BPH) often responds to alpha-adrenergic blockers. Antimuscarinic agents can be added for patients with persistent symptoms, but postvoid residual volume should be measured before initiating these medications in men with BPH.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_048",
"system": "Renal",
"stem": "A 40-year-old man seeks evaluation for edema. Two days ago, he had sudden onset of swelling in his legs. There was no associated warmth, redness, or tenderness. The patient had a mild cold a week ago and was taking over-the-counter cold remedies. He thought the swelling was an allergic reaction that would go away, but it has not. His past medical history is unremarkable. The patient does not use tobacco, alcohol, or illicit drugs. He takes no prescription or over-the-counter medications. There is no family history of kidney disease. The patient's temperature is 36.7 C (98.1 F), blood pressure is 120/70 mm Hg, and pulse is 78/min. He has 3+ pitting edema to the mid-thigh bilaterally. Otherwise, his physical examination is unremarkable. Laboratory results are as follows: Complete blood count: Hematocrit 42%, Leukocytes 6,900/mm^{3}. Serum chemistry panel: Sodium 140 mEq/L, Potassium 3.8~mEq/L, Chloride 102~mEq/L, Bicarbonate 26~mEq/L, Blood glucose 100~mg/dL, Albumin 1.9~g/dL, Total cholesterol 420~mg/dL. Urinalysis: Specific gravity 1.015, pH 5.5, Protein 4+, Blood Negative, Glucose Negative, White blood cells 1-2/hpf, Red blood cells 1-2/hpf, Casts None, Crystals None. Which of the following diagnoses is most likely to be made with renal biopsy?",
"choice_a": "Allergic interstitial nephritis",
"choice_b": "IgA nephropathy",
"choice_c": "Membranoproliferative glomerulonephritis",
"choice_d": "Minimal change disease",
"choice_e": "Postinfectious glomerulonephritis",
"correct_answer": "D",
"explanation": "This patient has explosive-onset nephrotic syndrome (edema, 4+ proteinuria, low albumin, elevated cholesterol) occurring shortly after an upper respiratory infection and characterized by lack of red cells or casts on urinalysis, well-maintained glomerular filtration rate, and normal blood pressure. Taken together, these findings are most consistent with minimal change or nil (nothing in light microscopy) disease. Minimal change disease accounts for a large percentage (70%-90%) of childhood and 10%-15% of adult non-diabetic nephrotic syndromes, but the cause remains unknown in the majority of cases. Sudden-onset nephrotic syndrome (as opposed to more progressive proteinuria seen with other forms of nephrotic syndrome) and occurrence after an upper respiratory or systemic infection are typical, some (but not most) patients will have acute kidney injury and hypertension. Renal biopsy usually shows normal-appearing glomeruli on light microscopy and no immune deposits by immunofluorescence. Electron microscopy usually shows effacement of the podocyte foot processes. Adults with new-onset nephrotic syndrome should undergo a renal biopsy to confirm diagnosis, guide therapy, and determine prognosis. Treatment of minimal change disease typically involves corticosteroids. (Choice A) Patients with allergic interstitial nephritis usually do not have proteinuria or nephrotic syndrome. The triad of fever, rash, and eosinophilia due to drug reaction (most frequently nonsteroidal inflammatory drugs, penicillins, or other antibiotics) is classic though not commonly seen. (Choice B) Almost all patients with IgA nephropathy have hematuria (either microscopic or macroscopic), sometimes following upper respiratory tract infection (\"synpharyngitic hematuria\"). (Choice C) Membranoproliferative glomerulonephritis is usually associated with hematuria and red blood cell casts on urinalysis. These features are not present in this patient. (Choice E) Postinfectious glomerulonephritis often presents with edema, hematuria, leukocyturia, and hypertension, typically 2 weeks after skin or respiratory tract infection in adults. This patient's urine sediment shows no significant leukocytes or erythrocytes. Educational objective: Explosive-onset nephrotic syndrome characterized by heavy proteinuria and profound hypoalbuminemia and that occurs shortly following an upper respiratory infection is typical for minimal change disease. Because the clinical phenotype does not accurately predict renal histopathology, most adults with non-diabetic nephrotic syndrome should undergo renal biopsy to confirm diagnosis and guide therapy.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_049",
"system": "Renal",
"stem": "A 32-year-old man comes to the office for evaluation after a recent visit to the emergency department due to recurrent nephrolithiasis. The patient passed the stone spontaneously with supportive care alone. Analysis of the stone composition later revealed calcium oxalate crystals. The patient drinks 1 or 2 beers daily but does not use tobacco or illicit drugs. His diet consists of mostly processed foods and meats obtained at local stores, and he avoids fruits, vegetables, and dairy products. Vital signs are within normal parameters. BMI is 32~kg/m^{2} Physical examination is normal. Serum chemistry is normal. You provide affirmation of his desire to lose weight and recommend increasing his water intake. In addition to weight loss and increased fluid intake, which of the following is the best dietary recommendation to reduce the risk of recurrent nephrolithiasis in this patient?",
"choice_a": "Add daily cranberry juice",
"choice_b": "Avoid coffee, tea, and alcohol",
"choice_c": "Decrease dietary purines",
"choice_d": "Increase dietary calcium",
"choice_e": "Increase dietary sodium",
"correct_answer": "D",
"explanation": "Nephrolithiasis occurs when supersaturated metabolites crystallize in the urine. Approximately 75% of kidney stones are calcium based (primarily calcium oxalate), and up to 50% of patients develop recurrent stones within 5 years. Dietary modifications can reduce the risk of stone formation, primarily by reducing urinary calcium and oxalate. In the past, patients were counseled to avoid calcium, but high dietary calcium intake actually decreases the risk of stone formation. Dietary calcium binds oxalate within the gastrointestinal tract, thereby decreasing systemic absorption of oxalate and subsequent excretion into the urine. However, supplemental (vs dietary) calcium may actually raise the risk of stone formation. If patients have recurrent stones despite dietary measures, medications (eg, thiazide diuretics, potassium citrate, allopurinol) may be needed to alter urine composition. (Choice A) Cranberry juice is often promoted to reduce the risk of urinary tract infections. However, its effect on the formation of calcium oxalate stones is unclear. Increasing dietary calcium is a better option to decrease the risk of stone formation. (Choice B) Despite prior recommendations, coffee, tea, and alcohol actually decrease the risk of calcium stone formation through their inhibition of antidiuretic hormone, leading to increased urine volume and decreased concentration of solutes (eg, calcium, oxalate). (Choice C) Reduction of high purine-containing foods (eg, seafood, organ meats) decreases uric acid production and is recommended for patients with uric acid stones, not calcium stones. (Choice E) Calcium is passively reabsorbed in the proximal tubule following sodium and water reabsorption. High sodium intake decreases proximal tubule sodium reabsorption and leads to increased urinary calcium levels, thereby raising the risk of calcium stone development. Educational objective: Calcium oxalate stones are the most common cause of nephrolithiasis. To reduce the risk of recurrent nephrolithiasis, patients should increase intake of fluids, dietary calcium, and fruits and vegetables, and decrease intake of sodium and animal protein.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_050",
"system": "Renal",
"stem": "A 58-year-old man with type 2 diabetes mellitus comes to the physician for a follow-up appointment. His other medical problems include obesity and chronic kidney disease with a baseline creatinine of 1.5~mg/dL and urine protein excretion of 1100~mg/day. He has failed to lose weight despite diet adjustments and aerobic exercise. The patient takes insulin daily. His blood pressure is 140/89 mm Hg and his pulse is 83/min. Body mass index is 30~kg/m^{2}. He is started on lisinopril 5 mg daily. The patient returns for a follow-up appointment 2 weeks later and reports feeling well. His blood pressure is 133/85 mm Hg. Repeat testing shows creatinine of 1.8~mg/dL and potassium of 4.8~mEq/L. Which of the following is the best next step in management of this patient?",
"choice_a": "Add irbesartan and repeat testing in 2-3 weeks",
"choice_b": "Continue lisinopril and repeat testing in 2-3 weeks",
"choice_c": "Discontinue lisinopril and repeat testing in 2-3 weeks",
"choice_d": "Switch to amlodipine and repeat testing in 2-3 weeks",
"choice_e": "Switch to valsartan and repeat testing in 2-3 weeks",
"correct_answer": "B",
"explanation": "This patient presents for management of diabetic nephropathy (ie, albuminuria of >300~mg/day or >300 mg/g creatinine on random urine sample). In addition to strict glycemic control and good blood pressure control (goal <140/90 mm Hg), inhibition of the renin-angiotensin-aldosterone system is a staple of therapy. Important side effects of angiotensin-converting-enzyme (ACE) inhibitor and angiotensin II receptor blocker (ARB) therapy include an expected initial decrease in glomerular filtration rate (GFR) from reduced renal capillary pressure (due to greater relaxation of the efferent arteriole) and possible rise in serum potassium from reduced levels of aldosterone. These side effects should be monitored closely, especially at the outset of therapy or during dose titration. A rise in serum creatinine of up to 30%-35% from baseline is acceptable and should not cause discontinuation of therapy (Choice C). Moderate elevations in serum potassium ( (le5.1-5.5~mEq/L) above normal limits should lead to dose reductions, and more severe elevations that cannot be managed with diuretics warrant discontinuation of therapy. (Choice A) Studies examining the effects of combining ARB and ACE inhibitor therapy have demonstrated no significant benefits over monotherapy. However, they have shown an increase in adverse events, including higher rates of acute kidney injury requiring dialysis, hospitalization, severe hyperkalemia, and hypotension. (Choice D) Although good blood pressure control (goal <140/90 mm Hg) is associated with a number of improved outcomes in patients with diabetes and diabetic nephropathy, ACE inhibitor or ARB therapy is preferred over calcium channel blockers due to the additional renal protective effects. (Choice E) Current guidelines do not prefer ARB over ACE inhibitor therapy unless a patient is unable to tolerate an ACE inhibitor (eg, cough). Both classes of medications have similar reductions in GFR and elevations in serum potassium. Educational objective: Angiotensin-converting enzyme inhibitors or angiotensin II receptor blockers are first-line medications for the management of diabetic nephropathy due to their renal protective effects. Both therapies are associated with a rise in serum creatinine of up to 30%-35% from baseline; this is acceptable and should not cause discontinuation of therapy.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_051",
"system": "Renal",
"stem": "An 80-year-old man comes to the physician because of a skin rash on his legs. He also complains of mild fatigue and a poor energy level. He denies chest pain/pressure, orthopnea, or dyspnea with exertion. Two weeks ago, he underwent coronary arteriography for unstable angina and had a stent placed in his right coronary artery. His subsequent hospital course was uncomplicated. His other medical problems include hyperlipidemia, type 2 diabetes mellitus, hypertension, and mild cognitive impairment. His current medications include low-dose aspirin, benazepril, atenolol, clopidogrel, hydrochlorothiazide, rosuvastatin, and glipizide. Clopidogrel was added after the stent placement. His blood pressure is 144/82 mm Hg and pulse is 72/min. His lungs are clear on auscultation. There is a mottled, lace-like, purplish discoloration of both lower extremities from the mid-thigh downward. His pulses are 1+ bilaterally over the distal lower extremities. Laboratory results are as follows: Hemoglobin 12.0~g/dL, Platelets 150,000~cells/mu L, Leukocyte count 8,500~cells/mu L. Differential: Neutrophils 60%, Eosinophils 13%, Lymphocytes 25%, Monocytes 2%. Serum chemistry: Sodium 136~mEq/L, Potassium 4.6 mEq/L, Chloride 98 mEq/L, Bicarbonate 22 mEq/L, Creatinine 2.9~mg/dL (1.4~mg/dL at discharge). Urinalysis: Specific gravity 1.010, Protein +1, Blood negative, Glucose negative, Leukocyte esterase negative, White blood cells 10-20/hpf, Red blood cells 5-10/hpf. Urine (spot sample) Sodium 38~mEq/24 h. Which of the following is the most likely diagnosis?",
"choice_a": "Acute interstitial nephritis",
"choice_b": "Acute kidney injury due to angiotensin converting enzyme inhibitor",
"choice_c": "Atheroembolic disease",
"choice_d": "Pre-renal acute kidney injury",
"choice_e": "Radiocontrast nephropathy",
"correct_answer": "C",
"explanation": "This patient's presentation is consistent with renal atheroembolic disease (cholesterol crystal emboli), which usually occurs after manipulation of the aorta or other large arteries in patients with atherosclerotic disease. The existing atherosclerotic plaque usually breaks off and embolizes to multiple small arteries leading to tissue and/or organ ischemia. Diagnosis is suggested by subacute onset of acute kidney injury (AKI), particularly with extrarenal embolic disease such as livedo reticularis and cyanotic toes. A skin or kidney biopsy may be necessary in some patients with an unclear diagnosis. Treatment is largely supportive and directed against secondary prevention of cardiovascular disease with aspirin, statins, blood pressure control, and smoking cessation. (Choice A) Acute interstitial nephritis usually causes fever, rash, and eosinophilia. However, it is usually not associated with extra-renal disease such as livedo reticularis or cyanotic toes. (Choice B) Acute kidney injury due to angiotensin converting enzyme inhibitors usually occurs soon after starting the drug and is not associated with an abnormal urinary sediment, as seen in this patient. (Choice D) Pre-renal azotemia usually presents with a spot urinary sodium concentration <20 mEq/L and normal urinary sediment. This patient's urinary sodium of 38 mEq/L and abnormal urine sediment makes this less likely. (Choice E) Although this patient is at risk, radiocontrast AKI usually resolves within two weeks and is not associated with eosinophilia and livedo reticularis. Educational objective: Atheroembolic disease usually presents with acute kidney injury after arteriography involving the aorta, and is associated with livedo reticularis and a cyanotic or gangrenous toe.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_052",
"system": "Renal",
"stem": "A 67-year-old man comes to the office for an annual examination. He generally feels well, although when asked about urinary problems, the patient says that he urinates 2 or 3 times per night and occasionally has to strain to initiate urination. He takes no medications. The patient does not use tobacco, alcohol, or drugs. His father died of prostate cancer at age 84. Temperature is 36.5 C (97.7 F), blood pressure is 126/74 mm Hg, pulse is 84/min, and respirations are 12/min. Cardiac, pulmonary, and abdominal examinations are within normal limits. Rectal examination reveals a prostate that is mildly enlarged, symmetric, and nontender. Rectal sphincter tone is normal. Urinalysis and serum creatinine level are normal. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Advise behavior modifications and observation",
"choice_b": "Initiate treatment with finasteride",
"choice_c": "Measure postvoid residual volume",
"choice_d": "Obtain abdominal ultrasound",
"choice_e": "Request urethrocystoscopy",
"correct_answer": "A",
"explanation": "This patient has lower urinary tract symptoms (eg, nocturia, hesitancy), most likely due to benign prostatic hyperplasia (BPH). Other common BPH symptoms include urinary frequency and decreased force of stream. Examination may show prostate enlargement, but symptoms do not correlate well with prostate size. Initial evaluation should include urinalysis to rule out hematuria (eg, due to bladder cancer) and infection and serum creatinine to screen for obstructive renal injury. Many experts also advise prostate-specific antigen testing for patients with lower urinary tract symptoms. BPH symptoms usually progress gradually, but some patients may experience regression over time. Severity is often scored based on number of symptoms (eg, frequency, nocturia, weak urinary stream, hesitancy, intermittence, incomplete emptying, urgency). For those with mild symptoms, such as this patient, simple behavioral modifications may be adequate. Interventions include shifting fluid intake to earlier in the day, decreasing caffeine and alcohol intake, and double voiding to more thoroughly empty the bladder. (Choice B) When medication is indicated, alpha-1-adrenergic antagonists (eg, tamsulosin, terazosin) are the preferred first-line treatment. 5-alpha-reductase inhibitors (eg, finasteride) are generally less effective and slower to act, and are most effective in men with a large prostate volume rather than in those with mild enlargement (as in this patient). (Choice C) Measuring postvoid residual volume is useful in patients with urge incontinence who are being considered for treatment with an anticholinergic agent or in those with BPH and symptoms of overflow incontinence (eg, involuntary leakage of urine). However, it is not indicated in patients with mild BPH symptoms. (Choice D) Abdominal ultrasound is indicated to evaluate obstructive uropathy or suspected hydronephrosis, which are less likely in this patient with mild symptoms and normal renal function. (Choice E) Urethrocystoscopy is not recommended for routine evaluation of BPH. It is typically used for patients with suspected calculi, urethral strictures, or bladder cancer, or for surgical planning in men with severe BPH. Educational objective: For patients with mild benign prostatic hyperplasia, simple behavioral modifications (eg, shifting fluid intake to earlier in the day, decreasing caffeine and alcohol intake, double voiding) may be adequate.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_053",
"system": "Renal",
"stem": "An 80-year-old woman presents to the clinic with increasing fatigue, dizzy spells, and nausea. She has been followed for several years for osteoporosis, type 2 diabetes mellitus, depression, and mild cognitive impairment. She was recently started on treatment for systolic hypertension. She lives independently with support provided by a visiting nurse three times weekly. She performs all of her own activities of daily living. Her current medications include alendronate, sertraline, metformin, and hydrochlorothiazide. Her temperature is 36.7 C (98.1 F), blood pressure is 146/70 mm Hg supine and 139/75 mm Hg standing ( (160/75 mmHg during the previous visit), pulse is 84/min, and respirations are 14/min. She is 5' 5\" (165 cm) and her BMI is 19~kg/m^{2} There is 2/6 ejection-type systolic murmur at the right upper sternal border without radiation to the carotids. Her lungs are clear. Muscle strength is preserved and deep tendon reflexes are symmetrical bilaterally. Her gait is mildly unsteady. Her mini-mental status exam score is 22/30 (1 year ago 27/30). Fingerstick glucose level is 220~mg/dL Which of the following is most likely responsible for this patient's current symptoms?",
"choice_a": "Cerebellar stroke",
"choice_b": "Hypercalcemia",
"choice_c": "Hyperglycemia",
"choice_d": "Hyponatremia",
"choice_e": "Volume depletion",
"correct_answer": "D",
"explanation": "This patient's symptoms are most likely due to hyponatremia; an occasional, but possibly fatal complication of thiazide diuretics. Thiazide-induced hyponatremia usually occurs within 1-2 weeks after starting the drug, more commonly in older woman with low body mass index. One study showed that 36% of patients had a plasma sodium <130~mEq/L and patients > age 70 had a 3.9 times higher risk of developing hyponatremia. Thiazide diuretics cause hyponatremia by increasing sodium and potassium excretion in the cortical distal tubule and increasing medullary water reabsorption. The concentrated urine leads to ADH-induced water retention, which further dilutes the serum and worsens the hyponatremia. Although they work in the loop of Henle to decrease sodium reabsorption and increase excretion, loop diuretics have a lower incidence of hyponatremia because they impair medullary water reabsorption and make the medulla less responsive to ADH-induced water retention. Patients with thiazide-induced hyponatremia usually appear clinically euvolemic but can present with dizzy spells, lethargy, malaise, vomiting, associated significant hypokalemia, and metabolic alkalosis. Treatment involves stopping the diuretic, replacing potassium, and giving normal saline for evidence of volume depletion. Hypertonic saline is reserved for patients with marked symptomatic hyponatremia. (Choice A) This patient's symptoms and signs suggest global central nervous system dysfunction rather than a focal cerebellar stoke. (Choice B) Hypercalcemia can result in fatigue, nausea, constipation, and impaired cognition. Although thiazide diuretics can mildly increase the serum calcium, they usually do not cause significant symptomatic hypercalcemia unless another cause for hypercalcemia is present. (Choice C) The osmotic force of hyperglycemia results in water movement out of cells to decrease cell volume, but this effect would be very small in this patient and less likely to cause her symptoms. (Choice E) Volume depletion is less likely in this patient without clinical findings such as orthostatic changes, tachycardia, or decreased skin turgor. Educational objective: Thiazide diuretics can lead to hyponatremia (more commonly than loop diuretics), especially in frail and elderly women with a low body mass index. Patients with nonspecific symptoms after starting thiazide diuretics should have laboratory evaluation of their electrolytes.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_054",
"system": "Renal",
"stem": "A 67-year-old woman comes to the physician for follow-up of several issues. She is known to have longstanding hypertension, obesity, stress incontinence, and osteoarthritis. She measures her blood pressure at home twice a week, and the readings are usually 140/90-100 mm Hg. Her current medications include ibuprofen 1.2 g daily, atenolol 50 mg daily, hydrochlorothiazide 25 mg daily, and enalapril 20 mg daily. Her blood pressure is 146/94 mm Hg, pulse is 64/min, and BMI is 30{kg/m}^{2}. Cardiovascular and pulmonary examinations show no abnormalities. She has 1+ to 2+ pedal edema. The patient's laboratory studies reveal: Hematocrit 38%, Leukocyte count 7,500/mm^{3}. Chemistry panel: Serum sodium 140~mEq/L, Serum potassium 4.8~mEq/L, Chloride 102~mEq/L, Bicarbonate 24~mEq/L, Serum creatinine 1.7~mg/dL. Which of the following is the most appropriate next step in hypertension management for this patient?",
"choice_a": "Add a calcium channel blocker",
"choice_b": "Evaluate for obstructive sleep apnea",
"choice_c": "Increase the atenolol dose",
"choice_d": "Increase the hydrochlorothiazide dose",
"choice_e": "Stop ibuprofen",
"correct_answer": "E",
"explanation": "This patient has suboptimal blood pressure control on three anti-hypertensives and likely has NSAID-induced blood pressure elevation. Nonsteroidal antiinflammatory drugs (NSAIDs) can cause kidney injury by either enhancing renal vasoconstriction, inducing interstitial nephritis, or causing glomerulonephritis (minimal change or membranous nephropathy). NSAIDs can cause sodium retention, attenuate the effect of diuretic agents (leading to increased blood pressure), and also blunt the blood pressure-lowering effects of several antihypertensive agents. In this patient, a trial of discontinuation of ibuprofen with observation of her blood pressure response is the most appropriate initial step. (Choice A) The addition of a fourth antihypertensive agent should be delayed until the response to stopping the NSAID is observed. (Choice B) Obstructive sleep apnea (OSA) can be associated with increased adrenergic neural traffic and hypertension. Evaluation for sleep apnea should be considered if her high blood pressure and edema do not resolve after discontinuing the NSAID. (Choice C) This patient's low pulse suggests adequate beta adrenergic blockade. A further increase in atenolol is unlikely to further lower her blood pressure and could result in worsened bradycardia. (Choice D) Increasing the hydrochlorothiazide dose may further increase the serum creatinine. A trial of discontinuing the ibuprofen would be the better first step. Educational objective: NSAIDs are commonly associated with elevations in blood pressure and can also affect the efficacy of anti-hypertensive agents. A trial of discontinuation of the NSAID should be considered in patients with suboptimal blood pressure control.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_055",
"system": "Renal",
"stem": "A 47-year-old man comes to the office due to recurrent kidney stones. He passed his first stone 7 years ago and has subsequently passed 2 additional stones since then. Analysis of one of the stones revealed a stone content of 85% calcium oxalate and 15% calcium phosphate. His father and brother have both had kidney stones. His medical history is significant for gastroesophageal reflux disease, mild intermittent asthma, and psoriasis. He takes esomeprazole several times per week and uses an albuterol inhaler as needed for shortness of breath. He is allergic to sulfa medications. His blood pressure is 122/78 mm Hg and his pulse is 76/min. BMI is 27~kg/m^{2} The patient's blood work from 6 months ago is shown below: Hemoglobin 14~g/dL, Hematocrit 44%, Platelets 260,000/mu L, Leukocytes 8,100/mu L, Sodium 140~mEq/L, Potassium 4.0~mEq/L, Chloride 102 mEq/L, Bicarbonate 24~mEq/L, Blood urea nitrogen 20~mg/dL, Creatinine 0.8~mg/dL, Calcium 10~mg/dL, Glucose 100~mg/dL, Phosphorus 3.0~mg/dL, Uric acid 4.0~mg/dL. The patient's current laboratory studies reveal: Urinalysis pH 5.6, Protein none, Blood negative, Red blood cells 1-2/hpf, White blood cells 1-2/hpf. 24-hour urine: Volume 1300~mL/24 h, Calcium 380 mg/24 h, Uric acid 600 {mg/24} h (normal: 240-755), Oxalate 30~mg/24 h (normal: <40), Citrate 240~mg/24 h (normal: 320-1240). Which of the following is the most appropriate recommendation for this patient?",
"choice_a": "Dietary sodium restriction",
"choice_b": "Esomeprazole discontinuation",
"choice_c": "Dietary calcium restriction",
"choice_d": "Vitamin D supplementation",
"choice_e": "Increase animal protein in the diet",
"correct_answer": "A",
"explanation": "This patient with urolithiasis has a low urinary volume and idiopathic hypercalciuria, the main factors predisposing him to stone development. Dietary changes may reduce the incidence of stone formation. Calcium undergoes passive reabsorption in the proximal tubule along with sodium and water. A low sodium diet (<2300 mg/24 h) leads to increased proximal tubule calcium and sodium reabsorption, decreased calcium excretion, and a reduced overall incidence of calcium stones. High sodium intake increases urinary calcium excretion and should be avoided. Citrate can form a complex with calcium, thereby decreasing calcium stone formation. Dietary sources of citrate, such as 4 oz of lemon juice, can also increase urinary citrate excretion. However, lower than normal 24-hour urinary citrate excretion (as seen in this patient) is a risk factor for calcium stone formation, and citrate supplementation would be indicated to decrease stone formation. (Choice B) Long-term use of proton pump inhibitors is associated with increased risk of bone fractures, Clostridioides difficile infection, and hypomagnesemia. Esomeprazole has not been associated with an increased risk of kidney stones, and discontinuation of the drug would worsen this patient's gastroesophageal reflux disease. (Choice C) Calcium intake has a paradoxical response in calcium stone formation. Higher dietary calcium intake may result in gastrointestinal binding of calcium oxalate, thereby reducing urinary excretion of calcium and oxalate. However, lower calcium intake could potentially increase urinary calcium oxalate excretion, increasing the risk for future stones. (Choice D) Vitamin D supplementation has been linked to an increased risk of kidney stones and should be avoided in this patient. (Choice E) High intake of animal protein can potentially contribute to calcium urolithiasis by increasing urinary calcium excretion, increasing urinary uric acid excretion (which can facilitate calcium stone formation), and lowering urinary pH. Educational objective: Hypercalciuria is a common risk factor for the formation of calcium-containing kidney stones. Several dietary factors can have a favorable impact in reducing the incidence of calcium stones.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_056",
"system": "Renal",
"stem": "A 75-year-old man comes to the office for hypertension follow-up. The patient has been taking chlorthalidone since being diagnosed with hypertension 15 years ago, and he was started on metoprolol 4 years ago after he had a non-ST elevation myocardial infarction. Over the last 2 years, his blood pressure measurements have ranged from 160/80 mm Hg to 180/100 mm Hg, and amlodipine was added to his medical regimen 6 months ago. The patient has had no chest pain, dyspnea, palpitation, headache, or subjective neurological deficits. His medical history includes hyperlipidemia and peripheral vascular disease, and other medications are aspirin and atorvastatin. The patient is a former smoker with a 30-pack-year history and does not use alcohol or illicit drugs. Today, blood pressure is 165/86 mm Hg and pulse is 68/min. Physical examination is notable for an abdominal bruit. Serum creatinine is 1.2~mg/dL, and duplex Doppler ultrasonography reveals >60\\% stenosis of bilateral renal arteries. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Addition of an ACE inhibitor",
"choice_b": "Invasive renal angiography",
"choice_c": "Plasma renin activity measurement",
"choice_d": "Renal angioplasty with stenting",
"choice_e": "Surgical renal revascularization",
"correct_answer": "A",
"explanation": "This elderly patient who has uncontrolled hypertension despite multidrug therapy and is found to have high-grade bilateral renal artery stenosis should be treated with an ACE inhibitor. Bilateral renal ischemia (caused by limited blood supply to the poststenotic kidney) induces the activation of the renin-angiotensin-aldosterone system (RAAS), which leads to sodium retention and volume expansion. As the RAAS is involved, a combination of a diuretic with an ACE inhibitor or angiotensin receptor blocker (ARB) is the preferred initial treatment. ACE inhibitors have been shown to decrease mortality, rate of myocardial infarction, progression to end-stage renal disease, and stroke and are equally as effective as angioplasty in most patients. Patients with bilateral renal artery stenosis are at increased risk of development of acute kidney injury; however, ACE inhibitors and ARBs are no longer thought to be contraindicated in this population as most patients only experience a small decline in glomerular filtration rate. More marked declines are usually reversible with dose reduction or elimination of the diuretic; patients should be monitored closely while on these medications. Other antihypertensive agents and statins, as well as antiplatelet therapy should be added when appropriate along with lifestyle changes. Patients who fail optimal medical therapy (eg, refractory hypertension, inability to tolerate medications, progressive renal insufficiency) or those with recurrent flash pulmonary edema or heart failure should undergo revascularization with stenting (Choice D). (Choice B) Although invasive renal angiography is considered the gold standard for diagnosis of renal artery stenosis, less invasive imaging (eg, ultrasound, MRI, CT scan) is preferred due to the risk of complications associated with angiography (eg, contrast load, cholesterol embolization). (Choice C) Plasma renin activity (PRA) measurements are useful to distinguish between primary and secondary hyperaldosteronism in patients with refractory hypertension. PRA is expected to be low in patients with primary hyperaldosteronism and elevated in patients with renovascular hypertension. However, up to 50% of patients with renovascular hypertension do not have an elevated PRA, and levels are suppressed by antihypertensives, high sodium diet, and bilateral renal artery disease, limiting the practical use of PRA measurement. (Choice E) Surgery is recommended for patients who have early primary branching of the main renal artery or multiple small renal arteries, have failed prior stenting, or require aortic reconstruction for other reasons (eg, aneurysm, aorto-iliac disease). Educational objective: Patients with bilateral renal artery stenosis should first be treated with medical therapy (eg, a diuretic and either ACE inhibitor or angiotensin receptor blocker) as it is as efficacious as angioplasty or surgery.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_2.pdf"
},
{
"id": "RENAL_057",
"system": "Renal",
"stem": "A 40-year-old man comes to the emergency department due to acute flank pain and dysuria. He has no associated fever, joint pain, or suprapubic pain. The patient was discharged 5 days ago following hospitalization for central nervous system toxoplasmosis. He has long-standing AIDS (most recent CD4 count: 150/mm^{3} and had not been compliant with either antiretroviral treatment or trimethoprim-sulfamethoxazole prophylaxis therapy for several months prior to admission. While in the hospital, the patient was started on sulfadiazine and pyrimethamine, and antiretroviral treatment was reinstituted. Temperature is 37 C (98.6 F), blood pressure is 122/78 mm Hg, and pulse is 98/min. Mucous membranes are dry. The abdomen is soft, and bilateral costovertebral angle tenderness is present. No rash is present. Laboratory studies are as follows: Complete blood count: Hemoglobin 10~g/dL, Platelets 140,000/mm^{3}, Leukocytes 11,000/mm^{3}. Differential: Neutrophils 75%, Eosinophils 1%, Lymphocytes 16%, Monocytes 8%. Serum creatinine 2.2~mg/dL (on discharge: 1.2~mg/dL). Urinalysis: Specific gravity 1.016, PH 5.5, Protein +1, Blood moderate, White blood cells 20-30/hpf, Red blood cells 20-30/hpf. A urinary catheter is placed and produces 10 mL of urine during 6 hours of observation in the emergency department. Which of the following is most likely to confirm the diagnosis in this patient?",
"choice_a": "Cystoscopy",
"choice_b": "Renal ultrasound",
"choice_c": "Urine culture",
"choice_d": "Urine sediment analysis for crystals",
"choice_e": "Urine sediment analysis for eosinophils",
"correct_answer": "D",
"explanation": "This patient has acute kidney injury (AKI) with hematuria, pyuria, and bilateral costovertebral angle tenderness. The recent initiation of sulfadiazine should raise suspicion for crystal-induced AKI, which occurs when poorly soluble drugs precipitate within the renal tubules. Factors favoring crystal formation include exposure to high doses of the drug, dehydration (increases intratubular concentration), and acidic urinary pH (occurs with uric acid, sulfonamides, and methotrexate). Patients are often asymptomatic, but can have flank pain symptoms typically occur within a week of drug initiation. Diagnosis is confirmed by observation of characteristic crystals on urinalysis when the patient is taking a known inciting drug. Hematuria and pyuria are also commonly noted. Nearly 30% of patients on sulfadiazine develop AKI, primarily due to the drug's insolubility at a urinary pH of ≤5.5. Sulfonamides can form needle-shaped, rosette, or clumped (\"stacks of wheat\") crystals that can be identified on urinalysis. Prevention and treatment of sulfadiazine-induced AKI include adequate hydration (3 L/day) and alkalinization of the urine to a pH of >7.15 to increase solubility. In patients with suspected sulfadiazine-induced AKI, renal ultrasound can be obtained to complete the evaluation but is unlikely to confirm the diagnosis. Ultrasonography can be normal, show sludge or small calyceal stones (due to sulfonamide precipitation), or reveal hydronephrosis (in rare cases where urolithiasis develops and causes obstructive uropathy). However, these findings are nonspecific and are unlikely to change initial management with fluids and urine alkalinization to solubilize the crystals. If urolithiasis is suspected in a nonpregnant patient, noncontrast CT scan is preferred to ultrasound as it is more sensitive and accurate (Choice B). (Choice A) Cystoscopy can detect bladder cancer or stones, which usually present with painless hematuria or irritative voiding symptoms. This patient's flank pain and costovertebral tenderness are more consistent with an upper urinary tract etiology. (Choice C) Pyelonephritis causes flank pain and costovertebral angle tenderness, although it is typically unilateral. However, patients who develop AKI from pyelonephritis are typically quite ill; fever, chills, and hypotension would be expected. (Choice E) Acute interstitial nephritis commonly presents with fever, rash, and eosinophilia. Urinalysis classically shows urine eosinophils and white blood cell casts (not seen in this patient). In addition, pain is uncommon. Educational objective: Crystal-induced acute kidney injury occurs when poorly soluble drugs precipitate in the renal tubules. Sulfadiazine is insoluble at a pH of ≤5.5; prevention and treatment include hydration and alkalinization of the urine to a pH of >7.15 to increase solubility.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_058",
"system": "Renal",
"stem": "A 56-year-old man comes to the physician with fever, chills, and painful urination for 3 days. He has also experienced decreased force in his urinary stream, urinary frequency, and nocturia. The patient was diagnosed with benign prostatic hyperplasia 2 years ago. His other medical problems include hypertension, hyperlipidemia, and type 2 diabetes mellitus. His medications include saw palmetto, metformin, enalapril, and lovastatin. He is sexually active with his wife of 35 years. His temperature is 38.3^{circ} C (101^{circ}F), blood pressure is 127/84 mm Hg, and pulse is 98/min. There is no costovertebral angle tenderness bilaterally. His genitalia and testes are normal. His prostate is enlarged and very tender to palpation on digital rectal examination. Laboratory results are as follows: Hematocrit 46%, Leukocyte count 14,200/mm^{3}, Creatinine 1.2~mg/dL, Glucose 100~mg/dL. Urinalysis: Specific gravity 1.013, Protein Trace, Blood Trace, Glucose Negative, Leukocyte esterase Positive, White blood cells 20-30/hpf, Red blood cells 5-10/hpf. Urine and blood cultures are sent. Urine Gram stain shows no organisms. Which of the following would be the best next step in management of this patient?",
"choice_a": "Foley catheter insertion",
"choice_b": "Oral doxycycline",
"choice_c": "Oral levofloxacin",
"choice_d": "Prostatic massage for fluid",
"choice_e": "Transrectal ultrasound",
"correct_answer": "C",
"explanation": "This patient's presentation is most consistent with acute bacterial prostatitis (ABP). Most cases are due to Gram-negative (eg, Escherichia coli, Proteus mirabilis, Klebsiella, Enterobacter) organisms. Gram-positive (eg, Staphylococcus aureus, Streptococci, Enterococci) infections are less common and are usually due to remote infection elsewhere, prolonged catheterization, or recent prostatic surgery. Patients typically present with acute urinary complaints (eg, frequency, urgency, urge incontinence), pelvic/perineal pain, cloudy urine, and systemic symptoms (eg, fever, chills, malaise, myalgia). Digital examination shows an exquisitely tender prostate that is warm and edematous. Prostate massage is not recommended, however, due to pain and increased risk of bacteremia. In addition, prostate fluid is not necessary for diagnosis (Choice D). Evaluation includes urine Gram stain and culture. Empiric antibiotics that effectively penetrate the prostate (eg, oral trimethoprim-sulfamethoxazole [TMP-SMX] or fluoroquinolone) are recommended. Intravenous antibiotics are recommended for septic-appearing patients. Oral antibiotics are usually continued for prolonged periods (eg, 4 weeks) and tailored to culture results. After the infection resolves, patients usually need urologic evaluation to determine the underlying cause. Chronic bacterial prostatitis (CBP) can be a complication of ABP due to inadequate duration of treatment. CBP tends to present with less severe urinary symptoms and without significant systemic findings. Most urologists obtain urine and prostate fluid specimens after prostate massage for diagnosis. Fluoroquinolones are the preferred first-line agent. Patients usually require a prolonged course of antibiotics ranging from 6 weeks to 6-12 months in some cases. (Choice A) Acute urinary retention is an infrequent complication of acute prostatitis, and bladder drainage must be done by suprapubic catheterization. Catheter insertion through the inflamed urethra into the bladder is contraindicated in acute prostatitis. (Choice B) Doxycycline is effective against Chlamydia trachomatis, which is more common in sexually active men and chronic bacterial prostatitis. It does not penetrate the prostate as well as fluoroquinolones or TMP-SMX and is not considered first-line therapy for ABP. (Choice E) Transrectal ultrasound can evaluate for suspected prostatic abscess or cancer. Prostate abscess can present similarly to prostatitis but usually has significant fluctuance on digital examination or persistent symptoms despite antibiotics. Educational objective: Management of acute prostatitis involves obtaining a urine culture followed by empiric treatment with fluoroquinolones or oral trimethoprim-sulfamethoxazole. Prostate massage is not recommended. If bladder drainage is required, the suprapubic route should be used.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_059",
"system": "Renal",
"stem": "A 65-year-old man comes to the office for a follow-up evaluation of hematuria. He underwent evaluation for an insurance policy and was told that he had blood in his urine. He has never observed any blood in his urine; however, he has noticed a progressively weaker urinary stream over the past several years and often gets up to urinate at least twice each night. He has no history of flank or abdominal pain, and has never passed a kidney stone or had urinary tract infection. He has smoked more than one pack of cigarettes daily for 40 years. He recently retired from many years of employment in the dye industry. He has been diagnosed with moderate chronic obstructive lung disease, benign prostatic hypertrophy, degenerative joint disease, and hypertension. His current medications consist of an inhaler containing a beta adrenergic agonist, several over-the-counter NSAIDs, and lisinopril. His blood pressure is 140/90 mm Hg, pulse is 84/min, and respirations are 20/min. Physical examination findings are compatible with moderate chronic obstructive lung disease. A urinalysis performed in the office shows a positive dipstick and 3-5/hpf RBCs. Subsequently, 2 additional urinalyses are performed; RBCs are 1-2/hpf on the first and 5-10/hpf on the second urinalysis. Urine cytology is negative for malignant cells on 3 occasions. A CT scan of the kidneys is within normal limits. A urine culture is negative. The patient's laboratory studies reveal: Hematocrit 43%, Platelets 280,000/mu L, Leukocytes 9,100/mu L, Creatinine 1.2~mg/dL. Which of the following is the most appropriate next step in management?",
"choice_a": "Follow-up with urinalyses every 6 months; do further evaluation if hematuria increases",
"choice_b": "Obtain coagulation studies",
"choice_c": "Perform cystoscopy",
"choice_d": "Perform renal MRI",
"choice_e": "Treat for benign prostatic hyperplasia, and see if the hematuria resolves",
"correct_answer": "C",
"explanation": "This patient has microscopic hematuria (defined as RBCs>3/hpf) along with several risk factors for bladder cancer (ie, age, gender, ethnicity, cigarette smoking history, and possible exposure to chemicals associated with bladder cancer). Chemicals associated with bladder cancer development include aromatic amines, arsenic, and other chemicals involved in the manufacture of dyes, rubber, leather, and textiles. As outlined in the figure, this patient had asymptomatic dipstick hematuria with microhematuria seen on subsequent urinalysis. Given his bladder cancer risk and presence of microhematuria on 1 of the 2 additional urine samples, imaging and urine cytology were performed. Because results of these studies were both negative, the next step would be cystoscopy to evaluate for bladder malignancy. (Choice A) Although the hematuria observed is low grade, this patient's risk profile for bladder cancer is high, and timely visualization of the bladder is appropriate to potentially diagnose an early stage cancer. (Choice B) Coagulation disorders rarely present as hematuria and are almost always associated with an abnormality within the genitourinary tract (eg, stone and tumor). This patient takes agents that may decrease platelet function (ie, NSAIDs), but coagulation studies would be low yield in this patient. (Choice D) With the CT scan showing no cause for the hematuria, MRI would be of very low diagnostic yield. (Choice E) Benign prostatic hyperplasia (BPH) can cause gross hematuria, usually at either initiation or termination of micturition. Although the mechanism of hematuria in BPH remains unclear, prominent neovascularization can occur and lead to visualization of enlarged veins in the prostatic urethra on cystoscopy. In this high-risk patient, bladder cancer should initially be excluded. Educational objective: Advancing age, male sex, Caucasian ethnicity, cigarette smoking, exposure to selected chemicals, chronic bladder inflammation, and a family history of cancer are risk factors for bladder cancer. Hematuria in a patient with risk factors should promote a timely evaluation for cancer with imaging, urine cytology, and cystoscopy.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_060",
"system": "Renal",
"stem": "A 75-year-old man comes for follow-up 6 months after radical prostatectomy for prostate cancer. He continues to have occasional episodes of involuntary loss of urine with activities such as straining or lifting heavy objects. The patient was an avid golfer but stopped after the surgery due to urinary leakage. He has no dysuria, nocturia, or hematuria. The patient did not undergo radiation therapy. He has a history of hypertension and type 2 diabetes mellitus. The blood pressure is 130/80 mm Hg and pulse is 68/min. The abdomen is soft and nontender without palpable masses. There is decreased sensation to light touch and pinprick on bilateral feet. Ankle reflexes are absent and muscle strength is normal. Post-void residual volume is low. Prostate-specific antigen level is undetectable and urinalysis findings are within reference range. Which of the following is the best next step in managing this patient?",
"choice_a": "MRI of lumbosacral spine",
"choice_b": "Pelvic floor exercises with biofeedback",
"choice_c": "Retrograde urethrogram",
"choice_d": "Sildenafil therapy",
"choice_e": "Tolterodine therapy",
"correct_answer": "B",
"explanation": "Urinary incontinence is a common complication after radical prostatectomy for localized prostate cancer and is usually due to urethral sphincter injury. Some studies show that up to 50% of patients can develop stress incontinence within 2 months of surgery, but the incidence dramatically decreases to ~10% by 2 years post surgery. As a result, nonsurgical treatment is initially preferred. Pelvic floor exercises with biofeedback can significantly accelerate recovery and decrease incidence of post-surgical urinary incontinence. Patients who fail conservative therapy (usually <1%) may require surgery with artificial sphincter placement or sling procedure. (Choice A) MRI of the lumbosacral spine can evaluate for neurogenic bladder due to spinal cord lesions. Patients usually develop lower extremity weakness with bowel/bladder incontinence. This patient's normal muscle strength makes this less likely. The absent ankle reflexes can be due to normal aging (most common after age 70) and are not clinically significant. (Choice C) Retrograde urethrogram can detect urethral strictures due to bladder neck contracture or distal urethral narrowing post prostatectomy. Patients usually develop urinary retention with decreased urinary stream or overflow incontinence. The post-void residual is usually increased. (Choice D) Sildenafil can improve erectile dysfunction after radical prostatectomy. However, it is not useful for urinary incontinence. (Choice E) Tolterodine is an antimuscarinic drug for urge incontinence due to benign prostatic hyperplasia. However, this patient's prostatectomy makes this unlikely. No medications have yet been approved in the United States for the treatment of stress incontinence. Educational objective: Urinary incontinence is a common complication after radical prostatectomy for localized prostate cancer and is usually due to a damaged urinary sphincter. Pelvic floor exercises with biofeedback can significantly accelerate recovery and decrease the incidence of postprostatectomy stress incontinence.",
"source": "ABIM_Renal,Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_061",
"system": "Renal",
"stem": "A 54-year-old woman with end-stage renal disease secondary to diabetic nephropathy and hypertension comes to the office due to easy fatigability and tiredness. The patient experienced similar symptoms 6 months ago, but they improved after starting erythropoietin therapy for anemia. Over the past several weeks, the symptoms have recurred but she has had no chest pain, dyspnea, palpitations, syncope, melena, or hematochezia. The patient receives 3-4 hours of maintenance hemodialysis 3 times a week. She has no drug allergies. Blood pressure is 130/78 mm Hg and pulse is 70/min with no orthostatic changes. She weighs 68 kg (150 lbs), which is her 'dry weight'. There are no heart murmurs. Abdominal examination shows no organomegaly and stool occult blood testing is negative. Laboratory studies are as follows: Hemoglobin 8.4~g/dL, Mean corpuscular volume 86~mu m^{3}, Serum potassium 4.8~mEq/L, Ferritin 182~ng/mL, Transferrin saturation 20%, Folate Normal, Vitamin $B{12}$ Normal. Hemoglobin was 8.2~g/dL and 10.1~g/dL 6 months and 4 months ago, respectively. Which of the following is the most appropriate next step in management of this patient's anemia?",
"choice_a": "Begin intravenous iron therapy",
"choice_b": "Check anti-erythropoietin antibody level",
"choice_c": "Intensify dialysis treatments",
"choice_d": "Perform bone marrow biopsy",
"choice_e": "Transfuse packed red blood cells",
"correct_answer": "A",
"explanation": "This patient initially had an appropriate response to erythropoietin-stimulating agent (ESA) therapy but now has worsening anemia. Iron deficiency is the most common cause of erythropoietin resistance. Patients with end-stage renal disease (ESRD) are at risk for iron deficiency due to: Absolute iron deficiency: Blood loss (eg, gastrointestinal, blood draws) or vigorous hematopoiesis during ESA therapy. Functional iron deficiency: Impaired mobilization of iron due to elevated hepcidin levels (ie, anemia of chronic disease) or because iron cannot be mobilized rapidly enough to keep up with hematopoiesis after ESA administration. Normocytic anemia can be seen in the early stages of absolute iron deficiency (ie, before microcytosis develops) as well as in functional iron deficiency (ie, anemia of chronic disease), explaining this patient's normal mean corpuscular volume. The diagnosis of absolute iron deficiency in patients with chronic kidney disease (CKD) is complex and is commonly based on parameters such as low transferrin saturation (eg, le20%) and ferritin (eg, le200~ng/mL in hemodialysis patients) levels. All patients with ESRD on ESA therapy should be treated with iron, regardless of the results of iron studies, unless ferritin >500~ng/mL. It is likely that this patient had limited iron stores that were rapidly depleted following initiation of ESA therapy. For completion, she should also be evaluated for gastrointestinal blood loss. (Choices B and D) Pure red blood cell aplasia is a hypoproliferative disorder that can be caused by anti-erythropoietin antibodies. Other hypoproliferative disorders (eg, myelodysplastic syndrome) can be diagnosed with bone marrow biopsy. However, hypoproliferative disorders are associated with increased serum iron levels due to reduced iron utilization. In addition, the brand of epoetin alfa most commonly associated with anti-erythropoietin antibodies has been removed from the market. Although bone marrow biopsy is the gold standard for diagnosis of absolute iron deficiency, parameters such as transferrin saturation and ferritin are commonly used to identify it in patients with CKD. (Choice C) Inadequate hemodialysis can cause ESA hyporesponsiveness, but this patient has maintained her dry weight and does not have symptoms of volume overload. (Choice E) Red blood cell transfusions come with significant risks (eg, volume overload, transfusion reaction) and are reserved for severe anemia (hemoglobin <7 g/dL) in patients unresponsive to ESAs after iron supplementation. Educational objective: Iron deficiency is the most common cause of erythropoietin resistance in patients with end-stage renal disease (ESRD). All patients with ESRD receiving erythropoietin-stimulating agents should be treated with intravenous iron, regardless of results of iron studies unless ferritin >500~ng/mL.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_062",
"system": "Renal",
"stem": "A 63-year-old woman with a long history of type 2 diabetes mellitus is being evaluated for a progressive decline in renal function. She has no new complaints except for occasional tiredness and lower back pain. Her other medical problems include hypertension, obesity, mild diabetic retinopathy, and peripheral neuropathy. One year ago, she was evaluated for atypical chest pain and had a negative exercise stress test. She is a lifetime non-smoker. Her current medications include insulin, amlodipine, and low-dose aspirin. She was treated with lisinopril, which has been stopped recently due to renal dysfunction and hyperkalemia. Her current eGFR is 15~ml/min, potassium is 5.1~mEq/L, and hemoglobin is 10.2~g/dL. Which of the following would provide the highest survival benefit in this patient?",
"choice_a": "Cadaveric renal transplant",
"choice_b": "Early initiation (preemptive) of hemodialysis",
"choice_c": "Erythropoietin therapy",
"choice_d": "Hemodialysis at onset of uremia symptoms",
"choice_e": "Peritoneal dialysis",
"correct_answer": "A",
"explanation": "Diabetes mellitus is the most common cause of end-stage renal disease (ESRD) requiring dialysis, and the 5-year survival for these patients on hemodialysis is around 30-40% (> 50% deaths from cardiovascular disease). Studies show diabetics with ESRD receiving kidney transplant had a 5-year survival of 67-77% and better quality of life. As a result, renal transplant should be offered to all eligible diabetics with ESRD. While a living related donor transplant is the best option, cadaveric transplant also offers increased survival in diabetic patients. Improved survival in diabetics following a cadaveric kidney transplant is maximal in younger age groups but is seen in all age groups, including patients > age 70. (Choices B & D) The optimal time to start dialysis is debated. Studies have shown no difference in outcomes between preemptive dialysis (GFR of 10-15~ml/min/1.73m^{2} without symptoms of uremia) and dialysis at either the onset of uremic symptoms or when the glomerular filtration rate is <10~ml/min/1.73m^{2}. (Choice C) Erythropoietin offers symptomatic relief from anemia of renal failure and indirectly improves cardiovascular morbidity and mortality, but renal transplant offers a higher survival benefit. (Choice E) Peritoneal dialysis is an option for maintenance dialysis in diabetics with stable cardiovascular dynamics, no severe vascular disease, or without advanced neuropathy. Survival with chronic peritoneal dialysis is generally comparable to chronic hemodialysis, but is not better than renal transplant. Educational objective: Diabetics with end-stage renal disease (ESRD) treated with either a living related or cadaveric donor kidney transplant (compared to dialysis) have better survival, quality of life, and rehabilitation. Infections are the most common cause of death in the early post-transplant period.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_063",
"system": "Renal",
"stem": "A 60-year-old man with a past medical history of hypertension comes to the physician complaining of urinary symptoms. Over the last 6 months, he has had a decreased urinary stream and an occasional uncomfortable sensation while urinating. He awakens once a night to urinate but sometimes feels that he needs to go again. The symptoms do not bother him much at this point, but he is afraid that they may worsen. He has no family history of prostate problems. He has no fever, malaise, back pain, cloudy urine, or blood in the urine. Digital rectal examination shows a moderately enlarged and rubbery prostate. The remainder of the physical examination is unremarkable. Laboratory results are as follows: Hemoglobin 14.2~g/dL, Creatinine 0.9~mg/dL, Prostate-specific antigen 10.2~ng/mL (N:<4~ng/mL). Urinalysis: WBC 0-2/hpf, RBC 0-2/hpf, Protein Trace. Which of the following is the best next step in managing this patient?",
"choice_a": "5-alpha-reductase inhibitor",
"choice_b": "Alpha-1-adrenergic antagonist",
"choice_c": "Re-evaluation in 3-6 months",
"choice_d": "Referral to urologist",
"choice_e": "Renal ultrasound",
"correct_answer": "D",
"explanation": "This patient's presentation of irritative and obstructive lower urinary tract symptoms, normal urinalysis, large prostate without a focal lesion, and prostate-specific antigen (PSA)>10~ng/mL is consistent with a prostatic disorder. PSA values have a log-linear relationship with prostate volume. However, elevated PSA has a lower specificity for prostatic cancer in men with obstructive symptoms than asymptomatic men. Prostate cancer screening is an individualized decision, and clinicians should first discuss the risks and benefits. If the patient prefers screening, most clinicians perform a digital rectal examination (DRE) and test serum PSA. Patients with normal DRE and PSA<3~ng/mL may be followed routinely. Men with PSA >7~ng/mL or abnormal DRE should be referred to a urologist for possible biopsy. Patients with PSA of 3-7~ng/mL should be retested in a few weeks and referred to a urologist if PSA remains >3~ng/mL (Choice C). Although the most common cause of elevated PSA is benign prostatic hyperplasia (BPH), the positive predictive value of a PSA>10 for prostate cancer is 15%-40%. Thus, this patient should be referred to a urologist. (Choices A and B) 5-alpha-reductase inhibitors and alpha-1-adrenergic blockers may relieve moderate to severe BPH symptoms. Treatment usually requires several weeks for optimal effect. However, this patient's mild BPH symptoms and elevated PSA require further investigation. (Choice E) A renal ultrasound would not be helpful with a normal serum creatinine. However, transrectal prostatic ultrasound can help guide prostate biopsy in selected cases. Educational objective: Patients with a normal digital rectal examination (DRE) and prostate-specific antigen (PSA)<3~ng/mL may be followed routinely. Men with PSA>7~ng/ml or abnormal DRE should be referred to a urologist for possible biopsy.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_064",
"system": "Renal",
"stem": "A 52-year-old man comes to the physician for follow-up on cadaveric renal transplantation done 10 months ago for polycystic kidney disease. His postoperative course was complicated by 2 episodes of acute rejection and an episode of lower gastrointestinal bleeding. These events prompted revision of his immunosuppressive regimen, which now includes prednisone, tacrolimus, mycophenolate, and acyclovir. The patient has no new symptoms. His only other medical problem is diet-controlled type 2 diabetes mellitus. His blood pressure is 122/70 mm Hg and pulse is 78/min. His BMI is 29{kg/m}^{2} There are no skin rashes. The spleen tip is not palpable. There is no lymphadenopathy. Laboratory results are as follows: Hemoglobin 12.0~g/dL, Potassium 3.8~mEq/L, Creatinine 2.7~mg/dL, HemoglobinA1c 7.4%. Urinalysis: Protein +1, Glucose Present, White blood cells 20-30/hpf, Red blood cells 20-30/hpf. Urine sediment analysis shows cellular casts. Cytology demonstrates atypical cells with intranuclear inclusions. Which of the following is the most likely diagnosis?",
"choice_a": "Chronic allograft nephropathy",
"choice_b": "Diabetic nephropathy",
"choice_c": "Epstein-Barr virus infection",
"choice_d": "Polyomavirus-induced nephropathy",
"choice_e": "Tacrolimus nephropathy",
"correct_answer": "D",
"explanation": "This patient most likely has human polyoma virus infection. There is a high prevalence of seropositivity of polyoma virus (eg, BK and JC) in the general population, but polyoma viruses cause disease only in immunosuppressed individuals. In renal transplant recipients, the BK form of polyoma virus produces tubulointerstitial nephritis and, less commonly, ureteric stenosis. The mean time of onset of BK infection is 10-15 months after transplantation. BK viral infection is most common in older men with type 2 diabetes mellitus and rejection episodes with significant immunosuppression. There are no characteristic clinical manifestations other than loss of renal function. The presence of cells with a single large basophilic intranuclear inclusion found on urine cytology suggests but does not prove BK infection. Serology is not as useful as many in the general population have antibodies against the virus. Renal biopsy findings can be similar to those in other viral infections (eg, cytomegalovirus). As a result, diagnosis requires renal biopsy showing characteristic cytopathology plus positive antibodies directed specifically against BK on immunohistochemistry tests. Biopsy sometimes misses the diagnosis, and at least 2 biopsy cores may be required in suspected patients. The primary treatment is reduction of immunosuppression. (Choice A) Allograft rejection can cause progressive renal dysfunction and may be difficult to differentiate clinically from BK infection. However, allograft rejection does not typically cause intranuclear inclusions on urine cytology. (Choice B) Diabetic nephropathy can recur after renal transplantation but usually presents several years after transplantation with significant proteinuria, which is not seen in this patient. (Choice C) Epstein-Barr virus may cause post-transplant lymphoproliferative disorder, which is due to both lymphoid and/or plasma cell proliferation in the transplanted organ/tissue. Patients may present with an infectious mononucleosis-like illness or nonspecific constitutional symptoms (eg, weight loss and fatigue) but usually do not have worsening renal function. (Choice E) The calcineurin inhibitors, including cyclosporine and tacrolimus, are potentially nephrotoxic. An acute nephrotoxicity is due to renal vasoconstriction and is often reversed by dosage reduction. A chronic form is due to vasculopathic changes in the kidney and is usually not reversible. Calcineurin inhibitors are not associated with intranuclear inclusions, and this patient's course is more characteristic of BK viral infection. Educational objective: BK polyoma virus presents in renal transplant recipients most commonly after rejection and significant immunosuppression. Patients typically develop tubulointerstitial nephritis with rising creatinine and the presence of intranuclear inclusions in urine cells. Definitive diagnosis requires renal biopsy plus positive immunohistochemistry tests using antibodies directed specifically against the BK virus.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_065",
"system": "Renal",
"stem": "A 22-year-old man comes to the physician for a follow-up after the passage of a kidney stone. He was evaluated in the emergency department 10 days ago for right-sided colicky flank pain. An abdominal CT scan at that time revealed a 7-mm stone at the right ureteropelvic junction and two stones near the tips of calyces in the left kidney. The patient spontaneously passed the stone, but was not able to retrieve it for analysis. He has not previously had symptoms of kidney stones. His review of systems is normal. He is in good health, takes no medication or vitamins, is not chronically dehydrated, and has no family history of kidney stones. Physical examination shows no abnormalities. Urinalysis shows occasional hexagonal crystals with benzene ring morphology. Which of the following analyses performed on a 24-hour urine collection is most likely to lead to the diagnosis?",
"choice_a": "Calcium",
"choice_b": "Citrate",
"choice_c": "Cystine",
"choice_d": "Oxalate",
"choice_e": "Uric acid",
"correct_answer": "C",
"explanation": "In a young patient with several kidney stones and typical cystine (hexagonal green/yellow) crystals on urinalysis, cystinuria is the most likely diagnosis. Cystinuria is a rare autosomal recessive disease that can lead to multiple kidney stones and complications such as obstructive uropathy, urinary tract infections, and loss of kidney function. Increased fluid intake to produce a higher urine volume, alkalinization of the urine (with potassium citrate or bicarbonate), and chelating agents (in some cases) can prevent further cystine stone formation. Patients with large stones or with urinary obstruction require referral to urology for stone removal. (Choice A) In the United States, >80% of the stones passed contain calcium. Hypercalciuria is a common predisposing factor in calcium-containing stone formers. Examination shows envelope-shaped crystals. (Choice B) Citrate appears to slow the growth of calcium crystals, and low urinary excretion of citrate is a factor that can contribute to stone formation. Urinary citrate measurement is not diagnostically helpful in this patient with cystinuria. (Choice D) Increased urinary excretion of oxalate is seen in inherited oxalate metabolism disorders and in malabsorption. In this patient with cystine crystals on urinalysis, measurement of the urinary excretion of oxalate is not diagnostically helpful. (Choice E) Increased urinary excretion of uric acid, along with low pH, contributes to uric acid stone formation. In some cases, increased urinary excretion of uric acid may also contribute to calcium stone formation by decreasing the solubility of calcium oxalate. Examination shows rhomboid crystals. Educational objective: Suspect cystinuria in patients with large branched calculi or a first stone occurring at an early age (childhood or adolescence). Hexagonal (benzene ring) crystals are seen in 25% of the patients on initial urinalysis. Increased fluid intake, alkalinization of the urine (with potassium citrate or bicarbonate), and chelating agents (in some cases) can prevent further cystine stone formation.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_066",
"system": "Renal",
"stem": "A 58-year-old man with a history of type 2 diabetes mellitus comes to the office for a follow-up visit. Medical history also includes hypertension, hyperlipidemia, coronary artery disease, and osteoarthritis. He has diabetic nephropathy with a baseline creatinine of 2.0-2.5~mg/dL. The patient's mobility is impaired due to right knee osteoarthritis and diabetic neuropathy. Medications include acetaminophen, insulin, metoprolol, valsartan, chlorthalidone, aspirin, and atorvastatin. Blood pressure is 159/102 mm Hg and pulse is 68/min. BMI is 36~kg/m^{2}. Physical examination shows 2+ bilateral lower extremity edema. Laboratory results are as follows: Serum creatinine 2.4~mg/dL, Serum potassium 5.4~mg/dL, Hemoglobin A1c 7.5%, 24-hour urine protein excretion 1.2~g/L. Which of the following is the best next step in management of this patient?",
"choice_a": "Start lisinopril",
"choice_b": "Substitute amlodipine for metoprolol",
"choice_c": "Substitute furosemide for chlorthalidone",
"choice_d": "Substitute lisinopril for valsartan",
"choice_e": "Substitute spironolactone for metoprolol",
"correct_answer": "C",
"explanation": "This patient has uncontrolled hypertension despite multiple antihypertensive medications. In addition, he is at increased risk for complications due to underlying diabetes and chronic kidney disease (CKD). Patients with CKD should have a target blood pressure of <140/90 mm Hg, and many experts recommend even more aggressive control. ACE inhibitors and angiotensin II receptor blockers (ARBs) (eg, valsartan) are first-line antihypertensive agents in patients with proteinuric CKD (ie, proteinuria >500~mg/day). For patients who have persistent hypertension despite first-line therapy, a diuretic or non-dihydropyridine calcium channel blocker (eg, diltiazem, verapamil) may be added. Diuretics are especially useful for patients with edema (such as this patient) as euvolemia can increase the effectiveness of other antihypertensives. However, thiazide diuretics (eg, chlorthalidone) are less effective in patients with creatinine clearance <30 mL/min/1.73 m^{2}, these patients should be transitioned to loop diuretics (eg, furosemide). If loop diuretics alone are ineffective at improving edema, a thiazide may be added again to improve diuresis. The addition of furosemide would likely reduce this patient's mild hyperkalemia as well. (Choices A and D) This patient is appropriately on an ARB (valsartan). There is little benefit in substituting an ACE inhibitor (eg, lisinopril) for an ARB beyond cost considerations and a slightly reduced rate of symptomatic hypotension. Adding an ACE inhibitor to an ARB is not recommended as combined therapy is associated with an increased risk of hypotension and hyperkalemia. (Choices B and E) Calcium channel blockers (eg, amlodipine) and aldosterone antagonists (eg, spironolactone) are excellent options for third-or fourth-line therapy in proteinuric CKD. However, non-dihydropyridine blockers are preferred over dihydropyridines due to their effect on proteinuria. Also, aldosterone antagonists may worsen this patient's hyperkalemia. Educational objective: In patients with hypertension and proteinuric chronic kidney disease, diuretics can correct edema and increase the effectiveness of other antihypertensive medications. Loop diuretics are more effective than thiazide diuretics in patients with creatinine clearance <30 mL/min/1.73 m².",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_067",
"system": "Renal",
"stem": "A 67-year-old woman is evaluated for intermittent claudication prior to angiography. At a recent evaluation, her ankle-brachial index was 0.65 on the right and 0.75 on the left. The patient has a history of long-term cigarette smoking, hypertension, type 2 diabetes mellitus, hyperlipidemia, and severe degenerative arthritis of the knees. Current medications include simvastatin, ibuprofen, glipizide, and amlodipine. Blood pressure is 130/86 mm Hg and pulse is 72/min. Cardiac examination reveals a grade 2/6 systolic ejection murmur at the base. The lungs are clear and there is no jugular venous distension. Tibial pulses are 1+ and the patient has trace pedal edema of the ankles bilaterally. Serum creatinine is 2~mg/dL and urinalysis shows 2+ proteinuria. In addition to using the smallest dose of a third-generation contrast agent and prehydrating with normal saline, which of the following is the most appropriate precaution for this patient's angiography?",
"choice_a": "Discontinuation of ibuprofen",
"choice_b": "Furosemide during and following the procedure",
"choice_c": "Intravenous dopamine during the procedure",
"choice_d": "Mannitol prior to and during the procedure",
"choice_e": "Prophylactic hemofiltration",
"correct_answer": "A",
"explanation": "This patient with chronic kidney disease is at risk for contrast-induced nephropathy (CIN) from her impending angiography. The etiology of CIN likely includes both direct cytotoxicity and renal vasoconstriction. Acute kidney injury (eg, elevated creatinine, electrolyte abnormalities) develops 24-48 hours after contrast administration, and patients often have a low fractional excretion of sodium (<1%), even in the absence of clinical volume depletion. Although the risk of CIN is negligible in patients with normal renal function, patients with chronic kidney disease (particularly those with diabetic nephropathy) are at increased risk. Additional risk factors include the use of large contrast volumes and older, first-generation contrast agents. Preventive measures include avoidance of nonsteroidal anti-inflammatory drugs (which can worsen vasoconstriction), periprocedural infusion of normal saline, and use of the smallest possible volume of contrast media. (Choices B, C, D, and E) Other suggested measures for preventing CIN include agents to force diuresis (eg, mannitol, furosemide), prevent renal vasoconstriction (eg, dopamine, fenoldopam), rapidly remove contrast material (eg, hemodialysis), or inhibit oxidative stress (eg, acetylcysteine). However, none has been shown to have a clear benefit. Educational objective: Patients with chronic kidney disease are at risk for contrast-induced nephropathy. Preventive measures include avoidance of nonsteroidal anti-inflammatory drugs, periprocedural infusion of normal saline, and use of the smallest possible volume of contrast media.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_068",
"system": "Renal",
"stem": "A 63-year-old man, who was diagnosed with type 2 diabetes mellitus 8 years ago, comes to the office for a follow-up appointment. Over the last 2 weeks, he has noticed mild swelling in his legs, as well as fatigue. He has had no shortness of breath, orthopnea, nausea, vomiting, or diarrhea. Over the past year, the patient was found to have albuminuria on 2 separate visits. Three months ago, blood pressure was 122/78 mm Hg, serum creatinine was 1.2~mg/dL urine albumin-to-creatinine ratio was 250~mg/g and hemoglobin A1c was 7.2%. Lisinopril was initiated a year ago and the dose was increased 3 months ago. The patient has had no recent viral illnesses or taken any new medications. Current medications include low-dose aspirin, atorvastatin, lisinopril, and glargine insulin. The patient does not use tobacco, alcohol, or illicit drugs. Blood pressure is 155/95 mm Hg and pulse is 85/min. Auscultation of the heart and lungs shows no abnormalities. The abdomen is nontender and no costovertebral angle tenderness. The patient has 2+ pitting edema of the bilateral lower extremities. Laboratory results are as follows: Serum chemistry: Sodium 132~mEq/L, Potassium 4.8~mEq/L, Chloride 102~mEq/L, Bicarbonate 22~mEq/L, Blood urea nitrogen 26~mg/dL, Creatinine 1.8~mg/dL, Glucose 138~mg/dL, Albumin 3.1~g/dL, Calcium 8.2~mg/dL. Urinalysis: Glucose negative, Bacteria none, White blood cells 20-30/hpf, Red blood cells 20-30/hpf, Casts red blood cell casts, Protein 3+. Hemoglobin A1c is 7.5%. A renal ultrasonogram shows symmetric, normal-sized kidneys with no evidence of hydronephrosis. Which of the following is the next most appropriate step in management of this patient?",
"choice_a": "Adjust insulin dose for strict glycemic control and follow-up in several weeks",
"choice_b": "Discontinue lisinopril and initiate valsartan",
"choice_c": "Discontinue lisinopril and repeat laboratory testing in several weeks",
"choice_d": "Discuss ultrasound-guided renal biopsy",
"choice_e": "Obtain duplex Doppler ultrasonography of the renal arteries",
"correct_answer": "D",
"explanation": "Diabetic nephropathy and nondiabetic glomerular diseases (eg, glomerulonephritis) can have similar presentations; however, these conditions must be differentiated from each other as their clinical course and treatment differs. Diabetic nephropathy commonly presents with albuminuria and a bland urinalysis, although hematuria and red blood cell casts can sometimes be seen. Diabetic nephropathy is slowly progressive; it typically takes years from the onset of albuminuria to the development of overt renal failure. Glomerulonephritis commonly presents with active urinary sediment (eg, hematuria, pyuria, red blood cell casts) and hypertension. It is typically rapidly progressive and may require specific anti-inflammatory therapy (eg, corticosteroids, immunosuppressants) to prevent development of end-stage renal disease. This patient with diabetes mellitus and a history of albuminuria now has a rapid decline in GFR, development of progressive hypertension despite an increased ACE inhibitor dose, a significant increase in proteinuria (3+ corresponds to a urine albumin-to-creatinine ratio >1,000~mg/g) with accompanying edema, and active urinary sediment; this constellation of findings makes glomerulonephritis likely. Renal biopsy is required to confirm the diagnosis. Nondiabetic glomerular diseases should also be considered in patients with marked renal dysfunction (>30% decrease in glomerular filtration rate [GFR]) after ACE inhibitor initiation or with symptoms of systemic disease. (Choice A) Excellent glucose control can cause a regression in diabetic nephropathy; however, this patient already has relatively good glycemic control (hemoglobin A1c of 7.5%), and his rapidly progressive course makes diabetic nephropathy less likely. (Choice B) Changing from an ACE inhibitor (eg, lisinopril) to an angiotensin receptor blocker (eg, valsartan) is recommended for patients who experience ACE-associated cough; it would not improve serum creatinine. (Choices C and E) Increased serum creatinine is common in patients on ACE inhibitor therapy, but the increase is usually modest (<30% decline in GFR). A more marked decline may occur with bilateral renal artery stenosis. However, renal artery stenosis should not cause active urinary sediment, and this patient tolerated an ACE inhibitor for a year without kidney injury. It is unlikely that the increased dose would cause such a rapid reduction in GFR. Educational objective: Diabetic nephropathy typically presents with bland urinalysis and albuminuria; however, hematuria and red blood cell casts may occur. Progression is slow (years); therefore, nondiabetic glomerular diseases should be considered in patients with rapidly progressive disease, unexpected reductions in glomerular filtration rates (>30%) after ACE inhibitor initiation, active urinary sediment, or symptoms of other systemic diseases.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_069",
"system": "Renal",
"stem": "A 60-year-old woman is being evaluated for headache and hypertension. For the past week, she has felt tired and has had a progressive, generalized headache. She denies fever, chills, photophobia, or neck stiffness. Her general health has been good with the exception of 6 months of persistent pains and swelling in both hands. During this time, her fingers felt puffy and she recently noted some tiny pits appearing on her finger tips. She is also troubled by heartburn and mild dyspnea with exertion. She does not smoke or drink alcohol. She takes calcium, vitamin D, and a multivitamin. Over the past few days, she has also been taking acetaminophen and ibuprofen. Her blood pressure is 210/111 mm Hg, pulse is 90/min, and respirations are 16/min. She looks her stated age and appears uncomfortable. Her ocular fundi reveal no papilledema. Her neck is supple. Cardiac and abdominal exams are within normal limits. She has bibasilar fine end-inspiratory crackles on pulmonary exam. There are a few small digital fingertip pits. Her laboratory studies are shown below: Complete blood count: Hematocrit 33%, Platelets 130,000~cells/mu L, Leukocyte count 9,200~cells/mu L. Serum chemistry panel: Sodium 140~mEq/L, Potassium 3.8~mEq/L, Chloride 98~mEq/L, Bicarbonate 24~mEq/L, Creatinine 2.8~mg/dL, Blood glucose 100~mg/dL, INR 1.0, Partial thromboplastin time 30 seconds. Urinalysis: Specific gravity 1.019, Protein trace, Blood negative, Casts none. Her chest-x ray shows bibasilar reticular fibrosis. Her peripheral blood smear reveals schistocytes. Which of the following is the best initial treatment for this patient?",
"choice_a": "Captopril",
"choice_b": "Clonidine",
"choice_c": "Metoprolol",
"choice_d": "Nifedipine",
"choice_e": "Plasmapheresis",
"correct_answer": "A",
"explanation": "This patient's presentation (joint pains, finger puffiness, digital tip pits, gastroesophageal reflux, and basilar interstitial lung disease) is most consistent with scleroderma. Severe and life-threatening renal disease develops in 10-20% of patients with the cutaneous form of scleroderma, known as scleroderma renal crisis. Intense renal vasoconstriction stimulates the release of renin and generation of angiotensin II, which worsens the hypertension and leads to progressive renal dysfunction. Angiotensin converting enzyme inhibitors can decrease progression of scleroderma renal failure, even in the presence of significant renal dysfunction (as in this patient). Captopril is preferred due to its rapid onset of action and extensive reported use in scleroderma renal crisis. The treatment should be continued even if renal function initially worsens, and some patients may need dialysis following long-term control of blood pressure with angiotensin converting enzyme inhibitors. (Choices B and C) Clonidine and Metoprolol are not first-line agents for hypertensive emergencies and do not prevent the effects of angiotensin II on renal vasoconstriction. (Choice D) Nifedipine can lower blood pressure quickly and may treat Raynaud's phenomena (seen in some scleroderma patients), but it is not effective for scleroderma renal crisis. (Choice E) Malignant hypertension and scleroderma renal crisis are often associated with microangiopathic hemolytic anemia and platelet destruction. In patients with TTP-HUS, marked thrombocytopenia and anemia are seen. This patient has severe hypertension, pulmonary fibrosis, and cutaneous findings which are not seen with TTP-HUS. As a result, there is no indication for plasmapheresis in this patient. Educational objective: A subset of patients with diffuse cutaneous systemic sclerosis develop scleroderma renal crisis, characterized by acute kidney injury (no active urinary sediment), accelerated hypertension, and microangiopathic hemolytic anemia. Treatment involves prompt initiation of an angiotensin converting enzyme inhibitor (even in patients with advanced renal dysfunction).",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_070",
"system": "Renal",
"stem": "A 32-year-old woman comes to the physician complaining of severe left flank pain and gross hematuria. The pain started about 6 hours earlier and has steadily increased. It is not colicky in nature. There is no history of trauma, bleeding, or bruising. The patient has no weight loss, fever, chills, or dysuria. She considers herself in good health and works full-time as an editorial assistant. There is no family history of hematuria, kidney stones, or kidney disease. Her past medical history is unremarkable and she takes no medications. On examination, the patient appears uncomfortable. Her vital signs are within normal limits. Some scattered small pits are noted in her teeth. Cardiac and pulmonary examinations are unremarkable. An ill-defined mass is felt in the left flank area on abdominal examination. Laboratory results show a urinalysis with red bloods cells too numerous to count, normal complete blood count, and normal comprehensive metabolic panel. An urgent ultrasound reveals a 10-cm echogenic mass in the left kidney. Smaller echogenic masses and 3 renal cysts are seen in the right kidney. Abdominal CT scan reveals a 10x13-cm mass in the left kidney with attenuation similar to perirenal fat. Which of the following is the most likely diagnosis?",
"choice_a": "Bilateral renal cell carcinoma",
"choice_b": "Neurofibromatosis",
"choice_c": "Polycystic kidney disease",
"choice_d": "Tuberous sclerosis complex",
"choice_e": "von Hippel-Lindau disease",
"correct_answer": "D",
"explanation": "This patient's presentation is consistent with likely tuberous sclerosis complex, an autosomal dominant disorder due to mutations in 1 of 2 tumor suppressor genes. However, nearly 60% of cases involve no family history and are caused by new germline mutations. Tuberous sclerosis complex usually presents with hamartomatous tumors in many organs, including the brain, heart, lungs, kidney, and skin. Patients may present early in life with mental dysfunction, seizures, skin findings (eg, cutaneous angiomas), and dental pitting. However, recent studies have documented more adult-onset cases due to inability to recognize characteristic skin and dental findings in childhood or to later development of skin and dental pits. Adult-onset tuberous sclerosis complex may present with renal angiomyolipomas (as in this patient) or cystic lung disease, termed lymphangioleiomyomatosis (LAM), in later life. The renal lesions may cause pain, hemorrhage, hematuria, and loss of kidney function. The pulmonary lesions can cause dyspnea, pneumothorax, hemoptysis, and loss of lung function. Many adults have normal cognitive function. Management usually involves seizure control and surveillance for CNS, pulmonary, and renal manifestations as many of the hamartomatous tumor complications are treatable. (Choice A) This patient's echogenic renal mass with attenuation similar to perirenal fat strongly suggests angiomyolipoma in the kidneys. Bilateral renal cell cancer is uncommon, and renal angiomyolipomas rarely (<2% of cases) become malignant. (Choice B) Neurofibromatosis typically does not involve the kidneys. (Choice C) Polycystic kidney disease is not usually associated with angiomyolipomas of the kidney. However, tuberous sclerosis complex is sometimes associated with renal cysts. (Choice E) von Hippel-Lindau disease is an autosomal dominant disorder presenting with hemangioblastomas of the central nervous system, retinal angiomas, pheochromocytoma, pancreatic lesions, renal cysts, and renal cell carcinoma. This patient's illness is not characteristic of von Hippel-Lindau disease. Educational objective: Tuberous sclerosis complex is being recognized more frequently in adults. Patients who present with >1 renal angiomyolipoma or pulmonary lymphangioleiomyomatosis in women should undergo a thorough dermatologic examination and brain imaging to screen for tuberous sclerosis. Management usually involves seizure control and surveillance for CNS, pulmonary, and renal manifestations.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_071",
"system": "Renal",
"stem": "A 36-year-old woman has increasing nausea and headaches 12 hours after a right-sided percutaneous nephrolithotomy for staghorn calculi. The procedure involved ultrasonic lithotripsy followed by fragment removal using a flexible nephroscope. The patient spent a prolonged period in recovery and has been drowsy since returning to the ward. She is receiving intermittent morphine for pain control. She also received intravenous ceftriaxone after an episode of postoperative low-grade fever. Other medical conditions include frequent urinary tract infections, gastroesophageal reflux disease, and angioedema. A month ago, the patient was treated for contact dermatitis from poison ivy with a 10-day course of prednisone. Temperature is 37.2 C (99 F), blood pressure is 130/90 mm Hg, pulse is 64/min, respirations are 14/min and oxygen saturation is 96% on room air. The patient is drowsy but arousable with a short attention span. Pupils are small but reactive to light and accommodation. Mucous membranes are moist. The neck is supple, and cardiovascular and lung examinations are unremarkable. Abdominal examination reveals diminished bowel sounds. The patient is able to move all extremities on command, and deep tendon reflexes are symmetric. The remainder of the examination is normal. Laboratory results are as follows: Hematocrit 36%, Leukocytes 10,000/mm^{3}, Sodium 119~mEq/L, Potassium 3.6~mEq/L, Chloride 90~mEq/L, Bicarbonate 22~mEq/L, Creatinine 0.8~mg/dL, Glucose 120~mg/dL. The patient's preoperative laboratory studies were normal. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "3% saline by infusion pump",
"choice_b": "500 mL bolus of normal saline followed by infusion",
"choice_c": "Blood cultures and intravenous cefepime",
"choice_d": "Noncontrast CT scan of head",
"choice_e": "Random cortisol level and intravenous dexamethasone",
"correct_answer": "A",
"explanation": "This patient, who is experiencing nausea, headaches, and drowsiness following lithotripsy, has acute symptomatic hyponatremia, likely related to her recent surgery. Postoperative hyponatremia can develop within hours of surgery due to release of vasopressin related to surgical stress, the use of nonelectrolyte solutions (eg, glycine, sorbitol) for irrigation, or the infusion of hypotonic solutions during surgery. Patients with hyponatremia may be asymptomatic, or they may have mild (eg, headache, nausea, vomiting, confusion) or severe (eg, seizure, obtundation, coma) symptoms. Untreated patients may develop cerebral edema and brain herniation. Management depends on hyponatremia chronicity and associated symptoms: Patients with acute (<24-48 hours) hyponatremia who are symptomatic, such as this patient, should be treated emergently with hypertonic saline while being carefully monitored. The goal is to relieve symptoms and increase the sodium level relatively rapidly (eg, 4-6 mEq/L within the first few hours); the correction rate should not exceed 8 mEq/L in 24 hours. Regardless of hyponatremia chronicity, patients with severe symptoms and those with intracranial pathology (eg, intracranial tumor, recent traumatic brain injury) should also receive hypertonic saline. In patients who do not require hypertonic saline, including most patients with chronic hyponatremia, serum sodium levels should be increased slowly; treatment depends on the underlying disease (eg. fluid restriction in hypervolemic patients, normal saline in hypovolemic patients). (Choice B) This patient needs relatively rapid correction of hyponatremia with hypertonic saline to prevent further deterioration in mental status; this cannot be achieved with an isotonic solution such as normal saline. In addition, her physical examination findings (eg, moist mucous membranes, lack of hypotension) do not suggest volume depletion. (Choice C) This patient already received ceftriaxone and does not have signs of sepsis (eg, tachycardia, hypotension) to warrant a change in antibiotics or blood cultures. Her mental status changes are more likely due to hyponatremia. (Choice D) The mechanism of the neurological manifestations of postoperative hyponatremia is unclear, but they may be due to effects of the actual irrigant used or, less commonly, to cerebral edema. In this patient, a noncontrast CT scan of the head may show cerebral edema but would not change management and could delay appropriate treatment. (Choice E) Although this patient received corticosteroids in the past, the lack of hypotension and of metabolic abnormalities consistent with adrenal insufficiency (eg, hyperkalemia, significant metabolic acidosis, hypoglycemia) makes an adrenal crisis less likely. Educational objective: Postoperative hyponatremia usually occurs due to surgical stress-related release of vasopressin, use of nonelectrolyte solutions for irrigation, or infusion of hypotonic solutions. Acute, symptomatic hyponatremia should be emergently treated with hypertonic saline.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_072",
"system": "Renal",
"stem": "A 73-year-old woman comes to the clinic complaining of acute onset of urinary incontinence after recent hospitalization for total knee replacement. Over the last 3 days, she has had 5-10 episodes of spontaneous urinary leakage daily. She also has had small, loose bowel movements. The patient has no urgency, increased frequency, dysuria, hematuria, or involuntary leakage associated with coughing, sneezing, or laughing. There is no recent history of fever or chills. Her other medical problems include hypertension, well-controlled type 2 diabetes mellitus with HbA1c of 6.9%, and chronic constipation. Her medications include metformin, glipizide, lisinopril, amlodipine, docusate, and oxycodone. She has not changed her diet or increased her caffeine intake. Her stable routine includes 1 or 2 alcoholic beverages each night. She has 4 children, all of whom were delivered vaginally. Her vital signs are within normal limits. The abdomen is distended and mildly tender to palpation in the lower quadrants. Rectal examination shows hard stool in the rectal vault. Pelvic examination shows no thinning or pallor of the vaginal mucosa and no evidence of vaginal wall prolapse. Which of the following is the most appropriate next step in management of this patient?",
"choice_a": "Ciprofloxacin",
"choice_b": "Estrogen cream",
"choice_c": "Oxybutynin",
"choice_d": "Pelvic muscle exercises",
"choice_e": "Polyethylene glycol",
"correct_answer": "E",
"explanation": "A thorough history is essential to differentiate causes of urinary incontinence. Because many patients are very reluctant to initiate discussions about incontinence, all women age > 65 should be screened for voiding problems. History should evaluate factors such as duration, severity, triggering factors (eg, cough, sneeze), associations (eg, frequency, urgency, dysuria), obstetric and gynecologic history, lifestyle (eg, alcohol use), and medications. In addition to differentiating the type of urinary incontinence, the history may indicate reversible causes. This patient likely has incontinence related to potentially reversible conditions (transient incontinence). Her history and physical examination show stool impaction. Impaction can impair bladder emptying as bowel control shares the same sacral cord innervation as the bladder. Laxative treatment, such as polyethylene glycol to increase the water content of the stool, would likely improve both the constipation and urinary incontinence in this patient. (Choice A) Although urinary tract infections commonly cause incontinence in elderly patients, this patient's absence of infectious symptoms (eg, dysuria, hematuria) makes this less likely. A urinalysis is recommended as part of the initial workup. However, empiric treatment with antibiotics is not recommended. (Choice B) Estrogen cream can help atrophic vaginitis. However, this patient does not have findings (eg, vaginal mucosa pallor, vulvar erythema and inflammation) suggesting atrophic vaginitis. (Choice C) Oxybutynin is the most frequently prescribed antimuscarinic agent for urge incontinence or detrusor overactivity. However, this patient does not describe classic urge symptoms preceding her episodes of incontinence. (Choice D) Pelvic muscle exercises can help stress, urge, or mixed incontinence. However, this patient's absence of additional lower urinary tract symptoms (eg, worsening with cough) makes this less likely. Educational objective: Women age > 65 should undergo screening for voiding problems with a thorough history and physical examination. Incontinence related to potentially reversible conditions (transient incontinence) can be due to etiologies such as stool impaction, medications, urinary tract infection, mobility issues, lifestyle, and atrophic vaginitis.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
{
"id": "RENAL_073",
"system": "Renal",
"stem": "A 37-year-old woman is evaluated for generalized weakness. She has been hospitalized twice over the last year with similar complaints and her serum potassium concentration was found to be <3.0~mEq/L Her potassium concentration returned to normal with aggressive potassium replacement. She eats a normal diet and denies vomiting, purging, and cathartic or diuretic use. Her blood pressure is within normal limits. Her only medication is an oral contraceptive. Her review of systems is otherwise unremarkable. Her sister suffers from Crohn's disease and her mother has congestive heart failure, diabetes mellitus, and bipolar disorder. Her blood pressure is 112/68 mm Hg and her pulse is 90/min. Her BMI is 22~kg/m^{2} Physical examination is normal. Laboratory studies are shown below: Complete blood count: Hemoglobin 12.8~g/dL, Hematocrit 38%. Serum chemistry: Sodium 136~mEq/L, Potassium 3.1~mEq/L, Chloride 90~mEq/L, Bicarbonate 30~mEq/L, Creatinine 0.8~mg/dL, Glucose 100~mg/dL. Urinalysis: Specific gravity 1.010, Protein none, Blood negative, Ketones negative, Nitrites negative, White blood cells 1-2/hpf, Red blood cells 1-2/hpf. Spot urinary chloride concentrations on two separate occasions were 15 and 65~mEq/L. Which of the following is most likely to establish diagnosis in this patient?",
"choice_a": "CT angiography of renal arteries",
"choice_b": "Colonoscopy",
"choice_c": "Plasma aldosterone and renin levels",
"choice_d": "Serum insulin and C-peptide levels",
"choice_e": "Urine screen for diuretics",
"correct_answer": "E",
"explanation": "This patient presents with unexplained hypokalemia and metabolic alkalosis. The most common causes are vomiting/purging and diuretic use. Surreptitious vomiting or purging can be difficult to diagnose, but it usually presents with significant metabolic alkalosis and a low urinary chloride. This patient also lacks signs of self-induced vomiting such as ulcers on the dorsum of the hand, dental erosions from chronic acid exposure, or puffy cheeks from hypertrophied salivary glands. Diuretics cause a high urine chloride and metabolic alkalosis, but the urine chloride returns to low levels once the drug's effect wears off. As a result, surreptitious diuretic use is often associated with intermittent hypokalemia and variable urinary chloride excretion. In patients without physical signs of self-induced vomiting, a positive urinary screen for diuretics (usually on several occasions) is required to confirm the diagnosis of diuretic abuse. (Choice A) CT angiography of the renal arteries diagnoses renal artery stenosis and fibromuscular dysplasia, which both cause hypertension usually with a urine chloride > 40 mEq/L. This patient's normal blood pressure and variable urinary chloride make this less likely. (Choice B) Colonoscopy would be indicated for gastrointestinal causes of hypokalemia (e.g., diarrhea, surreptitious cathartic use, or a secretory villous adenomas), but those patients usually have metabolic acidosis from bicarbonate loss rather than alkalosis. (Choice C) Elevated plasma aldosterone with suppressed renin suggests hyperaldosteronism, which usually presents with persistent hypokalemia and hypertension. This patient's normal blood pressure and episodic hypokalemia make this less likely. (Choice D) Elevated C-peptide and insulin levels would suggest exogenous oral hypoglycemic agent abuse or insulinoma. Elevated insulin levels with low C-peptide levels suggest exogenous insulin abuse. However, this patient's lack of hypoglycemia makes this less likely. Educational objective: Intermittent hypokalemia with metabolic alkalosis in the absence of vomiting suggests a diagnosis of either surreptitious purging or diuretic use. A variable urinary chloride favors diuretic abuse and can be confirmed with a urinary screen for diuretics.",
"source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
},
  {
    "id": "RENAL_074",
    "system": "Renal",
    "stem": "A 36-year-old woman comes to the office due to recurrent dysuria. She also has had dull pain in her right flank and cloudy urine that contains blood. The patient has a history of recurrent urinary tract infections since becoming sexually active in high school. Over the last year, she has had 3 infections accompanied by fever. Her last urine culture grew Klebsiella pneumoniae. The patient is in a monogamous relationship. For contraception, she uses a diaphragm or her partner uses a condom, both with spermicidal coatings. Temperature is 38.1 C (100.6 F), blood pressure is 114/70 mm Hg, and pulse is 95/min. The abdomen is soft and nontender. Mild right costovertebral angle tenderness is present on percussion. Laboratory results are as follows: Hematocrit 34%, Leukocytes 13,000/mm3, Sodium 140 mEq/L, Potassium 4.2 mEq/L, Chloride 102 mEq/L, Bicarbonate 24 mEq/L, Creatinine 1.9 mg/dL, Uric acid 8 mg/dL. Urinalysis: Specific gravity 1.013, PH 8, Protein none, Blood moderate, Glucose negative, Leukocyte esterase positive, Nitrites positive, Bacteria many, White blood cells 20-30/hpf, Red blood cells 20-30/hpf.",
    "choice_a": "Discontinuation of spermicides",
    "choice_b": "High-volume fluid intake and allopurinol",
    "choice_c": "Postcoital antibiotic prophylaxis",
    "choice_d": "Stone-removal procedure",
    "choice_e": "Urinary alkalization",
    "correct_answer": "D",
    "explanation": "This patient's clinical presentation is most consistent with a struvite (magnesium ammonium phosphate) stone. These stones form only in the presence of an upper urinary tract infection with a urease-producing bacterium such as Proteus or Klebsiella. Urease cleaves urea into ammonia and carbon dioxide; the resulting ammonia then buffers hydrogen ions to form ammonium, which increases the urinary pH to >7. The alkaline environment promotes the precipitation of magnesium ammonium phosphate, leading to the formation of large staghorn calculi. These stones can provide a nidus for recurrent infection. Treatment requires complete removal of the stone (usually via percutaneous nephrolithotomy) in addition to antibiotic therapy to eradicate the infection and prevent recurrence.",
    "source": "ABIM_Renal,_Urinary_Systems_Electrolytes_3.pdf"
  }
]