[
  {
    "id": "SYSTEM_001",
    "system": "Rheumatology",
    "stem": "A 52-year-old man comes to the physician with leg ulcers. Two months ago a small ulcer appeared on the right medial malleolus, and now there are 2 additional ulcers on both legs. He was diagnosed with seropositive rheumatoid arthritis 15 years ago and has been on oral prednisone, sulfasalazine, and hydroxychloroquine since then. Eight years ago methotrexate was discontinued due to liver toxicity. Five years ago he received etanercept for a few months, but this was discontinued due to frequent sinus infections.\n\nThe patient's other medical problems include gastritis, type 2 diabetes mellitus, and colon polyps. He is a cattle farmer and does not use tobacco, alcohol, or illicit drugs.\n\nHe is afebrile and vital signs are normal. Skin examination is notable for several nodules on the extensor surface of the elbows. There are 3 shallow ulcers on both legs in various stages of healing. Heart and lung sounds are normal. Spleen is palpable 2 cm below the left costal margin. There are rheumatoid deformities of both hands and feet with decreased range of motion in wrists, elbows, and ankle joints. Neurologic examination is normal.\n\nLaboratory results are as follows:\nComplete blood count\nHemoglobin: 9.0 g/dL\nMean corpuscular volume: 84 fL\nPlatelets: 148,000/μL\nLeukocytes: 3,300/μL\nNeutrophils: 30%\nLymphocytes: 70%\nSerum chemistry\nSodium: 140 mEq/L\nBlood urea nitrogen: 20 mg/dL\nCreatinine: 1.2 mg/dL\nCalcium: 9.4 mg/dL\nGlucose: 100 mg/dL\nLiver function studies\nTotal protein: 6.5 g/dL\nAlbumin: 3.7 g/dL\nAlkaline phosphatase: 70 U/L\nAspartate aminotransferase (SGOT): 37 U/L\nAlanine aminotransferase (SGPT): 24 U/L\nImmunologic and rheumatologic studies\nErythrocyte sedimentation rate: 92 mm/h",
    "choice_a": "Cutaneous polyarteritis nodosa",
    "choice_b": "Felty's syndrome",
    "choice_c": "Necrobiosis lipoidica diabeticorum",
    "choice_d": "Pyoderma gangrenosum",
    "choice_e": "Sweet's syndrome",
    "correct_answer": "B",
    "explanation": "This patient has rheumatoid arthritis, neutropenia, and splenomegaly, a triad known as Felty's syndrome (FS). It occurs in about 1% of patients with seropositive, advanced rheumatoid arthritis (usually > 10 years). Almost all patients have positive rheumatoid factor and anti-CCP antibodies. Patients can develop extra-articular manifestations such as mononeuritis multiplex, necrotizing skin lesions, pleuropericarditis, lymphadenopathy, and episcleritis. Patients are at increased risk for skin and respiratory tract infections due to neutropenia. Diagnosis requires bone marrow biopsy to rule out other causes of neutropenia, such as large granular lymphocyte syndrome. Treatment of FS is methotrexate and other disease-modifying antirheumatic drugs. Granulocyte colony-stimulating factor can be given to patients with life-threatening or refractory infections.\n\n(Choice A) Absence of renal manifestations and the presence of splenomegaly make polyarteritis nodosa unlikely.\n\n(Choice C) Necrobiosis lipoidica diabeticorum is a chronic, inflammatory skin condition most commonly seen in diabetics. The lesions typically appear as indurated plaques with central atrophy and yellow-brown pigmentation.\n\n(Choice D) Pyoderma gangrenosum is a skin condition frequently associated with systemic disorders such as inflammatory bowel disease. Patients present with painful, necrotic skin ulcerations. Pyoderma gangrenosum is not associated with splenomegaly.\n\n(Choice E) Sweet's syndrome is neutrophilic dermatoses associated with malignancy and autoimmune diseases (eg, inflammatory bowel disease). It presents with abrupt onset of erythematous plaques with pseudoblistering and pustules on the face, neck, chest, and extremities. It is frequently preceded by flu-like symptoms, and laboratory results show leukocytosis (not present in this patient).",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_002",
    "system": "Rheumatology",
    "stem": "A 45-year-old woman comes to the office with 3 months of right foot pain. Her symptoms started with nighttime numbness at the bottom of the right foot that has progressed to burning and aching pain. She also has vague discomfort while standing or sitting, especially when wearing shoes. The patient has a history of rheumatoid arthritis, which has been stable with weekly etanercept and as-needed ibuprofen. She does not use tobacco, alcohol, or illicit drugs.\n\nExamination shows swollen hand joints without tenderness and mild radial deviation of the wrist. She has mild hallux valgus deformity without focal tenderness on foot examination. Light tapping behind the right medial malleolus elicits tingling. There is intact sensation to light touch and vibration.",
    "choice_a": "Drug-induced neuropathy",
    "choice_b": "Morton neuroma",
    "choice_c": "Plantar fasciitis",
    "choice_d": "Stress fracture",
    "choice_e": "Tarsal tunnel syndrome",
    "correct_answer": "E",
    "explanation": "This patient's clinical features suggest tarsal tunnel syndrome, which is due to posterior tibial nerve compression as it passes under the flexor retinaculum posterior to the medial malleolus. Tarsal tunnel syndrome is most common following an ankle fracture or dislocation involving the talus, calcaneus, or medial malleolus, in which scar tissue, bony spurs, or bone/cartilage fragments can compress the nerve. Other etiologies include malignancy or inflammatory conditions (eg, rheumatoid arthritis). Patients usually develop pain and paresthesias in the distribution of the nerve (sole of the foot, distal foot, or toes). The pain can radiate up to the heel and calf and is worse at night or with standing. Taking off shoes often relieves the discomfort. Examination can show a positive Tinel's sign (tingling sensation on light percussion over the nerve) and/or sensory loss. Severe nerve injury can lead to atrophy of intrinsic foot muscles. Diagnosis is mainly clinical, although electrodiagnostic testing may be helpful. Treatment includes anti-inflammatory medications (eg, nonsteroidal anti-inflammatory drugs), shoe modification, or corticosteroid injection, with decompressive surgery in refractory cases.\n\n(Choice A) Drug-induced neuropathy typically presents with significant bilateral sensory abnormalities and motor weakness. This patient's unilateral presentation and intact sensory examination make this less likely.\n\n(Choice B) Morton neuroma presents with numbness or pain between the third and fourth toes and a clicking sensation (Mulder sign) that occurs when simultaneously palpating this space and squeezing the metatarsal joints. Tinel's sign is not a characteristic of Morton neuroma.\n\n(Choice C) Plantar fasciitis causes pain and focal tenderness in the plantar area of the rearfoot. The pain may be severe with the first steps of the day. It then often decreases with activity only to worsen again later in the day with prolonged weight bearing.\n\n(Choice D) Stress fractures are due to repeated tension or compression without adequate rest that eventually breaks the bone. Patients typically present with sharp and localized pain over a bony surface that is worse with palpation.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_003",
    "system": "Rheumatology",
    "stem": "A 35-year-old man is evaluated for pain and swelling behind his right foot that is exacerbated by walking. He reports chronic back pain that occurs mostly in the morning and at night. The pain improves during the day and with exercise, but not with rest. He takes over-the-counter ibuprofen with significant back pain relief. The patient has no fatigue, headaches, vision problems, or abdominal complaints. He has no other medical problems. His mother suffers from rheumatoid arthritis.\n\nLaboratory results are as follows:\nHemoglobin: 13.0 g/dL\nMean corpuscular volume: 88 fL\nC-reactive protein (CRP): 25 mg/L",
    "choice_a": "Arm span to height ratio",
    "choice_b": "Chest expansion",
    "choice_c": "Dix-Hallpike maneuver",
    "choice_d": "Drop arm test",
    "choice_e": "Romberg test",
    "correct_answer": "B",
    "explanation": "This patient's presentation suggests ankylosing spondylitis (AS). Ankylosing spondylitis usually presents in adults age < 40 with chronic low back pain due to sacroiliitis. The pain occurs during the day and night and tends to improve with exercise, but not with rest. Patients usually develop enthesitis at insertion sites of tendons to bone (eg, Achilles tendon, plantar fascia, shoulder), limited spinal mobility or chest wall expansion, and possible extra-articular manifestations (eg, anterior uveitis, osteopenia with increased fracture risk). Limited chest wall expansion is due to costovertebral rigidity. Normal chest wall expansion is 5 cm after maximum forced expiration followed by maximum inspiration. Expansion < 2.5 cm is considered abnormal and suggests AS. Patients with kyphoscoliosis and deformity above T10 are at increased risk for nocturnal hypoventilation and apneic events as well as respiratory failure. Advanced AS may have x-ray findings of continuous fusion of the lumbar spine (\"bamboo spine\"). Treatment of respiratory impairment includes pulmonary rehabilitation and noninvasive positive-pressure ventilation.\n\n(Choice A) Marfan syndrome usually presents with increased arm span to height ratio and is associated with aortic root dilatation/dissection, ectopia lentis, mitral valve prolapse, and pneumothorax.\n\n(Choice C) The Dix-Hallpike maneuver is a diagnostic test to identify benign paroxysmal positional vertigo. In the presence of posterior canal dysfunction, the maneuver generally provokes vertigo and nystagmus.\n\n(Choice D) The drop arm test is used to assess the integrity of the supraspinatus tendon for rotator cuff injuries. A positive test occurs when the patient is unable to lower the affected arm from a fully abducted position in a smooth, controlled manner compared to the unaffected arm.\n\n(Choice E) The Romberg test is used to test proprioception (dorsal columns of the spinal cord). Causes of a positive test include cervical spondylotic myelopathy, B12 deficiency, and neurosyphilis.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_004",
    "system": "Rheumatology",
    "stem": "A 33-year-old woman comes to the office due to a 2-day history of severe left knee pain and swelling. She has had no trauma, pain in other joints, fever, chills, or rash. The patient has a history of parathyroid adenoma with primary hyperparathyroidism and underwent parathyroidectomy a week ago. Her other medical problems include moderate persistent asthma, irritable bowel syndrome, and gastroesophageal reflux disease. The patient does not use tobacco, alcohol, or illicit drugs. She is married and her only medication is an oral contraceptive. Temperature is 36.7 C (98F), blood pressure is 110/56 mm Hg, pulse is 67/min, and respirations are 14/min. BMI is 28 kg/m2. Physical examination shows a moderate left knee effusion with warmth, erythema, and tenderness. Range of motion of the knee is decreased due to pain.\n\nLaboratory results are as follows:\nLeukocytes: 9,600/mm3\nHemoglobin: 11.1 g/dL\nPlatelets: 350,000/mm3\nCreatinine: 0.7 mg/dL\nErythrocyte sedimentation rate: 46 mm/hr\nAnalysis of synovial fluid from the knee joint shows a leukocyte count of 20,400/mm3 with 80% neutrophils.",
    "choice_a": "Acute gouty arthritis",
    "choice_b": "Erosive osteoarthritis",
    "choice_c": "Osteitis fibrosa cystica",
    "choice_d": "Pseudogout",
    "choice_e": "Septic arthritis",
    "correct_answer": "D",
    "explanation": "This patient has acute, inflammatory monoarticular arthritis affecting the knee. In light of her history of hyperparathyroidism and recent parathyroidectomy, this is most likely due to calcium pyrophosphate dihydrate crystal arthritis (pseudogout). Hyperparathyroidism can lead to chondrocalcinosis in the articular cartilage; parathyroidectomy can precipitate a pseudogout attack due to an abrupt drop in serum calcium levels, which triggers crystal shedding into the synovial fluid. Pseudogout commonly affects the knees, where it may be difficult to distinguish from urate gout. It also frequently affects the wrists and ankles and may involve multiple joints concurrently. Attacks often occur in the setting of trauma/overuse, surgery, or medical illness. The primary treatment is nonsteroidal anti-inflammatory drugs; intra-articular glucocorticoids and colchicine can also be considered.\n\n(Choice A) Although gout can also present with monoarthritis, this patient has no risk factors for gout (eg, obesity, alcohol use), and her recent parathyroidectomy is more strongly associated with pseudogout.\n\n(Choice B) Erosive osteoarthritis typically occurs in patients age >40. It presents with pain and stiffness. crepitus and tenderness on examination, joint space narrowing on x-rays, and clear synovial fluid with <2,000/mm3 white blood cells.\n\n(Choice C) Osteitis fibrosa cystica is a rare complication of severe primary hyperparathyroidism characterized by subperiosteal bone resorption in the middle phalanges, tapering of the distal clavicles, \"salt and pepper\" appearance of the skull, bone cysts, and brown tumors of the long bones. Patients typically experience chronic bone pain rather than acute arthritis (as in this patient).\n\n(Choice E) Septic arthritis typically presents with markedly decreased range of motion, increased warmth and swelling, and cloudy joint aspirate with >100.000/mm3 white blood cells (predominantly neutrophils).",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_005",
    "system": "Rheumatology",
    "stem": "A 20-year-old woman comes to the office due to atraumatic heel pain over the last week. For the past 6-8 months, the patient has also experienced bilateral hip pain that has progressively worsened and now awakens her during the early-morning hours. When this occurs, she gets up and walks around for a few minutes before going back to sleep. The patient also has difficulty tying her shoelaces in the morning due to back pain and stiffness; however, she does not feel limited when performing other daytime activities. She has tried over-the-counter pain medications and found ibuprofen to be more effective than acetaminophen. A year ago, she had an episode of intense pain, photophobia, and redness involving her left eye, which improved with corticosteroid eye drops. The patient also occasionally has mouth ulcers, usually around the time of her menstrual periods. Family history is significant for breast cancer in her mother and multiple sclerosis in her aunt. The patient does not use tobacco, alcohol, or illicit drugs. She is sexually active and uses oral contraceptives for birth control.\n\nVital signs are normal. The oral mucosa is moist with mild tonsillar swelling, but there are no ulcers or other lesions. There is tenderness and swelling of the heel, as shown in the exhibit. Examination of the ankle and other joints shows no synovitis or effusion. Flexion and external rotation of the hip joints elicits intense pain at the gluteal region.\n\nLaboratory results are as follows:\nLeukocytes: 5,600/mm3\nHemoglobin: 12.5 g/dL\nPlatelets: 320,000/mm3\nC-reactive protein: 10 mg/L (normal: <8)",
    "choice_a": "Anti-double-stranded DNA assay",
    "choice_b": "Cervical swab culture for Neisseria gonorrhoeae",
    "choice_c": "Chest x-ray",
    "choice_d": "Pathergy testing",
    "choice_e": "X-ray of the pelvis",
    "correct_answer": "E",
    "explanation": "Enthesitis is characterized by swelling, tenderness, and pain at tendon insertion sites (eg, Achilles tendon at the heel, costosternal junction, shoulders, elbows, hips, iliac crests, tibial tuberosities). Enthesitis may occur as an isolated disorder (eg, plantar fasciitis) but is a characteristic finding in the spondyloarthropathies (eg, ankylosing spondylitis [AS], psoriatic arthritis, reactive arthritis). This patient has features suggesting AS, including enthesitis at the heel and hips, inflammatory back pain (ie, insidious onset, stiffness, worse in the morning/with rest), and possible uveitis. The incidence of AS is highest at age 20-30. Examination often shows decreases in chest expansion (<2 cm expansion with inspiration suggests AS), cervical extension, and lumbar flexion. Dactylitis and peripheral joint synovitis are also possible. An anteroposterior x-ray of the pelvis revealing arthritis and erosions of the sacroiliac joints can confirm the diagnosis in most patients. Inflammatory markers (eg, C-reactive protein) are commonly elevated. HLA-B27 is positive in most patients and correlates with aggressive disease. Initial treatment includes nonsteroidal anti-inflammatory drugs and range-of-motion exercises.\n\n(Choice A) Enthesitis can occur in patients with systemic lupus erythematosus, but synovitis is more common. In addition, this patient does not have more characteristic findings of lupus (eg, malar rash, anemia); therefore, anti-double-stranded DNA antibody testing is not indicated.\n\n(Choice B) Disseminated gonococcal infection presents as purulent monoarthritis or a triad of tenosynovitis, dermatitis, and migratory polyarthralgias. Reactive arthritis is a spondyloarthropathy that resembles AS with inflammatory back pain, enthesitis, and peripheral arthritis but more commonly follows nongonococcal (eg, Chlamydia trachomatis) rather than gonococcal urethritis.\n\n(Choice C) Sarcoidosis can cause uveitis and arthritis of the ankle and knee joints, but enthesitis and inflammatory back pain are uncommon. Chest x-ray to evaluate for hilar adenopathy is not needed.\n\n(Choice D) Pathergy testing (formation of an inflammatory papule following insertion of a sterile needle into the skin) is useful for diagnosing Behçet disease. This disorder causes aphthous ulcers, uveitis, and genital ulcers but does not typically cause inflammatory back pain. Aphthous ulcers are a common, nonspecific finding often seen in association with menstrual periods and/or stress.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_006",
    "system": "Rheumatology",
    "stem": "A 55-year-old man comes to the physician due to myalgias, arthralgias, and weight loss. He has not felt well for 2 years. Over that time, he has experienced 4 episodes of sinusitis that responded poorly to treatment and required prolonged courses of antibiotics for symptom resolution. During the last 6 months, the patient has experienced diffuse aches. He has pain that migrates from his knees to his shoulders and wrists and has also lost 4.5 kg (10 lb). He has no history of hypertension, diabetes mellitus, or chronic kidney disease.\n\nHis blood pressure is 138/90 mm Hg. A small amount of crusted blood is present in one nostril. There are no other significant physical findings.\n\nLaboratory results are as follows:\nComplete blood count\nHemoglobin: 12.6 g/dL\nHematocrit: 36%\nPlatelets: 410,000/mm3\nLeukocytes: 9,900/mm3\nSerum chemistry\nSodium: 142 mEq/L\nPotassium: 4.4 mEq/L\nChloride: 98 mEq/L\nBicarbonate: 24 mEq/L\nCreatinine: 1.8 mg/dL\nUrinalysis\nSpecific gravity: 1.016\nProtein: +2\nBlood: Moderate\nRed blood cells: 20-30/hpf\nCasts: Coarsely granular casts\n\nChest CT reveals two 2-3 cm nodules in the left upper lobe. Serum anti-neutrophil cytoplasmic antibodies are negative.",
    "choice_a": "Blood cultures",
    "choice_b": "Bronchoscopy with nodule biopsy",
    "choice_c": "Kidney biopsy",
    "choice_d": "Nasal biopsy",
    "choice_e": "Urine eosinophils",
    "correct_answer": "C",
    "explanation": "This patient most likely has granulomatosis with polyangiitis (GPA), formerly called Wegener's granulomatosis. Prompt diagnosis and institution of therapy may be kidney- and life-sparing. GPA is suspected in patients with 22 of the following: nasal or oral inflammation, abnormal chest radiograph, abnormal urinary sediment, and granulomatous inflammation on biopsy of an artery or perivascular area. Pathogenesis involves anti-neutrophilic cytoplasmic antibodies (ANCA) reacting with 1 of 2 proteins (serine proteinase 3 or myeloperoxidase) on the surface of cytokine-stimulated white blood cells. Although up to 90% of patients with generalized GPA have positive ANCA, negative ANCA does not rule out the diagnosis. Tissue biopsy is typically obtained at the site of active disease (eg, skin, kidney, lung) to make a definitive diagnosis. This patient has evidence of renal disease with active urinary sediment; therefore, kidney biopsy should be obtained and may show pauci-immune segmental necrotizing glomerulonephritis with few or no immune deposits on electron microscopy. Lung biopsy can be obtained in patients with predominant lung disease; however, this often requires open or thoracoscopic biopsy as transbronchial biopsy generally does not yield a sufficient quantity of tissue (Choice B). The diagnostic yield of nasal biopsy is also very low due to the small amount of tissue obtained (Choice D). Therapy should be started in patients with suspected GPA if there is a delay in obtaining tissue biopsy, regardless of the ANCA result.\n\n(Choice A) Infective endocarditis can have a similar presentation, especially if it is right-sided given the lung lesions. However, this patient's 6-month history of multiple, refractory sinus infections makes this diagnosis unlikely.\n\n(Choice E) Urine eosinophils are seen in acute interstitial nephritis, which is rarely associated with GPA. In addition, this patient has no rash or history of recent exposure to triggering medications.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_007",
    "system": "Rheumatology",
    "stem": "A 35-year-old immigrant from Eastern Europe comes to the office due to dry cough, malaise, and fatigue. He has had joint aches and involuntary weight loss over the past 3 months. His other medical problems include severe allergies that manifest as nasal stuffiness, headache, and ear pain. He takes over-the- counter decongestants. He is a construction worker, smokes a pack of cigarettes a day, and drinks 6 cans of beer once a week. His mother suffers from severe rheumatoid arthritis.\n\nHis temperature is 37.2 C (99 F), blood pressure is 122/70 mm Hg, and pulse is 89/min. He has tenderness on palpation of bilateral maxillary sinuses. Tympanic membranes are full and bulging bilaterally. Pulmonary auscultation reveals occasional rhonchi. There are no heart murmurs. The tip of the spleen is not palpable. There are no skin rashes or joint swelling.\n\nLaboratory results are as follows:\nHemoglobin: 9.5 g/dL\nLeukocytes: 5,500/mm3\nPlatelets: 710,000/mm3\nPotassium: 4.5 mEq/L\nCreatinine: 2.0 mg/dL\n\nLiver panel is unremarkable. Urinalysis is positive for blood and protein, and urine sediment analysis reveals multiple red blood cells casts. Chest x-ray is shown below.",
    "choice_a": "Anti-double-stranded DNA antibodies",
    "choice_b": "Anti-myeloperoxidase antibodies",
    "choice_c": "Anti-proteinase 3 antibodies",
    "choice_d": "Bone marrow biopsy",
    "choice_e": "Tuberculin skin testing",
    "correct_answer": "C",
    "explanation": "This patient's clinical presentation is consistent with a systemic vasculitis. The history of weight loss, arthralgias, anemia of chronic disease, ear/sinus symptoms, pulmonary nodules, and renal insufficiency with glomerulonephritis suggests granulomatosis with polyangiitis (GPA), formerly Wegener granulomatosis. It is an anti-neutrophil cytoplasmic antibodies (ANCA)-associated vasculitis, with nearly 90% of patients testing ANCA positive. However, the absence of ANCA does not exclude GPA. Immunofluorescence test results are reported as c-ANCA (cytoplasmic pattern) or p-ANCA (perinuclear pattern) titers. The c-ANCA pattern is caused by anti-proteinase 3 (PR3) antibodies, and the p-ANCA pattern is caused by anti-myeloperoxidase (MPO) antibodies. The c-ANCA pattern and anti-PR3 antibodies are most commonly associated with GPA; P-ANCA pattern and MPO are associated with microscopic polyangiitis (Choice B). However, patients with typical clinical presentation and tissue biopsy confirming vasculitis can be diagnosed with GPA, even with positive p-ANCA or negative ANCA.\n\n(Choice A) Anti-double-stranded DNA antibodies are more specific for the diagnosis of systemic lupus erythematosus. However, this patient does not have other clinical criteria (eg, malar rash, photosensitivity, or pleurisy) for this disease. In addition, the pulmonary nodules and sinus/ear disease are more common with GPA.\n\n(Choice D) Bone marrow biopsy would be indicated to evaluate for thrombocytosis due to myeloproliferative disorders. However, this patient likely has reactive thrombocytosis from vasculitis and does not have significant white blood cell or red blood cell abnormalities to warrant a biopsy.\n\n(Choice E) Tuberculin skin testing may be indicated for this patient's pulmonary symptoms combined with weight loss. However, the renal involvement with active urinary sediment makes tuberculosis less likely.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_008",
    "system": "Rheumatology",
    "stem": "A 30-year-old woman comes to the physician with the complaint of cold hands. Symptoms occur during winter months or when she reaches into the freezer at home. The coldness is often associated with intense pallor and a bluish color. On recovery, the hands feel warm and appear red and flushed. With severe attacks, the patient has numbness and tingling in the hands. On rare occasions, she can also feel the sensation in her toes. She denies skin rashes, joint pain, acid reflux, dyspnea, or chest pain. She has no other medical problems and takes no medication. Family history is unremarkable. She does not use tobacco, alcohol, or illicit drugs.\n\nHer blood pressure is 122/70 mm Hg and pulse is 78/min. Lungs are clear on auscultation. No bruits are heard in the periumbilical area. Peripheral pulses are symmetric and full. Skin examination is normal.",
    "choice_a": "Ankle brachial index",
    "choice_b": "Carotid duplex ultrasound",
    "choice_c": "Dilated fundus examination",
    "choice_d": "Monofilament testing",
    "choice_e": "Nail bed capillaroscopy",
    "correct_answer": "E",
    "explanation": "This patient's presentation suggests primary Raynaud's phenomenon (RP). Patients usually experience biphasic color changes in the digits with thumb sparing during stress or on exposure to cold temperatures. Primary RP usually occurs in healthy women < age 30 without signs of tissue injury or abnormal laboratory findings (eg, ANA and ESR). Secondary RP is usually seen in men > age 40 and presents with signs of tissue ischemia or ulceration, abnormal laboratory findings, and/or systemic symptoms. Thumb involvement is also more common in secondary RP. Nailfold capillary examination can help differentiate between primary and secondary RP. It involves placing oil on the nailfold/cuticle and observing the capillaries with an ophthalmoscope. Normal capillaries are fine loops, and abnormal ones are enlarged with disorganized architecture and microhemorrhages. Normal nailfold capillaroscopy suggests primary RP, which has a low risk for subsequent development of connective tissue disease. Abnormal nailfold capillary structure suggests secondary RP, and the patient should be evaluated for an underlying disorder.\n\n(Choice A) Ankle brachial index is performed to diagnose peripheral artery disease in patients with symptoms of claudication. However, this patient has symptoms during cold temperatures rather than with exertion.\n\n(Choice B) This patient's absence of focal neurologic symptoms (eg, extremity weakness) makes TIA or stroke unlikely, and carotid duplex ultrasound would not be helpful.\n\n(Choice C) This patient has no visual complaints, and dilated funduscopic eye examination would not be helpful.\n\n(Choice D) Monofilament testing detects pressure sensation in an extremity and can predict the risk of developing neuropathy, ulcers, or amputation in diabetic patients. Although this patient has hand numbness, the symptoms occur with exposure to cold temperature and are not in the typical stocking-and- glove distribution seen in diabetic neuropathy.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_009",
    "system": "Rheumatology",
    "stem": "A 55-year-old woman comes to the physician with a rash on her face for the past 4 weeks. The rash seems to get worse when she spends time outdoors, but it does not flare with food intake. She has no flushing or itching. The patient denies fever, weight loss, or muscle weakness. She was recently diagnosed with hypertension and type 2 diabetes mellitus and started on lisinopril, metformin, and sitagliptin. Physical examination reveals a 1-cm ulcer in the roof of the hard palate. A photograph of the rash is shown below.",
    "choice_a": "Erythema multiforme",
    "choice_b": "Erythematotelangiectatic rosacea",
    "choice_c": "Fixed drug eruption",
    "choice_d": "Seborrheic dermatitis",
    "choice_e": "Systemic lupus erythematosus",
    "correct_answer": "E",
    "explanation": "This patient presents with an acute photosensitive rash, oral ulcer, and new-onset hypertension, features suggestive of systemic lupus erythematosus (SLE). Patients with SLE may present with rash months to years before development of other symptoms. The classic butterfly rash appears as erythema and scaling over the cheeks and bridge of nose with sparing of the nasolabial folds. It usually worsens with ultraviolet light exposure and can be mistaken for sunburn. Some patients may also have oral or nasopharyngeal ulcers, alopecia, or cutaneous bullae. Patients should be advised to avoid ultraviolet light exposure and use sun protection. Lupus rash can be treated initially with topical glucocorticoids, but patients with persistent rash should be treated with oral hydroxychloroquine (antimalarials). Systemic glucocorticoids and immunosuppressive agents are not used frequently except in patients with bullous lesions.\n\n(Choice A) Typical lesions of erythema multiforme appear as target lesions with central erosions or bullae. Erythema multiforme occurs most commonly in the setting of an infection (eg, herpes simplex), and the lesions usually resolve within 2 weeks.\n\n(Choice B) Patients with erythematotelangiectatic rosacea usually present with persistent facial erythema, telangiectasias, and episodes of facial flushing. They do not have the classic malar rash with abrupt cutoff (butterfly wing) that is seen in patients with lupus.\n\n(Choice C) Drug eruptions usually begin within days to weeks of starting a new medication. They occur in dependent areas with subsequent generalization and are almost always pruritic.\n\n(Choice D) Seborrheic dermatitis is characterized by scaling and erythema, usually on the scalp, face, and upper trunk (areas rich in sebaceous glands). When present on the face, it affects the lateral sides of the nose and nasolabial folds (unlike lupus), eyebrows, and forehead.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_010",
    "system": "Rheumatology",
    "stem": "A 35-year-old man comes to the office due to right knee pain over the last 2 weeks. The patient recently started running to lose weight and runs approximately 15 miles a week. He has since developed inner right knee pain, making it difficult to climb stairs. The pain is most intense at night when he is trying to fall asleep. Medical history is unremarkable, and he takes no medications. The patient does not use alcohol, tobacco, or illicit drugs. The patient's temperature is 36.5 C (97.7 F), blood pressure is 120/70 mm Hg, and pulse is 75/min. His BMI is 31 kg/m2 There is no knee swelling. Localized tenderness is noted at the medial aspect of the right knee, 1 inch below the joint line. While stabilizing the right thigh, lateral movement of the lower right leg elicits no knee pain or medial joint space movement. His gait is normal. The remainder of the physical examination is within normal limits.",
    "choice_a": "Activity restriction, knee protection, and ice",
    "choice_b": "Erythrocyte sedimentation rate and rheumatoid factor tests",
    "choice_c": "Glucocorticoid injection",
    "choice_d": "MRI of the knee",
    "choice_e": "X-rays of knee",
    "correct_answer": "A",
    "explanation": "This patient with medial knee pain and focal tenderness has pes anserinus pain syndrome (PAPS). This condition is often referred to as anserine bursitis, but most patients do not have true inflammation in the bursa, and multiple regional structures can contribute to the pain. The pes anserinus is formed by the conjoined tendons of gracilis, sartorius, and semitendinosus. The anserine bursa is located anteromedially over the tibial plateau, just below the joint line of the knee and deep to the pes anserinus. PAPS can arise due to medial compartment knee osteoarthritis, trauma, or increased mechanical stress on the knee (eg, running, obesity). Localized pain is typical over the anteromedial tibia and is often exacerbated by pressure from the opposite knee while lying on the side. Examination shows a well-defined area of tenderness over the medial tibial plateau just below the joint line. The diagnosis is primarily based on clinical features. Acute therapy includes avoidance of leg crossing, limiting repetitive knee bending, decreasing pressure on the area by placing a pillow between the knees at night, and applying ice to reduce pain. Nonsteroidal anti- inflammatory drugs are often given for pain relief but may not be beneficial as oral medications do not concentrate well in the isolated anserine bursa.\n\n(Choice B) The erythrocyte sedimentation rate and rheumatoid factor would be elevated in rheumatoid arthritis, which usually presents as polyarthritis rather than monoarthritis.\n\n(Choice C) Glucocorticoid injections into the bursa are reserved for patients who fail conservative measures and have persistent symptoms for 6-8 weeks.\n\n(Choice D) An MRI is often performed to assess the integrity of the medial collateral and associated ligaments when injury is suspected. However, this patient's negative valgus stress test makes this unlikely.\n\n(Choice E) X-rays are not required to diagnose PAPS. They may identify medial compartment osteoarthritis, which can also contribute to medial knee pain; however, osteoarthritis is unlikely in this young patient without previous symptoms.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_011",
    "system": "Rheumatology",
    "stem": "A 78-year-old woman comes to the physician with a red and swollen right foot for the last 2 weeks. She also reports mild pain that is relieved with acetaminophen. There is no associated fever, chills, or morning stiffness. She has not fallen or had trauma to the foot. The patient's other medical problems include coronary artery disease, hypertension, and type 2 diabetes mellitus complicated by peripheral neuropathy and chronic kidney disease. Her medications include aspirin, lisinopril, metoprolol, insulin, and gabapentin. Vital signs are within normal limits. Her body mass index is 32 kg/m2. Examination shows warmth, erythema, and edema to the plantar surface of the right foot. There is a visible collapse of the arch of the right mid-foot. No skin ulcers or sinus tracts are present. X-ray reveals advanced degenerative changes with dislocation of the mid-foot. Fluid aspiration from the right tarsus shows 200/mm3 red blood cells and 200/mm3 white blood cells (60% neutrophils). No crystals are seen and the Gram stain is negative.",
    "choice_a": "Casting with avoidance of weight bearing",
    "choice_b": "Orthotic shoe inserts",
    "choice_c": "Physical therapy",
    "choice_d": "Sulfasalazine and acetaminophen",
    "choice_e": "Surgical intervention",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with acute diabetic neuropathic arthropathy, known as Charcot joint. Charcot joint is progressive bony and soft-tissue destruction leading to joint dislocation, incapacitating deformities, and instability. It is more common in diabetics likely due to neuropathy and vasculopathy but can occur in other conditions (eg, syphilis, chronic alcoholism). The presentation can mimic inflammatory or septic arthritis, with erythema, warmth, and edema to the foot and ankle. These conditions should be ruled out with joint aspiration and synovial fluid analysis, as in this patient. Acute treatment involves casting and avoiding weight bearing until clinical findings resolve and x-ray findings improve. The cast is usually changed after 1-2 weeks to allow for resolving edema. Patients usually improve after 8 weeks of acute treatment and can progress to partial weight bearing and then full weight bearing by the 4th-5th month. Well-fitting shoes and podiatry referral are essential at this stage to prevent chronic deformities, skin ulceration, and infections.\n\n(Choice B) Custom or prefabricated orthotic shoe inserts are often recommended for conditions related to overuse injuries or foot deformities (eg, pes planus). However, they are not first-line intervention for Charcot joint.\n\n(Choice C) Avoidance of weight bearing on the affected joint rather than physical therapy is recommended.\n\n(Choice D) Sulfasalazine and acetaminophen are warranted for certain inflammatory arthropathies (eg, rheumatoid arthritis) but are not as beneficial for Charcot joint.\n\n(Choice E) Surgical intervention is avoided in most patients due to a 27% failure rate.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_012",
    "system": "Rheumatology",
    "stem": "A 72-year-old man presents with 4 weeks of central low back pain. His pain was initially mild and relieved by recumbency. Over the past two weeks, the pain has increased in severity and occurs at night without relief by lying down. The pain does not radiate and he has neither sensory loss nor weakness in his legs. The patient has benign prostatic hyperplasia with significant outlet obstruction. He is scheduled for a transurethral prostatectomy soon. He was treated for a urinary tract infection both 3 years ago and two months ago. He has a history of stable coronary artery disease, hypertension, and degenerative joint disease. He has no history of cancer. His temperature is 37.8 C (100.1 F), blood pressure is 140/72 mm Hg, and pulse is 84/min. Cardiac, pulmonary, and abdominal exams are unremarkable. There is decreased range of motion in all aspects of his back. Point tenderness is present over the third and fourth lumbar processes. There are no sensory or motor deficits in his lower extremities. Deep tendon reflexes are symmetric. Perineal sensation and rectal tone are normal. An enlarged, non-tender rubbery prostate is palpated on digital rectal examination.\n\nThe patient's labs reveal:\nComplete blood count\nHematocrit: 38%\nPlatelets: 350,000/mm3\nLeukocyte count: 9,000/mm3\nSerum chemistry\nSodium: 140 mEq/L\nPotassium: 4.5 mEq/L\nChloride: 100 mEq/L\nBicarbonate: 24 mEq/L\nCreatinine: 1.3 mg/dL\nBlood glucose: 120 mg/dL\nUrine\nSpecific gravity: 1.015\nBlood: negative\nLeukocyte esterase: trace\nNitrite: positive\nWBC: 20-30/hpf\nRBC: 1-2/hpf\nCasts: none\nHematology\nESR (Westergren): 90 mm/h",
    "choice_a": "Ibuprofen and activity as tolerated",
    "choice_b": "MRI of the lower spine",
    "choice_c": "Oxycodone with acetaminophen for 2 weeks",
    "choice_d": "Prostate biopsy",
    "choice_e": "Serum protein electrophoresis",
    "correct_answer": "B",
    "explanation": "This patient's clinical presentation is most concerning for vertebral osteomyelitis, most commonly occurring in males over age 50. The majority of low back pain is due to musculoskeletal causes, but the above red flags suggest a systemic disorder. Bacteria from an infected genitourinary source may spread to bone or travel into the lumbar vertebrae and adjacent structures via Batson's venous plexus (present in males). Patients typically present with pain initially relieved by bed rest that eventually worsens at night, point tenderness to palpation on examination, and elevated ESR (sometimes > 100 mm/h). A vertebral body or interspace infection is likely in this patient with a history of infected and obstructive uropathy, constitutional symptoms, subjective fever, and an erythrocyte sedimentation rate of 90. A spinal MRI is the most sensitive test for detecting vertebral osteomyelitis. Treatment is with intravenous antibiotics and surgery for those who do not improve with antibiotics.\n\n(Choices A and C) Pain control with either NSAIDs or acetaminophen with oxycodone may be effective as initial treatment of simple back pain in a patient without red flags for systemic illnesses or anatomic pathology. If a patient fails treatment after 2 weeks, further investigation can be done at that time with MRI or CT.\n\n(Choice D) Prostate biopsy is indicated if digital rectal examination shows nodules, induration, or asymmetry. However, it would not be diagnostic in this patient with known prostate enlargement, infection, and scheduled prostatectomy.\n\n(Choice E) Serum protein electrophoresis (SPEP) helps in the diagnosis multiple myeloma. However, this patient's clinical presentation is more concerning for an infectious etiology and warrants a MRI.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_013",
    "system": "Rheumatology",
    "stem": "A 65-year-old woman comes to the physician because of worsening right shoulder stiffness for the last 3 months. She denies any trauma or previous shoulder problems. She also reports a history of chronic low back pain and knee pain. She works as a librarian and has been lifting more books recently since her library expanded its book collection. Her other medical problems include diabetes, hypertension, and hypercholesterolemia. Her temperature is 36.5 C (97.7 F), blood pressure is 130/80 mm Hg, pulse is 85/min, and respirations are 14/min Her lungs are clear and her heart sounds are normal. Muscle strength is 5/5 in the lower extremities with intact sensation and 5/5 in the biceps bilaterally. She has markedly decreased passive and active range of motion in right shoulder. Her reflexes are 2+ throughout and she has a normal gait. The remainder of her physical examination is within normal limits.",
    "choice_a": "Complete rest and tramadol",
    "choice_b": "Oral steroids",
    "choice_c": "Range of motion exercises",
    "choice_d": "Steroid joint injection",
    "choice_e": "Strengthening exercises",
    "correct_answer": "C",
    "explanation": "This patient's presentation is most consistent with adhesive capsulitis (frozen shoulder syndrome). This results from chronic inflammation, fibrosis, and contracture of the joint capsule. Adhesive capsulitis (AC) can be idiopathic or due to underlying conditions such as rotator cuff tendinopathy, subacromial bursitis, stroke, diabetes, or humeral head fracture. Patients typically present with gradual onset of more shoulder stiffness than pain with an inability to reach objects or rotate their shoulder. Diagnosis is confirmed on examination with > 50% reduction in both passive and active range of motion. Adhesive capsulitis is a self-limited condition and responds to conservative management in > 90% of patients. However, complete recovery can take up to 6-18 months in some patients. Pain can be controlled with NSAIDs for 1-2 weeks. Stretching exercises to improve range of motion is the treatment of choice. These include pendulum-type swinging of hand held weights, stretching the arm by walking the fingers up a wall, and rubbing the lower back with a towel with both hands.\n\n(Choice A) Limiting the activity that predisposed the patient to adhesive capsulitis (e.g., lifting books in this patient) is usually recommended with range of motion exercises to prevent worsening of AC and improve joint mobility. Complete rest may worsen joint stiffening and promote adhesions. NSAIDs can be given for 1-2 weeks to decrease the pain and to help patients perform exercises more comfortably.\n\n(Choice B) Oral steroids may be effective for acute AC symptoms, but relief usually lasts only 6 weeks and is not as effective as steroid joint injections.\n\n(Choice D) Steroid joint injection is reserved for patients with persistent AC symptoms 6-8 weeks after range of motion exercises, especially in patients with concurrent rotator cuff or bicipital tendinopathy.\n\n(Choice E) Rotator cuff strengthening exercises are more useful in patients with underlying rotator cuff tendinopathy that may lead to AC. However, they are added after range of motion improves. Strengthening attempted before range of motion improvement may possibly lead to a further decline of range of motion.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_014",
    "system": "Rheumatology",
    "stem": "A 55-year-old man with a history of gout comes to the physician because of progressively worsening pain and swelling in his right knee that started overnight. The patient took two over-the-counter ibuprofen tablets earlier in the day, which were ineffective. He was diagnosed with gout six months ago when he had an ankle effusion, and he was started on allopurinol at that time. His other medical problems include recurrent renal stones, hypertension, and chronic rotator cuff tendinitis. His home medications include benazepril and allopurinol 100 mg daily. On examination, the right knee appears swollen and tender. Laboratory studies show a white blood cell count of 12,200 cells/μL, serum creatinine of 1.1 mg/dL uric acid level of 9 mg/dL (11 mg/dL 6 months ago), and normal liver function tests. Knee aspiration reveals monosodium urate crystals.",
    "choice_a": "Continue same-dose allopurinol and start colchicine",
    "choice_b": "Discontinue allopurinol and start colchicine",
    "choice_c": "Discontinue allopurinol and start febuxostat",
    "choice_d": "Increase allopurinol dose and start colchicine",
    "choice_e": "Start intravenous pegloticase",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with an acute gouty attack, which is evident by the positive synovial fluid crystals. NSAIDs are the first-line treatment for acute gout. Since this patient has already taken ibuprofen, colchicine or corticosteroids (oral or intra-articular) can be used as an alternative therapy. Once the acute attack subsides, prevention of future attacks involves dietary and lifestyle changes (e.g., weight loss, decrease alcohol intake, discontinue diuretics). Patients with recurrent attacks after making appropriate lifestyle changes require pharmacotherapy for prophylaxis. Other indications for prophylaxis include nephrolithiasis, tophaceous gout, x-ray findings of gouty arthritis, or urinary uric acid excretion > 1100 mg/day. Allopurinol is preferred by most clinicians for prophylaxis, and prophylactic colchicine is frequently started at the same time to prevent acute gouty attacks. The allopurinol dose is increased until the patient's serum uric acid level is < 6 mg/dL Prophylactic colchicine is usually given for 6 months after the uric acid level normalizes. Patients who develop an acute gouty attack while taking allopurinol should not stop the drug or have their dose adjusted, since this can worsen the acute attack (Choices B & D). The allopurinol dose may be adjusted 3-4 weeks after the acute inflammation subsides.\n\n(Choice C) Febuxostat is also a xanthine oxidase inhibitor that is usually reserved for patients who cannot tolerate allopurinol or have mild to moderate chronic kidney disease. This patient appears to be tolerating allopurinol and has normal kidney function.\n\n(Choice E) Intravenous pegloticase is a novel agent and a treatment option for patients who have chronic gout refractory to other available treatments.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_015",
    "system": "Rheumatology",
    "stem": "A 36-year-old woman comes to the physician with knee pain that started 2 weeks earlier. The pain is localized anteriorly in both knees and is greater in the left. She moved to a new 2-story house 3 weeks ago and has used the stairs many times. Lately she has experienced severe pain when ascending or descending the stairs. The pain also increases after prolonged rest. The patient has no obvious knee trauma or swelling. When she tried to run every day 3 months ago, she developed similar symptoms and had to stop. Her only other medical problem is psoriasis on her elbows, for which she uses corticosteroid and vitamin D combination ointment. Vital signs are normal. BMI is 34 kg/m2. There is no joint line tenderness, redness, warmth, or effusion noted in either knee. Range of motion is normal with mild crepitus. Directly compressing the patella while the leg is extended elicits pain. Valgus and varus stress testing are normal. Lachman, McMurray, and anterior and posterior drawer tests are normal.",
    "choice_a": "Bracing",
    "choice_b": "Corticosteroid injections",
    "choice_c": "Methotrexate",
    "choice_d": "MRI of both knees",
    "choice_e": "Physical therapy",
    "correct_answer": "E",
    "explanation": "This patient's anterior knee pain is most likely due to patellofemoral pain syndrome (PFPS), the most common etiology for nontraumatic knee pain. Risk factors include overuse, malalignment, and trauma, although overuse during training is probably most common. PFPS is usually diagnosed based on history and examination. Most patients complain of \"achy\" or \"sharp\" pain under or around the patella. Some patients report the affected knee as \"giving way\" or \"buckling\"; these symptoms should not be confused with those of anterior cruciate ligament injury. Some may complain of knee \"locking,\" but the presence of true locking and joint effusions indicates intra-articular pathology (eg, meniscal injury). The knee pain typically worsens after prolonged rest and with activities such as squatting, running, or going up and down stairs. Examination shows normal range of motion, mild crepitus, and retropatellar pain with direct compression of the patella during knee extension. Obesity, weakness, and/or quadriceps atrophy may be present. Supervised physical therapy involving activity modification and quadriceps plus hip abductor strengthening for at least 6-12 months is the mainstay of treatment. NSAIDS and bracing are often tried but have not demonstrated long-term benefit in clinical studies (Choice A). However, NSAIDs can be tried for short-term pain relief while physical therapy takes effect.\n\n(Choice B) Clinical studies have not found corticosteroid injections to be an effective long-term solution for PFPS.\n\n(Choice D) MRI is indicated only when a meniscal or ligamentous injury is suspected. This patient has no knee swelling, joint instability or abnormal valgus/varus tests, so no MRI is required.\n\n(Choice C) Methotrexate is used for psoriatic arthritis, but this patient's examination findings (retropatellar pain) are most likely due to PFPS.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_016",
    "system": "Rheumatology",
    "stem": "A 25-year-old woman comes to the physician because of multiple oral ulcers that have occurred intermittently for the last two months. These ulcers are very painful and are associated with fatigue and low grade fever. She is a teacher and several of her kindergarten students have been ill with hand-foot-and- mouth disease. She has a five-year history of a clinical diagnosis of genital herpes with intermittent flares requiring oral acyclovir. Her mother has an unspecified autoimmune disease with joint pains for which she has taken intermittent steroid therapy over the last 10 years. Physical examination reveals three vesicular lesions on her buccal and gingival mucosa and acneiform lesions on her face and back. Scars are noted on the patient's vulvar area. The remainder of the physical examination is normal.",
    "choice_a": "Aphthous stomatitis",
    "choice_b": "Behçet syndrome",
    "choice_c": "Coxsackie virus infection",
    "choice_d": "Herpes simplex type 1",
    "choice_e": "Systemic lupus erythematosus",
    "correct_answer": "B",
    "explanation": "This patient's presentation of recurrent oral ulcers, acne, and genital ulcers is most consistent with Behçet disease. While her genital ulcers have been attributed to Herpes simplex type 2, there is no reported viral documentation. Behçet disease is a vasculitis of either small (most common), medium, or large vessels that involves multiple organs. Diagnosis is based on clinical findings (recurrent oral aphthous ulcers > 3 times/year) plus two of the following: eye lesions, recurrent genital lesions, skin lesions, or positive pathergy (≥2 mm papule forming 24-48 hours after inserting a 20-25 gauge needle 5 mm into skin). Treatment usually involves steroids and directed therapy towards the involved organ system.\n\n(Choice A) Aphthous stomatitis lesions are nearly identical to those of Behçet, but they are usually not associated with the acneiform lesions and genital ulcers seen in this patient.\n\n(Choice C) Coxsackie virus (hand-foot-and-mouth syndrome) occurs more commonly in children and usually presents with fever, sore throat, and oral or palmar/plantar lesions sparing the lips and gingiva. This patient's recurrent lesions and lack of palmar/plantar lesions makes this unlikely.\n\n(Choice D) Vulvar or scrotal scarring occurs very rarely in conditions other than Behçet disease. Also, given the patients family history of autoimmune disease and acne, Behçet disease is more likely than any other diagnosis.\n\n(Choice E) Nearly 50% of lupus patients can have lip and oral mucosal involvement with plaques (discoid lesions), erythematous lesions, punched out erosions, or ulcers. However, the oral ulcers (except for discoid lesions) are usually painless. This patient's painful ulcers make lupus unlikely.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_017",
    "system": "Rheumatology",
    "stem": "A 60-year-old woman comes to the office due to back pain. For the last 3 months, the patient has had dull, achy pain in the lumbar area radiating to the buttocks bilaterally. The pain is worse with lifting heavy boxes and is not relieved with acetaminophen or heating pads. She has had no fever, weight change, dysuria, incontinence, abdominal pain, or muscular weakness. The patient's medical history is notable for hypertension, for which she takes chlorthalidone, and osteoarthritis of the knees and hands. She does not use tobacco, alcohol, or illicit drugs. Blood pressure is 148/98 mm Hg and pulse is 84/min. BMI is 32 kg/m2. Examination shows normal range of motion in the lumbar spine. Lower extremity strength, sensation, and reflexes are normal. Straight leg raise causes worsening of pain in the back but no radiation of pain.\n\nLaboratory results are as follows:\nSerum chemistry\nSodium: 133 mEq/L\nPotassium: 3.5 mEq/L\nBlood urea nitrogen: 18 mg/dL\nCreatinine: 1.1 mg/dL\nGlucose: 105 mg/dL\nComplete blood count\nHemoglobin: 12.2 g/dL\nLeukocytes: 5,500/mm3\nPlatelets: 250,000/mm3\nErythrocyte sedimentation rate: 15 mm/hr\n\nMRI of the lumbar spine shows a mild L4-L5 disc bulge without neural impingement and moderate facet arthropathy at multiple levels.",
    "choice_a": "Activity limitation and naproxen prescription",
    "choice_b": "Carisoprodol prescription",
    "choice_c": "Multidisciplinary rehabilitation program",
    "choice_d": "Transcutaneous electrical nerve stimulation",
    "choice_e": "Trial of glucocorticoid injection",
    "correct_answer": "C",
    "explanation": "This patient has uncomplicated back pain with no systemic symptoms or neurologic deficits. Back pain can be categorized as acute (<4 weeks), subacute (4-12 weeks), or chronic (>12 weeks). Acute back pain usually resolves spontaneously and may be managed conservatively (eg, heating pads, nonsteroidal anti-inflammatory drugs). However, chronic pain is less likely to improve without additional interventions. Also, imaging is not usually necessary in acute pain; it can be considered for patients with chronic pain, but frequently shows nonspecific findings (eg, degenerative changes, disc herniations) that do not correlate with symptoms, as in this patient. Management of chronic back pain should emphasize nonpharmacologic measures. A multidisciplinary rehabilitation program, including physical therapy (with recommendations for a home exercise program), occupational therapy, and cognitive-behavioral therapy, has been shown to improve pain and functional status better than a single-modality approach. For obese patients, an effective weight loss program can reduce or eliminate long-term pain.\n\n(Choice A) Nonsteroidal anti-inflammatory drugs (eg, naproxen) can be effective in chronic back pain, although long-term use can be problematic in those, such as this patient, with chronic kidney disease or hypertension. In addition, patients should not be advised to restrict activity but should maintain normal, moderate activity.\n\n(Choice B) Centrally acting muscle relaxants (eg, cyclobenzaprine, tizanidine) are effective for pain relief in patients with acute back pain. However, muscle relaxants are not advised for those with chronic pain, and the risks of carisoprodol (eg, abuse/withdrawal, driving impairment) outweigh the benefits for nearly all patients.\n\n(Choice D) A number of physical modalities for chronic back pain, such as transcutaneous electrical nerve stimulation, back braces, traction devices, and shortwave diathermy, have been promoted in the lay media. Evidence of benefit for these treatments is generally of low quality and shows inconsistent benefits. They are not currently recommended.\n\n(Choice E) Epidural glucocorticoids can be considered for patients with persistent pain due to lumbosacral radiculopathy if noninvasive management is ineffective. Glucocorticoid injections (eg, epidural, facet joints) are not effective for uncomplicated nonradicular chronic back pain (as in this patient).",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_018",
    "system": "Rheumatology",
    "stem": "A 65-year-old woman with known chronic obstructive pulmonary disease seeks evaluation due to pain in both of her knees and warmth in her fingertips. She has a 50-pack-year smoking history and quit 5 years ago. She has never been hospitalized for respiratory symptoms. The patient uses a tiotropium inhaler daily and albuterol as needed for shortness of breath. She also takes lisinopril for hypertension and bisacodyl for chronic constipation. Her blood pressure is 144/85 mm Hg and pulse is 90/min. She has decreased breath sounds bilaterally and a mildly prolonged expiratory phase of respiration. There is a grade 1/6 systolic murmur along the left upper sternal border. The finger joints and both knees have some mild warmth and slight tenderness to palpation, with normal range of motion. Mild finger clubbing is present.",
    "choice_a": "Chest imaging study",
    "choice_b": "Ibuprofen and reassurance",
    "choice_c": "Liver function tests",
    "choice_d": "Low-dose prednisone",
    "choice_e": "Transthoracic echocardiogram",
    "correct_answer": "A",
    "explanation": "This patient's smoking history, clubbing, and symptoms of periosteal inflammation suggest hypertrophic osteoarthropathy (HOA), which is characterized by abnormal proliferation of the skin and osseous tissue. HOA is most commonly due to an intrathoracic process, frequently non-small cell lung cancer. Other intrathoracic causes of clubbing with hypertrophic osteoarthropathy include cystic fibrosis, chronic lung infections, and cyanotic heart disease with right-to-left intracardiac shunts. Patients presenting with HOA warrant thoracic imaging with chest x-ray or CT to rule out malignancy. Imaging of the painful joints would reveal periosteal new bone formation.\n\n(Choice B) Nonsteroidal anti-inflammatory drugs can relieve the pain. However, symptomatic therapy alone misses the opportunity to detect an underlying lung cancer. Resection of the mass may lead to resolution of joint symptoms in some patients.\n\n(Choice C) Chronic liver disorders, including cirrhosis, can lead to clubbing, but this is uncommon.\n\n(Choice D) Because most individuals with chronic obstructive pulmonary disease (COPD) are or have been smokers, there is a higher frequency of intrathoracic neoplasms in this population. However, COPD per se does not result in clubbing, and treating COPD with glucocorticoids or bronchodilators does not relieve HOA.\n\n(Choice E) Cyanotic heart disease with a right-to-left shunt can result in clubbing. This patient has a murmur that is likely due to age-related aortic sclerosis or mild aortic stenosis, but there are no additional cardiac findings that suggest a shunt.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_019",
    "system": "Rheumatology",
    "stem": "A 32-year-old woman comes to the physician because of hand pain and swelling that lasts several hours every morning. She has not felt well since \"getting the flu\" two weeks ago from her two children (ages 4 and 6). She initially had a sore throat and fever without rash, cough, dysuria, or diarrhea. She works as a flight attendant and travels extensively, but has been on medical leave for the past two weeks due to her illness. She is in a monogamous relationship and uses a barrier method for contraception. She does not smoke, but she drinks alcohol occasionally. Her vital signs are within normal limits. There are no skin rashes. Oropharyngeal examination shows mild tonsillar swelling and normal appearing pharyngeal mucosa. Several 0.5 cm non-tender lymph nodes are palpable in the anterior cervical region. Auscultation of the heart and lungs is normal. There is no hepatosplenomegaly. The small joints of her hands and wrists are swollen and tender. She is unable to flex or extend her wrists or make a fist due to the pain and swelling. She has normal range of motion without swelling in both knees, ankles, shoulders, and feet.\n\nLaboratory results are as follows:\nComplete blood count\nHemoglobin: 11.1 g/dL\nMean corpuscular volume: 80 fL\nPlatelets: 320,000 cells/μL\nLeukocyte count: 8,900 cells/μL\nSerum chemistry\nCreatinine: 0.8 mg/dL\nImmunologic and rheumatologic studies\nAnti-nuclear antibody (ANA): 1:80 (nucleolar pattern)\nErythrocyte sedimentation rate: 35 mm/h\nRheumatoid factor: 51 U/mL",
    "choice_a": "Acute rheumatic fever",
    "choice_b": "Infectious mononucleosis",
    "choice_c": "Parvovirus infection",
    "choice_d": "Rheumatoid arthritis",
    "choice_e": "Systemic lupus erythematosus",
    "correct_answer": "C",
    "explanation": "This patient's presentation is consistent with likely parvovirus infection. The classic \"slapped cheek\" rash is less common in adults than children. Adults usually present with flu-like symptoms 5-10 days after exposure followed by acute symmetrical arthralgias/arthritis (e.g., hands/wrists) that can resemble rheumatoid arthritis. Patients with preexisting hematologic disease (e.g., sickle cell) can develop a transient aplastic crisis, while immunocompromised patients can develop acute or chronic anemia due to bone marrow suppression of erythroid precursors. Patients may have a positive rheumatoid factor (RF), but rheumatoid arthritis should not be diagnosed by RF alone if symptoms are < 6 weeks in duration (Choice D). Acute infection is confirmed with parvovirus B19 IgM antibodies, which increase within the first month of illness and often become undetectable after 2- 3 months. Parvovirus IgG antibodies reflect past exposure and are not diagnostic, since up to 50% of healthy people may have parvovirus IgG antibodies. Arthritis caused by parvovirus infection is self-limiting and usually resolves in 1-2 months. Treatment is mainly supportive with monitoring, since there is no currently effective vaccine or pharmacotherapy.\n\n(Choice A) Acute rheumatic fever usually presents with fever and migratory arthritis involving the large joints (e.g., knees), but it may involve the ankles and elbows as well. However, this patient does not have migratory arthritis or other major criteria (e.g., chorea, erythema marginatum, pancarditis, subcutaneous nodules) to suggest rheumatic fever.\n\n(Choice B) Infectious mononucleosis typically presents with fever, pharyngitis, lymphadenopathy, and atypical lymphocytosis. Patients can also have splenomegaly and a generalized rash, but usually do not present with the symmetric arthritis seen in this patient.\n\n(Choice E) Nearly 5-10% of healthy patients can have a positive ANA, usually at a low titer (e.g., 1:40). Parvovirus can cause a false-positive ANA, and this patient does not have other clinical symptoms (e.g., malar rash, photosensitivity) to suggest SLE.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_020",
    "system": "Rheumatology",
    "stem": "A 34-year-old man comes to the office with 2 weeks of left forefoot pain. He is a runner and has participated in many marathons without any problem. For the past 2 months, he has been training for a cross-country race with hill runs. His pain has worsened to the point that he has had to stop in the middle of many training sessions. The pain improves with rest. Holding the left second toe and pushing it in toward the foot produces pain. X-rays of the left foot are normal.",
    "choice_a": "Morton neuroma",
    "choice_b": "Plantar fasciitis",
    "choice_c": "Sesamoiditis",
    "choice_d": "Stress fracture",
    "choice_e": "Tarsal tunnel syndrome",
    "correct_answer": "D",
    "explanation": "This patient's presentation suggests a metatarsal shaft stress fracture, which is usually due to repetitive weight-bearing activities (eg, running, dancing, jumping) injuring the forefoot. Risk factors include anatomic defects (eg, pes planus), obesity, female athlete triad (oligo-/amenorrhea, decreased caloric intake, and osteopenia/porosis), and poorly fitting shoes. Bone can remodel in response to mechanical stress, but abruptly increasing physical activity (intensity, duration, or frequency) without adequate rest causes repeated tension or compressive stress, leading to microfractures and eventually to a discontinuity of the cortical bone. Metatarsal stress fractures occur most commonly in the 2nd, 3rd, and 4th metatarsal shafts. Patients usually develop gradually worsening forefoot pain and with continued activity can progress to swelling or frank fracture. Examination may show focal tenderness, or holding the corresponding toe at the same level as the metatarsal and pushing it in along the long axis of the metatarsal (axial loading) may elicit the pain. The diagnosis is made clinically but may require imaging in uncertain cases. Plain x-rays can be normal up to 6 weeks after symptom onset, and more sensitive modalities (eg, MRI, bone scan) may be required for definitive diagnosis.\n\n(Choice A) Morton neuroma is associated with numbness or pain between the third and fourth toes and with a clicking sensation (Mulder sign) that occurs when this space is palpated and the metatarsal joints are squeezed simultaneously.\n\n(Choice B) Plantar fasciitis causes burning pain in the plantar (not dorsal) area of the rearfoot that worsens with the first steps in the morning. The pain decreases as activity increases during the day but can worsen at the end of the day with prolonged weight bearing. Point tenderness is the hallmark.\n\n(Choice C) Sesamoiditis usually presents with focal pain of the sesamoid bones on the plantar surface of the first metatarsophalangeal joint. The pain typically increases with walking, running, and dorsiflexion of the great toe.\n\n(Choice E) Tarsal tunnel syndrome is due to compression of the tibial nerve as it passes through the ankle. It usually develops after acute bony injuries. Patients develop burning, numbness, and aching of the distal plantar (not dorsal) surface of the foot/toes that may radiate up to the heel and calf.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_021",
    "system": "Rheumatology",
    "stem": "A 65-year-old woman comes to the physician with a rash on her hands for the past 2 weeks. Two months ago she developed a rash on her face and forearms while vacationing at a beach resort. Her review of systems is positive for recent onset weakness of the shoulders and hips. She has no dysphagia, shortness of breath, fever, chills, or weight loss. She is a lifetime nonsmoker. Her temperature is 37.2 C (99 F), blood pressure is 134/82 mm Hg, pulse is 75/min, and respirations are 14/min. Her BMI is 21 kg/m2. Cardiopulmonary examination is within normal limits. There is no hepatosplenomegaly. Range of motion of the spine is normal and without pain, scoliosis, or excessive kyphosis of the back. Upper and lower limb deep-tendon reflexes are 2+. She has difficulty rising from a chair. Muscle strength is 4/5 in both upper and lower extremities.\n\nLaboratory results are as follows:\nHemoglobin: 12.5 g/dL\nPlatelets: 180,000/μL\nLeukocytes: 4,100/μL\nCreatinine: 0.8 mg/dL\nCalcium: 9.4 mg/dL\nTotal protein: 6.5 g/dL\nAlbumin: 3.7 g/dL\nAlkaline phosphatase: 100 U/L\nAspartate aminotransferase (SGOT): 96 U/L\nAlanine aminotransferase (SGPT): 120 U/L\nThyroid-stimulating hormone: 3.4 μU/mL\nSerum creatine kinase: 1040 U/L\nAnti-nuclear antibody (ANA): 1:160, nucleolar pattern\nErythrocyte sedimentation rate: 68 mm/h\nThe rash is shown in the photograph.",
    "choice_a": "Anti dsDNA antibodies testing",
    "choice_b": "Cancer screening",
    "choice_c": "Dilated funduscopic examination",
    "choice_d": "Liver biopsy",
    "choice_e": "Trial of low-dose prednisone",
    "correct_answer": "B",
    "explanation": "This patient's muscle weakness and elevated creatine kinase suggest a myopathic process. The characteristic rash in the hands (Gottron's papules located over the metacarpophalangeal joints) and history of photosensitive rash (shawl sign) suggest dermatomyositis as the most likely diagnosis. Up to 50% of patients may also present with violaceous periorbital rash in the upper eyelid (heliotrope rash). Patients with inflammatory myopathy (dermatomyositis and polymyositis) are at fivefold increased risk of malignancy compared to the general population. Thus, screening should include age-appropriate cancer screening tests (eg, mammogram and colonoscopy) in all patients, and additional tests in high-risk patients (eg, CT of the chest/abdomen/pelvis, UA, serum CA125/CA19-9/PSA, UGI endoscopy).\n\n(Choice A) This patient's rash on the hands and muscle weakness with elevated CK are not characteristic of systemic lupus erythematosus (SLE). SLE can cause myalgias and is somewhat less likely (<15%) to present in a patient of this age.\n\n(Choice C) Optic neuritis is rarely associated with systemic inflammatory disorders (eg, SLE and Wegener's granulomatosis). Patients typically present with painful unilateral vision loss over several hours to days. Funduscopic examination may be normal or show visible optic nerve inflammation.\n\n(Choice D) Liver biopsy may be indicated in patients with elevated transaminase levels, but this patient likely has a muscular source of the elevated enzymes due to inflammatory muscle disease.\n\n(Choice E) High-dose steroids are usually indicated for treating dermatomyositis. Initial low-dose steroids are frequently used for polymyalgia rheumatica.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_022",
    "system": "Rheumatology",
    "stem": "A 43-year-old attorney comes to the office because of pain in his right lower extremity. He is an avid tennis player, and lately, he has started to notice pain in his right groin area whenever he runs or jogs. The pain is described as a soreness that travels down his anterior thigh toward his knee. It is present with moderate activity and improves with rest. Lying on his right side does not affect the pain. There is no associated numbness or muscle weakness. His temperature is 37.2 C (98.9 F), blood pressure is 120/70 mm Hg, pulse is 72/min, and respirations are 12/min. His cardiac, pulmonary, and abdominal examinations are within normal limits. His hip examination reveals pain along the anterior hip worsened with internal and external rotation.",
    "choice_a": "Hamstring injury",
    "choice_b": "Meralgia paresthetica",
    "choice_c": "Occult hip fracture",
    "choice_d": "Osteoarthritis of the hip",
    "choice_e": "Trochanteric bursitis",
    "correct_answer": "D",
    "explanation": "Hip pain is most commonly caused by trochanteric and gluteus medius bursitis, femoral fractures, and osteoarthritis (most likely in this patient). Patients with osteoarthritis typically complain of morning stiffness and groin pain. The pain may radiate towards the knee, but does not extend beyond it. Rest tends to ameliorate the pain, but lying on either side would not affect the pain. Pain is often aggravated by movement (internal/external rotation) rather than by direct pressure, as in trochanteric bursitis. Plain x-rays (weight bearing AP pelvis) can confirm osteoarthritis by showing a decreased joint space, sclerosis of the joint space margins, and periarticular osteophytes. Treatment usually involves rest and NSAIDS.\n\n(Choice A) A hamstring injury would present with pain felt over the buttock area and may extend to the trochanteric bursa area, but would not be felt anteriorly in the thigh.\n\n(Choice B) Patients with meralgia paresthetica complain of burning pain, paresthesia, and diminished sensation over the upper outer thigh. The most common predisposing factor is obesity with an overlying panniculus and is caused by compression of the lateral femoral cutaneous nerve.\n\n(Choice C) Occult hip fracture typically presents with acute onset of severe pain after an injury. Patients have pain with any slight hip movement and difficulty bearing weight, neither of which was present in this patient.\n\n(Choice E) Trochanteric bursitis usually presents with pain/point tenderness over the greater trochanter that is worse when lying on the affected side. The most common cause of trochanteric bursitis is disturbance of gait from any cause (e.g., lumbosacral spine disease (75%), leg length discrepancy (10%), etc.). Examination of the hip is usually normal.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_023",
    "system": "Rheumatology",
    "stem": "A 73-year-old woman comes to the office because of achiness. She began to notice pain around her shoulders and hips six weeks ago. The symptoms developed abruptly without an antecedent illness. She notes considerable stiffness around her neck and shoulders in the morning when she gets out of bed and has difficulty dressing herself. She has some soreness in both hips, but these symptoms slowly clear by midday. She denies any cranial complaints. She has never had similar muscle or joint achiness before. She has no fever, chills, weight loss, or headache. She tried over-the-counter ibuprofen, which did not relieve her pain. Her past medical history is notable for hypertension, hyperlipidemia, coronary artery disease, transient ischemic attack. Her medications include aspirin, hydrochlorothiazide, hydralazine, isosorbide, a statin, and a beta blocker. She has had no medication changes in the last year. She is allergic to angiotensin converting enzyme inhibitors. Physical examination is within normal limits except for some mild restriction of bilateral shoulder abduction. She does not have any swollen joints.\n\nHer laboratory results are as follows:\nCreatine kinase, serum: 132 U/L\nThyroid stimulating hormone: 6.4 μU/mL\nFree T4: 1.6 ng/dL\nErythrocyte sedimentation rate: 20 mm/h\nC-reactive protein: 24.0 mg/L (Normal ≤ 8 mg/L)\nHer complete blood count, serum electrolytes, and liver and kidney function studies are normal.",
    "choice_a": "Discontinue hydralazine",
    "choice_b": "Discontinue statin medication",
    "choice_c": "Prescribe amitriptyline at bedtime",
    "choice_d": "Start low-dose levothyroxine",
    "choice_e": "Start low-dose prednisone",
    "correct_answer": "E",
    "explanation": "This patient has a subacute onset of aching and morning stiffness in the shoulders, hip girdles, and neck. This is consistent with polymyalgia rheumatica (PMR), a condition of unknown etiology that occurs in about 1% of the population over the age of 50. The great majority of patients with PMR have an elevated ESR (>40 mm/h), but this can be normal in up to 20% of patients. C-reactive protein is elevated (>22 mg/L) in nearly all PMR patients and would be the next step to suggest the diagnosis in patients with a normal ESR. Patients in whom there is still uncertainty can then be treated empirically with low-dose prednisone ( (10-15 mg/day with slow taper over 1-2 years). The diagnosis of PMR is confirmed with a dramatic response and symptom resolution (usually within 3 days) after starting low-dose prednisone.\n\n(Choice A) Drug-induced lupus associated with hydralazine typically presents with myalgias, arthralgias, fever, malaise, rash, and possibly serositis. This patient has no other active systemic symptoms.\n\n(Choice B) Statin myopathy typically starts within weeks to months of drug initiation and presents as proximal and symmetrical muscle weakness with soreness, myalgias, and sometimes elevated creatine kinase (CK). Shoulder and hip stiffness (morning stiffness) is uncommon with statin use.\n\n(Choice C) Amitriptyline is not effective for the management of PMR; but it is used for fibromyalgia, which can also cause widespread achiness. However, fibromyalgia occurs less frequently in older individuals and is not localized to the shoulder or hip girdle areas, as in this patient.\n\n(Choice D) Hypothyroidism may cause symptoms similar to PMR, but is less likely in this patient with subclinical hypothyroidism.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_024",
    "system": "Rheumatology",
    "stem": "A 63-year-old woman comes to the office due to several months of bilateral leg pain, predominantly in her calves and thighs when she walks. After a block or two, she experiences numbness in both calves and thighs that progresses to pain and weakness with continued walking. The patient's symptoms worsen when she walks downhill, and the pain and numbness quickly subside with rest. Her symptoms often occur at the grocery store, but are relieved when she leans over a cart. She also has lower back pain. The patient has no bladder and/or bowel symptoms, chest pain, chest pressure, dyspnea, or edema. The patient's medical problems include hypertension, gastroesophageal reflux disease, hyperlipidemia, and degenerative joint disease. She also has a history of coronary artery disease with stent placement in her right coronary artery 2 years ago. Her medications include atorvastatin, metoprolol, aspirin, clopidogrel, lisinopril, and omeprazole. The patient's blood pressure is 130/80 mm Hg and pulse is 72/min. A bruit is heard over the right carotid artery. There are no abdominal or femoral bruits. Her femoral, popliteal, and dorsalis pedal pulses are normal and symmetric. There are no trophic changes of the skin or nails in the feet. Straight leg raising test is negative. The patient can walk on her heels and toes. There are no lower extremity sensory deficits. Lower extremity deep-tendon reflexes are 2+ and symmetric. Perineal sensation is normal.",
    "choice_a": "Abdominal aortic ultrasound",
    "choice_b": "Ankle-brachial index",
    "choice_c": "Bone scan",
    "choice_d": "MRI of the lumbar spine",
    "choice_e": "Nerve conduction studies",
    "correct_answer": "D",
    "explanation": "This patient's clinical presentation is most consistent with lumbar spinal stenosis, which occurs most commonly in adults age >60 due to degenerative spondylosis. Patients typically present with a syndrome of bilateral pain (pseudoclaudication) that is worsened when walking with the spine extended (eg, downhill more than uphill) or with prolonged periods of standing upright. Both activities decrease the diameter of the spinal canal and cause mechanical and/or ischemic disruption of nerve root function. Symptoms are usually relieved with rest or bending forward while walking (eg, leaning over a cart) as these maneuvers increase the diameter of the spinal canal. Pseudoclaudication may resemble vascular claudication, but the lower extremity pulses are usually normal. Lower extremity neurologic examination may also be normal, although objective weakness may be seen in advanced disease. Lumbar MRI is the preferred test as it best visualizes the soft tissues and neural structures (eg, conus medullaris, spinal nerve roots).\n\n(Choice A) Although abdominal aortic aneurysm (AAA) and occlusive peripheral vascular disease can co- exist, most AAAs remain asymptomatic until they rupture. It would be unlikely for this patient's symptoms to be caused by an AAA.\n\n(Choice B) Reduced ankle-brachial index (ABI) indicates vascular claudication due to extensive atherosclerotic vascular disease. Lower extremity pulses are usually diminished. However, ABI is usually normal in lumbar stenosis.\n\n(Choice C) Bone scan is useful to diagnose metastatic lesions but would be unlikely to be diagnostic in this patient who has no point tenderness of her back, no history of cancer, and no evidence of cauda equina syndrome.\n\n(Choice E) Nerve conduction studies are diagnostic for peripheral neuropathy, but this patient's symptoms do not suggest this condition.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_025",
    "system": "Rheumatology",
    "stem": "A 60-year-old woman comes to the office due to frequent urination. She gets up 3 times a night to urinate and drink water. She has also noticed some mild hoarseness, fatigue, and difficulty concentrating. Her eyes have been dry and \"burning,\" for which she uses over-the-counter eye drops. The patient has no history of chronic medical conditions but has smoked a pack of cigarettes daily for 40 years. Blood pressure is 144/78 mm Hg and pulse is 82/min and regular. Physical examination is unremarkable.\n\nLaboratory results are as follows:\nComplete blood count\nHematocrit: 34%\nLeukocytes: 7,500/mm3\nSerum chemistry\nSodium: 138 mEq/L\nPotassium: 3.4 mEq/L\nChloride: 110 mEq/L\nBicarbonate: 18 mEq/L\nCreatinine: 1.7 mg/dL\nCalcium: 9.4 mg/dL\nLiver function studies\nTotal protein: 8.9 g/dL\nAlbumin: 3.9 g/dL\nAlkaline phosphatase: 135 U/L\nAspartate aminotransferase (SGOT): 25 U/L\nAlanine aminotransferase (SGPT): 30 U/L\nUrinalysis\nSpecific gravity: 1.001\nProtein: trace\nBlood: negative\nGlucose: negative\nNitrites: negative\nWhite blood cells: 1-2/hpf\nRed blood cells: 1-2/hpf\nCasts: none",
    "choice_a": "Chest CT scan with contrast",
    "choice_b": "Lower lip salivary gland biopsy",
    "choice_c": "Renal biopsy",
    "choice_d": "Urine and serum protein electrophoresis",
    "choice_e": "Viral hepatitis serologies",
    "correct_answer": "B",
    "explanation": "This patient with dry eyes, hoarseness, and fatigue has an elevated gamma globulin gap (total protein minus albumin >4), raising suspicion for a chronic inflammatory disorder such as Sjögren syndrome (SS). SS is marked by lymphocytic infiltration of the lacrimal and salivary glands, which leads to the characteristic symptoms of dry eyes and dry mouth. Approximately 25% of cases are also accompanied by extraglandular disease of the skin, lungs, nervous system, heart, and/or kidneys. The most common renal manifestation of SS is chronic interstitial nephritis. Patients with this condition usually have mild renal insufficiency, a fairly benign urinalysis, and renal tubular abnormalities such as distal renal tubular acidosis and nephrogenic diabetes insipidus. Diagnosis usually requires anti-SSA and anti-SSB antibody testing and/or lower lip salivary gland biopsy.\n\n(Choice A) Chest CT scan with contrast could help diagnose sarcoidosis, which can cause an elevated gamma gap and dry eyes. However, most patients with sarcoidosis also have pulmonary, skin, and/or joint manifestations.\n\n(Choice C) Renal biopsy would likely show interstitial nephritis, but this finding would not be diagnostic of SS specifically. Diagnosis must be established with anti-SSA/SSB testing and/or lip biopsy.\n\n(Choice D) Multiple myeloma can cause an elevated gamma gap and renal insufficiency, but bone pain and hypercalcemia are more common. Dry eyes and hoarseness would be uncommon.\n\n(Choice E) Chronic hepatitis C virus (HCV) can cause an SS-like syndrome, but usually causes glomerular injury with nephrotic/nephritic patterns on urinalysis.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_026",
    "system": "Rheumatology",
    "stem": "A 52-year-old man with a history of rheumatoid arthritis comes to the clinic due to increasing pain and swelling involving several joints over the past 6 weeks. The patient also has fatigue and morning stiffness that can last for hours. He was diagnosed with rheumatoid arthritis 2 years ago after he presented with symmetrical polyarthritis, a high-titer rheumatoid factor, and positive cyclic citrullinated peptide antibodies. Treatment with methotrexate and nonsteroidal anti-inflammatory agents resulted in reduction of joint pain and swelling. At his last visit 3 months ago, the patient had only mild joint pains without any morning stiffness. His other medical problems include hypertension, diverticulosis, and hyperlipidemia. His temperature is 37.4 C (99.4 F), blood pressure is 135/82 mm Hg, and pulse is 77/min. Gentle squeezing of his hands and feet evokes pain. Several small joints of the fingers and toes are swollen and tender. There is mild boggy swelling of the left knee. Subcutaneous nodules are seen over the elbows. The remainder of the physical examination is unremarkable.\n\nLaboratory results are as follows:\nHemoglobin: 10.4 g/dL\nPlatelets: 450,000/mm3\nLeukocytes: 9,200/mm3\nCreatinine, serum: 0.9 mg/dL\nErythrocyte sedimentation rate: 67 mm/h",
    "choice_a": "Arrange for skin tuberculin testing",
    "choice_b": "Check antineutrophil cytoplasmic antibody levels",
    "choice_c": "Check Lyme disease titers",
    "choice_d": "Stop methotrexate and observe",
    "choice_e": "Stop methotrexate and start sulfasalazine",
    "correct_answer": "A",
    "explanation": "This patient with rheumatoid arthritis (RA) had an initial response to methotrexate but now has treatment-resistant disease. Adding a biologic disease-modifying antirheumatic drug (DMARD), such as a tumor necrosis factor-α (TNF) antagonist, is the most appropriate next step (step-up therapy). However, TNF blockers increase the risk of reactivation of latent tuberculosis (TB). As a result, all patients should undergo TB screening (either skin tuberculin test or interferon-gamma release assay) before starting TNF blockers, and those with positive tests should then be treated for latent TB prior to starting TNF antagonist therapy. Patients should also be screened for hepatitis B and C prior to initiation.\n\n(Choice B) RA is commonly associated with p-ANCA, but it is unclear how specific this finding is without systemic vasculitis.\n\n(Choice C) Lyme disease typically involves large joints (eg, knees). This patient has hand arthritis and no preceding rash, making Lyme disease less likely.\n\n(Choice D) Methotrexate is the most commonly used DMARD and is rarely discontinued unless there is toxicity; this patient requires additional treatment for worsening disease.\n\n(Choice E) Adding another nonbiologic DMARD is acceptable but less preferable than adding a biologic DMARD in this setting.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_027",
    "system": "Rheumatology",
    "stem": "A 55-year-old woman comes to the physician with worsening left knee pain. She has had intermittent pain and stiffness in her left knee for the past 5 years. The pain is aggravated by prolonged standing, but her knee also feels stiff if she sits in 1 place for too long. She was diagnosed with ulcerative colitis 3 years ago. The patient initially was treated with systemic steroids, and the disease is currently in remission on oral sulfasalazine. Her other medical problems include hypertension, impaired glucose tolerance, and hypothyroidism. The patient's vital signs are normal. Her BMI is 31 kg/m2 On physical examination, flexion and extension of the left knee joint elicit pain, but there is no instability. There is a small joint effusion. Knee joint aspiration yields 3 mL of synovial fluid. Synovial fluid analysis shows a total cell count of 2000/μL with 25% polymorphonuclear cells. An x-ray of the left knee is shown below.",
    "choice_a": "Arthritis associated with inflammatory bowel disease",
    "choice_b": "Avascular necrosis of femur",
    "choice_c": "Calcium pyrophosphate crystal deposition disease",
    "choice_d": "Osteoarthritis",
    "choice_e": "Patellofemoral pain syndrome",
    "correct_answer": "D",
    "explanation": "This patient has long-standing, worsening knee pain and stiffness. Her symptoms and knee x-ray findings (osteophytes, loss of joint space) are suggestive of osteoarthritis. Patients with osteoarthritis usually have morning stiffness for < 30 minutes, pain that worsens with activity, bony enlargement, and no palpable warmth. Joint fluid analysis shows a non-inflammatory process with a total cell count typically < 2,000/μL. Treatment involves acetaminophen, NSAIDs, or injections.\n\n(Choice A) IBD-associated arthropathy typically presents with acute onset joint pain and inflammatory synovial fluid (total cell count > 2,000/μL, often 5,000-10,000/μL).\n\n(Choice B) Osteonecrosis can occur with steroid use, but is most common in the femoral head. X-rays reveal increased lucency with bony sclerosis.\n\n(Choice C) CPPD (pseudogout) shows positively birefringent crystals and inflammatory fluid with > 50% neutrophils. X-rays reveal chondrocalcinosis.\n\n(Choice E) Patellofemoral pain syndrome affects younger patients and presents with retropatellar pain on compression; there is no joint effusion or narrowing.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_028",
    "system": "Rheumatology",
    "stem": "A 55-year-old man comes to the physician with a 3-month history of right groin pain. It initially occurred only during weight-bearing maneuvers but now has become constant. He has no fever, dysuria, or paresthesia. The patient underwent renal transplantation 10 years ago due to polycystic kidney disease. His other medical problems include hypertension and spinal stenosis status post lumbar laminectomy. His medications include prednisone, mycophenolate, and sirolimus. He does not use tobacco or alcohol. His temperature is 37 C (98 F), blood pressure is 114/67 mm Hg, pulse is 72/min, and respirations are 14/min. The abdomen is soft and nontender. Range of motion and curvature of the spine are normal with no pain to palpation noted. Internal rotation of the right hip joint is restricted due to pain. There is no warmth, swelling, or erythema to the joint. Neurologic examination is within normal limits. Pinprick and light touch sensations are intact.\n\nLaboratory results are as follows:\nLeukocytes: 5,500/μL\nCreatinine: 0.8 mg/dL\nC-reactive protein: 6 mg/L\nErythrocyte sedimentation rate: 22 mm/h\nX-ray of the right hip shows mild joint space narrowing between the femur and acetabulum.",
    "choice_a": "Heat and passive stretching exercises",
    "choice_b": "Indium-111 WBC scan",
    "choice_c": "MRI scan of the hip joint",
    "choice_d": "Ultrasound-guided steroid injection of the hip joint",
    "choice_e": "X-ray of lumbosacral spine",
    "correct_answer": "C",
    "explanation": "This patient's groin pain on weight bearing, limited internal rotation, steroid use, normal vital signs/inflammatory markers, and history of renal transplantation suggest avascular necrosis (AVN) of the femur. AVN is caused by compromised bone blood supply. The pathognomonic sign on late-stage x-ray is the crescent sign, but in early stages, x-rays may be normal or show only mild nonspecific narrowing. If clinical suspicion is high, MRI is the most sensitive means of diagnosing early AVN.\n\n(Choice A) Passive stretching is for trochanteric bursitis, which presents with lateral hip tenderness rather than groin pain during internal rotation.\n\n(Choice B) Indium-111 WBC scans localise infection; osteomyelitis typically presents with local inflammation and elevated markers.\n\n(Choice D) While this patient has mild joint space narrowing, his high risk for AVN (steroids, transplant) makes MRI necessary to rule out AVN before assuming osteoarthritis and injecting steroids.\n\n(Choice E) The patient has no back pain or radicular symptoms to warrant spinal imaging.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_029",
    "system": "Rheumatology",
    "stem": "An 80-year-old man comes to the office due to generalized weakness and intermittently feeling \"dizzy\" and unsteady over the past year. He fell 9 months ago when he tripped over a step. The patient has had no syncope or chest pain and has not attempted to use any mobility aids. History is notable for hypertension, type 2 diabetes mellitus, hypercholesterolemia, osteoarthritis, coronary artery disease, and gastroesophageal reflux disease. Current medications include metformin, glipizide, hydrochlorothiazide, aspirin, atenolol, simvastatin, and omeprazole. The patient does not use tobacco or alcohol. Blood pressure is 150/90 mm Hg and pulse is 68/min. There are no orthostatic changes. BMI is 30 kg/m2 Examination shows normal jugular venous pressure, clear lung fields, and normal S1 and S2. The abdomen is soft and nontender. There is no tenderness to palpation of the lower back. There are symmetric joint deformities of both knees and generalized arthritic changes in both hands. Cranial nerve examination is normal. Muscle power is 4/5 in both upper and lower extremities. Pinprick and light touch sensations are mildly decreased in both feet. Achilles reflexes are absent bilaterally. Complete blood count, basic metabolic panel, and vitamin D levels are normal. Hemoglobin A1c is 8.2%. ECG shows normal sinus rhythm and old Q waves in lateral leads.",
    "choice_a": "Cardiac pacemaker",
    "choice_b": "Education on fall prevention",
    "choice_c": "Intensive blood glucose control",
    "choice_d": "Intensive blood pressure control",
    "choice_e": "Physical therapy",
    "correct_answer": "E",
    "explanation": "This elderly patient with nonspecific weakness and dizziness on ambulation is likely experiencing disequilibrium. Disequilibrium is common in older individuals with multiple chronic disorders and increased fall risk. The etiology is likely multifactorial (neuropathy, muscle weakness, arthritis, medications). Management requires a multidisciplinary program including regular exercise and physical therapy. Strengthening exercise education is best provided in a supervised physical therapy program.\n\n(Choice A) Pacemakers are for symptomatic bradycardia (syncope/presyncope); this patient has no bradycardia or block on ECG.\n\n(Choice B) Education is part of assessment, but supervised exercise/therapy is more effective for improving balance and strength.\n\n(Choice C) Tight glucose control in the elderly increases hypoglycemia risk and fall risk. A target A1c of <8.5% is often appropriate for complex patients.\n\n(Choice D) Intensive blood pressure control is associated with an increased risk of falls in patients over 80.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_030",
    "system": "Rheumatology",
    "stem": "A 49-year-old man comes to the physician because of a two-month history of right-sided neck, shoulder, and arm pain. The onset of the pain occurred a few days after he spent an afternoon chopping firewood. He describes the pain as constant and occasionally pulsating, especially at night. He also notes that his right arm alternates between warm and cold to the touch. He gets partial pain relief when he applies ice to the affected areas. He tried over-the-counter acetaminophen and ibuprofen without relief. His other medical problems include hypertension, hypercholesterolemia, and gastroesophageal reflux disease. His medications include losartan, amlodipine, omeprazole, and simvastatin. Physical examination is remarkable for tenderness over the right occipital area. There is mild edema of the fingers on the right hand. Neck motion is complete but slow in all directions. Neurological examination, including pinprick, motor strength, and deep tendon reflexes of the upper extremities, is unremarkable. \n\nLaboratory results are as follows:\nHemoglobin: 14.2 g/dL\nPlatelets: 250,000 cells/μL\nCreatinine: 0.9 mg/dL\nErythrocyte sedimentation rate: 15 mm/h\n\nRadiographs of the cervical spine show some mild disk space narrowing at C5-C6 and C6-C7. A right shoulder x-ray demonstrates normal alignment, no fractures, and no calcifications. There is some patchy bone demineralization involving the acromion.",
    "choice_a": "Cervical radiculopathy",
    "choice_b": "Complex regional pain syndrome",
    "choice_c": "Fibromyalgia",
    "choice_d": "Polymyalgia rheumatica",
    "choice_e": "Systemic sclerosis",
    "correct_answer": "B",
    "explanation": "This patient's presentation is most consistent with complex regional pain syndrome (CRPS), which commonly occurs after an injury. Stage 1 features include limb pain (throbbing/aching, sensitive to cold), local edema, changes in color/temperature, and patchy bone demineralization on x-ray. CRPS likely involves a reflex arc along the sympathetic nervous system leading to autonomic symptoms (swelling, coldness). Diagnosis is clinical based on symptoms and relief with local anesthetic block.\n\n(Choice A) Cervical radiculopathy usually follows a specific nerve root distribution; this patient's symptoms traverse multiple roots and include vasomotor symptoms.\n\n(Choice C) Fibromyalgia presents with widespread tender points on both sides of the body, unlike these localized symptoms.\n\n(Choice D) PMR presents with bilateral shoulder girdle stiffness in patients > 50 and lacks the paresthesias and temperature changes seen here.\n\n(Choice E) Systemic sclerosis is usually bilateral and associated with specific skin hardening/Raynaud's rather than unilateral temperature changes without color changes.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_031",
    "system": "Rheumatology",
    "stem": "A 57-year-old man comes to the physician for evaluation of pain and swelling in his right leg. He experienced pain in his right calf the night before that he thought was related to playing softball the previous day. He recalled no injury while playing. The pain progressed and he now has slight swelling in the right foot. The patient has not had a similar problem previously. He has no fever, chills, chest pain, or dyspnea. His other medical problems include hypertension, hyperlipidemia, and degenerative joint disease of both knees. Vital signs are normal. There is 1+ pedal edema on the right leg and no edema on the left. Peripheral pulses are full and symmetric. There is no obvious difference in temperature between the legs. There is no erythema or palpable cords. Homan's sign is strongly positive on the right. There may be a small effusion of the right knee. The patient has nonpulsatile fullness in the right popliteal fossa when standing with his legs fully extended.",
    "choice_a": "Deep venous thrombosis",
    "choice_b": "Popliteal artery aneurysm",
    "choice_c": "Popliteal synovial cyst",
    "choice_d": "Sarcoma",
    "choice_e": "Torn head of the gastrocnemius",
    "correct_answer": "C",
    "explanation": "This patient's presentation is consistent with a popliteal synovial cyst (Baker's cyst). Dissecting cysts often result in a \"pseudo-thrombophlebitis\" syndrome causing calf tenderness, positive Homan's sign, and edema. Physical examination shows prominent medial popliteal fullness with the patient standing and knees extended (Foucher's sign). Underlying joint disease (osteoarthritis) is a major risk factor.\n\n(Choice A) DVT also presents with swelling and Homan's sign, but posterior knee fullness and joint effusion favor a dissecting cyst.\n\n(Choice B) Popliteal aneurysms usually present as a pulsatile mass.\n\n(Choice D) Sarcoma presents as solid fullness but is less common than popliteal cysts in the setting of known osteoarthritis.\n\n(Choice E) Torn gastrocnemius causes localized pain and possible hematoma but is not associated with knee swelling.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_032",
    "system": "Rheumatology",
    "stem": "A 66-year-old woman comes to the physician because of progressively worsening hip pain over the last several weeks. The pain is localized to the lateral aspect of her left hip over the outer thigh, but sometimes extends to her left buttock and knee. Her pain increases when she climbs stairs, gets out of the car, and stands up from sitting in a deep chair. She also notes that the pain sometimes occurs with walking or prolonged standing. On occasion, the pain awakens her from sleep when she rolls onto her left side. She denies fever, chills, or constitutional symptoms. She cannot recall any trauma to the area and has had no falls. Her medical problems include obesity (BMI 30 kg/m2), type 2 diabetes mellitus, hypertension, hyperlipidemia, chronic low back pain, and depression.",
    "choice_a": "Intermittent claudication",
    "choice_b": "Lumbar spinal stenosis",
    "choice_c": "Meralgia paresthetica",
    "choice_d": "Osteoarthritis of the hip",
    "choice_e": "Trochanteric bursitis",
    "correct_answer": "E",
    "explanation": "This patient's presentation is consistent with trochanteric bursitis, caused by exaggerated movement of the gluteus medius tendon over the femur. Patients present with lateral hip pain worsened by repetitive hip flexion (climbing stairs) or lying on the affected side. Physical examination typically reveals local tenderness over the midpoint of the greater trochanter during flexion. Treatment includes local heat, weight reduction, and NSAIDs.\n\n(Choice A) Claudication from aortoiliac disease causes aching pain in the buttock/hip with activity but is usually not localized to the lateral hip.\n\n(Choice B) Spinal stenosis produces back pain radiating into the buttock/thigh, usually bilateral and posture-dependent.\n\n(Choice C) Meralgia paresthetica (lateral femoral cutaneous nerve entrapment) causes decreased sensation/paresthesia over the antero-lateral upper thigh rather than localized trochanteric pain.\n\n(Choice D) Osteoarthritis of the hip is associated with groin pain rather than lateral hip pain, and is often accompanied by limited range of motion.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_033",
    "system": "Rheumatology",
    "stem": "A 65-year-old man comes to the physician due to attacks of joint pain and swelling that affect primarily his hands but sometimes his knees or elbows. He currently has no pain, but the episodes occur once or twice a month. The patient's other medical problems include type 2 diabetes mellitus and hypertension. He has not seen a physician for 2 years, and he has managed his diabetes with diet. He was diagnosed with arthritis 2 years ago at a different clinic and was prescribed ibuprofen. The patient smokes 1-2 packs of cigarettes a day and drinks 2-3 cans of beer each night. Temperature is 36.7 C (98 F), blood pressure is 155/96 mm Hg, pulse is 84/min, and respirations are 16/min. The patient's BMI is 35 kg/m2. He has clear lungs and normal first and second heart sounds. His abdomen is obese, nontender, and without hepatosplenomegaly. His fingers are shown in the images below. There is no joint tenderness and no joint effusions are present elsewhere. Serum creatinine level is normal and fasting blood glucose level is 133 mg/dL.",
    "choice_a": "Allopurinol",
    "choice_b": "Etanercept",
    "choice_c": "Methotrexate",
    "choice_d": "Prednisone",
    "choice_e": "Sulfasalazine",
    "correct_answer": "A",
    "explanation": "This patient with metabolic syndrome has visible tophi over the distal interphalangeal (DIP) joints, characteristic of tophaceous gout. Tophi indicate chronic intraarticular uric acid deposition. For patients with frequent attacks of gouty arthritis, prophylaxis with allopurinol is the preferred long-term treatment.\n\n(Choice B) Etanercept (TNF inhibitor) is for severe RA or psoriatic arthritis, not gout.\n\n(Choices C and E) Methotrexate and sulfasalazine are DMARDs used for RA; RA typically spares the DIP joints.\n\n(Choice D) Prednisone is used for acute polyarticular attacks of gout in patients who cannot tolerate NSAIDs, but it is not for long-term relief.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_034",
    "system": "Rheumatology",
    "stem": "A 35-year-old woman with no significant past medical history comes to the physician due to muscle and joint pains over her entire body for the past 6 months. She feels as if she has \"the flu\" all the time. The patient also experiences fatigue, mental slowness, and occasional headaches. Vital signs are within normal limits. On examination, she has tenderness to gentle palpation over the muscles of her neck, shoulders, and back. There is no synovitis. Laboratory results show normal electrolytes, complete blood count, erythrocyte sedimentation rate, and thyroid function.",
    "choice_a": "Cardiovascular fitness training",
    "choice_b": "Hydrocodone/acetaminophen",
    "choice_c": "Hydroxychloroquine",
    "choice_d": "Low-dose prednisone",
    "choice_e": "Methotrexate",
    "correct_answer": "A",
    "explanation": "Fibromyalgia (FM) commonly presents in young to middle-aged women with widespread pain, fatigue, and cognitive disturbances. Initial management includes patient education, regular aerobic exercise (cardiovascular fitness training), and good sleep hygiene. Although patients may have short-term pain after activity, regular exercise improves long-term pain.\n\n(Choice B) Opioids such as hydrocodone likely do not outweigh the risks in FM and may actually worsen pain status.\n\n(Choice C) Hydroxychloroquine is effective for SLE or RA, but not for FM.\n\n(Choices D and E) Prednisone and Methotrexate are for inflammatory conditions (eg PMR, RA) which usually present with elevated ESR. FM is non-inflammatory.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_035",
    "system": "Rheumatology",
    "stem": "A 55-year-old man comes to the office due to a 2-year history of pain in both hands with intermittent swelling of the finger joints. The pain impairs his functioning as a carpenter. He also has stiffness in the knees after prolonged sitting. Review of systems is negative for any other systemic or physical symptoms. His other medical problems include chronic bronchitis, impaired glucose tolerance, and a history of nephrolithiasis. His home medications include ibuprofen as needed, glucosamine/chondroitin supplements, and aspirin. His father died of cardiomyopathy at age 75. The patient does not use illicit drugs but smokes a pack of cigarettes daily and drinks 2 mixed alcoholic beverages every night. His vital signs are within normal limits. Finger nails appears pitted. There is boggy swelling and tenderness to palpation involving all the proximal and distal interphalangeal joints.\n\nLaboratory results are as follows:\nComplete blood count\nHemoglobin: 14.1 g/dL\nPlatelets: 320,000/mm3\nLeukocytes: 7,800/mm3\nLiver function studies\nBilirubin, total: 0.8 mg/dL\nAlkaline phosphatase: 80 U/L\nAspartate aminotransferase (SGOT): 48 U/L\nAlanine aminotransferase (SGPT): 30 U/L\nImmunologic and rheumatologic studies\nErythrocyte sedimentation rate: 25 mm/h\nRheumatoid factor: 10 U/mL\nCyclic citrullinated peptide antibodies: negative\n\nChest x-ray reveals hyperinflation of the lungs but is otherwise normal. Hand x-ray is shown in the exhibit.",
    "choice_a": "Hemochromatosis",
    "choice_b": "Hypertrophic osteoarthropathy",
    "choice_c": "Polyarticular gout",
    "choice_d": "Psoriatic arthritis",
    "choice_e": "Rheumatoid arthritis",
    "correct_answer": "D",
    "explanation": "Psoriatic arthritis can present with various clinical patterns including distal interphalangeal (DIP) joint arthritis, asymmetric oligoarthritis, symmetric polyarthritis (resembling rheumatoid arthritis), spondyloarthropathy, and aggressively destructive arthritis mutilans. Some patients may have a combination of patterns. Hand x-rays can reveal erosive changes with new bone formation, lysis of the terminal phalanges, joint destruction, \"pencil-in-cup\" appearance, and joint lysis with ankylosis. Most patients with psoriatic arthritis have had psoriasis for many years, but up to 30% of patients first develop arthritis followed by skin disease months to years later. In such cases, DIP joint arthritis and arthritis mutilans are considered the most specific for psoriatic arthritis. Nail changes such as pitting, yellowish discoloration, and onycholysis (lifting of the nail from the nail beds) also favor a diagnosis of psoriatic arthritis. This patient's hand x-ray reveals early \"pencil-in-cup\" appearance at the second and fifth proximal interphalangeal joints; this is consistent with psoriatic arthritis.\n\n(Choice A) Hemochromatosis is associated with an arthritis that is similar to pseudogout (calcium pyrophosphate crystal deposition) and typically affects the metacarpophalangeal (MCP) joints. Hand x-rays usually reveal chondrocalcinosis and hook-like osteophytes involving the MCP joints.\n\n(Choice B) Hypertrophic osteoarthropathy presents with digital clubbing and severe pain due to periostitis, and is often associated with intrathoracic malignancies (eg, lung cancer) or infectious diseases (eg, pulmonary infection). Radiographs of the long bones usually reveal periostitis instead of the destructive findings seen in this patient.\n\n(Choice C) This patient's alcohol use and history of kidney stones should raise concern for the possibility of gout. However, gout usually presents as monoarthritis with x-rays revealing bony erosions and overhanging edges.\n\n(Choice E) Rheumatoid arthritis typically presents as a symmetrical polyarthritis that commonly involves the MCP joints. This patient's nail pitting, normal inflammatory markers, and involvement of the DIP joints favor psoriatic arthritis.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_036",
    "system": "Rheumatology",
    "stem": "A 42-year-old woman comes to the physician with 6 months of progressively worsening exertional dyspnea. She is unable to climb two flights of stairs without becoming short of breath. She also complains of dry cough, weight loss, and fatigue. She describes finger tingling and numbness when exposed to colder temperatures. Her past medical history is significant for acid reflux disease and diabetes mellitus. Her medications include metformin and omeprazole. She does not smoke cigarettes.\n\nHer blood pressure is 155/80 mm Hg and her pulse is 86/min. Oxygen saturation is 94% on room air. Small ulcers are seen at the fingertips bilaterally. Jugular venous pressure is estimated at 6 mm H2O. There are no heart murmurs. Inspiratory fine crackles are heard on auscultation at lung bases. There is no organomegaly.\n\nLaboratory results are as follows:\nHemoglobin: 11.5 g/dL\nWBC count: 5,600/mm3\nPlatelet count: 420,000/mm3\nCreatinine: 1.3 mg/dL\n\nChest x-ray shows bilateral reticular opacities.",
    "choice_a": "Anticitrullinated peptide antibodies",
    "choice_b": "Anti-DNA topoisomerase I antibodies",
    "choice_c": "Antimitochondrial antibodies",
    "choice_d": "Antineutrophil cytoplasmic antibodies",
    "choice_e": "Antisynthetase antibodies",
    "correct_answer": "B",
    "explanation": "This patient's presentation is consistent with likely systemic sclerosis (SSc), as summarized in the table. She has features of Raynaud's phenomenon, fingertip ulcers, abnormal chest x-ray, and acid reflux disease. Laboratory testing can usually confirm the diagnosis in clinically suspected patients. The most commonly seen antibodies include antitopoisomerase (SCL-70), anticentromere (ACA), and anti-RNA polymerase III. These antibodies also correlate with specific organ involvement (eg, lung, skin) and can sometimes correlate with prognosis.\n\n(Choice A) Anticitrullinated peptide antibodies (anti-CCP) are less common in SSc but more common in rheumatoid arthritis and overlap syndrome.\n\n(Choice C) Antimitochondrial antibodies (AMA) are usually seen in primary biliary cirrhosis (PBC).\n\n(Choice D) Antineutrophil cytoplasmic antibodies are not associated with SSc but are more commonly associated with vasculitis.\n\n(Choice E) Antisynthetase antibodies include anti-Jo-1 and are more specific for myositis. They are more commonly found in patients with dermatomyositis/polymyositis associated with interstitial lung disease. This patient has no muscle weakness.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_037",
    "system": "Rheumatology",
    "stem": "A 68-year-old woman comes to the office due to worsening pain and stiffness in her hands for the past several months. The patient initially had pain in the fingers and at the base of the thumb only after prolonged gardening or sewing, but she is now having difficulty with daily activities such as buttoning her blouse or holding her dog's leash. Her fingers are stiff in the morning, with gradual improvement after 15- 20 minutes of use. The patient has experienced no fever or swelling in the hands. She has attempted treatment of her pain with stretching exercises and over-the-counter acetaminophen without relief. Medical history is notable for hypertension, for which she takes amlodipine and lisinopril. The patient occasionally drinks alcohol but does not use tobacco or illicit drugs.\n\nVital signs are within normal limits. Hand examination shows no redness, swelling, or joint deformities, but passive and active range of motion elicits pain at the proximal and distal interphalangeal joints. The remainder of the examination is normal. X-ray of the patient's hand is shown in the exhibit.",
    "choice_a": "Daily oral naproxen",
    "choice_b": "Glucosamine supplement",
    "choice_c": "Low-dose prednisone",
    "choice_d": "Serology testing",
    "choice_e": "Topical diclofenac",
    "correct_answer": "E",
    "explanation": "This patient has chronic noninflammatory arthritis in the hands. Her x-ray shows joint space narrowing, subchondral sclerosis, and osteophyte formation in the distal interphalangeal (DIP) joints of multiple digits, particularly the second and the third. These findings are consistent with osteoarthritis (OA). The initial management of OA is determined by the joints involved, severity of symptoms, and comorbid conditions. OA of the large weight-bearing joints (eg, knees) often improves with an exercise and weight loss program. Initial medication options include acetaminophen and nonsteroidal anti-inflammatory drugs (NSAIDs). However, systemic NSAIDs are associated with increased risk of complications in patients age ≥65 (such as this patient) and in those with comorbid hypertension, heart disease, chronic kidney disease, or a history of gastrointestinal hemorrhage (Choice A). For these patients, a topical NSAID (eg, diclofenac) may be equally effective and associated with less systemic toxicity.\n\n(Choice B) The highest-quality studies on the use of glucosamine in OA have shown little benefit. It may have a small benefit in OA of the knee, but it is unlikely to be helpful for this patient.\n\n(Choices C and D) Serologic testing (eg, cyclic citrullinated peptide antibodies) is appropriate to screen for rheumatoid arthritis (RA) and other autoimmune disorders, and prednisone is often used in short courses in RA to provide initial relief while planning appropriate long-term management. However, RA is characterized by prolonged morning stiffness, palpable synovitis, and sparing of the DIP joints. This patient's noninflammatory arthritis that prominently affects the DIP joints is more consistent with OA.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_038",
    "system": "Rheumatology",
    "stem": "A community-dwelling 80-year-old patient comes to the physician for preoperative assessment prior to elective hip replacement. Which of the following would be the best metric for determining the likelihood of 30-day post-operative complications and discharge to a nursing facility?",
    "choice_a": "Evaluation of cardiac status",
    "choice_b": "Evaluation of pulmonary and kidney function",
    "choice_c": "Frailty determination",
    "choice_d": "Mini-Mental Status Exam",
    "choice_e": "Review of medication list",
    "correct_answer": "C",
    "explanation": "Preoperative assessment of geriatric patients has proved challenging. While all of the above options can be helpful, recent studies indicate that the presence of frailty is strongly associated with adverse post-operative outcomes. A commonly used frailty index includes weight loss, exhaustion, physical weakness, slow walking speed, and decreased physical activity. Scoring is as follows: 4-5 points - frail, 2-3 points - intermediately frail, 0-1 points - non-frail. There is a progressive increase in length of stay and 30-day post-operative complications with an increasing number of points. Individuals classified as frail have an odds ratio of 20 when compared with non-frail patients for discharge to a nursing facility.\n\n(Choices A and B) Determination of the likelihood of post-operative complications has traditionally been centered around the degree of dysfunction of key organ systems. These classification schemes still have value, but may be less useful in older patients.\n\n(Choice D) Impaired cognitive function as determined by Mini-Mental Status Exam evaluation is associated with an increased risk of developing post-operative delirium. Impaired cognitive function is one of several important determinants of post-operative complications; however, it is best used in conjunction with additional assessment tools.\n\n(Choice E) The medication list can often estimate the co-morbidity burden of a patient and, as such, is one of several factors that can be used to assess the likelihood of adverse post-operative outcomes.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_039",
    "system": "Rheumatology",
    "stem": "A 20-year-old woman comes to the physician because her fingers turn white episodically. The symptoms started 6 months ago during the summer when she noticed that opening the freezer or holding cold beverages precipitated these episodes. She was advised to avoid cold stimuli and wear protective gloves. However, the symptoms worsened during the winter and the episodes occurred more frequently. She feels numbness and pain with each episode and seeks relief. The patient has no skin thickening, chest pain, acid reflux symptoms, or shortness of breath. She has no other past medical history. She does not smoke but drinks alcohol occasionally. Her vital signs are within normal limits. The remainder of the physical examination is within normal limits. The hand is shown in the picture.\n\nLaboratory results are as follows:\nWBC count: 4,500/mm3\nHemoglobin: 13.1 g/dL\nPlatelets: 240,000/mm3\nCreatinine, serum: 0.9 mg/dL\nUrine protein: None\nHepatitis B and C serologies: Negative\nTSH, serum: 0.8 mIU/L\nHIV ELISA: Negative\nANA, serum: 1:40, homogeneous pattern",
    "choice_a": "Amlodipine",
    "choice_b": "Aspirin",
    "choice_c": "Hydroxychloroquine",
    "choice_d": "Prednisone",
    "choice_e": "Propranolol",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with likely primary Raynaud's phenomenon (RP), an increased vascular response to cold temperature or emotional stress without an underlying cause. Primary RP usually occurs in women age <30 with symmetrical episodic attacks without evidence of peripheral vascular disease, tissue injury, or abnormal nailfold capillary examination. Laboratory studies (eg, ANA, ESR) are usually negative. Episodes can also involve tingling, numbness, and pain with skin color changes of pallor (white attack) or cyanotic (blue attack). Primary RP requires no further evaluation. Treatment primarily involves avoiding aggravating factors (eg. cold stimuli) as the risk of tissue-damaging digital ischemia is less likely with primary RP. Calcium channel blockers (eg, nifedipine, amlodipine) are the drugs of choice for continuing symptoms.\n\n(Choice B) Aspirin combined with calcium channel blockers may be used in selected patients with severe secondary RP who are at risk for digital ulceration or larger-artery thrombotic events. However, aspirin alone will not alleviate symptoms.\n\n(Choices C and D) Hydroxychloroquine and prednisone are used to treat SLE and RA, which can cause secondary RP. However, this patient's lack of systemic findings (eg, fever, joint pain, rash) makes these less likely.\n\n(Choice E) Beta-blockers can actually worsen Raynaud's phenomenon and should be avoided in this patient.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_040",
    "system": "Rheumatology",
    "stem": "A 78-year-old retired professor comes to the physician because of occasional headaches that have gradually worsened over the last six months. The headaches are right-sided and involve the corner of the right eye. He also gets pains in his jaw while chewing food. He has hyperlipidemia and he takes atorvastatin daily. He asks if the medication might be causing his symptoms. His other medical problems include coronary artery disease for which he had a stent placed in his left anterior descending artery five years ago. He has no history of strokes, vision problems, or peripheral artery disease. He is a lifetime non-smoker. Physical examination reveals a right-sided carotid bruit. Heart sounds are normal. The remainder of the physical examination is within normal limits.\n\nLaboratory results are as follows:\nHemoglobin: 10.9 g/dL\nPlatelets: 350,000 cells/μL\nCreatinine: 0.7 mg/dL\nLow density lipoprotein: 68 mg/dL\nHemoglobinA1c: 4.8%\nESR: 82 mm/h",
    "choice_a": "H. pylori eradication",
    "choice_b": "Muscle enzyme monitoring",
    "choice_c": "Prevention of osteoporosis",
    "choice_d": "Screening for abdominal aortic aneurysm",
    "choice_e": "Screening for vitamin B12 deficiency",
    "correct_answer": "C",
    "explanation": "This patient's presentation (i.e., jaw claudication, new headache, and increased ESR) is most consistent with giant cell arteritis (GCA). Jaw claudication is the most specific symptom and is seen in up to 50% of cases. Laboratory findings include elevated ESR, elevated C-reactive protein, and a normocytic normochromic anemia. Temporal artery biopsy confirms clinical diagnosis and treatment involves immediate glucocorticoid therapy. Since GCA affects primarily postmenopausal women and older men, steroids can predispose or worsen pre-existing osteoporosis. As a result, all patients should undergo bone mineral density measurements. Patients with GCA receiving steroids should also receive adjunctive calcium, vitamin D, and possibly bisphosphonates.\n\n(Choice A) Although steroid therapy may predispose to ulcers, eradication of H. pylori does not significantly affect this.\n\n(Choice B) Statin myopathy usually presents with proximal muscle myalgias/weakness (sometimes with elevated CK), but is usually not associated with jaw pain.\n\n(Choice D) Screening for abdominal aortic aneurysms is less beneficial since they are much less common than ascending aortic aneurysms in GCA patients. It is recommended to perform yearly chest x-rays (up to ten years) to identify patients with thoracic aortic aneurysms prior to rupture or dissection.\n\n(Choice E) Vitamin B12 deficiency usually causes a macrocytic anemia. However, GCA is usually associated with a normochromic normocytic anemia and reactive thrombocytosis that improves with steroids.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_041",
    "system": "Rheumatology",
    "stem": "A 72-year-old woman comes to the physician because of aching and stiffness of her neck and shoulders for the past several weeks. This stiffness lasts for 1-2 hours after rising in the morning. She has tried ibuprofen without relief and has also experienced increasing fatigue for 4-6 weeks. She has no visual changes, headaches, other joint complaints, fever, or chills. Her weight is stable. The patient has osteoporosis, hyperlipidemia, type 2 diabetes mellitus, and hypertension. Current medications include metformin, chlorthalidone, lisinopril, atorvastatin, and calcium and vitamin D supplements. On physical examination, she appears to be in no acute distress. Her temperature is 37.1 C (98.8 F), pulse is 84/min, blood pressure is 130/84 mm Hg, and respiratory rate is 16/min. There is some limitation in range of motion of her shoulders and neck. There is no cervical muscle tenderness, no upper or lower extremity proximal muscle weakness, and no joint swelling or redness. \n\nThe patient's laboratory results are as follows:\nComplete blood count\nHemoglobin: 10.8 g/dL\nHematocrit: 33%\nPlatelets: 420,000/μL\nLeukocytes: 9,800/μL\nSerum chemistry panel\nSodium: 140 mEq/L\nPotassium: 3.6 mEq/L\nChloride: 103 mEq/L\nBicarbonate: 24 mEq/L\nBlood urea nitrogen: 20 mg/dL\nCreatinine: 1.1 mg/dL\nCalcium: 9.6 mg/dL\nBlood glucose: 188 mg/dL\nHbA1C: 8.1%\nCreatine kinase, serum: 57 U/L\nTSH, serum: 8.0 μU/mL\nErythrocyte sedimentation rate (ESR), blood: 82 mm/h",
    "choice_a": "Diabetic amyotrophy",
    "choice_b": "Fibromyalgia",
    "choice_c": "Hypothyroidism",
    "choice_d": "Medication side effect",
    "choice_e": "Polymyalgia rheumatica",
    "correct_answer": "E",
    "explanation": "This patient, with pain and stiffness of proximal muscles associated with an elevated erythrocyte sedimentation rate (ESR), has typical features of polymyalgia rheumatica (PMR). PMR is a disorder of unknown cause that occurs in approximately 1% of the population age >50. The ESR is >40 mm/h in 70%-90% of patients, and the C-reactive protein (CRP) is increased >10 mg/L in more than 90% of individuals. Administration of 15-20 mg/day of prednisone provides rapid resolution of symptoms; lack of a prompt response should call the diagnosis into question. Although there are no specific laboratory studies to confirm the diagnosis of PMR, age of onset, elevation of ESR, and rapid response to prednisone will differentiate PMR from other myopathies.\n\n(Choice A) Diabetic amyotrophy typically presents as an acute asymmetrical pain followed by gradually worsening proximal lower extremity and back weakness, autonomic failure, and weight loss. This patient's lack of lower extremity weakness makes this diagnosis less likely.\n\n(Choice B) Fibromyalgia presents with widespread musculoskeletal pain, fatigue, stiffness, and aching with characteristic tender points. Fibromyalgia usually has a normal CRP and ESR.\n\n(Choice C) Hypothyroid myopathy is characterized by myalgias, weakness, and elevated creatine kinase (CPK). This patient's mild elevation of TSH is more likely due to subclinical hypothyroidism, which is usually not associated with her degree of symptoms.\n\n(Choice D) Statin myopathy is characterized by myalgias with proximal muscle weakness and elevated CPK. This patient has an elevated ESR with normal strength, which is more consistent with PMR.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_042",
    "system": "Rheumatology",
    "stem": "A 38-year-old woman comes to the office for chronic aching pain and stiffness all over her body for the last 6 months. Her symptoms are worse with exercise. She also has experienced fatigue, headaches, and insomnia. The patient tried water aerobic exercise 3 times a week but had no symptom improvement. She has a history of irritable bowel syndrome. Vital signs are within normal limits. Examination shows multiple tender spots over bony prominences. Her muscle strength is 5/5 in all extremities and deep-tendon reflexes are normal throughout. No sensory abnormalities are noted. There is no joint redness or swelling.\n\nLaboratory results are as follows:\nHematocrit: 43%\nLeukocytes: 7,000/μL\nPlatelets: 200,000/μL\nCreatine kinase, serum: 60 U/L\nThyroid-stimulating hormone: 3.0 μU/mL\nErythrocyte sedimentation rate: 9 mm/h",
    "choice_a": "Amitriptyline",
    "choice_b": "Carbamazepine",
    "choice_c": "Colchicine",
    "choice_d": "Methotrexate",
    "choice_e": "Oxycodone",
    "correct_answer": "A",
    "explanation": "This patient's clinical features are consistent with fibromyalgia (FM). FM presents most commonly in young-to-middle-aged women with widespread pain, fatigue, and cognitive/mood disturbances. Initial FM treatment involves a multidisciplinary approach that includes patient education, regular aerobic exercise, and good sleep hygiene. Patients who do not respond to conservative measures may require medications. Tricyclic antidepressants (eg, amitriptyline) are preferred first-line drugs. Pregabalin, duloxetine, and milnacipran are alternate therapies approved for use in FM and can be useful for patients not responding to tricyclic antidepressants.\n\n(Choice B) Pregabalin and gabapentin are anticonvulsant medications that have demonstrated effectiveness in FM. However, other anticonvulsants, including carbamazepine, are not known to be beneficial.\n\n(Choices C and D) Colchicine is used for treating gout. Methotrexate can effectively treat inflammatory arthritides. Neither drug is effective for fibromyalgia.\n\n(Choice E) Opioids (eg, oxycodone), with the exception of tramadol, are usually not recommended for fibromyalgia as there is little evidence that they provide significant relief, and the risks (abuse) outweigh the benefits.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_043",
    "system": "Rheumatology",
    "stem": "A 54-year-old woman comes to the physician with complaints of weakness and skin rash. She thinks that her symptoms could be related to medications she started on over the last 6 months. She was diagnosed with hypertension and hyperlipidemia and takes valsartan, amlodipine, chlorthalidone, and atorvastatin. It has become progressively more difficult for her to perform activities of daily living. She has no family history of skin disease. Her vital signs are normal. BMI is 33 kg/m2 Physical examination findings are shown in the pictures below. She has decreased muscle strength (4/5) in the quadriceps muscles bilaterally. Deep-tendon reflexes are 1+ and symmetrical. The remainder of the physical examination is within normal limits.\n\nLaboratory results are as follows:\nComplete blood count\nHemoglobin: 10.8 g/dL\nMean corpuscular volume: 89 fL\nPlatelets: 150,000/μL\nLeukocytes: 4,100/μL, normal differential\nSerum chemistry\nBlood urea nitrogen: 20 mg/dL\nCreatinine: 0.8 mg/dL\nLiver function studies\nTotal protein: 6.5 g/dL\nAlbumin: 4.0 g/dL\nAlkaline phosphatase: 70 U/L\nAspartate aminotransferase (SGOT): 87 U/L\nAlanine aminotransferase (SGPT): 74 U/L\nCreatine kinase, serum: 1286 U/L\nThyroid-stimulating hormone: 2.9 μU/mL",
    "choice_a": "Dermatomyositis",
    "choice_b": "Medication toxicity",
    "choice_c": "Psoriasis",
    "choice_d": "Systemic lupus erythematosus",
    "choice_e": "Systemic sclerosis",
    "correct_answer": "A",
    "explanation": "This patient's cutaneous manifestations strongly suggest dermatomyositis (DM). Patients with DM usually present with symmetrical weakness that is more proximal. Classic skin findings include Gottron's papules, which are violaceous to dusky pink papules with scaling over the extensor surfaces of the MCP and IP hand joints and dorsal aspect of the wrists, elbows, and knees. Fewer than 50% of patients present with violaceous periorbital rash in the upper eyelid (heliotrope rash). Other skin findings include shawl sign (diffuse, flat erythema in a V-shaped distribution over the chest and shoulder), mechanic's hands, and erythroderma. Diagnosis is suggested by these clinical findings and can be confirmed with laboratory testing, EMG, and skin/muscle biopsy. Treatment involves glucocorticoids and evaluation for possible associated malignancy.\n\n(Choice B) Statins can cause myalgias, acute rhabdomyolysis, and, rarely, inflammatory myopathy. Cutaneous manifestations are usually not present.\n\n(Choice C) Psoriasis usually presents with scaly plaques on the extensor surfaces of the arms and does not normally cause muscle weakness.\n\n(Choice D) Lupus may present with malar or discoid rash, myalgias, and arthritis. However, it does not usually cause muscle weakness.\n\n(Choice E) Systemic sclerosis can present with sclerodactyly, inflammatory myositis, and fatigue. However, it usually does not present with the skin findings seen in this patient.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_044",
    "system": "Rheumatology",
    "stem": "A 33-year-old woman comes in for a follow-up appointment. She was seen 6 months ago for a rash on her face, profound fatigue, and arthritis. The patient was diagnosed with systemic lupus erythematosus and started on hydroxychloroquine and low-dose prednisone. She has experienced marked improvement in her symptoms and has resumed her usual activities. Physical examination shows a faint facial rash but is otherwise unremarkable.\n\nCurrent laboratory results are as follows:\nHemoglobin: 10.4 g/dL\nCreatinine: 1.2 mg/dL\nUrinalysis\nWhite blood cells: 20-30/hpf\nRed blood cells: many/hpf\n24-hour urine protein: 900 mg/24 hr\nImmunologic and rheumatologic studies\nAnti-double-stranded DNA antibody: 5 IU/mL (<30.0 IU/mL)\nAntinuclear antibody: strongly positive (negative)",
    "choice_a": "CT of the abdomen with contrast",
    "choice_b": "Cyclophosphamide",
    "choice_c": "Kidney biopsy",
    "choice_d": "Reassurance and follow-up in 2-3 months",
    "choice_e": "Serum protein electrophoresis",
    "correct_answer": "C",
    "explanation": "Over half of all patients with systemic lupus erythematosus (SLE) will develop renal disease during their lifetime, an important indicator of overall prognosis. A renal biopsy is needed to accurately distinguish among the various subtypes of LN. Renal biopsy should be performed when any new evidence of kidney involvement is present, including proteinuria (≥500 mg/day), elevated creatinine, or active urine sediment. Mild proteinuria alone does not require aggressive immunosuppressive therapy, and biopsy may not be necessary. Repeat biopsies should be performed with evidence of new or worsening laboratory markers as transformation of LN subtypes can occur.\n\n(Choice A) Radiologic imaging has little role in the evaluation of LN, although renal ultrasonography and noncontrast CT scans can be used in acute kidney injury to rule out other suspected causes.\n\n(Choices B and D) Hydroxychloroquine, with or without glucocorticoids, is appropriate for mild SLE without nephritis. However, additional immunosuppressive therapy is likely needed in this patient. The particular regimen is determined by the specific LN subtype, which is based on renal biopsy findings.\n\n(Choice E) Urine protein electrophoresis may demonstrate polyclonal gammopathy in LN but would not be helpful in distinguishing the LN subtype.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_045",
    "system": "Rheumatology",
    "stem": "A 32-year-old right-hand-dominant woman living in New Hampshire comes to the physician complaining of right wrist pain for the past 3 months. She has no history of tick bites, recent travel, or illness in the family. Review of systems is negative for fever, pain or swelling in any other joints, skin rash, or recent gastrointestinal or genitourinary infections. The patient is sexually active in a monogamous relationship. She delivered her first child 4 months ago. She smokes marijuana occasionally.\n\nHer temperature is 37.2 C (99 F), blood pressure is 110/78 mm Hg, pulse is 78/min, and respirations are 12/min. She weighs 80 kg (176 lb). There is a sharp tenderness on palpation of the radial styloid at the wrist. The pain is aggravated on ulnar deviation of the wrist after she is asked to make a fist over the thumb. There is no synovitis or tenderness noted on any other joints. The right hand x-ray is normal.",
    "choice_a": "Carpal tunnel syndrome",
    "choice_b": "de Quervain's tenosynovitis",
    "choice_c": "Gonorrheal arthritis",
    "choice_d": "Lyme arthritis",
    "choice_e": "Osteoarthritis of the first carpometacarpal joint",
    "correct_answer": "B",
    "explanation": "This patient's wrist pain, history of caring for an infant, positive Finkelstein's maneuver, and normal hand x-ray suggest de Quervain's tenosynovitis. Chronic overuse of the wrist, trauma, or repetitive activity may entrap the abductor pollicis longus and extensor pollicis brevis tendons at the radial styloid process. The resultant tendinitis/tenosynovitis causes pain. The tenosynovitis occurs most commonly in women ages 30-50 with infants and daycare workers. Patients usually present with pain at the radial side of the wrist, pain can radiate to the thumb or volar aspect of the wrist with movement. Examination may show painful swelling or enlargement of the first extensor (dorsal) compartment. Tenderness and thickening at the radial styloid can be present in many patients. Finkelstein's maneuver involves grasping the patient's clenched hands (with fingers over the thumb) and rotating the wrist toward the ulnar aspect. Pain with movement is a positive sign and suggests the diagnosis. Acute treatment involves activity modification, thumb splints, and anti-inflammatory agents.\n\n(Choice A) Carpal tunnel syndrome presents with pain or paresthesia in the distribution of the median nerve with a positive Tinel's sign.\n\n(Choice C) Gonococcal arthritis usually presents with tenosynovitis, migratory polyarthritis, and pustular skin lesions.\n\n(Choice D) Lyme arthritis typically presents with intermittent or persistent monoarthritis affecting larger joints and more swelling than pain.\n\n(Choice E) X-ray is usually normal in de Quervain's tenosynovitis; CMC osteoarthritis may have subluxation, diminished space, osteophytes, and sclerosis.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_046",
    "system": "Rheumatology",
    "stem": "A 75-year-old woman comes to the office for follow-up of osteoporosis. She has been on weekly oral risedronate for the last 2 years and has an adequate daily intake of calcium and vitamin D via diet and oral supplements. However, in the past year the patient has experienced 2 vertebral compression fractures and lost 5.1 cm (2 in) in height. She was evaluated in a fall reduction program, and home safety improvements were implemented. A home health aide assists the patient with her medications and notes that adherence has been excellent. Medical history is notable for a mild stroke 2 years ago with minimal residual deficits. Vital signs are normal. BMI is 20 kg/m2. On examination, the patient appears frail and has a modest thoracic kyphosis. Physical examination is otherwise normal.\n\nLaboratory results show normal blood counts, liver function tests, serum creatinine, alkaline phosphatase, TSH, serum parathyroid hormone, anti-tissue transglutaminase antibody assay, 25-hydroxyvitamin D, and serum protein electrophoresis. 24-hour urine calcium excretion is 290 mg. DXA reveals a T-score of -2.8 in the hip and -3.6 in the spine, which represents a significant (>5%) decrease compared with her last test 2 years ago.",
    "choice_a": "Add raloxifene",
    "choice_b": "Add teriparatide",
    "choice_c": "Advise wearing a hip protector",
    "choice_d": "Measure urine N-telopeptide",
    "choice_e": "Stop risedronate and start teriparatide",
    "correct_answer": "E",
    "explanation": "This patient has osteoporosis and has received appropriate first-line treatment with a bisphosphonate. However, she has experienced progressive bone loss while on treatment and has severe osteoporosis (T-score ≤-3.5 or T-score ≤-2.5 with a fragility fracture) and recurrent fragility fractures. Teriparatide is a recombinant parathyroid hormone analog that is useful in patients with severe osteoporosis or who fail first-line treatment. It is given by daily subcutaneous injection and can increase bone density and reduce fracture risk. Treatment with teriparatide is typically prescribed for 2 years, after which a bisphosphonate is resumed to preserve gains in bone density. However, there is no evidence of reduced fracture risk with concurrent therapy (Choice B).\n\n(Choice A) Raloxifene is less effective than bisphosphonates and has not been proven to reduce fractures in combination. It is not recommended for patients with increased thromboembolic risk (eg, prior stroke).\n\n(Choice C) Hip protectors have not been shown to reduce the risk of hip fractures and are not recommended.\n\n(Choice D) DXA confirms progressive bone loss, and an N-telopeptide assay would not improve management.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_047",
    "system": "Rheumatology",
    "stem": "A 65-year-old woman with a history of rheumatoid arthritis comes to the physician with persistent hand pain aggravated by use. She was prescribed tramadol and occupational therapy 1 year ago and has had no relief. Rheumatoid arthritis was diagnosed 20 years ago, and she was started on methotrexate, prednisone, and hydroxychloroquine at that time. She was prescribed etanercept 10 years ago and switched to adalimumab 5 years later due to persistent disease activity. The patient's other medical problems include hypertension and acid reflux disease. Her current medications include methotrexate, hydroxychloroquine, adalimumab, tramadol, prednisone, and ibuprofen. She does not use tobacco, alcohol, or illicit drugs. Her vital signs are normal. Musculoskeletal examination is notable for the presence of rheumatoid deformities in the hands and feet. There is no joint tenderness or effusion. Neurological examination is within normal limits. \n\nLaboratory results are as follows:\nHemoglobin: 12.0 g/dL\nMean corpuscular volume: 84 fL\nPlatelets: 200,000/μL\nLeukocytes: 4,800/μL\nCreatinine: 1.0 mg/dL\nCalcium: 9.4 mg/dL\nGlucose: 120 mg/dL\nC-reactive protein (CRP): 5 mg/L\nErythrocyte sedimentation rate: 18 mm/h",
    "choice_a": "Add infliximab to the current regimen",
    "choice_b": "Add sulfasalazine to the current regimen",
    "choice_c": "Prescribe a short course of high-dose prednisone",
    "choice_d": "Refer for orthopedic evaluation",
    "choice_e": "Switch from oral to subcutaneous methotrexate",
    "correct_answer": "D",
    "explanation": "This patient with long-standing rheumatoid arthritis (RA) has pain and functional limitations not explained by the inflammatory aspect of her disease. Her ESR and CRP are not elevated, and she has no joint effusions or tenderness. The pain is likely from mechanical stress of joint deformities and/or destruction. Due to failure of conservative treatment (eg, NSAIDs and occupational therapy), the next step would be orthopedic evaluation. Surgery is indicated in RA patients with joint destruction causing intractable pain, severe functional disability, or impending tendon rupture. Surgical options include total joint replacement, soft-tissue release, and joint fusion. Timely referral can prevent further joint destruction and allow for successful rehabilitation.\n\n(Choice A) This patient's pain is likely mechanical from joint destruction rather than from inflammatory disease activity. Adding more aggressive biologic therapy with a TNF-α antagonist will likely not benefit her.\n\n(Choices B, C, E) Adding another DMARD, increasing the dose of prednisone, or switching to subcutaneous methotrexate are options for patients with active disease and markers of inflammation. This patient would not benefit from these options.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_048",
    "system": "Rheumatology",
    "stem": "A 35-year-old woman comes to the physician with 2 months of arm and leg weakness accompanied by puffy swelling of her hands. She also complains of dry eyes and mouth. She reports that her fingers turn blue or white when exposed to cold temperatures. The patient was evaluated for fatigue 6 months ago and was found to have normal complete blood count, serum chemistry, thyroid-stimulating hormone, vitamin D level, erythrocyte sedimentation rate, and C-reactive protein. Her antinuclear antibody test was positive at a low titer 1:80. She was advised to increase her aerobic activity level and was prescribed myofascial stretching exercises. She has no other significant past medical history. Her medications include acetaminophen and oral contraceptive pills. The patient drinks alcohol occasionally but does not use tobacco or illicit drugs. She works on a factory assembly line and has 3 children.\n\nVital signs are within normal limits. On examination, she has several telangiectasias in the face. Both hands appear edematous and there is synovitis in several metacarpophalangeal and proximal interphalangeal joints. There is no leg edema. Muscle strength is decreased symmetrically and is 4/5 in both upper and lower extremities.\n\nLaboratory results are as follows:\nHemoglobin: 11.0 g/dL\nMean corpuscular volume: 80 fL\nPlatelet count: 190,000/μL\nLeukocyte count: 5,800/μL\nCreatinine: 0.9 mg/dL\nCalcium: 9.0 mg/dL\nCreatine kinase: 856 U/L\nThyroid-stimulating hormone: 3.5 μU/mL",
    "choice_a": "Antibodies to aminoacyl-tRNA synthetases",
    "choice_b": "Antibodies to topoisomerase",
    "choice_c": "Anti-double-stranded DNA antibodies",
    "choice_d": "Anti-neutrophil cytoplasmic antibodies",
    "choice_e": "Anti-U1-RNP (ribonucleoprotein) antibodies",
    "correct_answer": "E",
    "explanation": "This patient's presentation of fatigue, muscle weakness, sicca symptoms (eg, dry eyes and mouth), Raynaud's phenomenon, and hand swelling (synovitis) is consistent with likely mixed connective tissue disease (MCTD). MCTD is an overlap syndrome associated with anti-U1-RNP (ribonucleoprotein) antibodies and features of systemic lupus erythematosus (SLE), systemic sclerosis, and polymyositis. Diagnosis requires anti-RNP antibodies and the presence of swollen hands, myositis, synovitis, or Raynaud's phenomenon. Unlike in SLE, patients with U1-RNP antibodies rarely develop diffuse glomerulonephritis, psychosis, or seizures. However, they usually develop early Raynaud's phenomenon, sclerodactyly, inflammatory muscle disease, and pulmonary hypertension. Treatment is usually glucocorticoids.\n\n(Choice A) Antibodies to aminoacyl-tRNA synthetases (eg, anti-Jo-1) are more specific for myositis. Her symptoms are more suggestive of a mixed disorder.\n\n(Choice B) Antibodies to topoisomerase are associated with diffuse cutaneous systemic sclerosis. Scleroderma does not usually cause the significant hand arthritis seen in this patient.\n\n(Choice C) Anti-double-stranded DNA antibodies are specific for SLE. This patient does not have characteristic lupus symptoms (eg, weight loss, alopecia, malar rash).\n\n(Choice D) Granulomatosis with polyangiitis (GPA) and microscopic polyangiitis (MPA) usually present with oronasal inflammation and abnormalities on urinalysis and/or chest imaging.",
    "source": "ABIM - Rheumatology, Orthopedics Sports -1.pdf"
  },
  {
    "id": "SYSTEM_049",
    "system": "Rheumatology",
    "stem": "A 65-year-old man comes to the physician because of a 3 day history of pain and swelling in his left knee. He also reports nausea and feeling weak earlier today. He has a long-standing history of rheumatoid arthritis (RA) and has had several previous episodes of \"fluid in the knee.\" He currently takes methotrexate and sulfasalazine for his RA. Tumor necrosis factor inhibitor therapy was prescribed two years ago but was discontinued after six months due to frequent sinus infections and exacerbation of his congestive heart failure. His other medical problems include hypertension, hypercholesterolemia, colonic polyps, essential tremor, congestive heart failure, and a remote history of asbestos exposure. His other medications include furosemide, propranolol, lisinopril, aspirin, and simvastatin.\n\nHis temperature is 37.2 C (99 F), blood pressure is 110/70 mm Hg, pulse is 88/min, and respirations are 16/min. He has no jugular venous distention. His heart sounds are normal and his lungs are clear. Musculoskeletal examination is notable for extensive deformities in the hands due to long-standing arthritis. His right knee is normal. The left knee is tender and swollen and he is unable to extend it due to pain.\n\nJoint aspiration yields 20 cc of synovial fluid. Laboratory results are as follows:\n\nComplete blood count\nHemoglobin: 11.9 g/dL\nPlatelets: 250,000 cells/µL\nLeukocyte count: 9,500 cells/µL\nSerum chemistry\nPotassium: 3.9 mEq/L\nCreatinine: 0.9 mg/dL\nImmunologic and rheumatologic studies\nErythrocyte sedimentation rate: 25 mm/h\nUric acid, serum: 8.5 mg/dL\nSynovial fluid analysis\nCrystals: None\nGram stain: Negative\nTotal cell count: 65,000 cells/µL\nWhite blood cells: 60,000 cells/µL\nNeutrophils: 88%\nRed blood cells: 2000 cells/µL\n\nWhich of the following is the most appropriate next step in management?",
    "choice_a": "Colchicine",
    "choice_b": "Intraarticular corticosteroid injection",
    "choice_c": "Intravenous antibiotics",
    "choice_d": "Oral prednisone",
    "choice_e": "TNF inhibitor therapy",
    "correct_answer": "C",
    "explanation": "This patient's clinical presentation (e.g., sudden onset of knee joint swelling, nausea, weakness, and inability to move joint) and synovial fluid analysis (increased cell count with 88% neutrophils) are suspicious for a septic joint. Damaged joints (e.g., rheumatoid arthritis) serve as a nidus for infection and can predispose to septic arthritis. However, many rheumatoid arthritis (RA) patients with septic arthritis do not present acutely and may not have fever, chills, or peripheral leukocytosis. This is particularly common in elderly patients, which often leads to a delayed diagnosis. Although RA alone can present as \"pseudoseptic arthritis\" with florid acute synovitis and marked synovial fluid leukocytosis, septic arthritis must be excluded first. Diagnosis is usually suggested by synovial fluid showing elevated leukocytes (50,000-150,000 cells/µL), positive Gram stain, and positive fluid culture. However, synovial fluid Gram stain can be negative in 20-30% of septic arthritis cases, especially with gram-negative bacteria. Blood cultures are positive in 50% of patients and must always be obtained prior to antibiotic therapy. Treatment consists of IV antibiotics and joint drainage. This patient should be monitored clinically and started on IV antibiotics until culture results return. (Choice A) Colchicine would be effective in treating gouty arthritis, but the lack of crystals in this patient's synovial fluid makes this diagnosis unlikely. (Choice B) Intraarticular steroid injection should not be performed until infection is excluded. Repeated steroid injections are an important risk factor for septic arthritis. (Choice D) Prednisone is effective in RA flare-up, but infectious arthritis should be excluded first. (Choice E) TNF antagonists may be used cautiously in class 1 and 2 congestive heart failure (CHF), but are contraindicated in class 3 and 4 CHF. Since the patient had CHF exacerbation with a TNF antagonist, it would be inappropriate to restart the medication. In addition, TNF antagonists are not useful in acute joint inflammation.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_050",
    "system": "Rheumatology",
    "stem": "A 75-year-old man comes to the physician because of bilateral groin pain that is worse on the right side than the left. The pain is aggravated by any type of prolonged weight bearing. He feels particularly stiff in the hips in the mornings and after sitting in one place for a few hours. He was prescribed physical therapy and tramadol 4 months ago. After some temporary relief, he now feels more pain throughout the day, which limits his daily activities. He also received physical therapy last year, which provided only temporary relief. He denies any pain or swelling in his other joints or systemic symptoms. His daughter who accompanies him states that he had recently complained of dizziness. His other medical problems include type 2 diabetes mellitus, hypercholesterolemia, peripheral vascular disease, and benign prostatic hyperplasia. The patient lives at home by himself. His medications include aspirin, metformin, glipizide, hydrochlorothiazide, lisinopril, acetaminophen, and tramadol. His vital signs are within normal limits. Range of motion of the spine is normal and without pain. There is no scoliosis or excessive kyphosis. There is significant reduction in internal and external rotation at the hip joints accompanied by pain. Complete blood count and basic metabolic panel are unremarkable. ESR is 15 mm/hr. A radiograph of the right hip joint is shown here. Which of the following is the most appropriate next step in this patient's management?",
    "choice_a": "Increase tramadol to the maximal tolerated dose",
    "choice_b": "Offer intraarticular hyaluronic acid therapy",
    "choice_c": "Prescribe oxycodone as needed",
    "choice_d": "Refer for joint replacement surgery",
    "choice_e": "Start low-dose prednisone",
    "correct_answer": "D",
    "explanation": "This patient's presentation is consistent with advanced noninflammatory osteoarthritis (OA) with severe pain that limits his activities of daily life. Hip OA patients typically present after age 50 with groin pain and impaired internal rotation (<15°) and hip flexion (<115°). Diagnosis also requires two of the following: ESR <20 mm/hr, x-rays showing osteophytes (femoral or acetabular), or joint space narrowing (superior, axial, or medial) on hip radiographs. This patient's x-ray shows a complete loss of joint space, osteophytes, and sclerosis of the acetabular articular surfaces and the head of the femur. Nonpharmacologic treatments (e.g., weight loss, wedged shoe insoles) are recommended first and are effective in some patients. Acetaminophen is recommended as a first-line therapy for noninflammatory OA followed by NSAIDs as needed in patients with persistent symptoms. The next step is to try intraarticular steroid injections followed by intraarticular hyaluronic acid or short-term opioids (e.g., oxycodone) in refractory patients. Patients with persistent symptoms and significant impairment (such as this patient) usually require total hip replacement. Surgery should be performed early before the patient develops significant deformities, joint instability, contractures, or muscular atrophy. (Choices A and C) Tramadol is preferred over NSAIDs in patients with renal impairment; however, it can cause dizziness and confusion. Since this patient already has dizziness, increasing the dose is not appropriate. In addition, adding an opioid can cause more dizziness and confusion in this elderly patient. (Choice B) Intraarticular hyaluronic acid products are approved for knee osteoarthritis, but are more useful in OA of recent onset rather than severe advanced OA. These products have been studied for use in other joints, but are not yet FDA approved. (Choice E) Oral corticosteroids are not beneficial in OA; they are more useful in polymyalgia rheumatica (PMR). However, PMR usually presents with symmetric bilateral stiffness in the hips and shoulders as well as an elevated ESR.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_051",
    "system": "Rheumatology",
    "stem": "A 69-year-old woman with a long history of rheumatoid arthritis (RA) is brought to the physician by her daughter because of gait instability and near-falls. She was previously able to walk outdoors with the use of a cane, but she has required a walker for the past three months. She also notes that her mother has been holding onto the furniture when she walks from room to room. The patient denies any new joint pain or discomfort, muscle pain, or numbness in her arms and legs. The patient had RA treatment in the past with methotrexate. She underwent right-sided knee replacement seven years ago. Recent x-rays of the replaced joints did not demonstrate any fractures or prosthesis loosening. Her other medical problems include hypertension, hyperlipidemia, and lactose intolerance. Her current medications include low-dose prednisone, ibuprofen, lisinopril, hydrochlorothiazide, simvastatin, calcium, and vitamin D.\n\nHer blood pressure is 135/85 mm Hg supine and 130/90 mm Hg standing. Her pulse is 85/min and regular. Joint examination shows subluxation of the metacarpophalangeal joints and ulnar deviation bilaterally. There is mild synovitis of both wrists. Flexion is moderately restricted at the right hip. The knees show full range of motion. Motor strength is 4/5 in the proximal muscles of both upper and lower extremities. Deep tendon reflexes are 3+ in both the upper and lower extremities bilaterally with a few beats of unsustained clonus at the ankles. Her gait is unsteady. She cannot walk heel-to-toe without assistance. Proprioception is decreased at both ankles. Which of the following is the most appropriate next step?",
    "choice_a": "Check TSH and CPK levels",
    "choice_b": "Order an MRI of the cervical spine",
    "choice_c": "Refer to physical therapy for gait training",
    "choice_d": "Start treatment with anti-TNF agents",
    "choice_e": "Stop prednisone and re-evaluate in 2-4 weeks",
    "correct_answer": "B",
    "explanation": "This patient's presentation is most consistent with cervical myelopathy, likely due to atlanto-axial (C1-C2) subluxation from rheumatoid arthritis (RA). Risk factors for cervical subluxation include late-onset RA, elevated C-reactive protein, rapidly progressive peripheral joint disease, and early subluxation of peripheral joints. C1-C2 is the only spinal segment lined by a synovial membrane. Patients with RA can develop synovitis with erosions that destroy adjacent ligaments anchoring C1-C2, causing eventual subluxation of C1 relative to C2 (most often anteriorly). This creates pressure on the adjacent spinal cord and results in cervical myelopathy. Patients present with symptoms/signs listed in the above table. Plain radiographs are sometimes difficult to interpret but may show separation between C1 and C2. A spinal MRI is preferred to visualize the cervical spine for spinal cord compression, bony erosions, and synovitis. Patients with subluxation without signs of cord compression can be treated medically with neck collars and close monitoring with fall prevention. Patients with signs of cord compression usually require surgery for spinal stabilization. This patient is very symptomatic and should undergo cervical MRI. (Choice A) The serum CK and TSH would be elevated in thyroid myopathy, which usually presents with myalgias and diffuse muscle weakness rather than the gait and sensory findings seen in this patient. (Choice C) Physical therapy with gait training may be required in the future, but this patient first needs an MRI to evaluate for spinal cord disease. (Choice D) Anti-TNF therapy given early to RA patients may prevent future erosive joint disease and subluxations. However, this patient has chronic changes and would likely not benefit from this therapy at this time. (Choice E) Discontinuing prednisone in this patient will likely not help this patient since she has evidence of cervical disease that requires prompt imaging.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_052",
    "system": "Rheumatology",
    "stem": "A 36-year-old woman is seen in a clinic for follow-up evaluation. She was diagnosed with rheumatoid arthritis 3 months ago and was started on methotrexate and hydroxychloroquine. Which set of clinical features and serologic results at this visit is likely to predict the worst outcome in this patient?\n\n| | Number of swollen joints | CRP negative: < 8 mg/L | ANA titer negative: < 1:160 | Anti-CCP antibodies negative: < 50 units | Rheumatoid factor negative: < 40 u/mL |\n| :--- | :--- | :--- | :--- | :--- | :--- |\n| A. | 3 | 10 mg/L | 1:160 | Negative | 20 u/mL |\n| B. | 6 | 14 mg/L | 1:80 | 280 units | Negative |\n| C. | 6 | 14 mg/L | Negative | 280 units | 86 u/mL |\n| D. | 6 | 6 mg/L | Negative | 60 units | Negative |\n| E. | 4 | 14 mg/L | 1:640 | Negative | 20 u/mL |",
    "choice_a": "A",
    "choice_b": "B",
    "choice_c": "C",
    "choice_d": "D",
    "choice_e": "E",
    "correct_answer": "C",
    "explanation": "Early identification of rheumatoid arthritis (RA) patients with predictive factors for erosive disease can lead to more aggressive therapy with disease-modifying agents (Table). Positive anti-cyclic citrullinated peptide (CCP) antibodies with high titers predict radiographic progression and poorer functional outcomes in RA (Choices A, D, and E). Patients with both positive rheumatoid factor and anti-CCP antibodies may benefit from more aggressive disease-modifying antirheumatic drug therapy compared to other patients (Choice B). In addition, elevated ESR and CRP may also predict RA disease activity with poorer outcomes.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_053",
    "system": "Rheumatology",
    "stem": "A 38-year-old Puerto Rican woman comes to the physician because of fever and fatigue for the last two weeks. Over the past few days, she has developed bilateral pedal edema, ankle pain with walking, and painful bruises on her shins without any trauma. She denies diarrhea, vaginal discharge, or lower abdominal pain. Her weight has been stable. She has no travel history within the past year. She denies tobacco, alcohol, or illicit drug use. She is in a monogamous relationship with her long-standing, live-in boyfriend and uses oral contraceptives. Her temperature is 38.1 C (100.5 F), blood pressure is 122/70 mm Hg, and pulse is 86/min. Chest examination is unremarkable. The liver span is 11 cm and the tip of the spleen is not palpable. There are several violaceous, tender, raised lesions over both pretibial areas and 1+ pretibial edema. Both ankles are warm to the touch with some discomfort on passive movement. Complete blood count, comprehensive metabolic panel, and urinalysis are all within normal limits. Which of the following would be most useful in establishing the diagnosis in this patient?",
    "choice_a": "Chest imaging",
    "choice_b": "HIV testing",
    "choice_c": "Rheumatoid factor and anti-CCP antibodies",
    "choice_d": "Tuberculin skin testing",
    "choice_e": "Urethral and cervical cultures",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with Löfgren's syndrome, a variant of sarcoidosis. Löfgren's syndrome classically presents with the triad of hilar adenopathy, erythema nodosum, and acute polyarthritis. The arthritis typically involves both ankles (> 90% of cases) and other large joints in the lower extremities. Because the presentation is so classical, Löfgren's syndrome does not require a tissue biopsy and can be diagnosed based on clinical presentation alone. Patients with suspected Löfgren's syndrome usually require chest imaging (e.g., chest CT if chest x-ray is negative) to identify hilar adenopathy. This variant of sarcoidosis is usually self-limiting, with a favorable long-term prognosis. Although no controlled trials are available, NSAIDs usually offer symptomatic relief and corticosteroids are generally not utilized. (Choice B) HIV infection can present with systemic symptoms, as seen in this patient, but is not usually associated with ankle involvement and erythema nodosum. The rash in HIV is often generalized, maculopapular, and frequently involves the mucous membranes. (Choice C) Although rheumatoid arthritis may present with joint disease and fatigue, it is usually not associated with erythema nodosum. (Choice D) Tuberculosis may present with hilar adenopathy and erythema nodosum (very rare), but less commonly with ankle involvement. This patient should first undergo chest imaging to evaluate for hilar adenopathy before tuberculin skin testing, since her presentation is more consistent with Löfgren's syndrome. (Choice E) Disseminated gonococcal infections can present with either purulent monoarthritis or as a triad of skin rash, tenosynovitis, and polyarthralgia without purulent monoarthritis. Tenosynovitis is quite specific for gonococcal infection. The associated skin rash is usually pustular or vesiculopustular. Symmetric joint involvement is uncommon.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_054",
    "system": "Rheumatology",
    "stem": "A 53-year-old seamstress comes to the physician with pain and intermittent swelling in her fingers for the past 3 years. Symptoms involve primarily the distal interphalangeal joints and occur after she sews. A year ago, she was hospitalized with upper gastrointestinal bleeding and was found to have erosive gastritis and a duodenal ulcer. Her other medical problems include hypertension, type 2 diabetes mellitus, and fatty liver. Her current medications are glipizide, sitagliptin, lisinopril, and amlodipine. Her blood pressure is 133/70 mm Hg and pulse is 78/min. Her BMI is 26 kg/m². Her hands appear as shown below. There is bony swelling and tenderness of several distal interphalangeal joints. The remainder of the examination is within normal limits. Laboratory results are as follows:\n\nComplete blood count\nHemoglobin: 11.5 g/dL\nMean corpuscular volume: 77 fL\nPlatelets: 320,000/µL\nLeukocyte count: 5,200 cells/µL\nSerum chemistry\nPotassium: 4.2 mEq/L\nCreatinine, serum: 1.8 mg/dL\nCreatinine clearance: 40 mL/min\n\nLiver function tests are within normal limits. Which of the following is the most appropriate treatment for this patient?",
    "choice_a": "Acetaminophen",
    "choice_b": "Adalimumab",
    "choice_c": "Celecoxib",
    "choice_d": "Methotrexate",
    "choice_e": "Naproxen",
    "correct_answer": "A",
    "explanation": "This patient's presentation is consistent with osteoarthritis of the hands. She has a history of GI bleed and should avoid NSAIDs. A COX-2-specific NSAID (eg, celecoxib) may reduce the risk of GI bleed but has the same nephrotoxicity risk as a nonspecific NSAID. Since this patient has renal insufficiency, she should avoid all NSAIDs if possible (Choices C and E). Acetaminophen is the safest choice for this patient. Even in patients with advanced liver disease, tramadol and acetaminophen are safer than NSAIDs. (Choice B) Adalimumab (Humira), an anti-TNF antibody, is used in the treatment of rheumatoid arthritis or spondylarthritis. It is not indicated for the treatment of osteoarthritis. (Choice D) Methotrexate is indicated for treatment of rheumatoid arthritis. However, the absence of pain or swelling of the PIP or MCP joints makes rheumatoid arthritis unlikely in this patient. Psoriatic arthritis is also treated with methotrexate. However, this patient's occupation and lack of skin findings make psoriasis unlikely.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_055",
    "system": "Rheumatology",
    "stem": "A 71-year-old woman comes to the physician because of increasing mid-back pain for the last 2 weeks. The pain has not improved with ibuprofen and acetaminophen combined with oxycodone. The pain limits her ambulation, dressing, and housekeeping. Her temperature is 36.5 C (97.7 F), blood pressure is 130/70 mm Hg, pulse is 86/min, and respirations are 14/min. Her back examination shows moderate tenderness in the mid-back along the vertebral column. She has an otherwise unremarkable examination. A lateral spine film reveals diffuse osteopenia with a vertebral compression fracture of T10. Blood for a complete blood count, metabolic panel, alkaline phosphatase, and 25-hydroxy vitamin D has been obtained. Which of the following is most likely to provide early pain relief in this patient?",
    "choice_a": "Back brace",
    "choice_b": "Intravenous bisphosphonate",
    "choice_c": "Muscle relaxant",
    "choice_d": "Nasal calcitonin",
    "choice_e": "Vertebroplasty",
    "correct_answer": "D",
    "explanation": "This patient presents with a vertebral compression fracture, which is the most common type of osteoporotic fracture. Over 60% of osteoporotic vertebral compression fractures are clinically silent, but symptomatic patients can experience pain for 2-6 weeks or longer. The pain can radiate to the anterior abdomen and create a \"girdle of pain.\" Many patients are successfully treated with an NSAID and acetaminophen, sometimes with an opioid. When pain persists, intranasal calcitonin is often effective. Although calcitonin is not a first-line agent to treat osteoporosis, intranasal calcitonin has been shown to significantly reduce pain from vertebral compression fractures. (Choice A) A variety of back braces are used for vertebral compression fractures, but clear-cut data demonstrating efficacy is lacking. Moreover, back braces can limit mobilization and promote disuse osteoporosis. (Choice B) Both intravenous and oral bisphosphonates are used for long-term treatment of osteoporosis and may provide pain relief over time. However, they are not effective for acute pain relief from vertebral compression fractures. (Choice C) Muscle relaxants are somewhat beneficial for nonspecific acute low back pain, but have not been demonstrated to be helpful in the management of vertebral compression fractures. (Choice E) While uncontrolled studies suggested that vertebroplasty is beneficial for symptomatic compression fractures, prospective controlled trials have failed to demonstrate efficacy. Vertebroplasty is invasive and associated with some risk due to cement leakage, including nerve injury and pulmonary embolization.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_056",
    "system": "Rheumatology",
    "stem": "A 35-year-old immigrant from Turkey comes to the physician for painful mouth ulcers that occur frequently and are accompanied by malaise and poor appetite. He was diagnosed with \"canker sores\" many years ago and has tried different oral rinse solutions. He also reports muscle aches and poor sleep. One year ago, he had anterior uveitis; laboratory studies at that time revealed no abnormalities. His other medical problems include acid reflux disease, constipation, and acne. The patient takes over-the-counter antacids and fiber supplements. He has a 15-pack-year smoking history but does not use alcohol or illicit drugs. The patient's vital signs are normal. Physical examination shows 2 large ulcers on the buccal mucosa. There are papular and pustular skin lesions on the face. He has no joint swelling or deformities. He refuses laboratory work-up because each time blood is drawn he develops \"skin bumps and infection.\" Which of the following conditions is the most likely diagnosis?",
    "choice_a": "Behçet's disease",
    "choice_b": "Familial Mediterranean fever",
    "choice_c": "Recurrent herpes simplex infection",
    "choice_d": "Sarcoidosis",
    "choice_e": "Systemic lupus erythematosus",
    "correct_answer": "A",
    "explanation": "This patient has recurrent painful oral ulcers, uveitis, acneiform skin lesions, and positive pathergy test, all features suggestive of Behçet's disease. Behçet's disease is an inflammatory disease more common in men from the \"Silk Road\" region (eastern Asia to the Mediterranean Sea). All patients have recurrent and painful oral ulcerations. About 75% have genital ulcerations and/or skin lesions (eg, acne and erythema nodosum). Genital ulcerations often leave scarring, which is rarely seen in any other condition. Some patients present very early with superficial or deep vein thrombosis. Although most symptoms of Behçet's disease are caused by vasculitis, the renal and peripheral nervous systems are not affected, as occurs in other vasculitides. There are no laboratory studies to diagnose Behçet's disease; it is diagnosed clinically based on symptoms and pathergy test (Table). Nonspecific inflammatory markers such as ESR and CRP may be elevated. Treatment of Behçet's disease includes colchicine, glucocorticoids, or immunosuppressive agents. (Choice B) Patients with familial Mediterranean fever typically present with paroxysmal episodes of fever and concomitant serositis (peritonitis, pleuritis, or pericarditis). This patient does not have a fever or complaints of abdominal pain, making familial Mediterranean fever less likely. (Choice C) Herpes simplex infection can cause recurrent oral ulcers, keratitis, and, sometimes, uveitis. However, this patient's skin lesions and positive pathergy test are not consistent with herpes infection. (Choice D) Sarcoidosis involves the lungs in > 90% of patients and can present with uveitis, joint pain, and skin lesions (eg, erythema nodosum). However, painful mucocutaneous lesions and normal chest x-ray are not common with sarcoidosis. (Choice E) Patients with systemic lupus erythematosus can present with oral ulcers; however, these are usually painless. Behçet's disease is most likely given the positive pathergy test.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_057",
    "system": "Rheumatology",
    "stem": "A 55-year-old man comes to the physician complaining of joint pain. He has had 2 years of intermittent and mild arthralgias of his hands, wrists, and shoulders at night. He recently developed pain in his wrists and hand pain with flexion mainly at the second and third metacarpophalangeal joints. He has no morning stiffness or warmth or redness around his joints. There is no history of fever, weight loss, or subcutaneous nodules. His medical problems include type 2 diabetes mellitus diagnosed 5 years ago and hypertension and hyperlipidemia diagnosed 3 years ago. Mild liver function abnormalities were detected and attributed to possible fatty liver 2 years ago. His medications include metformin, lisinopril, and rosuvastatin. The patient's vital signs are within normal limits. BMI is 34 kg/m². There is swelling of the metacarpophalangeal joints bilaterally. He has no synovial swelling or abnormalities of his proximal and distal interphalangeal joints. There are no abnormalities of the wrists, shoulders, or hips. X-rays of the hands and wrists reveal narrowing of the third, fourth, and fifth metacarpophalangeal joints with hook-shaped osteophytes at the metacarpal heads. Erythrocyte sedimentation rate is 15 mm/hr. Which of the following would most likely show the cause of this patient's current symptoms?",
    "choice_a": "Discontinuation of rosuvastatin",
    "choice_b": "HLA-B27 testing",
    "choice_c": "Rheumatoid factor and anti-citrullinated peptide antibodies",
    "choice_d": "Serum transferrin saturation",
    "choice_e": "Uric acid levels",
    "correct_answer": "D",
    "explanation": "This patient's diabetes mellitus, atypical degenerative joint disease, and history of liver function abnormalities suggest likely hemochromatosis. Differentiating idiopathic primary osteoarthritis from secondary forms of osteoarthritis can be difficult. Secondary causes of osteoarthritis include trauma, underlying inflammatory arthritis, infection, calcium pyrophosphate deposition disease, and metabolic disorders (eg, hemochromatosis). Primary osteoarthritis of the hands most commonly involves the proximal and distal interphalangeal joints and the first metacarpophalangeal (MCP) joint. This patient's narrowing of the third, fourth, and fifth MCP joints and the findings of hook-shaped osteophytes strongly suggest hemachromatosis as the cause of the arthritis. Secondary osteoarthritis occurs in 40-60% of patients with hemochromatosis and can present with arthralgias, hand involvement (eg, wrist), and shoulder pain (see table). Screening this patient for hemochromatosis initially with serum transferrin saturation is the next appropriate step, as high levels correlate with arthritis. (Choice A) Rosuvastatin may cause mild liver abnormalities and myalgias in the proximal muscles but typically does not cause hand arthritis, as seen in this patient. (Choice B) HLA-B27 is linked to spondyloarthropathies (eg, ankylosing spondylitis, reactive arthritis, psoriatic arthritis). However, this patient does not have other clinical features (eg, back pain, inflammatory eye disease, enthesitis, sausage digits) seen in many spondyloarthropathies. (Choice C) Although hemochromatosis can sometimes mimic rheumatoid arthritis (RA), this patient does not have other clinical features (eg, morning stiffness, subcutaneous nodules) of RA. In addition, the low sedimentation rate makes this less likely. (Choice E) Chronic tophaceous gout typically results in bone erosions with characteristic thin \"overhanging\" edges.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_058",
    "system": "Rheumatology",
    "stem": "A 69-year-old man comes to the office with severe pain in his left knee for the past 48 hours. The pain began in the middle of the night. He denies trauma and has no fever or chills. He had an episode of pain in his right great toe 3 years ago that he was told was gout. He was given treatment to prevent a recurrence but has been noncompliant. His past medical history is significant for hypertension, stage 3 chronic kidney disease, and gastro-esophageal reflux disease (GERD). His current medications are atenolol, fosinopril, and lansoprazole. He appears to be in mild distress and has difficulty with ambulation. His temperature is 36.7 C (98 F), blood pressure is 136/94 mm Hg, pulse is 84/min, and respirations are 14/min. Cardiovascular, pulmonary, and abdominal exams are unremarkable. His left knee is tender, warm, and erythematous with a small effusion. There is decreased range of motion in all aspects. There are no abnormalities of any other joints. The patients labs reveal:\n\nComplete blood count\nHematocrit: 38%\nPlatelets: 280,000/µL\nSerum chemistry panel\nSodium: 140 mEq/L\nPotassium: 4.2 mEq/L\nChloride: 90 mEq/L\nBicarbonate: 24 mEq/L\nBlood urea nitrogen: 20 mg/dL\nCreatinine: 2.4 mg/dL\nCalcium: 9.4 mg/dL\nBlood glucose: 100 mg/dL\nUric acid, serum: 9.0 mg/dL\n\nPlain films of the knee are remarkable only for evidence of degenerative joint disease. On arthrocentesis of the left knee, a small amount of fluid was obtained with a negative gram stain and 13,000/mm3 white blood cells (50% polymorphonuclear cells). Needle-shaped, negatively birefringent crystals are present on polarized microscopy. Which of the following is the best treatment option for this patient?",
    "choice_a": "Allopurinol",
    "choice_b": "Febuxostat",
    "choice_c": "Indomethacin",
    "choice_d": "Intra-articular corticosteroids",
    "choice_e": "Low-dose colchicine",
    "correct_answer": "D",
    "explanation": "This patient presents with acute gout, which usually causes mono-arthritis but can also affect multiple joints in some patients. The goal of therapy is acute pain relief with prompt resolution. Prophylactic treatment is indicated for the prevention of future attacks, chronic tophaceous gout, and avoidance of joint disability. The table above summarizes the main therapies for acute gout. This patient with chronic kidney disease (CKD) has a mono-articular flare of gout, and intra-articular corticosteroids are the most effective and safest therapy. When systemic corticosteroids are used, there is a risk of rebound attacks once the drug is discontinued. (Choice A) Allopurinol is a xanthine oxidase inhibitor that decreases uric acid production and prevents recurrent attacks of gouty arthritis. It is not, however, indicated for the treatment of acute gouty arthritis. Allopurinol's dose must be decreased in patients with CKD (GFR < 30-50 ml/min) because its metabolite (oxypurinol) can accumulate in the body and cause serious liver function abnormalities and a severe desquamating skin rash. (Choice B) Febuxostat is a non-purine inhibitor of xanthine oxidase, which decreases serum levels of uric acid and is less dependent on renal elimination than allopurinol. Febuxostat is used to treat chronic hyperuricemia and prevent gouty arthritis, but is not indicated for acute gout. (Choice C) Indomethacin and other NSAIDs are preferred for treating acute gouty arthritis, but they cause acute kidney injury (AKI) by decreasing renal blood flow and GFR (due to decreased production of vasodilatory eicosanoids). As a result, NSAIDs are contraindicated in this patient with stage 3 CKD. (Choice E) Colchicine is effective for acute gouty arthritis, but is limited by frequent gastrointestinal side effects and is a second-line agent. Colchicine is less effective than corticosteroids. Chronic administration in CKD patients can lead to colchicine accumulation in the blood and cause significant neuromyopathy.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_059",
    "system": "Rheumatology",
    "stem": "A 52-year-old woman with recently diagnosed rheumatoid arthritis comes to the physician complaining of decreased appetite, sore throat, and mild nausea for the past 2 weeks. She has no fevers, vomiting, or dark or bloody stools. She has been treated with oral naproxen daily and methotrexate weekly for the last 6 weeks with improvement of joint symptoms. She also takes ranitidine for occasional heartburn and senna for chronic constipation. Her temperature is 36.7° C (98°F), blood pressure is 120/70 mm Hg, and pulse is 78/min. Oral examination shows several shallow ulcers on the buccal mucosa and hard palate as well as mild pharyngeal erythema. No enlarged lymph nodes are palpated. There are no skin rashes. The abdomen is soft and nontender. The small hand joints are mildly swollen and tender to palpation bilaterally. A small effusion is present in the right knee. Laboratory results are as follows:\n\nComplete blood count\nHemoglobin: 11.4 g/dL\nPlatelets: 260,000/µL\nLeukocytes: 9,200/µL\nNeutrophils: 67%\nEosinophils: 1%\nSerum chemistry\nCreatinine: 0.8 mg/dL\n\nLiver function tests are normal. Which of the following is the best next step in management of this patient?",
    "choice_a": "Discontinuation of methotrexate",
    "choice_b": "Discontinuation of naproxen",
    "choice_c": "Oral acyclovir",
    "choice_d": "Short course of prednisone",
    "choice_e": "Vitamin supplementation",
    "correct_answer": "E",
    "explanation": "This rheumatoid arthritis patient's symptoms suggest common methotrexate (MTX) toxicity. MTX depletes folic acid by interfering with its metabolism and leads to possible complications, including stomatitis and megaloblastic anemia. Stomatitis usually occurs with high-dose methotrexate but can also occur at low doses. Stomatitis can persist for days to weeks, interfere with eating, and may lead to premature discontinuation of MTX. All patients taking MTX should receive folic acid at 1 mg/day with dose increases to 5 mg/day based on symptoms. Folic acid supplementation usually improves stomatitis. Patients without symptom improvement after folic acid supplementation may need to discontinue MTX (Choice A). Other common toxicities such as fever, gastrointestinal disturbances, and rash usually occur within days of the weekly MTX dose. Fever can be caused by MTX, but infection must be excluded. Gastrointestinal complaints (eg, nausea, upset stomach) may be relieved with histamine H2 blockers or proton pump inhibitors. A punctuate, macular rash affecting the extremities but sparing the trunk may occur, but it usually fades by the next week's dose. Life-threatening complications include direct hepatocyte damage causing hepatotoxicity or worsening hepatotoxicity in viral hepatitis patients, pulmonary damage, myelosuppression, and nephrotoxicity. Chest x-ray is required prior to starting MTX. All patients should also have a viral hepatitis panel prior to MTX therapy and either be treated or receive therapy to suppress viral replication. Periodic monitoring includes serum aminotransferase, albumin, complete blood count, and creatinine. (Choice B) Naproxen toxicity usually presents with anion gap metabolic acidosis, worsening renal dysfunction, hypertension, and anemia due to bleeding gastrointestinal ulcers. (Choice C) Oral acyclovir treats herpes simplex labialis, which usually presents with painful vesicles at the vermillion border of the lips. This patient does not have a vesicular eruption. (Choice D) Prednisone can improve rheumatoid arthritis symptoms and treat allergic reactions. However, this patient's symptoms have improved on MTX and do not require prednisone. She also does not have a diffuse rash or eosinophilia to suspect an allergic reaction.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_060",
    "system": "Rheumatology",
    "stem": "A 65-year-old man comes to the physician for evaluation of a recent x-ray abnormality. Three months ago, he experienced a mild episode of diverticulitis. An abdominal film at that time revealed an abnormality in the pelvis. His diverticular disease has abated and he presents for follow-up. The patient occasionally has some mild aching pain in his left hip and groin area that he attributes to arthritis. He has chronic low back pain that is worse on arising in the morning and improves after ambulation. The patient has had no fever, chills, or weight loss. He gets up to urinate about three times a night and says that his urine stream isn't what it used to be. He has intermittent gastroesophageal reflux and hypertension. His current medications include lisinopril, lansoprazole, ibuprofen, baby aspirin, and a multivitamin. The patient appears healthy on examination. His temperature is 36.9°C (98.5 F), blood pressure is 138/88 mm Hg, pulse is 72/min, and respirations are 14/min. BMI is 29 kg/m². His general examination is within normal limits. Digital rectal examination shows normal sphincter tone and a mildly enlarged soft prostate. There is good range of motion of his hips. There is limited range of motion of his back. He has no motor or sensory deficits of his lower extremities, and reflexes are 2+ and symmetrical. Laboratory results are as follows:\n\nComplete blood count\nHematocrit: 40%\nPlatelets: 240,000/µL\nLeukocytes: 7,500/µL\nSerum chemistry\nSodium: 140 mEq/L\nPotassium: 4.4 mEq/L\nChloride: 102 mEq/L\nBicarbonate: 24 mEq/L\nCreatinine: 1.2 mg/dL\nCalcium: 9.4 mg/dL\nGlucose: 100 mg/dL\nLiver function studies\nBilirubin, total: 0.3 mg/dL\nAlkaline phosphatase: 310 U/L\nAspartate aminotransferase: 12 U/L\nAlanine aminotransferase: 24 U/L\nProstate-specific antigen: 2.1 ng/mL\n\nA review of the x-rays reveals thickening of the femoral neck and diffuse sclerosis of bone that is most prominent in the left hemi-pelvis. Which of the following would be the most appropriate next step?",
    "choice_a": "Bone biopsy",
    "choice_b": "Bone scan",
    "choice_c": "Bone turnover markers",
    "choice_d": "PTH and vitamin D2 levels",
    "choice_e": "Ultrasound-guided prostate biopsy",
    "correct_answer": "B",
    "explanation": "This patient's presentation suggests Paget disease. The primary defect is abnormal osteoclasts causing focal areas of accelerated bone resorption. This is followed by increased osteoblast activity, resulting in formation of structurally weaker bone with areas of sclerosis. Commonly affected sites include the skull, thoracic and/or lumbar spine, pelvis, and proximal femurs. Asymptomatic patients are usually diagnosed by routine imaging obtained for another reason or elevated alkaline phosphatase. Depending on the involved site, symptomatic patients may present with persistent and constant bone pain made worse with weight bearing. Laboratory findings usually show an elevated serum and bone alkaline phosphatase. Additional bone turnover markers include procollagen type I N-terminal propeptide (PINP), serum C-telopeptide (CTX), urinary N-telopeptide (NTX), and urinary hydroxyproline. However, bone markers may not be elevated in active disease and are not routinely measured for diagnosis or monitoring (Choice C). Plain radiographs obtained during the early stages of disease show lytic lesions; eventually with osteoblastic response mixed lytic/sclerotic lesions are seen. Elevated alkaline phosphatase levels with the classic radiographic findings (as in this patient) are diagnostic for Paget disease. Once the disease is diagnosed, a bone scan should be obtained in all patients to determine the extent and distribution of bony lesions as the sites involved rarely change over time. In asymptomatic patients, treatment with bisphosphonates is indicated if the bone scan shows active disease at sites where complications could occur (eg, skull, spine, weight-bearing bones). (Choice A) Bone biopsy is usually not needed to confirm or monitor Paget disease in patients with the typical findings as seen in this patient. (Choice D) Parathyroid hormone and vitamin D2 levels would indicate hyperparathyroidism or vitamin D deficiency. However, this patient's calcium is normal and neither condition usually causes the x-ray findings he exhibits. (Choice E) The radiographic features of osteoblastic metastatic prostate cancer can be similar to the typical findings of Paget disease. However, this patient's normal digital rectal examination and prostate-specific antigen level make this less likely.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  },
  {
    "id": "SYSTEM_061",
    "system": "Rheumatology",
    "stem": "A 55-year-old man comes to the physician for evaluation of left foot drop. Two weeks ago, he was hospitalized for a severe exacerbation of diverticulitis and was treated with intravenous antibiotics and bed rest. He was discharged 3 days ago and noticed that his left foot felt \"weak\" when he tried to walk. He also reports numbness on the top of his foot and the outer part of his leg. The patient has a history of type 2 diabetes mellitus, hypertension, and hyperlipidemia. His medications include metformin, lisinopril, and atorvastatin. On examination, he has a steppage gait. There is weakness of left foot dorsiflexion and eversion. Sensation to pinprick and light touch is decreased over the lateral aspect of the left lower leg and the dorsum of the foot. The right leg is normal. Ankle and knee reflexes are 2+ and symmetric bilaterally.",
    "choice_a": "Cerebrovascular accident",
    "choice_b": "Guillain-Barré syndrome",
    "choice_c": "Injury to the common peroneal nerve",
    "choice_d": "L4-L5 disc herniation",
    "choice_e": "Vitamin B12 deficiency",
    "correct_answer": "C",
    "explanation": "This patient's clinical presentation is consistent with a common peroneal nerve (also known as common fibular nerve) injury. This nerve is a branch of the sciatic nerve that travels around the head of the fibula, making it susceptible to compression or injury from prolonged bed rest, leg casting, or trauma. Injury typically results in \"foot drop\" due to weakness of the muscles in the anterior and lateral compartments of the leg, which are responsible for foot dorsiflexion and eversion. Patients often compensate with a \"steppage gait,\" lifting the knee higher than normal to prevent the toes from dragging. Sensation is usually decreased over the lateral leg and the dorsum of the foot. Refleces are typically preserved as the peroneal nerve does not mediate the patellar or Achilles tendon reflexes. (Choice A) Stroke is a less common cause of foot drop and typically occurs in patients with residual hemiparesis. This patient has loss of sensation in the common peroneal distribution. (Choice B) Guillain-Barré syndrome causes a progressive, symmetric, ascending weakness with paresthesias and loss of reflexes. This patient's symmetric loss of only ankle reflexes is common in the elderly and does not suggest specific pathology. The unilateral weakness in the distribution of a single nerve makes Guillain-Barré unlikely. (Choice D) L4-5 disc herniation can cause foot drop but is usually associated with back pain. (Choice E) Vitamin B12 deficiency causes an ataxic, wide-based gait with impaired balance, and neuropathy is generally symmetric and slowly progressive rather than focal and acute as seen in this patient.",
    "source": "ABIM - Rheumatology, Orthopedics Sports - 2.pdf"
  }
]