[
  {
    "id": "SOCIAL_001",
    "system": "Social Sciences",
    "stem": "An 84-year-old man is admitted to the hospital with multilobar pneumonia and respiratory failure that required emergent intubation and mechanical ventilation in the emergency department. He is accompanied by his 2 daughters. Medical history is significant for poorly controlled type 2 diabetes mellitus, end-stage renal disease, moderate chronic obstructive pulmonary disease, and hypertension. The patient was recently diagnosed with hepatocellular carcinoma with bone and lung metastases. The patient is started on broad-spectrum antibiotics and transferred to the intensive care unit for continued care. Shortly after arrival, his blood pressure is 76/54 mm Hg despite aggressive intravenous fluid hydration. The patient does not have a written advance directive, but his daughters say that he has made it clear that he \"wants everything done\" in the event of illness. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Consult with the hospital ethics committee regarding withholding care on the basis of futility",
    "choice_b": "Do not initiate aggressive life-sustaining treatment, explaining that it is inappropriate given the patient's poor prognosis",
    "choice_c": "Initiate aggressive life-sustaining treatment but do not perform CPR",
    "choice_d": "Initiate aggressive life-sustaining treatment but continue discussing prognosis and introduce the topic of palliative care",
    "choice_e": "Initiate and continue aggressive life-sustaining treatment in accordance with the patient's reported wishes",
    "correct_answer": "D",
    "explanation": "Critically ill patients in the intensive care unit (ICU) may be unable to communicate their wishes, placing the burden on family members who are often ill prepared and may have a limited understanding of interventions and the prognosis for recovery. In the absence of an advance directive, the physician should initiate aggressive life-sustaining treatment in accordance with the patient's wishes as communicated by his daughters. At the same time, the physician should educate the family about the patient's disease process, prognosis, and potential ICU interventions, including options for palliative comfort care as an alternative to aggressive management. Effective communication can often help align the goals of a patient and family with those of the ICU team, thereby promoting patient and family values, improving the quality of dying, and reducing family distress. ICU palliative care includes symptom management that prioritizes patient comfort and dignity and provides emotional and spiritual support for patients and families. (Choice A) The hospital ethics committee can be helpful in intractable situations in which there is irreconcilable disagreement among family members about the plan of care. In this case, the next step is to engage the family in a discussion of the patient's prognosis and palliative care options. (Choices B and C) It is essential for the clinician to respect the patient's reported wishes and to engage the family in discussion about treatment options. It would be inappropriate for the physician to make a unilateral decision regarding which, if any, life-sustaining measures should be withheld at this time. (Choice E) Although the family members' decision should be respected, it is important to engage them in further discussion of prognosis and treatment options, including palliative care. Educational objective: Physicians practicing in the intensive care unit must engage patients and families and provide an accurate picture of the disease process and prospects for recovery. In cases of severe illness and a high likelihood of death, patients and families should be made aware of palliative care treatment options that prioritize comfort and quality of life.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_002",
    "system": "Social Sciences",
    "stem": "An 86-year-old man is admitted to the intensive care unit (ICU) because of multilobar pneumonia. His ICU course was complicated by acute respiratory distress syndrome, which required him to be placed on mechanical ventilation. He has been in the ICU for 3 days and has shown no progress despite broad spectrum antibiotic therapy. He has also developed worsening acute kidney injury, third spacing of fluids, and persistent hypotension despite vasopressor support. His other medical problems include stage 3 chronic kidney disease, congestive heart failure, coronary artery disease, cerebrovascular accident with mild residual right hemiparesis, and advanced prostate cancer. The patient lives alone at home and has no advance directives on record. He has 2 sons and 3 daughters who have arrived at the ICU and want to speak with the ICU physician. A family meeting is arranged in an adjacent private conference room. After every person is comfortably seated, everyone in the room, in turn, introduces themselves. The family members look apprehensive. Which of the following is the most appropriate response by the ICU physician?",
    "choice_a": "Have you ever talked to your father about what his wishes would be if he became critically ill?",
    "choice_b": "To make sure we are on the same page, can you share with me your understanding of your father's condition?",
    "choice_c": "Your father is very sick. We are doing everything we can to help his body recover from the infection.",
    "choice_d": "I wish I could tell you that your father is going to pull through.",
    "choice_e": "Some people want to hear about what I think may happen, while others do not want this information. Which would you prefer?",
    "correct_answer": "B",
    "explanation": "Critically ill patients cannot make their own medical decisions and often lack advanced directives, thus the medical team must frequently rely on surrogate decision makers to guide further care. Family members of dying ICU patients are often dissatisfied with the communication provided by health care providers and commonly experience anxiety, depression, and post-traumatic stress disorder in the aftermath of the hospitalization. Family meetings can improve communication by informing family members of the patient's condition (e.g., prognosis and current treatment plan), answering any questions they may have, and including the patient's surrogates in the decision making process (e.g., end-of-life and palliative care). Prior to explaining the patient's condition, it is important to begin the conversation with an open-ended question that asks how much the family members already know. Understanding the family's degree and depth of knowledge and their emotional state allows for better organized discussions and guides the remainder of the family meeting. SPIKES is a useful model and mnemonic for framing family meeting discussions and breaking bad news. SPIKES incorporates key step-by-step communication techniques for assessing the family's perception of the patient's condition and facilitating information flow to families. (Choice A) When ICU interventions are unlikely to improve the patient's condition, it is appropriate to discuss transitioning to palliative care. One can ask the family what they believe the patient would want if he or she could speak. However, this topic should be approached after providing the family information regarding the patient's diagnosis, prognosis, and current therapy. (Choice C and D) Providing information about the patient's diagnosis, current condition, and prognosis should be done after assessing the family's perception of the patient's current condition and how much information they wish divulged. (Choice E) It is important to find out how much information the family wants to know, but this should be done after assessing the family's perception of the patient's condition. Educational objective: At the start of a family meeting, family members should be asked how much they know about the patient's condition. The SPIKES mnemonic is a useful model for framing the family meeting discussion and breaking bad news.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_003",
    "system": "Social Sciences",
    "stem": "A patient dies in the hospital after a rare but fatal adverse event related to a drug-drug interaction. In response, the hospital implements a more comprehensive database of drug-drug interactions in its computerized order entry system. The updated database increases the number of recognized drug interactions from 60,000 to 200,000. A year later, however, the quality improvement team finds that the number of prescribed drugs with high-risk interactions has increased since the database update. Which of the following is the most likely explanation for this finding?",
    "choice_a": "Alert fatigue",
    "choice_b": "Increased workload",
    "choice_c": "Overutilization",
    "choice_d": "Poor interoperability",
    "choice_e": "Risk homeostasis",
    "correct_answer": "A",
    "explanation": "This case study illustrates an example of alert fatigue, a recognized adverse effect of electronic health records, order entry systems, and other computerized devices. Alert fatigue occurs when health care personnel are bombarded by numerous automated alerts and warnings of low clinical consequence (ie, low signal-to-noise ratio) and become conditioned to ignore all alerts, including those with high clinical significance. A study in an intensive care unit found an average of >180 audible alarms/bed/day, the large majority of which were clinically inconsequential. Automated alerts are commonly utilized in health care settings, with some types (eg, drug-drug interactions) mandated by regulations regarding electronic health records; their use has been associated with decreased medication error rates. However, the realized benefits tend to be more modest than anticipated, possibly due to high override rates. To mitigate the risk of alert fatigue, it is recommended that health care facilities measure clinically meaningful outcomes before and after implementing or changing alerting systems. Specific recommendations are listed in the table. (Choice B) Excessive work hours (eg, resident physician on-call schedules) or workloads are associated with an increased frequency of medical errors. However, alert fatigue can occur with any change in workflow even if workload is held constant. (Choice C) Overutilization refers to excessive health care consumption by individual patients, leading to use of diagnostic tests and treatments that do not improve outcomes. Overutilization would lead to reduced benefit per service rather than increased error rate. (Choice D) Interoperability refers to the capacity of one system to interact correctly with another. An example of poor interoperability would be a new computerized order entry system that does not give proper commands to an automated pharmacy dispensing system. (Choice E) Risk homeostasis is the tendency to compensate for a decline in risk in one area with an increase in risk taking in another. An example would be an increase in unsafe driving habits after buying a car with upgraded airbags and safety systems. Educational objective: Alert fatigue occurs when health care personnel are bombarded by numerous automated alerts and warnings of low clinical consequence and become conditioned to ignore all alerts, including those with high clinical significance.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_004",
    "system": "Social Sciences",
    "stem": "A physician smells alcohol on the breath of one of her physician colleagues. The concerned physician confronts her colleague, but he adamantly denies consuming any alcohol. Nonetheless, the concerned physician insists that the colleague go home for the day. The colleague initially protests saying, \"I just had a couple of beers last night!\" However, he eventually leaves for the day voluntarily. The concerned physician plans to discuss the issue further with her colleague the next day and encourage him to get help. The colleague comes to work the next day again smelling of alcohol. Which of the following is the most appropriate course of action?",
    "choice_a": "Assist the physician in obtaining substance abuse treatment",
    "choice_b": "Report the physician only if there is evidence that patient care has been negatively affected",
    "choice_c": "Report the physician to his supervisor",
    "choice_d": "Report the physician to the state's physician health program",
    "choice_e": "Urge the physician to voluntarily engage with the state physician health program",
    "correct_answer": "D",
    "explanation": "Although physicians may detect impairment in their colleagues, they are often reluctant to report an impaired physician due to concerns regarding potential professional and personal consequences. However, patient safety must always take priority. When there are concerns that a physician may be too impaired to practice medicine safely due to a substance use disorder, psychiatric illness, or medical condition (eg, neurodegenerative disease) physicians are ethically obligated to report suspected physician impairment to the appropriate state regulatory body. In most states, a physician health program (PHP) would be the appropriate regulatory body, but in the few states without a PHP, physicians would file a report directly with the state medical board. (Choice A) It would be inappropriate for a concerned colleague to intervene in the medical care of a potentially impaired physician. The PHP can assist the impaired physician in obtaining necessary evaluation and/or treatment. (Choice B) The physician's alcohol abuse is a risk to patient care and safety. Reporting a physician to the PHP does not require evidence of malpractice. (Choice C) Although it may be appropriate to notify the potentially impaired physician's supervisor, this action alone would not discharge the concerned physician's ethical duty to report the impaired physician to the state PHP. (Choice E) Efforts to discuss concerns directly with the physician have already been met with denial and there is continued evidence of impairment that places his patients at risk. It would be inappropriate to postpone notifying the state PHP. Educational objective: Physicians have an ethical responsibility to report an impaired colleague to the appropriate state regulatory body (ie, a physician health program or state medical board).",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_005",
    "system": "Social Sciences",
    "stem": "A 53-year-old man with end-stage renal disease is admitted to the hospital for complications related to his arteriovenous fistula. Medical history includes type 1 diabetes, diabetic nephropathy, diabetic neuropathy, and diabetic ophthalmopathy. During the daytime nurse's assessments, the patient is consistently hypertensive with systolic blood pressure of 160-170 mm Hg, both pre- and post-dialysis, despite adherence to his antihypertensive regimen. The nurse phones the physician, who orders that the patient be started that evening on hydralazine 25 mg 3 times a day. However, the nurse instead enters an order for hydroxyzine 25 mg 3 times a day. The order for hydroxyzine is processed and approved by the pharmacy. After retrieving the patient's medications, the evening-shift nurse is surprised the patient is taking hydroxyzine as he has not reported any itching. Before administering hydroxyzine, the nurse pages the physician who wrote the order and asks for clarification. The physician recognizes what has happened and corrects the order. Which of the following is the most appropriate course of action in response to the error?",
    "choice_a": "Ask the daytime nurse to inform the patient of the error and its prompt correction",
    "choice_b": "Do nothing as the error was corrected and there was no harm",
    "choice_c": "Inform the patient of the error and assure him that he received the correct medication",
    "choice_d": "Report the error to the hospital administration through a medical event-reporting system",
    "choice_e": "Submit a detailed description of the event to the Joint Commission",
    "correct_answer": "D",
    "explanation": "In this scenario, a medication error is identified and corrected before the patient received the wrong medication and so the patient is unharmed. Such incidents are characterized as \"near-miss\" events, as a negative outcome could have occurred but did not, either by chance or, as in this case, due to timely intervention. Near misses are much more common than adverse events but their root causes are similar. Therefore, identifying root causes of near misses can help prevent future adverse events. This event should be reported to the hospital administration (eg, using a medical event-reporting system) to identify weaknesses in the system of care that jeopardize patient safety (eg, lack of a standardized process for verbal orders) and to help develop formal corrective measures. When an error is corrected before a patient is harmed, the physician should use professional judgment when considering whether to inform the patient. Disclosing the near miss may be distressing to some patients or confuse them unnecessarily. However, if the patient is aware of the near miss, disclosure is recommended as it will decrease anxiety and improve trust and confidence. In contrast, any medical error that impacts patient care or causes harm to a patient should be promptly disclosed. (Choices A and C) Disclosure to the patient is not mandatory as there was no impact on the patient's care. However, if the patient is aware of the medication error, then disclosure would be advisable to preserve the physician-patient relationship. (Choice B) Although there was no harm to the patient, the incident should be reported to hospital administration for analysis to help prevent similar medication errors that could lead to adverse events. (Choice E) It is not necessary to report to the Joint Commission a near miss that was corrected before reaching the patient. Educational objective: Near-miss events should be reported to the hospital administration as analysis can assist in the identification and correction of errors that jeopardize patient safety.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_006",
    "system": "Social Sciences",
    "stem": "A 65-year-old man is recovering in the post-anesthesia care unit after coronary artery bypass graft procedure for left main artery disease. The patient's operation was uncomplicated and his current condition is stable. Prior to the procedure, the patient requested that no information about his medical condition be released. A close friend of his is designated as the health care power of attorney. While the patient is recovering from anesthesia, the physician is approached by the patient's wife and daughter, who are very concerned about his condition. They request information about his condition, the results of surgery, and his prognosis. Which of the following is the most appropriate course of action?",
    "choice_a": "Disclose that the patient is stable and schedule an appointment to discuss his condition further",
    "choice_b": "Explain that information cannot be provided without the physician first speaking with the patient",
    "choice_c": "Inform the wife and daughter that the patient is stable and surgery was successful",
    "choice_d": "Provide information to the wife only, as she is the next of kin",
    "choice_e": "Refer the wife and daughter to the patient's health care power of attorney",
    "correct_answer": "B",
    "explanation": "Physicians are ethically and legally obligated to preserve the confidentiality of protected health information (PHI). Apart from the limited circumstances in which PHI may be disclosed without consent (eg, harm to self or others, physical or sexual abuse, neglect, violent injuries), physicians should not disclose PHI against a patient's wishes. This includes disclosure to all family members (Choices C and D). Whenever possible, physicians should preemptively discuss patient PHI disclosure preferences. When this patient recovers from anesthesia, he should be approached regarding permission to disclose information to his wife and daughter. (Choice A) To alleviate acute family distress, some physicians may make an initial general statement regarding the patient's medical stability before obtaining express permission to disclose further information. However, in this case, strict confidentiality should be maintained as this patient expressly requested that no information about his condition be released. (Choice E) This patient will likely recover from anesthesia shortly and should be approached at that time to clarify his preferences for disclosure regarding his wife and daughter. Educational objective: Confidentiality is a basic legal and ethical principle of medical care. Permission should be obtained prior to disclosing information to other parties, including family members.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_007",
    "system": "Social Sciences",
    "stem": "A physician practices oncology in a suburb 15 miles outside of a large city. She presently refers patients in need of special imaging studies to one of two centers in the city depending on the patient's home location and medical history. Recently, a respected radiologist informs the physician that he has joined a for-profit imaging center with the latest equipment and technology. The company is considering opening a new location in the physician's area. The radiologist states that this center would provide the highest quality of care and that an opportunity now exists to invest in this new center. He adds that more local investors will increase the likelihood that the company will locate their new center in the physician's suburb. The physician is interested in investing in the new center. Which of the following most accurately describes the conflict of interest regarding the physician's referral practices and potential investment in this center?",
    "choice_a": "There is a conflict of interest and referrals to the center would be prohibited by law",
    "choice_b": "There is a conflict of interest and the physician's investment should be disclosed to patients",
    "choice_c": "There is no conflict of interest as the new center would provide enhanced quality of care",
    "choice_d": "There is no conflict of interest if the physician also provides referrals to other radiology centers",
    "choice_e": "There is no conflict of interest, provided the physician does not preferentially recommend this center",
    "correct_answer": "B",
    "explanation": "Trust in the medical profession demands that even the appearance of conflict of interest be avoided. A primary responsibility of physicians is to ensure appropriate medical therapy and prioritize patient interests regardless of the impact on the physician's own practice, financial arrangements, and investments. Referral to a radiology center in which the physician has invested represents a financial conflict of interest as there is potential for financial incentives to influence the physician's medical judgment (consciously or unconsciously). Studies have demonstrated that self-referral can result in the overutilization of imaging. The physician's investment should be disclosed and patients given the opportunity to seek care in an independent facility. (Choice A) It is not illegal for the physician to refer to the center; however, her investment should be disclosed. (Choice C) It is not clear that the new center would provide a higher quality of care not available elsewhere. Regardless, the physician should disclose her investment in the center and provide the patient with all local options. (Choice D) Although the physician should provide referrals to other radiology centers as well, this does not substitute for her obligation to disclose her investment. (Choice E) It is important that the physician does not overtly influence the patient by preferentially recommending the center. However there is also the potential for unintentional coercion through verbal statements or body language. The conflict of interest still exists, requiring disclosure. Educational objective: Objective clinical judgment can be unconsciously clouded by financial incentives. Any actual or apparent financial conflict of interest must be disclosed and patients given the opportunity to seek care in independent facilities.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_008",
    "system": "Social Sciences",
    "stem": "A 32-year-old physician approaches a colleague and asks if he would write him a prescription for an antidepressant. He has known this colleague since medical school and they work closely in the same hospital department. The physician says he has been under a great deal of stress lately. His mother was recently diagnosed with cancer and his spouse has complained about his long work hours and disinterest in the relationship. The physician says, \"I'm trying so hard to be everything to everybody, but some days it's just too much. I would really appreciate if you could help me out. I don't want this in my medical record. I don't think I'm clinically depressed; I just think I could feel better.\" Which of the following is the most appropriate response?",
    "choice_a": "\"Here's a month's supply of medication, but please be sure to follow up with your own doctor.\"",
    "choice_b": "\"Here's a prescription for fluoxetine; let me know if you're not feeling any better in a month.\"",
    "choice_c": "\"I can only prescribe medication for you if I keep some documentation.\"",
    "choice_d": "\"I know you're having a tough time, but I don't think it's best for a colleague to prescribe medication.\"",
    "choice_e": "\"I understand, but I think you should try psychotherapy before considering medication.\"",
    "correct_answer": "D",
    "explanation": "This physician is faced with the difficult situation of being asked to prescribe medication for a colleague. Although it is understandable to want to help, physicians must consider the ethical implications of this decision. Due to the nature of the social and professional relationship, the treating physician may not feel comfortable asking sensitive and potentially critical questions regarding suicidal ideation, severity of depression, past psychiatric history, and substance use. As a result, the treating physician would be assuming medico-legal responsibility for treatment decisions that may be based on an inadequate assessment. In addition, the treating physician may feel pressured to agree to the patient's suggestions, as the patient is also a physician and a colleague. In the event of an adverse outcome, the treating physician would likely feel guilty and remorseful. Other potential problems include lack of timely and appropriate follow-up, inadequate documentation, practicing outside one's area of expertise, and lack of communication with the patient's primary physician. Physicians must always be guided by the ethical principles of beneficence (patient's best interest) and nonmaleficence (do no harm). Expressing empathy but explaining that it is best not to prescribe for a colleague would be the most appropriate response. (Choices A, B, and C) Although adequate documentation and specific follow-up plans would be preferable, prescribing medication for a colleague is ethically problematic. (Choice E) Psychotherapy is a treatment option for mild to moderate depression that could be discussed with the patient. However, treatment recommendations should be based on a thorough, independent assessment. Educational objective: Physicians may feel pressured to provide informal or undocumented care to colleagues and should be aware of the ethical implications. Referral to an independent clinician who can perform a comprehensive assessment is in the patient's best interest.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_009",
    "system": "Social Sciences",
    "stem": "An 85-year-old woman comes to the office for follow-up of chronic conditions. She has occasional knee pain due to osteoarthritis, for which she takes ibuprofen. The patient also has a history of hypertension treated with amlodipine; her blood pressure had been well controlled in the past, but several readings over the past year have been high. She insists that she takes her medications as prescribed, but pharmacy records indicate that she has not picked up her medication on several occasions. The patient's husband passed away a year ago, and since then she has lived with a family friend to share expenses. She has no difficulty cooking, cleaning, dressing, or bathing. She cries sometimes when she thinks about him, but she also enjoys memories of good times they had together. Temperature is 36.7 C (98 F), blood pressure is 162/96 mm Hg, pulse is 78/min, and respirations are 12/min. Examination shows no swelling or warmth of the joints. There is a small effusion in the right knee and mild restriction on extension of both knees. There is no joint laxity or instability. The remainder of the examination is unremarkable. Which of the following is the most appropriate next step in management of this patient?",
    "choice_a": "Initiate antidepressant therapy",
    "choice_b": "Order multidomain neuropsychological testing",
    "choice_c": "Recommend placement in an assisted living facility",
    "choice_d": "Review understanding of medication use",
    "choice_e": "Screen for elder mistreatment",
    "correct_answer": "D",
    "explanation": "This patient's poor medication adherence suggests possible low health literacy (ie, the ability to comprehend and apply information regarding health conditions). Impaired health literacy can lead to adverse outcomes, including more frequent hospitalizations and increased morbidity/mortality. Clues to health literacy and strategies for addressing it are listed in the table. Antihypertensive therapy reduces the risk of cardiovascular complications (eg, stroke, heart failure) but provides little short-term subjective benefit; therefore, successful treatment requires that patients understand the relationship between medication adherence and improved outcomes. Patients who take numerous medications often benefit from regular medication review and should be instructed to bring their medications to the office so that the indications and proper use can be discussed. It may also help to address factors (eg, costs, common side effects) that may cause a patient to be nonadherent to therapy. (Choice A) Depression in elderly patients may manifest as apathy, social withdrawal, or behavioral changes. Although a basic screen for depression (eg, Patient Health Questionnaire) should be considered periodically in older patients, this patient's affective symptoms are consistent with normal grief and antidepressant therapy is not indicated. (Choice B) Other than neglecting medication refills, this patient has normal function in activities of daily living (ADLs), making dementia unlikely. A brief cognitive assessment (eg, Mini-Mental State Examination) can be considered, but detailed neuropsychological testing is indicated only if initial screening is abnormal. (Choice C) Assisted living facilities are ideal for individuals who are independent with basic ADLs (eg. bathing, toileting) but require assistance with instrumental ADLs (eg, transportation, medication management). If a brief counseling intervention can achieve better medication adherence, placement in an assisted living facility would have little further benefit. (Choice E) Although physicians should remain vigilant for elder mistreatment, this patient does not exhibit any warning signs (eg, unexplained bruising, malnutrition). Educational objective: Health literacy is the ability to comprehend and apply information regarding health conditions. Impaired health literacy can lead to adverse outcomes, including more frequent hospitalizations and increased morbidity/mortality. Patients taking numerous medications often benefit from regular medication review.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_010",
    "system": "Social Sciences",
    "stem": "An 80-year-old woman comes to the office accompanied by her nephew, who helps take care of her. The patient lives alone and rarely leaves the house. She has a history of hypertension, osteoporosis, type 2 diabetes mellitus, and cognitive impairment (Mini-Mental Status Exam score of 23 out of 30). She received treatment for a spiral fracture of the humerus a year ago. The patient performs most of her activities of daily living unassisted but needs help with cooking, cleaning, and shopping. She reports no new problems today. Medications include metoprolol, hydrochlorothiazide, glipizide, calcium, and vitamin D. On examination, she is quiet and appears frail. Blood pressure is 170/94 mm Hg and pulse is 90/min. BMI is 18 kg/m^2. There is a 2x4 cm, Stage 2 pressure ulcer in her presacral area. Fingerstick blood glucose level is 250 mg/dL. On further questioning, the patient states that she is now unable to pay for her prescription refills. Which of the following is the most appropriate course of action?",
    "choice_a": "Admit to a rehabilitation facility",
    "choice_b": "Arrange for high-calorie nutritional supplements",
    "choice_c": "Arrange for nephew to supervise medication",
    "choice_d": "Arrange for visiting nursing services",
    "choice_e": "Contact adult protective services",
    "correct_answer": "E",
    "explanation": "Elder abuse is common and often goes unrecognized. This patient has many risk factors for elder abuse, including female gender, advanced age, social isolation, and cognitive impairment. There are several red flags that strongly suggest the possibility of elder abuse in this patient, including a spiral fracture of a long bone, a change in ability to pay (possible financial exploitation), malnutrition, and signs of neglect (pressure ulcer). Although all patients with suspected abuse should be interviewed alone and asked directly about abuse, many elders are either cognitively impaired and/or reluctant to report abuse. Given the history and signs of neglect on physical examination, assuring this patient's safety is the priority and a formal evaluation by experienced personnel is urgently needed. Contacting adult protective services directly to report this patient's circumstances and the possibility of abuse is appropriate and, in many states, mandated. An experienced senior's social worker could facilitate information-gathering and make the necessary contacts and arrangements. The site and extent of safe and supportive care for this patient will need to be determined based on further evaluation, comprehensive geriatric assessment, and availability of resources. (Choices A, B, C, and D) These interventions may be appropriate depending on the outcome of further evaluation by adult protective services. Reporting the suspected abuse takes priority. Educational objective: Unexplained traumatic injuries, signs of neglect (eg, pressure ulcers), and abrupt changes in financial status or ability to pay are red flags for elder abuse. When elder abuse is suspected, adult protective services should be contacted immediately.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_011",
    "system": "Social Sciences",
    "stem": "You are about to see an 80-year-old man for an annual follow-up visit. Just prior to entering the exam room, the patient's daughter tells you that she wishes you would dissuade the patient from driving. When you inquire as to why, she relates that she doesn't have any specific reason other than his advancing age, he is becoming a little forgetful, and she worries about him driving. The patient states that he is doing well and voices no new complaints. He denies falls. He has a history of hypertension, hyperlipidemia, gastroesophageal reflux, diminished hearing, and benign prostatic hyperplasia. His current medications include atenolol, hydrochlorothiazide, omeprazole, and a multivitamin. He does not drink alcohol. The patient lives independently and performs all of his own activities of daily living, including his own shopping. He drives approximately 3-5 times a week for shopping, restaurants, and entertainment. He's had one minor \"fender bender\" when he backed into a short stationary garbage can that he did not see one year ago. He has not had any moving traffic violations, he denies having any close calls while driving, and he has never gotten lost while driving. He has cataracts but his recent eye exam showed a corrected vision of 20/40 in both eyes and good peripheral vision. His last driver's license renewal was 12 months ago. He relates that he feels comfortable with driving. His blood pressure is 136/84 mm Hg and pulse is 72/min. His general examination is unchanged. His head and neck mobility are good and his gait is normal. He performs a 'Get Up and Go test' in 14 seconds. His score on a Mini-Mental State Exam is 26/30; he scored 27/30 18 months ago. What should you tell this patient and his daughter regarding his driving?",
    "choice_a": "He is at high risk for a significant driving-related event and should limit his driving to emergencies only",
    "choice_b": "He is capable of driving",
    "choice_c": "He should get his driving evaluated at an agency that performs \"on-the-road\" driving evaluations",
    "choice_d": "He should take a driving refresher course",
    "choice_e": "He should stop driving now",
    "correct_answer": "B",
    "explanation": "Family members often request an assessment of driving risk for older individuals. Without a definitive test to assess and determine a person's competency behind the wheel, this becomes a complex issue. Loss of driving privileges by older individuals can result in diminished independence, self-esteem, and quality of life. Advice regarding driving competency must maintain a careful balance between avoiding the endangerment of the general public and patient autonomy. The table above illustrates several \"red flags\" that should raise concern regarding driving competence. Based on this patient's medical history, systems review, physical examination, performance on an MMSE and a 'Get Up and Go test,' and his recent driving record - all indicate that he is capable of driving (Choices A & E). However, he should be cautioned to limit his driving during poor weather conditions, at night, for long distances, and in heavy traffic. (Choice C) Evaluation of driving with an on-road observed driving evaluation may be the most efficacious way of assessing driving competence, but does not appear to be indicated in this patient at this point in time. (Choice D) Several driving refresher courses (e.g., sponsored by AAA and AARP) emphasize driving safety, but they do not evaluate on-road observed driving performance. In addition, they have not been shown to improve actual driving and would not be indicated in this patient. Educational objective: Assessing driving competence is difficult. Driving history is an important evaluative tool along with the careful evaluation of medical conditions and physical examination. If there is doubt regarding driving competence, evaluation with a directly observed on-road test may be indicated (if available).",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_012",
    "system": "Social Sciences",
    "stem": "A 74-year-old woman comes to the office for a new patient visit, accompanied by her son. The patient's first language is Spanish, but she indicates that she is also comfortable speaking English. She points to a nonhealing ulcer on her right forearm that has been present for approximately a year. The patient is otherwise in good health and takes no medications. She does not use tobacco, alcohol, or illicit drugs. Physical examination shows an irregular, 1-cm erythematous scaly papule that is concerning for squamous cell carcinoma. As the physician explains the diagnostic possibilities and need for a biopsy, it becomes apparent that the patient is having difficulty understanding the information presented in English. The physician recommends using a medical interpreter, but the son suggests that his mother would be most comfortable if he served as her interpreter. The patient's nurse also offers to interpret, stating that he knows some Spanish. Which of the following is the most appropriate next step?",
    "choice_a": "Obtain medical interpreter services",
    "choice_b": "Provide written educational materials in Spanish",
    "choice_c": "Repeat the explanation in English using simpler terminology",
    "choice_d": "Use the patient's nurse as interpreter",
    "choice_e": "Use the patient's son as interpreter",
    "correct_answer": "A",
    "explanation": "According to census data, approximately 10% of the U.S. population has difficulty communicating in English. Coupled with a general health literacy rate of around 50%, medical interpreters are a critical component of cross-cultural health care. Physicians should ask patients about their comfort level communicating in English. Those who demonstrate difficulties in communication should be offered medical interpreter services for all aspects of the clinician-patient interaction (eg, interview, explanation of diagnosis, consent, treatment planning). Clinician-patient language barriers are associated with increased rates of medical errors and poor outcomes. Medical interpreters are trained in medical terminology, familiar with cultural beliefs, and guaranteed to have bilingual fluency. Family members should be used for interpretive services only in an emergency (Choice E). The risks of using a family member as a medical interpreter include unintentional or deliberate omissions, additions, substitutions, and opinions that may contribute to misinterpretation of medical advice; inaccuracies in obtaining the patient history and report; and potential compromise of patient privacy. The most appropriate next step in this scenario would be to obtain the services of a trained medical interpreter. (Choice B) Providing written educational materials in the patient's language is not an adequate substitute for an interpreter-facilitated discussion that allows the patient to express her concerns and ask questions. (Choice C) The patient has demonstrated an inability to adequately comprehend the diagnosis and treatment recommendations in English, so the most appropriate next step is to pursue an interpreter. (Choice D) Although the nurse is knowledgeable about medical terminology and procedures, medical interpreters require specific training. In addition, the nurse does not have guaranteed bilingual fluency, which could impair effective communication. Educational objective: Family members should be used as medical interpreters only in urgent situations. Otherwise, trained medical interpreters should be used for all aspects of the clinician-patient interaction (eg, interview, explanation of diagnosis, consent, treatment planning).",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_013",
    "system": "Social Sciences",
    "stem": "An asymptomatic 85-year-old woman is brought to the physician for a routine followup visit. She has a history of progressively worsening Alzheimer's dementia for 8 years. In the past 6 months, she has become nonverbal and can no longer walk. Her son reports that she is eating less, and he is concerned that she is not ingesting enough calories. She is not resistant to care and has had no behavioral disturbances. The patient lives with her son, who assists her with all activities of daily living. Her other medical problems include hypertension, hypercholesterolemia, and a hospitalization for aspiration pneumonia in the past year. Her medications include donepezil 10 mg once daily, lisinopril, and simvastatin. She has no known drug allergies. The patient's vital signs are within normal limits. She weighs 50 kg (110.2 lb). Her weight 6 months earlier was 55 kg (121 lb). She is awake but not oriented to person, place, or time. There is a small stage II decubitus ulcer on her sacrum. The remainder of the examination shows no other abnormalities. Which of the following is the most appropriate course of action?",
    "choice_a": "Add megestrol",
    "choice_b": "Add memantine",
    "choice_c": "Increase dose of donepezil",
    "choice_d": "Recommend gastrostomy tube placement",
    "choice_e": "Recommend referral to hospice care",
    "correct_answer": "E",
    "explanation": "This patient meets the criteria for advanced dementia, characterized by profound memory deficits, total functional dependence, no knowledge of recent or past events, little to no verbal communication, and limited ability to ambulate. Prognosticating a 6-month life expectancy can be difficult in these patients. However, her dependence on her son for activities of daily living, lack of ability to ambulate and communicate verbally, eating problems, and episode of aspiration pneumonia in the past year would make her eligible for hospice services (Figure). Hospice care has been shown to improve end-of-life experiences for patients with dementia, lower rates of hospitalization, increase the likelihood of appropriate pain management, and provide bereavement services for caregivers. Therefore, a recommendation to enroll this patient into hospice services is most appropriate at this time. (Choice A) Eating problems are a common feature of end-stage dementia. There is no evidence that appetite stimulant medications such as megestrol lead to weight gain or improved nutritional status, and therefore they are not recommended for routine use in advanced dernentia. (Choices B and C) Recent studies have provided additional data on the medical management of Alzheimer's that continues to progress despite initial therapy. Continuing donepezil results in better outcomes than discontinuing the drug, and is somewhat better than replacing donepezil with memantine. Increasing the dosage of donepezil is unlikely to have a significant impact on this patient and may cause adverse effects such as nausea, diarrhea, and bradycardia. Therefore, a palliative approach focused on enhancing quality of life and minimizing the symptom burden would be more appropriate. (Choice D) Use of artificial feeding in severe dementia has not been shown to reduce malnutrition, prevent recurrent aspiration pneumonia, or promote wound healing in cohort studies of patients with advanced dementia. Educational objective: Hospice services should be offered to surrogate decision makers for patients with advanced dementia. Criteria for enrollment include dependence on others for all activities of daily living, lack of verbal communication, and inability to ambulate, in addition to a medical condition such as aspiration pneumonia or eating problems in the past year.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  },
  {
    "id": "SOCIAL_014",
    "system": "Social Sciences",
    "stem": "Following 2 case reports about the potential for allopurinol to improve outcomes in patients with congestive heart failure, a research team plans a study to test this association. An investigation is undertaken at a hospital to systematically evaluate if patients taking allopurinol for gout are hospitalized less frequently for exacerbations of congestive heart failure. Community physicians are asked by the principal investigator to refer appropriate patients for the study. Which of the following will help ensure protection of the patients' right to privacy with respect to their personal health information?",
    "choice_a": "Designing a prospective, randomized, double-blind clinical trial",
    "choice_b": "Ensuring that all participants are informed of the risks and benefits of study participation",
    "choice_c": "Ensuring that all study subjects are participating freely and without coercion",
    "choice_d": "Ensuring that study subjects are informed about how their health information will be used",
    "choice_e": "Requiring research personnel to use de-identified patient data",
    "correct_answer": "E",
    "explanation": "In 1996, the US Congress passed the Health Insurance Portability and Accountability Act (HIPAA), which regulates the use and disclosure of individually identifiable health care information. This protection extends to research subjects, and study designs must include measures to help safeguard the privacy of personal health information for study subjects. Research investigators must ensure that patient confidentiality will be protected and that patient identity will not be disclosed to third parties or appear in any study reports or publications. Avoiding the use of such information as actual names and social security numbers by using de-identified patient information (eg, assigning a unique study number to each patient) helps ensure patient privacy. (Choice A) A prospective, randomized, double-blind clinical trial is the most robust of all study designs as it avoids inherent biases encountered in observational studies, such as retrospective chart reviews. However, this study design will not ensure patient privacy. (Choices B and C) All study subjects should be allowed sufficient time to read the informed consent form, which details the risks and benefits of the study. They must be given the opportunity to ask questions, including those regarding confidentiality, and must be free and willing to participate. However, it is the responsibility of the research investigator to protect their personal health information. (Choice D) Although patients should be informed that data from their records is being used for study, they should be assured that their privacy will be maintained through de-identification. Educational objective: Patients have rights to privacy, and their personal health information is protected by the Health Insurance Portability and Accountability Act (HIPAA). In research studies, de-identifying patients by assigning a unique study number helps ensure confidentiality.",
    "source": "ABIM_Social_Sciences_Ethics,_Legal,Professional@USMLEWorldStep3.pdf"
  }
]